{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:45:21.296000"
  },
  "content": "Housing programmes of the Singapore government **Public housing in Singapore** is subsidised, built, and managed by the [government of Singapore](/wiki/Government_of_Singapore). Starting in the 1930s, the country's first [public housing](/wiki/Public_housing) was built by the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) (SIT) in a similar fashion to contemporaneous [British public housing projects](/wiki/Public_housing_in_the_United_Kingdom), and housing for the resettlement of [squatters](/wiki/Squatting) was built from the late 1950s. In the 1960s under the SIT's successor, the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB), public housing consisting of small units with basic amenities was constructed as quickly and cheaply as possible at high densities and used for resettlement schemes. From the late 1960s, housing programmes focused more on quality, public housing was built in new towns, and a scheme allowing residents to lease their flats was introduced. Throughout the 1970s and 1980s, more public housing options were provided for the middle class and efforts to increase community cohesion within housing estates were made. From the 1990s, the government began portraying public housing as an asset, introducing large-scale upgrading schemes and loosening regulations on the resale of public housing while additional housing programmes for the [sandwich classes](/wiki/Sandwich_class) and elderly residents were introduced. Rising housing prices led to public housing being seen as an investment from the 2000s, and new technologies and eco-friendly features were incorporated into housing estates. In the early 2020s, Singapore's public housing is located in new towns, in communities that are intended to be self-contained, with services nearby housing blocks, and is either owned by or rented to residents. Lessee-occupied public housing is sold on a 99-year lease and can be sold on the private resale market under certain restrictions. Rental housing consists of smaller units and is mainly meant for lower-income households. Housing grants are provided to lower-income applicants for flat purchases while flats with shorter leases and lease monetisation schemes have been implemented for elderly homeowners. Housing estates are managed and maintained by town Councils, and older housing estates are improved by the [Housing and Development Board](/wiki/Housing_and_Development_Board) under the Estate Renewal Strategy. Close to 80% of Singapore's resident population lives in public housing flats provided by the Housing & Development Board (HDB), in 2025, down from a high of 88.0% in 2000. ## History ### Under the Singapore Improvement Trust During British colonial rule, Singapore had an underdeveloped housing infrastructure that led to overcrowding and poor living conditions once it experienced an uptick in immigration. Model public housing was first built in Singapore by the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) (SIT) from the late 1920s. Intended to house people displaced by the clearance of unsanitary buildings or by town improvement schemes, the SIT's initial housing schemes were small in scale but well received. From the early 1930s, the SIT subsequently started planning larger housing estates on the outskirts of the Central Area, and after being unable to encourage the private development of such estates, constructed the first estate, [Tiong Bahru](/wiki/Tiong_Bahru), from 1936. Subsequently, the SIT began focusing more on public housing provision from the late 1940s. The public housing built by the SIT was similar in terms of density and living space to British public housing projects of the time, with low population densities, and housed nine per cent of Singapore's population by 1959. ### Emergency housing and resettlement schemes After the [Second World War](/wiki/World_War_II), Singapore experienced a significant influx of immigrants, many of whom settled in urban kampongs at the edge of the [Central Area](/wiki/Central_Area,_Singapore). Consisting of wooden houses built over empty plots, swamps and old cemeteries, these kampongs expanded rapidly through the 1950s, housing a quarter of Singapore's urban population by the early 1960s. The kampongs largely functioned as autonomous areas, with many residents taking up jobs in the informal economy or joining secret societies, which provided security within the kampongs. This autonomy led to the colonial government perceiving the kampongs as socially undesirable areas, and as a \"margin\" that they had little authority over and which had to be cleared and replaced with public housing. In addition, the closely spaced wooden houses in urban kampongs made these areas highly susceptible to fire, and such fires broke out frequently and displaced many residents. The British colonial authorities saw these fires as opportunities to integrate displaced kampong dwellers into formal society by rehousing them in formal housing, but were initially unable to convince the SIT to build such housing over financial sustainability concerns. Subsequently, in 1953, as the flats it usually built were proving expensive to construct, the SIT reluctantly started constructing emergency housing for displaced [kampong](/wiki/Kampung_(village)) dwellers, but the housing were poorly received so the SIT scaled back construction two years later. By the late 1950s, the issue of rehousing urban kampong residents in formal housing had become highly politicised, so the [Labour Front](/wiki/Labour_Front) government adopted a clear emergency housing strategy. After fires at Kampong Koo Chye and [Kampong Tiong Bahru](/wiki/Kampong_Tiong_Bahru), the government took over the fire sites and instructed the SIT to build flats on them. The SIT also envisioned a resettlement plan in Kampong Tiong Bahru after the fire, acquiring additional land for emergency flats and renting out the flats to the kampong dwellers. These schemes were also poorly received by the displaced kampong residents. The SIT faced multiple issues in its provision of public housing; rents for SIT flats were unaffordable for most of the local population and too low to be financially sustainable for the SIT, and by 1949, new flats were not being built quickly enough to keep up with the increase in population in Singapore. By 1958, the SIT was unable to financially sustain its public housing programme and delays in approval of new housing projects slowed construction even further. The [People's Action Party](/wiki/People%27s_Action_Party) government that subsequently came into power in 1959 held similar views on housing and the kampongs as the colonial government. Consequently, plans to replace the SIT with a new housing authority were drawn up in the late 1950s, and in February 1960, it was replaced with the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB). The HDB announced a five-year housing plan with high aspirations and continued the SIT's emergency housing programme from November 1960, adopting a strategy of building one-room flats for resettlement schemes. In May 1961, in the aftermath of [a subsequent fire in Bukit Ho Swee](/wiki/Bukit_Ho_Swee_fire), the government immediately took over the fire site, set aside most of the emergency flats in Kampong Tiong Bahru for the rehousing of displaced kampong dwellers, and developed a housing estate on the site of the kampong that was completed between 1963 and 1965. The [Bukit Ho Swee](/wiki/Bukit_Ho_Swee) estate was used to rehouse other kampong residents displaced by fires or development schemes, paving the way for further urban renewal and resettlement schemes in the Central Area. By 1965, more than 50,000 flats had been constructed and 23% of Singapore's population lived in public housing. In the 1960s, the HDB's housing was intended to be built as quickly and cheaply as possible, and consisted mainly of one- and two-room flats. These were built at high densities to make the most of the limited land available for public housing. Housing estates built during this period had limited amenities; they were built at the edge of the Central Area, whose facilities and services residents relied on. Through the development of public housing, the government attempted to change the behaviour of the kampong residents with prohibitions on modifying or subletting flats, and to have more control over them. The government intended to build harmony between Singapore's racial groups; the new housing estates had no racial distinctions, unlike the settlements that preceded them. In addition, the design of housing units brought about a shift away from larger family structures towards nuclear families, while Riaz Hassan noted that since the design of public housing inhibited communication between neighbours, there was a lack of community and social cohesion within housing blocks and estates. Nevertheless, the intended residents resisted the resettlement schemes and many residents loathed the one-room emergency flats. The government attempted to provide housing to all people and organisations affected by the schemes. The HDB shifted away from constructing one-room flats from the late 1960s. ### Development of new towns In 1964, the Home Ownership for the People Scheme (or Home Ownership Scheme) was introduced to enable the lower-middle-income group to own their homes. Applicants could use their contributions from the [Central Provident Fund](/wiki/Central_Provident_Fund) (CPF), a compulsory savings scheme, to pay for their flats from 1968, and by 1984, 62 percent of flats were owned. The HDB started constructing its first new town in 1965; it was located about 5–8 km (3.1–5.0 miles) from the city centre, and had a town centre with amenities and industrial areas to provide employment to residents. From the late 1960s, the HDB began focusing on the quality of public housing, building larger flats and providing more amenities in housing estates. In addition, the 1966 Land Acquisition Act gave the government broad powers to take over land and made more land available for public housing. From the 1970s, public housing was constructed further away from the Central Area, more amenities were provided in new towns and flat sizes continued to increase. Owners were allowed to sell their flats on the resale market from 1971, and from the mid-1970s, the designs of public housing developments became more diverse. To provide flats for middle-class residents, who at the time could not afford to purchase housing built by private developers and were ineligible for flats built by the HDB, the Housing and Urban Development Company (HUDC) was set up in 1974. The HUDC's housing estates had layouts similar to those of private condominiums, and were initially well received. In addition, flats were built by the [Jurong Town Corporation](/wiki/Jurong_Town_Corporation) in [Jurong](/wiki/Jurong) and [Sembawang](/wiki/Sembawang) between 1968 and 1982. In the late 1970s, in an attempt to build a sense of community within housing estates, Residents' Communities and the precinct concept were introduced. Rising construction costs during this period resulted in designs again becoming more uniform and from the early 1980s, housing construction started incorporating more prefabricated sections to reduce costs. The 1980s saw the introduction of larger executive flats while the HDB, which took over the HUDC in 1982, stopped construction of the middle class flats that had been constructed by the HUDC as the prices of these flats were approaching those of housing built by private developers, while the raising of income ceilings for the HDB's lower-end flats made the middle class eligible for these flats. In the light of falling demand for smaller flats, those in older housing estates were enlarged while older housing blocks that did not meet the HDB's standards were torn down. Flat modification regulations were relaxed and housing estates were upgraded on an *ad hoc* basis. To ensure people of different races were evenly distributed across public housing estates, a limit on Malay residents was introduced for new flats. This proved insufficient to prevent the formation of racial enclaves so in 1989, the limits were extended to [all races](/wiki/Demographics_of_Singapore) and also to the resale market. ### Upgrading schemes and new housing programmes From the 1990s, the Singapore government started portraying public housing as an asset and as a useful tool for safeguarding retirement. The government pursued measures for upgrading and \"asset enhancement\", and loosened restrictions on the public housing resale market. The first of these schemes, a large-scale, S$15 billion upgrading scheme, was announced in 1989. The scheme's aim was intended to make older housing estates more attractive to younger people, and included the creation of differentiated precincts, the provision of more amenities, and upgrades to blocks and flats. Town councils and residents were able to determine the nature and extent of the upgrades to their estates. After a trial on vacant housing blocks and a demonstration phase on selected blocks, the scheme was initiated in 1993. A less-extensive interim upgrading programme was carried out in newer estates and several town councils carried out their lease amenity-upgrading schemes. In 1995, the [Selective En bloc Redevelopment Scheme](/wiki/Selective_En_bloc_Redevelopment_Scheme) to redevelop selected housing blocks in older estates was introduced. These upgrading schemes were subsequently used for political ends; politicians from the ruling [People's Action Party](/wiki/People%27s_Action_Party) stated estates with higher proportions of votes for the ruling party would be prioritised for upgrading schemes. Besides the upgrading programmes, additional housing schemes were introduced in the 1990s. These included executive condominiums with similar amenities to private condominiums for the [sandwich class](/wiki/Sandwich_class), along with Design Plus and Design and Build flats, which had higher-quality fittings and designs, and were designed with feedback from private architects. Design and Build flats were also developed by private architects and building contractors. In 1997, smaller studio apartments that were fitted with elderly-friendly features were introduced. Both public and private housing were built within the same new towns from the 1990s, while from 1995, HUDC estates were privatised, and residents took over the management and leasehold ownership of the estates. ### Present day Facing a glut of flats in the housing market, the HDB significantly reduced public housing construction in the early 2000s, and housing was built only when demand was present. The 2000s also saw the incorporation of new technology and eco-friendly features in public housing estates, and their planning was aided by computer simulations. The [Design, Build and Sell Scheme](/wiki/Design,_Build_and_Sell_Scheme), under which the design, construction and sale of flats is handled by private developers, was introduced in 2005. Additional upgrading programmes, such as the [Lift Upgrading](/wiki/Lift_Upgrading_Programme) and [Home Improvement Programmes](/wiki/Home_Improvement_Programme), regarding direct lift access and flat interiors respectively, were also introduced. Remaking Our Heartland, an extensive development scheme for existing new towns, was introduced in 2007. Public involvement in public-housing provision increased; public consultations on community building in housing estates was held in 2006, and residents could give feedback and vote on estate improvements under the [Neighbourhood Renewal Programme](/wiki/Neighbourhood_Renewal_Programme), which was introduced in 2007. The proportion of permanent residents in public housing also increased and in 2010, a quota on non-Malaysian permanent residents was introduced to prevent the formation of [enclaves](/wiki/Ghetto). In 2011, the HDB released its Roadmap to Better Living, setting out its plans for housing in the 2010s; it aimed to provide well-connected, unique and sustainable housing estates. More public housing was built in response to increased demand. Attempts to increase residents' involvement in upgrading schemes were made under the poorly received 2013 Building Our Neighbourhood Dreams! programme, under which residents could make suggestions about estate improvements. In the late 2010s and early 2020s, the HDB made further efforts to make housing estates unique and sustainable through the introduction of design guides for each new town and the HDB Green Towns Programme respectively. Community Care Apartments for the elderly with care services for residents were introduced. ### Homelessness in Singapore Despite existing HDB policies to ensure affordable housing for all Singaporeans, Tan and Forbes-Mewett's report in 2017 highlighted the government's reluctance to acknowledge the issue of homelessness. The report mentioned that the government avoided addressing the growing visibility of older individuals sleeping rough, opting instead to release statistics on the number of homeless people it had provided assistance to, along with explanations for the causes of their homelessness. It was only in 2019 that the first nationwide study on homelessness in Singapore was launched, which revealed that approximately 1,115 individuals were sleeping on the streets. In December 2021, the HDB introduced the Joint Singles Scheme Operator-Run Pilot, placing social service agencies in charge of managing the flats under this initiative. These agencies are responsible for matching single tenants with suitable flatmates, mediating conflicts that may arise between them, and facilitating transfers to other public rental flats when needed. This pilot differed from the existing Joint Singles Scheme, which required two or more singles to apply for a public rental flat together. During the [COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore), homelessness saw a temporary spike, but by 2021, *The Straits Times* reported a slight decline to 1,036 individuals. However, this decrease was attributed to more homeless individuals seeking refuge in temporary shelters, reducing the visibility of the issue. The [Ministry of Social and Family Development](/wiki/Ministry_of_Social_and_Family_Development) (MSF) reported a further drop in November 2022 with only 530 'rough sleepers' – those sleeping in public spaces. The MSF attributed this to 'progress in whole-of-society efforts to engage and support rough sleepers'. ## Physical organization Singapore's public housing is constructed within [new towns](/wiki/Planned_community), which are intended to function as independent communities. These new towns are planned on the basis of zoning of land for multiple uses, and house up to 300,000 residents. Each new town is divided into neighbourhoods, which are further subdivided into precincts. Each precinct has about 400 to 800 flats within seven or eight housing blocks. Up to half of the land area in the new towns is set aside for amenities, which are provided on levels ranging from the town centre to the individual housing block and, according to certain guidelines, allowing facilities to be located near residents. Different flat types are spread out across new towns to prevent the concentration of people of a certain income group in any area. The first new town in Singapore, [Queenstown](/wiki/Queenstown,_Singapore), was developed by the SIT in the 1950s, and the development of new towns was continued by the HDB from the mid-1960s. New towns were planned following a prototype new town model from the early 1970s, and the new towns built in the 1970s comprised a town centre and several neighbourhoods, the latter of which were differentiated by different road numbering systems and housing block paint schemes. New towns built from the late 1970s adopted a \"checkerboard model\", with residential and non-residential areas alternated throughout the town, and showed increased variance in design and layout, in an attempt by the HDB to give each new town a unique identity. In the late 1990s, under a revised new town model, newly built new towns comprised densely built developments integrating both public housing and amenities. Subsequently, in the 2000s and 2010s, new towns were built with the aid of computer models, incorporated new technologies and monitoring systems, and had layouts inspired by the environment of the areas in which they were built. ## Design Under the Singapore Improvement Trust, public housing design followed Western architectural styles, such as [Streamline Moderne](/wiki/Streamline_Moderne) and the [International Style](/wiki/International_Style_(architecture)), while incorporating features suited to Singapore's tropical climate. These features are derived from the designs of [shophouses](/wiki/Shophouse), and include [five-foot ways](/wiki/Five-foot_way), [back lanes](/wiki/Back_lane) and spiral staircases. With an emphasis on quantity, public housing built during the HDB's initial years was very basic and consisted of small housing units that were barely fitted out, and housing estates were provided with few amenities. Quality improvements in public housing started in the late 1960s with the inclusion of landscaping, and more amenities such as open spaces and car parks within housing estates. As new towns were built farther away from the Central Area from the 1970s, amenities such as retail and industrial areas were provided within the new towns to give them a degree of self-sufficiency. A prototype new-town model dictating the distribution of services was also adopted. Efforts to distinguish neighbourhoods through the use of numbering schemes and paint schemes for housing blocks were made. Access corridors in housing blocks were divided into multiple parts for resident privacy, housing-block designs were made less uniform and more visually appealing, and the ground floors were left empty and unfinished. The HDB intended this \"[void deck](/wiki/Void_deck)\" to be used for communal activities. From the 1980s, public housing design was intended to give estates a unique character through the variation of block heights within estates and the incorporation of traditional architecture elements into housing block design. Block layouts in new towns were varied with a shift in emphasis away from solar orientation while as part of the precinct concept, groups of blocks were built closer together and open areas were added to foster community interaction. Public housing design in Singapore began to shift away from a modernist style in the 1990s, with elements from multiple architectural styles added to housing blocks through upgrading schemes. In addition, more effort was made to differentiate housing block designs, while higher quality fittings within housing units were also introduced. Multiple types of services were also provided within integrated developments, while additional community spaces were added in housing estates. In the 2000s, Singaporean public housing began incorporating technology such as pneumatic waste collection, sensor-activated lights, and eco-friendly and energy-efficient features. Housing estates began to incorporate more greenery while additional recreation facilities such as cycling tracks and natural features were provided. The 2010s brought an increased focus on estate identity and quality of life; historical and natural aspects of the locations of estates were used as inspiration for their design. ## Housing types ### Lessee-occupied public housing Most public housing in Singapore is lessee-occupied. Under Singapore's housing leasehold ownership programme, housing units are sold on a 99-year leasehold to applicants who meet certain income, citizenship and property leasehold ownership requirements. The estate's land and common areas continue to be owned by the government. As of 2022[update], new lessee-occupied flats are sold under the Build-To-Order and Sale of Balance Flats programmes. Executive condominiums, although considered private housing and constructed and sold by private developers, have similar leases and requirements to lessee-occupied public housing. For those in the lower-income groups, grants are available from the government to help them pay for their flat purchase. These grants are adjusted based on household income. While the SIT allocated public housing using a points system from 1947, allocation in the HDB's initial years used a ballot system, under which applicants could state their preferred flat type and general location, and reject up to two ballots. People who were displaced by resettlement schemes were given priority. Subsequently, applicants were able to select from flat types and areas in which flats were available. In the early 2000s, in light of increasing numbers of unsold flats, the HDB suspended its earlier flat allocation system, switching to the Build-To-Order programme, in which flats are only built when demand is present. From the late 1990s, in light of the increasing number of elderly homeowners, schemes to enable them to monetise their flats, starting with reverse mortgages, were put into place. These schemes were poorly received and were withdrawn. In 2009, the HDB introduced the Lease Buyback Scheme, under which the HDB buys a proportion of the housing unit's lease at current resale prices. Additional schemes, such as the Silver Housing Bonus, under which the homeowner moves to a smaller flat, and the two-room Flexi scheme consisting of smaller flats with shorter leases, were introduced. ### Resale public housing Lessee-occupied public housing can be sold in a resale market, subject to restrictions. The government does not regulate prices within the resale market. Initially, owners were only able to sell their housing units back to the HDB but after 1971, the sale of flats on the private market was allowed. After that, sellers on the private market could only sell flats to buyers who satisfied the requirements for purchasing new flats. Sellers were required to have lived in their flats for a minimum time, and were prevented from applying for new flats for a certain time, which was known as the debarment period. In 1978, the restriction on new flat purchase was replaced by a resale levy. Resale restrictions were loosened in the late 1980s; income limits were removed, and permanent residents and property owners were allowed to purchase resale flats in 1989. In 1991, the resale market was opened to unmarried people older than 35. CPF housing grants for the resale market were introduced in 1994. These measures led to a rapid rise in resale prices by the mid-1990s; in response, the HDB introduced additional taxes and restrictions. Increasing housing prices and government statements regarding public housing as assets that can be enhanced resulted in public housing being perceived as an investment. In the late 2000s, with the trend of increasing housing prices, the government introduced measures such as additional taxes and restrictions to reduce investment demand for housing. The government also tried not to dissuade the use of public housing as an investment. Rising resale prices for public housing in prime areas led to the government placing additional purchase and resale restrictions on newly built public housing in prime areas from 2021. On 4 October 2022, the [Minister of National Development](/wiki/Ministry_of_National_Development_(Singapore)), [Desmond Lee](/wiki/Desmond_Lee_(Singaporean_politician)), elaborated further on the government’s policies to intervene to keep public housing relatively affordable and available. In hopes of cooling the housing market, the government plans to implement a fifteen-month waiting period before homeowners can buy an HDB resale flat, continued supply of significant grants for first-time buyers, and tightened maximum loan price limits. Likewise, to keep providing a counter to the resale market, the HDB ramped up its Build-to-Order supply, which is on track to place 23,000 apartments on the market between 2022 and 2023. Should these measures be implemented, they could serve as a protective measure for those unable to afford the current climate of the housing resale market, which averages $716,000 per apartment as of 2022. ### Rental public housing The HDB also provides public housing for rental, which consists of smaller units, such as one- and two-room flats, and is mainly provided for lower-income households and households waiting for their purchased flats. Rental public housing has lower income requirements than lessee-occupied public housing. ## Maintenance and renewal In Singapore, public housing estates are maintained by [Town Councils](/wiki/Town_Council_(Singapore)), which are divided along political constituency lines and headed by a [Member of Parliament](/wiki/Member_of_Parliament), and have full-time estate-management staff. Funding for town councils' maintenance work comes from government grants, and maintenance fees paid by estate residents and businesses. Improvement works in older estates are carried out under the HDB's Estate Renewal Strategy. These improvement works consist of the upgrading of amenities and infrastructure to meet modern standards, and the addition of features and facilities similar to those found in newer housing estates. ## Societal impact ### Interactions with other policies Through HDB, the Singaporean government used housing to promote certain legislative agendas. Until 1991, single individuals could not buy apartments as it was not in line with the country’s pro-family stance. Despite singles having access to apartments now, families with three or more children still receive a tax fund and priority in allocating public housing, making it a more streamlined process to obtain home leasehold ownership. These influential policies also apply to the ethnic makeup of the new towns. The 1989 Ethnic Integration Policy seeks to promote ethnic integration and harmony among the Chinese, Malay, and Indian populations in public housing. As a result of the policy, the HDB will not approve the sale of a new or resale to a particular ethnic group if it exceeds the ethnic quota of the block. Moreover, during election cycles, the People’s Action Party (PAP) emphasizes the program's success and promises upgrades to improve living conditions to incentivise voters. ### Economic connections Reducing income inequality and decreasing poverty were benefits of public housing in the country. It allowed the state to bolster its GDP through the construction sector, which brings in continuous revenue enabling the nation to focus on other industries, such as technology and finance, that allow it to remain competitive in the global economy. ## Community living concerns ### Disputes There has been a number of disputes involving community living spaces. Among other things, disputes often arise over usage of common spaces, noise and smoking complaints. The HDB highlighted that on average, they received about: - 3,400 reports/feedback annually from 2015 to 2019[*citation needed*] - 2,150 complaints monthly in 2023 The [Ministry of National Development](/wiki/Ministry_of_National_Development_(Singapore)) (MND) highlighted that common area obstructions accounted for about 32% of all estate maintenance issues. The indiscriminate placement of objects contravenes the fire safety code and the by-laws of the town councils. MND has emphasized the removal of corridor clutter in order to foster a safe and inclusive living environment for residents. On the subject of smoking concerns, while not prohibited within the HDB unit, smoking is prohibited in public areas such as common corridors, void decks and stair wells under the [National Environment Agency](/wiki/National_Environment_Agency) regulations. HDB has instituted rules on permissible noisy renovation works; contracted renovation works and their operating durations are subject to approval. Loud renovation works (such as in the use of pneumatic drills, 110-120 dBA) are prohibited on weekends and public holidays and limited to the grace period of 9 am to 1 pm and 2 pm to 5 pm on weekdays. Due to the close living quarters, HDB also mandates silent hours between 10 pm to 8 am. On the subject of noise transmission between units, experts from the Institution of Engineers (IES) and building consultants have highlighted that the reinforced concrete used in the HDB blocks is highly effective in transmitting sound. In addition, the sound traversing through the floor slabs above any particular unit does not necessarily correlate to the above unit as the direct source of the sound. There is literature on how bulk insulation embedded within concrete structures separating units can reduce noise transmission but not evident to have been explored or implemented in HDB design. Enforcement may be taken by the regulatory agencies to curb offences and lessors involved in disputes may be directed to mediation channels. Some notable cases of disputes and their outcomes are summarised below: 1. May 2022, lessors fought over void deck space that culminated in arson 2. Nov 2019 to Dec 2020, lessors fought over smoking issues that led to harassment ### Littering The dumping of any form of rubbish within the housing estate, such as void decks and other common areas, is considered as a littering offence. Under the penal code, these offences are punishable with a $2,000 fine for the first offence. A [corrective work order](/wiki/Corrective_work_order) may also be issued at the judge's discretion. Feedback on high-rise littering has increased by more than 60%, from 2017 to 2019, to 19,000 cases. The number of cases (approximated) of high-rise littering where enforcement action has been taken is tabulated below. From July 2023, there is a presumption clause under the *Environmental Public Health Act*, that the littering act, found to have originated from a particular unit, can be attributed to its registered owner. Enforcement201720182019202020212022**# of cases**1,5001,3001,1002,0001,5001,100 ### Noise pollution Due to residential zoning in close proximity to active airbases, there have been concerns raised by residents regarding the noise impact of fighter aircraft operations. The problem was noted to be most acute at HDB estates like the north eastern parts of Punggol, which lie directly under the take-off trajectory of aircraft leaving the [Paya Lebar Airbase](/wiki/Paya_Lebar_Airbase). Studies by [WHO](/wiki/World_Health_Organization) and the ANIMA project have shown that there are a number of adverse impact on health (e.g. mental health, cardiovascular diseases) associated with exposure to continuous aircraft noise. - [Housing and Development Board](/wiki/Housing_and_Development_Board) - [Public housing](/wiki/Public_housing) - [Public housing in Hong Kong](/wiki/Public_housing_in_Hong_Kong) - [Public housing in Taiwan](/wiki/Public_housing_in_Taiwan) ### Bibliography - Cheong, Koon Hean (2016). \"Chapter 7: The Evolution of HDB Towns\". In Heng, Chye Kiang (ed.). *50 Years of Urban Planning in Singapore*. World Scientific. pp. 101–125. [ISBN](/wiki/ISBN_(identifier)) 978-981-4656-48-1. [OCLC](/wiki/OCLC_(identifier)) 1010606530. - Cho, Im Sik; Nasution, Ivan; Lee, Jihye; Mascarenhas, Nina (2017). \"Mechanisms for facilitating community participation in Singapore's neighbourhood-planning framework\". *Journal of Architectural and Planning Research*. **34** (4): 320–335. [JSTOR](/wiki/JSTOR_(identifier)) 44987240. - [Chua, Beng-Huat](/wiki/Chua_Beng_Huat) (1991). \"Race Relations And Public Housing In Singapore\". *Journal of Architectural and Planning Research*. **8** (4): 343–354. [JSTOR](/wiki/JSTOR_(identifier)) 43029053. - Fraser, James M. (April 1952). \"Town Planning and Housing in Singapore\". *The Town Planning Review*. **23** (1). [Liverpool University Press](/wiki/Liverpool_University_Press): 5–25. [doi](/wiki/Doi_(identifier)):10.3828/tpr.23.1.v7327214j63750w3. [JSTOR](/wiki/JSTOR_(identifier)) 40102143. - Goh, Robbie B.H. (August 2001). \"Ideologies of 'Upgrading' in Singapore Public Housing: Post-modern Style, Globalisation and Class Construction in the Built Environment\". *[Urban Studies](/wiki/Urban_Studies_(journal))*. **38** (9): 1589–1604. [doi](/wiki/Doi_(identifier)):10.1080/00420980120076821. [JSTOR](/wiki/JSTOR_(identifier)) 43196729. [S2CID](/wiki/S2CID_(identifier)) 143688718. - Hassan, Riaz (1969). \"Some Sociological Implications Of Public Housing In Singapore\". *Southeast Asian Journal of Sociology*. **2**: 23–26. [JSTOR](/wiki/JSTOR_(identifier)) 43822132. - Hee, Limin; Ooi, Giok Lin (January 2003). \"The Politics of Public Space Planning in Singapore\". *[Planning Perspectives](/wiki/Planning_Perspectives)*. **18** (1): 79–103. [doi](/wiki/Doi_(identifier)):10.1080/0266543032000047413. [S2CID](/wiki/S2CID_(identifier)) 145342576. - Jensen, Rolf (July 1967). \"Planning, Urban Renewal, and Housing in Singapore\". *The Town Planning Review*. **38** (2): 115–131. [doi](/wiki/Doi_(identifier)):10.3828/tpr.38.2.eg304r3377568262. [JSTOR](/wiki/JSTOR_(identifier)) 40102546. - Kuah, Adrian T.H. (2018). \"Tropical Urbanisation and the Life of Public Housing in Singapore\". *ETropic: Electronic Journal of Studies in the Tropics*. **17** (1): 41–59. [doi](/wiki/Doi_(identifier)):10.25120/etropic.17.1.2018.3641. - Lim, William Siew Wai (July–August 1984). \"Public housing and community development in Singapore\". *Ekistics*. **51** (307): 319–327. [JSTOR](/wiki/JSTOR_(identifier)) 43621881. - [Liu, Thai Ker](/wiki/Liu_Thai_Ker) (July 1974). \"Reflections on problems and prospects in the second decade of Singapore's public housing\". *Ekistics*. **38** (224): 42–46. [JSTOR](/wiki/JSTOR_(identifier)) 43618343. - Loh, Kah Seng (2009). \"5 The Politics of Fires in Post-1950s Singapore and the Making of the Modernist Nation-State\". In Aljunied, Syed Muhd Khairudin; Heng, Derek (eds.). *Reframing Singapore: Memory - Identity - Trans-Regionalism*. [Amsterdam University Press](/wiki/Amsterdam_University_Press). pp. 89–108. [ISBN](/wiki/ISBN_(identifier)) 978-90-485-0821-1. [JSTOR](/wiki/JSTOR_(identifier)) j.ctt45kf1j.9. [OCLC](/wiki/OCLC_(identifier)) 1006078523. - Loh, Kah Seng (April 2007). \"Black Areas: Urban Kampongs and Power Relations in Post-War Singapore Historiography\". *Sojourn: Journal of Social Issues in Southeast Asia*. **22** (1): 1–29. [doi](/wiki/Doi_(identifier)):10.1355/SJ22-1A. [JSTOR](/wiki/JSTOR_(identifier)) 41308084. [S2CID](/wiki/S2CID_(identifier)) 126805119. - Ooi, Giok Ling (1992). \"Managing Change and Continuity in the Public Housing Process in Singapore\". *Ekistics*. **59** (354/355): 170–179. [JSTOR](/wiki/JSTOR_(identifier)) 43622246. - Phang, Sock Yong (August 2015). \"Singapore's Housing Policies: Responding to the Challenges of Economic Transitions\". *Singapore Economic Review*. **60** (3): 1–25. [doi](/wiki/Doi_(identifier)):10.1142/S0217590815500368. [ISSN](/wiki/ISSN_(identifier)) 0217-5908. [S2CID](/wiki/S2CID_(identifier)) 154753207. - Phang, Sock Yong (2007). \"The Singapore Model of Housing and the Welfare State\". In Groves, Richard; Murie, Alan; Watson, Christopher (eds.). *Housing and the New Welfare State: Perspectives from East Asia and Europe*. Ashgate Publishing. pp. 15–44. [ISBN](/wiki/ISBN_(identifier)) 9780754644408. [OCLC](/wiki/OCLC_(identifier)) 1291944332. - Phang, S.-Y.; Helble, M. (2016). *Housing Policies In Singapore*. Tokyo: Asian Development Bank Institute. - Sugarman, M. W. (2018). \"On The Urban Edge: Housing, The Bombay Development Department, The Singapore Improvement Trust And An Improving Urban Urbanism, 1909-1941\". *Slums, Squatters and Urban Redevelopment Schemes in Bombay, Hong Kong, and Singapore, 1894-1960* (PhD thesis). [doi](/wiki/Doi_(identifier)):10.17863/CAM.24186. - Tan, Harry; Forbes-Mewett, Helen (2018). \"Whose 'fault' is it? Becoming homeless in Singapore\". *Urban Studies*. **55** (16): 3579–3595. [doi](/wiki/Doi_(identifier)):10.1177/0042098017743723. [ISSN](/wiki/ISSN_(identifier)) 0042-0980. Retrieved 20 June 2025. - Teo, Siew Eng; [Kong, Lily](/wiki/Lily_Kong) (March 1997). \"Public Housing in Singapore: Interpreting 'Quality' in the 1990s\". *Urban Studies*. **34** (3): 441–452. [doi](/wiki/Doi_(identifier)):10.1080/0042098976069. [JSTOR](/wiki/JSTOR_(identifier)) 43083375. [S2CID](/wiki/S2CID_(identifier)) 154318656. - Yuen, Belinda (2009). \"Reinventing Highrise Housing in Singapore\". *Cityscapes*. **11** (1): 3–18. [JSTOR](/wiki/JSTOR_(identifier)) 20868687. Library resources about **Public housing in Singapore** - Resources in your library - Resources in other libraries - Public housing in Singapore on eresources.nlb.gov.sg - Housing in Singapore detailed analysis about evolution of SIT and HDB typical floor plans from 1930s to present, statistics, list of BTO, DBSS, EC and more.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:45:21.295748",
  "title": "Public housing in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Public_housing_in_Singapore"
}