{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:45:16.640666"
  },
  "content": "This article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"Public holidays in Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2015)* *(Learn how and when to remove this message)* The schedule of 11 **public holidays in [Singapore](/wiki/Singapore)** which are gazetted and recognized since the establishment of [Singapore](/wiki/Singapore)'s 1998 Holidays Act. ## List of public holidays in Singapore There are generally 11 public holidays a year; however, since the gap between the [Islamic calendar](/wiki/Islamic_calendar) and the [Gregorian calendar](/wiki/Gregorian_calendar) lasts around 11 days, [Hari Raya Puasa](/wiki/Hari_Raya_Puasa) and [Hari Raya Haji](/wiki/Hari_Raya_Haji) are respectively celebrated twice in a Gregorian calendar year every 32 or 33 years. This occurred in 1968 and 2000 for Hari Raya Puasa as well as 1974 and 2006 for Hari Raya Haji, giving Singaporeans 12 public holidays in those years instead of 13 since they are not close enough to be both celebrated twice in the same Gregorian year, only either one of the two. Day or Month2025 Date2026 DateNameRemarks1 January[New Year's Day](/wiki/New_Year%27s_Day)Celebrates the opening of the [Gregorian New Year](/wiki/Gregorian_calendar) marked annual day to commemorate the first day of the Gregorian calendar.January/February29 and 30 January17 and 18 February[Chinese New Year](/wiki/Chinese_New_Year_in_Singapore)A two-day holiday. Celebrates the opening of the [Chinese holiday](/wiki/Chinese_holiday) marked annual festival to commemorate the first and second days of the [Chinese calendar](/wiki/Chinese_calendar).March/April18 April3 April[Good Friday](/wiki/Good_Friday)This [Christian holiday](/wiki/Christian_holiday) marks the crucifixion and death of [Jesus Christ](/wiki/Jesus_Christ).1 May[Labour Day](/wiki/Labour_Day)Celebrates the [economic](/wiki/Economic) and [social](/wiki/Social) achievements of workers.May/June12 May31 May[Vesak Day](/wiki/Vesak)This [Buddhist holiday](/wiki/Buddhist_holiday) celebrates the birth and [enlightenment](/wiki/Enlightenment_in_Buddhism) and [Parinibbana](/wiki/Parinibbana) of [Gautama Buddha](/wiki/Gautama_Buddha), held on the 15th day of the fourth Lunar Month of the [Chinese calendar](/wiki/Chinese_calendar).9 August[National Day](/wiki/National_Day_(Singapore))Celebrates the [commemorate the nationhood and independence of Singapore](/wiki/History_of_Singapore#Independent_Singapore_(1965_-_present))October/November20 October8 November[Deepavali](/wiki/Diwali)The [Hindu holiday](/wiki/List_of_Hindu_festivals) celebrates the return of [Lord Rama](/wiki/Rama) to [Ayodhya](/wiki/Ayodhya_(Ramayana)) after defeating the demon king [Ravana](/wiki/Ravana) and vanquishing of the demon [Naraka](/wiki/Naraka) by [Lord Krishna](/wiki/Lord_Krishna)25 December[Christmas Day](/wiki/Christmas_Day)This [Christian holiday](/wiki/Christian_holiday) celebrates the birth of [Jesus Christ](/wiki/Jesus_Christ).1 [Syawal](/wiki/Shawwal)31 March21 March[Hari Raya Puasa](/wiki/Hari_Raya_Puasa)This [Islamic holiday](/wiki/Islamic_holiday) celebrates the close of the fasting month of [Ramadan](/wiki/Ramadan).10 [Zulhijjah](/wiki/Dhu_al-Hijjah)7 June27 May[Hari Raya Haji](/wiki/Hari_Raya_Haji)This [Islamic holiday](/wiki/Islamic_holiday) celebrates the willingness of [Ibrahim](/wiki/Abraham_in_Islam) to sacrifice his son [Ismael](/wiki/Ishmael) as an act of obedience to [Allah](/wiki/Allah). Under the Holidays Act, should a public holiday fall on a Sunday, the following Monday is gazetted as a public holiday (also called holiday-in-lieu). There are however, special occasions, that may be gazetted by the [President of Singapore](/wiki/President_of_Singapore) to declare any day to be observed as a public holiday by modifying any days specified in the schedule to the Holidays' Act and if any, another day to be observed as an additional public holiday when in that year two public holidays fall on the same day. One such occasion occurred during the 2015 National Day, whereas an additional day of August 7 was gazetted as a public holiday in addition to August 10 being the holiday-in-lieu. If any public holiday falls on a Saturday in Singapore, the following Monday is declared as a school holiday for students in primary and secondary schools, only if that Monday is not a public holiday itself. ### General / presidential elections Under Section 35 of the Parliamentary Elections Act and Section 17 of the Presidential Elections Act, Polling Day for a general election or a presidential election (but not [by-elections](/wiki/By-elections_in_Singapore)) is a public holiday that is gazetted by the [returning officer](/wiki/Returning_officer) from the [Elections Department Singapore](/wiki/Elections_Department_Singapore). Under the Employment Act, employees not required to work on that day are entitled to one day off in lieu or be given one day's pay. Latest DateNameRemarksLast Election3 May 2025[General election](/wiki/General_elections_in_Singapore)To elect the next [Parliament of Singapore](/wiki/Parliament_of_Singapore)[2025 general election](/wiki/2025_Singaporean_general_election)1 September 2023[Presidential election](/wiki/Presidential_election)To elect the next [president of Singapore](/wiki/President_of_Singapore)[2023 presidential election](/wiki/2023_Singaporean_presidential_election) ## Defunct public holidays Up to and including 1968, these few were also gazetted as [public holidays](/wiki/Public_holidays) but were removed to improve business competitiveness. - [Boxing Day](/wiki/Boxing_Day) - celebrated the day after Christmas Day. - [Easter Monday](/wiki/Easter_Monday) - in the Western Christian liturgical calendar, the second day of Eastertide and analogously in the Byzantine Rite is the second day of Bright Week. - [Holy Saturday](/wiki/Holy_Saturday) - the Saturday of Holy Week, also known as the Great Sabbath, Black Saturday, or Easter Eve, and called \"Joyous Saturday\" or \"the Saturday of Light\" among Coptic Christians, is the day after [Good Friday](/wiki/Good_Friday). - [Thaipusam](/wiki/Thaipusam) - A Hindu festival celebrated mostly by the Tamil community on the full moon in the Tamil month of Thai. - [Mawlid](/wiki/Mawlid) - The observance of the birthday of the Islamic prophet Muhammad which is celebrated in Rabi' al-awwal, the third month in the Islamic calendar. - Second day of [Hari Raya Puasa](/wiki/Hari_Raya_Puasa) - Second day of Hari Raya. ## Workers' rights It is legal for employers to agree to give their employees other holidays in substitution for one or more public holidays. No act or thing relating to any [government](/wiki/Government_of_Singapore) department or public authority, any judicial proceeding, any transaction, instrument or any other act or thing is rendered invalid where it is done or executed on a Sunday or public holiday. Under the Employment Act, an employee who is required to work on a public holiday is entitled to an extra day's salary at the basic rate of pay, in addition to the gross rate of pay for that holiday. The days observed as general [public holidays](/wiki/Public_holiday) in [Singapore](/wiki/Singapore) are declared in the schedule to the Holidays Act. According to the [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)), which issues a yearly list of the dates on which public holidays fall, the holidays were \"chosen and agreed upon after close consultation with different community and religious leaders in Singapore\". Other factors taken into account were the impact on business costs and statutory leave provided for under the Employment Act. Thus, some religious holidays such as [Easter Monday](/wiki/Easter_Monday), [Mawlid](/wiki/Mawlid) (the birthday of Muhammad), [Boxing Day](/wiki/Boxing_Day) and [Thaipusam](/wiki/Thaipusam) were removed from the list of public holidays and become a non-holiday observances to improve business competitiveness.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:45:16.640223",
  "title": "Public holidays in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Public_holidays_in_Singapore"
}