{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:45:14.931340"
  },
  "content": "* *Public demonstrations** in [Singapore](/wiki/Singapore) are generally rare due to laws that make it illegal to hold cause-related events without a valid licence from the authorities. Such laws include the Public Entertainments Act and the Public Order Act. Public demonstrations are nevertheless permitted at the [Speakers' Corner](/wiki/Speakers%27_Corner,_Singapore), which occurs regularly, most notably [Pink Dot SG](/wiki/Pink_Dot_SG) and the protest against [Population White Paper](/wiki/Population_White_Paper) in 2013. ## Speaker's Corner In the past, political speeches in Singapore were only permitted at the Speaker's Corner, an area created and designated for such events. However, a police permit was still a requirement before one could proceed with one's speech. On 1 September 2008, the government decided that Singapore citizens wishing to hold events there need not obtain any permits from the police, and the restriction on using audio amplification devices was lifted. However, they are still required to inform the National Parks Board, a statutory body that manages nature parks. In 2008, Speakers' Corner was the scene for meetings held over several weeks by [Tan Kin Lian](/wiki/Tan_Kin_Lian), former chief executive of insurance company [NTUC Income](/wiki/NTUC_Income), to advise people of their legal recourse after [structured products](/wiki/Structured_product) they had purchased became virtually valueless upon the collapse of [Lehman Brothers](/wiki/Lehman_Brothers). ## Notable incidents Nevertheless, such laws did not deter some groups conducting a number of illegal public demonstrations. ### 2005 #### White elephant incident at Buangkok MRT station ### 2008 #### *Tak Boleh Tahan* A group of 20 people turned up at Parliament House on 15 March 2008 to protest against the escalating cost of living in Singapore. *Tak Boleh Tahan* stands for \"I can't take it anymore\" in colloquial Malay. The event was organised by the [SDP](/wiki/Singapore_Democratic_Party) and included their members. 18 were arrested when they refused to disperse as ordered by the police. All 20 were subsequently charged under Section 5(4)b Chapter 184 of the Miscellaneous Offences (Public and Nuisance) Act. The Singapore Police Force described this incident as an escalation on the scale and level of defiance exhibited by the group and stated that their actions and arm-locking with each other was \"militant like\". ### 2021 #### Protest outside Ministry of Education headquarters In 2021, six Singaporeans protested for improved [trans](/wiki/Trans_rights) protections in the educational system outside the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) headquarters at [Buona Vista](/wiki/Buona_Vista). ## Recent changes The Public Order Act gives authorities the power to prevent an individual from leaving home or a building if it is deemed that that person intended or intends to be part of a demonstration. Police are also allowed to order a person to leave a specific area should they determine an intention of offence. Second Home Affairs Minister [K. Shanmugam](/wiki/K._Shanmugam) argues that this was necessary to maintain security at the [Asia-Pacific Economic Cooperation](/wiki/Asia-Pacific_Economic_Cooperation) summit held in 2009. However, opponents like [Chee Soon Juan](/wiki/Chee_Soon_Juan), leader of the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) argues that the law is intended \"for the long run\" to silence discontent against the government. - [Human rights in Singapore](/wiki/Human_rights_in_Singapore) - [Censorship in Singapore](/wiki/Censorship_in_Singapore) - [Demonstration (protest)](/wiki/Demonstration_(protest))\n",
  "language": "en",
  "processed_at": "2026-01-12T11:45:14.930751",
  "title": "Public demonstrations in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Public_demonstrations_in_Singapore"
}