{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:45:10.973461"
  },
  "content": "1998 legal judgement on constitutionality of a statutory provision ***Public Prosecutor v. Taw Cheng Kong*** is a landmark case decided in 1998 by the [Court of Appeal of Singapore](/wiki/Court_of_Appeal_of_Singapore) which shaped the landscape of Singapore's [constitutional law](/wiki/Constitutional_law). The earlier [High Court](/wiki/High_Court_of_Singapore) decision, *Taw Cheng Kong v. Public Prosecutor*, was the first instance in Singapore's history that a statutory provision was struck down as unconstitutional. The matter subsequently reached the Court of Appeal when the [Public Prosecutor](/wiki/Attorney-General_of_Singapore) applied for a criminal reference for two questions to be considered. The questions were: 1. whether section 37(1) of the Prevention of Corruption Act (Cap. 241, 1993 Rev. Ed.) (\"PCA\") was *[ultra vires](/wiki/Ultra_vires)* the powers of the legislature on the ground that the legislature had, under section 6(3) of the Republic of Singapore Independence Act 1965 (No. 9 of 1965, 1985 Rev. Ed.), been divested of the power to [legislate extraterritorially](/wiki/Extraterritorial_jurisdiction); and 2. whether section 37(1) of the PCA was discriminatory against [Singapore citizens](/wiki/Singaporean_nationality_law) and hence inconsistent with [Article 12(1)](/wiki/Article_12_of_the_Constitution_of_Singapore) of the [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore) (1992 Reprint) (now the [Singapore Constitution](/wiki/Constitution_of_Singapore) (1999 Reprint)). In answering both questions in the negative, the Court of Appeal overturned the High Court's finding that the statute was unconstitutional. The Court of Appeal further clarified Singapore's stance on legislative [plenary power](/wiki/Plenary_power) and expounded upon Article 12(1) of the Constitution, explaining that the promise of equality does not mean that all persons are to be treated equally, but simply that all persons in like situations will be treated alike. Drawing on foreign case law, the Court of Appeal further outlined the test to determine if a differentiating law falls foul of Article 12. ## Facts Taw Cheng Kong (\"Taw\") is a [Singapore citizen](/wiki/Singapore_nationality_law), and was the Regional Manager (Asia Pacific) of the [Government of Singapore Investment Corporation Pte. Ltd.](/wiki/Government_of_Singapore_Investment_Corporation) (\"GIC\"), a [sovereign wealth fund](/wiki/Sovereign_wealth_fund). Based in Hong Kong, he had charge of equity portfolios in Hong Kong and the Philippines, and had authority to decide which companies to invest in on behalf of GIC. Taw was charged with corruption in deals involving GIC and Rockefeller & Co. Inc. It was alleged that Taw, at the instigation of Kevin Lee, managing director of Rockefeller's Far East operations, had orchestrated the purchase by GIC of the Pioneer Hong Kong Fund, which was managed by Rockefeller. For each transaction, Lee was alleged to have paid Taw a sum of money. Taw was tried and convicted in the [District Court](/wiki/Subordinate_Courts_of_Singapore) of eight charges of corruption under section 6(a) read with section 37(1) of the Prevention of Corruption Act (\"PCA\"). Section 6(a) of the PCA provides as follows: > If ... any agent corruptly accepts or obtains, or agrees to accept or attempts to obtain, from any person, for himself or for any other person, any gratification as an inducement or reward for doing or forbearing to do, or for having done or forborne to do, any act in relation to his principal's affairs or business, or for showing or forbearing to show favour or disfavour to any person in relation to his principal's affairs or business ... he shall be guilty of an offence ... Section 37(1) of the PCA states: > The provisions of this Act have effect, in relation to citizens of Singapore, outside as well as within Singapore; and where an offence under the Act was committed by a citizen of Singapore in any place outside Singapore, that person could be dealt with in respect of that offence as if it had been committed in Singapore. Taw appealed to the [High Court](/wiki/High_Court_of_Singapore) against his conviction on two main grounds. The first involved the [admissibility of evidence](/wiki/Admissible_evidence) for his corruption, and, additionally, inconsistencies of such evidence. The second concerned constitutional issues. With regard to the evidential issue, the Court held that the trial judge made an error in accepting GIC's statements as admissible, and thus ordered Taw's convictions to be set aside. ## Constitutional arguments before the High Court In addition, Taw (the appellant) argued, first, that section 37(1) of the PCA was unconstitutional, and, secondly, that its enactment was *ultra vires* the legislative power of [Parliament](/wiki/Parliament_of_Singapore). ### Section 37(1) of the PCA is *ultra vires* Parliament's legislative power The appellant contended that \"any law in Singapore which seeks to have extraterritorial effect is, by that virtue of that alone, unconstitutional\". He raised instances of [extraterritorial](/wiki/Extraterritorial_jurisdiction) laws of Malaysia and India, but differentiated them from the Singapore position since there were express provisions in the constitutions of these jurisdictions providing for the extraterritorial reach of their legislatures, namely, Article 73(a) of the [Constitution of Malaysia](/wiki/Constitution_of_Malaysia) and Article 245(2) of the [Constitution of India](/wiki/Constitution_of_India). Article 73(a) of the Malaysian Constitution states: > In exercising the legislative powers conferred on it by the Constitution ... Parliament may make laws for the whole or any part of the Federation and laws having effect outside as well as within the Federation ... Article 245(2) of the Indian Constitution likewise provides that: > [N]o law made by Parliament shall be deemed invalid on the ground that it would have extraterritorial operation ... In contrast, the Singapore Constitution contains no similar provision. The appellant hence argued that \"Parliament [was] bound by an inherent limitation on its powers so any legislation purporting to have extraterritorial effect must have been *ultra vires* the Constitution\". The appellant further highlighted that section 6 of the Republic of Singapore Independence Act (\"RSIA\"), which was enacted shortly after [Singapore's independence from Malaysia](/wiki/History_of_the_Republic_of_Singapore#Independence_from_Malaysia), provides that Part IV of the Constitution of Malaysia ceased to have effect in Singapore. Since Part IV contains Article 73(a) – the extraterritoriality clause – the appellant argued that its exclusion meant that Singapore's Parliament was not empowered to make any law which had extraterritorial effect. ### Section 37(1) of the PCA is discriminatory The appellant also contended that he had been convicted under section 37(1) of the PCA which discriminated against him \"as a Singapore citizen in derogation of his rights under Art 12 of the Constitution\". Article 12(1) of the Constitution states: \"All persons are equal before the law and entitled to the equal protection of the law.\" The appellant's argument rested on the alleged arbitrariness of the ambit of section 37(1), in that it employed citizenship as a criterion. He alleged this was most apparent \"if an offence under the Act was committed by a non-citizen or permanent resident jointly with a Singapore citizen outside Singapore\", as \"only the Singapore citizen could be dealt with in respect of that offence, and not the non-citizen or permanent resident\". Hence, the appellant argued that since section 37(1) \"unfairly discriminates against him on the basis of citizenship\", it must contravene Article 12 which provides that all persons, citizens and non-citizens alike, are equal. This rendered section 37(1) void according to Article 4 of the Constitution which provides: > This Constitution is the supreme law of the Republic of Singapore and any law enacted by the legislature after the commencement of this Constitution which is inconsistent with this Constitution shall, to the extent of the inconsistency, be void. ## Holding of the High Court ### Parliament had no legislative power to enact section 37(1) of the PCA The High Court rendered its judgment on 9 January 1998. It accepted the appellant's assertion that Article 73(a) was an empowering provision. Hence since section 6(3) of the RSIA had clearly and unambiguously excluded Article 73(a) of the Malaysian Constitution from applying in Singapore following its independence from Malaysia, Parliament had disempowered itself from legislating extraterritorially. Applying this to the case, the Court held that Parliament had no legislative power to enact section 37(1) of the PCA. ### Section 37(1) violates the rights to equality and equal protection In interpreting Article 12 of the Constitution the High Court paid homage to, and endorsed, the approach taken in the landmark case *[Ong Ah Chuan v. Public Prosecutor](/wiki/Ong_Ah_Chuan_v._Public_Prosecutor)* (1980), an appeal to the [Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council) when it was still Singapore's final court of appeal. In the case, the Privy Council held that \"equality before the law and equal protection of the law require that like should be treated with like\". The court further clarified that laws that differentiate between classes are valid if \"the factor which the legislature adopts as constituting the dissimilarity in circumstances is not purely arbitrary but bears a reasonable relation to the social object of the law\". Following the approach in *Ong Ah Chuan*, Judge of Appeal M. Karthigesu, sitting as a judge of the High Court in *Taw Cheng Kong*, sought to succinctly express the reasonable classification test as a means to combat three forms of arbitrariness. This can be expressed as follows: Form of arbitrarinessExplanation of arbitrarinessAction to guard against form of arbitrarinessFirst form of arbitrarinessArbitrary classification: there is no discernible basis of classification.To guard against this form of arbitrariness, all persons being discriminated must share a common identifying mark which is not borne by those persons not discriminated against.Second form of arbitrarinessArbitrary treatment between persons in the same class.To guard against this form of arbitrariness, all persons falling into a particular class must be treated the same way.Third form of arbitrarinessBasis or rationale of classification is arbitrary.To guard against this form of arbitrariness, the basis of classification must bear a reasonable relationship to the object of the executive action. #### High Court's test Upon reviewing the lines of Indian and Malaysian cases before him, Karthigesu J.A. reformulated a three-stage test to determine whether a statute or section will contravene Article 12 of the Constitution. The judge's articulation of the test, premised on \"elegance and simplicity\", sought to address the three forms of arbitrariness as mentioned above. This test is described as follows, and is fully depicted by the diagram on the right: - **Stage 1**. Is the law discriminatory, in the sense that it prescribes different treatment amongst individuals? - **Stage 2**. Is the discrimination founded on intelligible differentia? (\"Intelligible differentia\" is defined under the first form of arbitrariness.) - **Stage 3**. Two further questions must be posed to ensure that the law is not arbitrary: (a) Are persons falling into the same class treated equally? If all the persons in the class are equally discriminated against, and all persons not discriminated against are equally not discriminated against, then the law does not offend this second order of arbitrariness.(b) Does the basis of discrimination bear a reasonable relation to the object of the statute? To answer this question, the following inquiries have to be undertaken:(i) What is the object of the statute?(ii) Is the basis of the discrimination a reasonable means of achieving the object? #### Application of the High Court's test The crux of the High Court's holding rested on stage 3(b), as illustrated in the table below. In analysing the constitutionality of the provision with regards to this portion of the reasonable classification test, the Court first ascertained the object of section 37(1) of the PCA. It subsequently considered if differentiation on the basis of citizenship was a reasonable means of attaining the objective. StageApplicationStage 1section 37(1) of PCA is discriminatory. A person who has committed an offence under the Act will be criminally prosecuted, as compared to a person who has not. Hence the Court proceeded to the second stage.Stage 2Singapore citizenship was considered by the Court to be an intelligible differentia, and hence the law is not arbitrary as there is a discernible classification between Singapore citizens and non-citizens or [permanent residents](/wiki/Permanent_residency). Hence the Court proceeded to the third stage.Stages 3(a) and (b)Section 37(1) passed stage 3(a). All Singapore citizens who have committed an offence under the Act will be prosecuted, while all non-citizens or permanent residents who have similarly committed an offence of corruption will be immune. The difficulty lay in stage 3(b), namely, whether the decision of the legislature to discriminate against Singapore citizens in the matters of corruption bore a reasonable relationship or rational nexus to the object of the Act. According to the parliamentary debates relating to the Prevention of Corruption Ordinance 1960, the PCA was originally enacted to eradicate corruption from [Singapore's civil service](/wiki/Singapore_Civil_Service) and fiduciaries in Singapore, and not corruption globally \"irrespective of national boundaries\". Section 37(1), however, was not part of the original PCA. It was added in an amendment to the Act in 1966. In this regard, the Court found it incorrect, as a matter of [statutory interpretation](/wiki/Statutory_interpretation), to \"rely on earlier material to interpret subsequent legislation\". Rather, it asserted the importance of looking at the amending legislation afresh. Referring to the parliamentary material relating to the original Act and the subsequent addition of section 37(1), the Court found that section 37(1) was added to \"address acts of corruption taking place outside Singapore but affecting events within it\". To this end, it held that classification along the lines of citizenship was an unreasonable means of attaining the objective of section 37(1) of PCA, for it was both over-inclusive and under-inclusive. Legislation is over-inclusive if it catches a class of persons not originally contemplated as falling within the objective of the Act, and under-inclusive if it catches a class of persons who clearly do not fall within the mischief sought to be addressed by the Act. On the facts, section 37(1) was over-inclusive as a Singapore citizen who was now a permanent resident of a foreign country and employed there who received a bribe in a foreign currency from a foreign payor would be guilty of an offence under the Act. Conversely, it was simultaneously under-inclusive since a Singapore permanent resident or a foreigner working for the [Government of Singapore](/wiki/Government_of_Singapore) who takes a trip outside Singapore to receive a bribe in Singapore dollars in relation to an act he will do in Singapore is not caught under the Act. The Singapore permanent resident poses a greater threat to the integrity of the Civil Service than the Singapore citizen employed abroad. Yet, it is the latter who is captured and not the former. Therefore, the High Court felt that classification according to citizenship was not a reasonable means of attaining the objectives of the PCA, for the latter class of persons who posed a larger threat would not be caught. Accordingly, section 37(1) was unconstitutional. The \"strength of the nexus\" between the objective of the PCA and the classification, along the lines of citizenship, was \"insufficient\" to justify the derogation from the constitutional promise of equality. ## Issues before the Court of Appeal Following the High Court's decision, the [Attorney-General](/wiki/Attorney-General_of_Singapore), in his capacity as the Public Prosecutor, applied pursuant to section 60 of the Supreme Court of Judicature Act for a criminal reference for two questions of law to be considered by the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore). The questions were: 1. whether section 37(1) of the PCA was *ultra vires* the powers of the legislature on the ground that the legislature had, under section 6(3) of the RSIA, been divested of the power to legislate extraterritorially; and 2. whether section 37(1) of the PCA was discriminatory against Singapore citizens and hence inconsistent with Article 12(1) of the Constitution. ## Holding of the Court of Appeal ### Parliament has power to legislate extraterritorially The Court of Appeal held that section 6(3) of the RSIA had not divested the legislature of its power to legislate extraterritorially on two grounds. #### Possession of plenary powers by sovereign states First, the Court clarified that extraterritorial provisions were \"inserted to dispel any doubts over the legislative capacity of the respective legislatures\". However, such insertions were actually unnecessary since it was trite law that a [dominion](/wiki/Dominion) or [colony](/wiki/Crown_colony) had extraterritorial legislative powers. *[A fortiori](/wiki/A_fortiori_argument)*, a sovereign state's extraterritorial legislative powers should be undisputed. Therefore, the Court was of the opinion that when Singapore gained independence on 9 August 1965, it acquired the attributes of sovereignty, and Parliament was bestowed with full [plenary powers](/wiki/Plenary_power) to enact legislation. These powers include the power to enact extraterritorial laws and enforce them in local courts. Parliament had subsequently used these plenary powers to enact the Constitution (Amendment) Act 1965 and the RSIA on 22 December 1965. This served to eliminate any doubt as to the legislative powers of the Singapore Parliament because section 5 of the RSIA transferred all the plenary legislative powers previously possessed by the [Parliament of Malaysia](/wiki/Parliament_of_Malaysia) to the Singapore Parliament. This would necessarily have included the power to legislate extraterritorially. This was not negated by section 6 of the RSIA for two reasons. First, with the plenary powers of the Malaysian legislature vested in it under section 5, Parliament \"did not have to depend on any express conferment of extraterritorial powers\". Secondly, section 6 was concerned with provisions in the Malaysian Constitution which were either \"preserved or excluded because Parliament in 1965 did not have time to enact a new Constitution\". It could not have any effect on section 5 of the RSIA which was not a provision of the Malaysian Constitution. #### Article 73(a) not an empowering provision As the plenary legislative powers of the Parliament were sufficient to grant extraterritorial legislative powers to the Parliament, the Court declined to pronounce whether Article 73(a) was an empowering provision. However, it indicated on an *[obiter](/wiki/Obiter_dictum)* basis that had it been necessary to do so, it would have accepted the Attorney-General's alternate submission that Article 73(a) of the Malaysian Constitution was never intended to be an empowering provision. If Article 73(a) was intended to be an empowering provision, its exclusion would have disempowered the Parliament from legislating within Singapore, an absurd result which could not have been intended. Instead, the Court held that the provision was a provision regulating the \"relations between the Federation and the States\", as the title of Part VI of the Malaysian Constitution states. This was supported by the text found in the marginal note (\"extent of federal and state laws\") and the relevant chapter (\"distribution of legislative powers\"). Additionally, the opening words to Article 73(a) – \"In exercising the legislative powers conferred on it by this Constitution ...\" – already indicated that it was [presupposed](/wiki/Presupposition) that extraterritorial powers had been conferred. As Article 73(a) was not an empowering provision, it had been excluded merely because it was irrelevant to the RSIA and it did not disempower the Parliament of its extraterritorial legislative powers. ### Section 37(1) of the PCA consistent with rights to equality and equal protection In answering the second question, the Court of Appeal considered two main issues, namely, the concept of equality and the test to determine if a statute or executive act violates Article 12. #### Concept of equality In construing the concept of equality in Article 12, the Court held that equality does not mean that all persons are to be treated equally, but simply that all persons in like situations will be treated alike. [Chief Justice](/wiki/Chief_Justice) [Yong Pung How](/wiki/Yong_Pung_How) arrived at this conclusion by considering the history that underpinned the notion of equality. The Court traced the origin of Article 12 back to the 40th article of [Magna Carta](/wiki/Magna_Carta) which reads, \"To none will we sell, to none will we deny, to none will we delay right or justice.\" Subsequently, the Court cited with approval the Malaysian case *Public Prosecutor v. Su Liang Yu* (1976), that equality referred to the administration of equal justice. Also, the Privy Council case *Ong Ah Chuan* was quoted again, as it was in the High Court, as Yong C.J. referenced [Lord Diplock](/wiki/Kenneth_Diplock,_Baron_Diplock)'s observation that \"... Art 12(1) of the Constitution assures ... the individual ... the right to equal treatment with other individuals in similar circumstances ...\". #### Court of Appeal's test Clarifying the law on equality and equal protection, the Court adopted the approach proposed by [Supreme Court](/wiki/Federal_Court_of_Malaysia) Judge [Mohamed Azmi Mohamed](/wiki/Mohamed_Azmi_Mohamed) in *Malaysian Bar v. Government of Malaysia* (1986). Whilst similar to the test expressed by Karthigesu J.A. in the court below, this approach seemed to streamline his first two forms of arbitrariness into the first limb of its test. Thus, according to the Court of Appeal, the test for validity under Article 12 of the Constitution is as follows: - **Stage 1**. Does the law differentiate in that it prescribes different treatment amongst individuals? - **Stage 2**. If the law differentiates, is it based on a reasonable classification? To answer this, the following have to be considered: (a) Is the classification founded on an intelligible differentia which distinguishes persons that are grouped together from others that are left out of the group?(b) Does the differentia bear a rational relation to the object sought to be achieved by the law in question? On a [semantic](/wiki/Semantics) point, Yong C.J. cautioned against an indiscriminate use of the word *discrimination*, proffering instead that the term *differentiation* be used unless the law fails the three-stage test. Also, before applying this test in considering if a piece of legislation contravenes Article 12, there needs to be a presumption that an impugned law is constitutional. This [presumption of constitutionality](/wiki/Presumption_of_constitutionality) stems from the wide power of classification which the legislature has to make laws which operate differently as regards different groups of persons, so as to give effect to its policies. An academic, Tan Yock Lin, has acknowledged the benefit of this presumption as it \"tells the challenger what he must do\". The person challenging the constitutionality of a legislative or executive classification must expect to \"furnish cogent and compelling evidence of unequal treatment\". Postulating examples will not be sufficient for the purposes of rebuttal. However, Tan has pointed out that this results in additional indeterminacy for it is not clear what level of cogency will satisfy the court of the viability of the challenge. #### Application of the Court of Appeal's test The Court of Appeal ultimately found that section 37(1) of the PCA did not offend Article 12(1). Whilst the decision was similarly made at the \"rational nexus\" limb of stage 3 of its test, the Court fundamentally differed from the High Court in construing the objective of section 37(1). It viewed the section as \"capable of capturing all corrupt acts by Singapore citizens outside Singapore\", whereas the High Court constrained its ambit to Singapore. Having established this expansive objective as the starting point, Yong C.J. dismissed the notion that the over- and under-inclusiveness of section 37(1) meant it was unconstitutional. In considering over-inclusiveness, he considered the argument that the \"net cast by the legislature\" would include a person whom the provision was not intended to catch, such as a Singapore citizen who is a foreign permanent resident, employed in the foreign country by the foreign government, receiving a bribe paid in foreign currency by a foreign payor. He held, however, that such alleged over-inclusiveness was irrelevant to the constitutional issue of equality, as it would apply to all citizens as a class. In addressing under-inclusiveness, he cited the need to respect international [comity](/wiki/Comity), thereby rendering impractical the extension of section 37(1) to govern non-citizens living abroad. The differences in the High Court and the Court of Appeal's approaches are summed up in the following table: IssueHigh CourtCourt of AppealObjective of section 37(1)To address acts of corruption taking place outside Singapore but affecting events within it, particularly within the civil service.To capture all corrupt acts by Singaporeans, including those outside Singapore.Over-inclusivenessYes, as section 37(1) captures acts that would arguably not affect events within Singapore, such as acts committed by Singapore citizens residing in foreign countries.No, as it applies equally to all citizens as a class.Under-inclusivenessYes, as section 37(1) does not capture acts affecting events within Singapore by non-citizens living in Singapore.Not applicable, given the necessity to respect international comity. Tan Yock Lin has opined that the Court of Appeal was incorrect in dismissing over-inclusiveness on the ground that section 37(1) applies to all Singapore citizens as a class. Such reasoning amounts to the argument that class fairness is a [tautology](/wiki/Tautology_(rhetoric)), where so long as there is equality within the same class, it is considered fair. If this were the case, no classification would ever be over- or under-inclusive. Instead, Tan argues that the doctrine of reasonable classification is premised on the propriety of distinctions based on classes, and whether it is proper to treat those within the class differently from those outside. Tan also criticized the justification of under-inclusiveness purely on the basis of international comity. Whilst he accepts that the considerations of international comity \"explain why the nationality criterion is sound\", he questions the under-inclusion of the [permanent resident](/wiki/Permanent_residency), an unexplained omission. While equality jurisprudence primarily centres around a pledge of the protection of equal laws, laws frequently classify individuals out of necessity. Needless to say, the very idea of classification is premised on, and engenders, inequality. Therein lies the paradox of equality jurisprudence. The necessity of differentiation is even more paramount in modern society with its increasingly complicated problems. [Joseph Tussman](/wiki/Joseph_Tussman) and Jacobus tenBroek have proposed the doctrine of reasonable classification as the solution, whereby the legislation defines the class that includes all who are similarly situated for the purpose of the law and none who are not. Two varieties of inequality violate the doctrine of reasonable classification: over-inclusiveness and under-inclusiveness. If a classification is over-inclusive, the net cast by the legislature catches a class of persons not contemplated as falling within the objectives of the Act. Conversely, an under-inclusive classification arises if the net cast does not catch a class of persons who clearly do fall within the mischief sought to be addressed. Tussman and tenBroek represent the two inequalities in a [Venn diagram](/wiki/Venn_diagram), an adaptation of which is reproduced on the right. Between the two inequalities, over-inclusiveness is a more egregious violation of the equal protection provision in the Constitution, for it affects the \"innocent bystander, the hapless victim of circumstance or association\". In comparison, under-inclusiveness should not be fatal. The Court of Appeal in *Taw Cheng Kong* held that, keeping in mind practical considerations, \"the enactment of a provision need not be seamless and perfect to cover every contingency\". The legislature is reasonably entitled to address the mischief \"in a piecemeal fashion\", as the equal protection clause is not \"a pedagogic requirement of the impracticable\". ## Other implications of the judgment ### Customary international law rules Lim Chin Leng has opined that *Taw Cheng Kong* stands as authority for the proposition that the Singapore courts will apply in [domestic law](/wiki/Municipal_law) the rules and principles of [public international law](/wiki/Public_international_law) that have previously been received into the [common law](/wiki/Common_law). The Court of Appeal recognized a rule of [customary international law](/wiki/Customary_international_law) that had been received into the common law, that is, the presumption against extraterritoriality, and ascribed to Parliament the intent to uphold that rule for the purposes of construing a statutory provision. Considering the statements made in the case by Yong C.J., Lim observed that \"[a]n Act of Parliament would ordinarily apply within the territorial limits of the state, and thus would not normally be construed to apply to foreigners in respect of acts done by them outside the territorial limits of the state\" and that \"when it came to determining the rationality of the classification, the objective of the Act must be balanced against Parliament's intention to observe international comity\". The author went on to consider how the phrase *international comity* should be defined, observing that \"it is often used by the United Kingdom courts to mean a rule or principle of (customary) international law, as opposed to a rule pertaining only to the common courtesy of nations\". Finally, he argued that if this was the interpretation to be adopted, then *Taw Cheng Kong* \"suggests that what the Singapore courts recognize as a customary rule of international law that has been received into the common-law could determine or condition the proper interpretation to be given to a statutory provision, or could at least be relied upon to determine the true intent of Parliament\". Lim noted that although the view held in Singapore appears to be that a country's laws are not presumed to apply extraterritorially, it might be desirable to include a general extraterritoriality clause. He derived support for this statement from *Taw Cheng Kong*, where the Court of Appeal expressed the following view: > As Singapore becomes increasingly cosmopolitan in the modern age of technology, electronics and communications, it may well be more compelling and effective for Parliament to adopt the effects doctrine as the foundation of our extraterritorial laws in addressing potential mischief. But we must not lose sight that Parliament, in enacting such laws, may be confronted with other practical constraints or considerations which the courts are in no position to deal with. The matter, ultimately, must remain in the hands of Parliament to legislate according to what it perceives as practicable to meet the needs of our society. ### Statutory interpretation [Goh Yihan](/wiki/Goh_Yihan) has considered the High Court's decision in *Taw Cheng Kong* in relation to the issue of the type of extrinsic materials that may be referred to by courts when interpreting legislation, according to the section 9A of the Interpretation Act. Section 9A(1) requires courts to adopt a [purposive approach](/wiki/Purposive_theory) towards statutory interpretation by providing that when a court is interpreting written law, an interpretation that promotes the purpose or object underlying the law is to be preferred to one that does not. Section 9A(3) goes on to state as follows: > [T]he material that may be considered ... in the interpretation of a provision of a written law shall include — > > (a) all matters not forming part of the written law that are set out in the document containing the text of the written law as printed by the Government Printer;(b) any explanatory statement relating to the Bill containing the provision;(c) the speech made in Parliament by a Minister on the occasion of the moving by that Minister of a motion that the Bill containing the provision be read a second time in Parliament;(d) any relevant material in any official record of debates in Parliament;(e) any treaty or other international agreement that is referred to in the written law; and(f) any document that is declared by the written law to be a relevant document for the purposes of this section. Despite having observed that some cases had adopted a broad reading of section 9A(3), Goh noticed a concurrent line of cases which had sought to limit the type of extrinsic materials that might be referred to. One of these was the High Court decision in *Taw Cheng Kong*, in which Karthigesu J.A. laid down the following reasons for not relying on extrinsic material to interpret subsequent legislation: - Sections 9A(3)(b) and 9A(3)(c) of the Interpretation Act contemplate the use of [explanatory statements](/wiki/Preamble) to a tabled [bill](/wiki/Bill_(proposed_law)) or a speech made by a minister on the occasion of the [motion](/wiki/Motion_(legal)) for the [second reading](/wiki/Reading_(legislature)#Second_reading) of the bill as interpretive aids. However, they do not permit reference to other explanatory statements or speeches. The statements the court may refer to under these provisions are strictly the statements concerning the bill in question. - Section 9A(3)(d) allows the court to consider \"any relevant material in any official record of debates in Parliament\". Under this provision, material relating to the original Act may be looked at in interpreting an amendment. However, it would not be wise to set a precedent for the unregulated use of original material in construing a subsequent amendment. After all, it is not a rule that Parliament must legislate consistently with past legislation. On the contrary, subsequent legislation must, where inconsistent with its predecessor, prevail over it. The objective of the court is not to construe all legislation as if Parliament was in some way bound by its intentions when it first passed the Act. It is to construe why Parliament has seen fit to amend that Act in the light of the inadequacies that the passage of time has revealed or new needs carried by the tide of progress. - The first duty of the court is to determine whether the amendment was intended to be consistent with the intentions of Parliament in passing the original Act. Only if the court is satisfied if that is the case may it read them as one. ### Judicial role in constitutional interpretation As of 2009, the High Court's decision in *Taw Cheng Kong* was the only case in Singapore where a statutory provision had been struck down as unconstitutional.[note 1] Although overturned on appeal, the case illustrates the power that the judiciary wields and its role in safeguarding the Constitution. However, [Thio Li-ann](/wiki/Thio_Li-ann) has expressed the view that the High Court judgment *Rajeevan Edakalavan v. Public Prosecutor* (1998) seems to indicate \"a judicial cession of its [the court's] role to protect fundamental liberties\". Noting that in *Rajeevan* it was said that \"[t]he sensitive issues surrounding the scope of fundamental liberties should be raised through our representatives in Parliament who are the ones chosen by us to address our concerns\", she opined that the statement was more appropriate to a jurisdiction premised on [parliamentary supremacy](/wiki/Parliamentary_sovereignty). On the other hand, since the Constitution is the supreme law of Singapore, the judiciary is empowered to strike down unconstitutional legislation, as the High Court's decision in *Taw Cheng Kong* indicates. ## Notes ### Citations ### Sources **Articles and websites** **Books** - Tan, Kevin Y[ew] L[ee]; Thio, Li-ann (2010), \"The Right to Equality & Equal Protection\", *Constitutional Law in Malaysia and Singapore* (3rd ed.), Singapore: [LexisNexis](/wiki/LexisNexis), pp. 871–970, [ISBN](/wiki/ISBN_(identifier)) 978-981-236-795-2.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:45:10.973094",
  "title": "Public Prosecutor v Taw Cheng Kong",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Public_Prosecutor_v_Taw_Cheng_Kong"
}