{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:45:49.539150"
  },
  "content": "North-Eastern Island of SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Pulau Ubin\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2025)* *(Learn how and when to remove this message)* **Pulau Ubin** (*OO-bin*), also simply known as **Ubin**, is an [island](/wiki/Island) situated in the north east of [Singapore](/wiki/Singapore), to the west of [Pulau Tekong](/wiki/Pulau_Tekong). The [granite](/wiki/Granite) [quarry](/wiki/Quarry) used to be supported by a few thousand settlers on Pulau Ubin in the 1960s, but only about 40 villagers remained as of 2012. It is one of the last rural areas to be found in Singapore, with an abundance of natural flora and fauna. The island forms part of the [Ubin–Khatib Important Bird Area](/wiki/Ubin%E2%80%93Khatib_Important_Bird_Area) (IBA), identified as such by [BirdLife International](/wiki/BirdLife_International) because it supports significant numbers of visiting and resident birds, some of which are [threatened](/wiki/Threatened_species). Today, the island is managed by the [National Parks Board](/wiki/National_Parks_Board), compared to 12 agencies managing different areas of the island previously. ## Etymology The name ***Pulau Ubin*** literally means \"Granite Island\" in [Malay](/wiki/Malay_language), which explains the many abandoned granite quarries there. *Pulau* means \"island\", and *Ubin* is said to be a [Javanese](/wiki/Javanese_language) term for \"squared stone\". To the [Malays](/wiki/Malay_people), the island is also known as *Pulau Batu Ubin*, or \"Granite Stone Island\". The rocks on the island were used to make floor [tiles](/wiki/Tile) in the past and were called *Jubin*, which was then shortened to Ubin. The island is known as *tsio̍h-suann* in the [Taiwanese Romanization](/wiki/Taiwanese_Romanization_System) of [Hokkien](/wiki/Hokkien), which means \"stone hill\". The highest point is Bukit Puaka (Haunted Hill in Malay) at a height of 75 m. ### Legend Legend has it that Pulau Ubin was formed when three animals from Singapore (a [frog](/wiki/Frog), a [pig](/wiki/Pig) and an [elephant](/wiki/Elephant)) challenged each other to a race to reach the shores of [Johor](/wiki/Johor). The animals that failed would turn to stone. All three came across many difficulties and were unable to reach the shores of Johor. Therefore, the elephant and pig together turned into Pulau Ubin whilst the frog became [Pulau Sekudu](/wiki/Pulau_Sekudu) or Frog Island. ## History Pulau Ubin first appeared on map in an 1828 sketch of the Island of Singapore as *Pulo Obin* and in Franklin and [Jackson](/wiki/Philip_Jackson_(surveyor))'s map as *Po. Ubin*. Since the [British](/wiki/United_Kingdom) founding of Singapore, the island has been known for its granite. The numerous granite quarries on the island supply the local [construction industry](/wiki/Construction_industry). The granite [outcrops](/wiki/Outcrop) are particularly spectacular from the sea because their grooves and fluted sides create [furrows](/wiki/Furrow) and [ridges](/wiki/Ridge) on each granite rock slab. These features are captured in [John Turnbull Thomson](/wiki/John_Turnbull_Thomson)'s 1850 painting — *Grooved stones on Pulo Ubin near Singapore*. The granite from Pulau Ubin was used in the construction of [Horsburgh Lighthouse](/wiki/Horsburgh_Lighthouse). *Tongkangs* ferried the huge rock blocks (30 by 20 feet) from the island to [Pedra Branca](/wiki/Pedra_Branca,_Singapore), the site of the lighthouse, in 1850 and 1851. Later, the granite was also used to build the [Singapore-Johor Causeway](/wiki/Johor-Singapore_Causeway). Most of the quarries are not in operation today and are being slowly recolonised by [vegetation](/wiki/Vegetation) or filled with water. Apart from quarrying, [farming](/wiki/Farming) and [fishing](/wiki/Fishing) were the principal occupations of the inhabitants of the island in the past. It is also called *Selat Tebrau* (*tebrau* is a kind of large [fish](/wiki/Fish)). In the 1970s as the granite quarries closed down and jobs dwindled, residents began leaving. Outlined in [Urban Redevelopment Authority (URA)](/wiki/Urban_Redevelopment_Authority)'s 1993 master plan, there were plans to build an [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) line connecting the island and Pulau Tekong to mainland Singapore as well as HDB apartments on the island by 2030. In 2013, these plans were removed from URA's updated master plans and authorities announced that there were no plans to develop the island. In the 1990s, the government approved land reclamation plans for [Chek Jawa](/wiki/Chek_Jawa), a [cape](/wiki/Cape_(geography)) and 100-hectare [wetlands](/wiki/Wetland) located on the south-eastern tip of Pulau Ubin, and when the plans were made public in 2001, it drew public criticism, with Singaporeans making appeals to the government to preserve the biodiversity of Chek Jawa instead. After a biodiversity survey conducted by conservationist volunteers in December, 2001, it resulted in the plans being postponed by the government, with the [Ministry of National Development](/wiki/Ministry_of_National_Development_(Singapore)) stating that the island would not be developed if there is no need for it to be. In the URA 2011 concept plan, Pulau Ubin is poised to be developed when Singapore's population exceeds a [threshold of 6.9 million](/wiki/Population_White_Paper). According to the plan, HDB flats and a bridge would be built to connect the island with the mainland and Pulau Tekong.[*citation needed*] However, the government has also stated that it would preserve the island in its current state for as long as possible. Pulau Ubin's wooden house villages and wooden jetties, relaxed inhabitants, rich and preserved wildlife, abandoned quarries and plantations, and untouched nature make it the last witness of the old kampung Singapore that existed before modern [industrial](/wiki/Industrialisation) times and large-scale urban development. ## Human settlement In the 1880s, a number of Malays led by Endut Senin from the [Kallang River](/wiki/Kallang_River) were said to have moved to the island that began the thriving Malay community on the island. Many of the former kampung on Pulau Ubin were either named after the first person who settled in the kampung or by some feature in the area. Kampung Leman was named by Leman; Kampung Cik Jawa by a Singaporean named Jawa; and Kampung Jelutong from people from Changi and from its *jelutong* trees. During the 1910s the island was home to a number of German-run coffee plantations. One of the German residents who died in 1914 is commemorated at the [German Girl Shrine](/wiki/German_Girl_Shrine). During the Japanese invasion of Malaya and Singapore in WW2, the island was captured and occupied by the Imperial Japanese army on the night of 7th February 1942 as a diversionary attack on Singapore. A few Japanese soldiers were killed and wounded in the conquest of the island by a few soldiers and natives who put up a fight. The Japanese created havoc on the island and executed and wounded many locals on the island. During the 1950s and 1970s, there were 2,000 people living on the island and the Bin Kiang School was established in 1952 for the increasing number of children, from money donated by the Chinese residents. Lessons prior to this were conducted on the village wayang stage. With a student population that once numbered 400, enrolment fell as the Singapore mainland developed. The school closed in 1985, and was demolished on 2 April 2000. There was also a private Malay school around 1956 at Kampung Melayu, which closed in the late 1970s. Pulau Ubin was found to be suitable for the construction of several campsites. [Outward Bound Singapore](/wiki/Outward_Bound_Singapore) (OBS) was established in 1967 at Pulau Ubin, by Dr Goh Keng Swee, while the [National Police Cadet Corps](/wiki/National_Police_Cadet_Corps) (NPCC) opened its 25-hectare site camp located between Kampung Bahru and Kampung Noordin. The camp is called Camp Resilience where Secondary 2 and 3 NPCC cadets have a 3-day 2 night stay for training. Secondary 2 NPCC cadets go to Adventure Training Camp (ATC) while Secondary 3 NPCC cadets go to Survival Training Camp (STC). lt was opened officially on 10 August 2004. On 3 June 2005, the Singapore Government ordered that all the farmers rearing [poultry](/wiki/Poultry) on the island were to ship them to mainland Singapore and rear them in government-approved farms by 17 June 2005, in the wake of the [avian influenza](/wiki/Avian_influenza). In exchange, the local inhabitants were offered [HDB](/wiki/Housing_and_Development_Board) government housing packages, although they could choose to live on the island. As of 2012, there are only 40 people living on the island. ### Ubin Town Ubin Town is the only settlement on the island. Located near Ubin Jetty, many businesses in the village cater mainly to visitors to the island, with various bicycle shops, restaurants and provision shops dotting the village centre. A [Chinese opera](/wiki/Chinese_opera) stage, managed by the village temple ([Fo Shan Teng Tua Pek Kong Temple](/wiki/Fo_Shan_Ting_Da_Bo_Gong_Temple)) is also located in the village centre; it is one of the last three Chinese opera stages that has survived in Singapore. The platform is a characteristic of Southern Chinese temples, where Chinese opera and [Getai](/wiki/Getai) performances can be held during important festivals presented to the [deities](/wiki/Shen_(Chinese_religion)) of the temple. ## Local tourism Although the island attracted attention for development and planning only in recent years, Pulau Ubin has been popular with Singaporean visitors for recreational activities such as [summer camps](/wiki/Summer_camp) and outdoor activities. With growing attention and interest in nature, visitors to Pulau Ubin has increased over the years, where according to the [National Parks Board](/wiki/National_Parks_Board), the island sees an estimated 300,000 visitors annually. [Pulau Ubin Recreation Area](/wiki/Pulau_Ubin_Recreation_Area), which included [Chek Jawa](/wiki/Chek_Jawa), was created to cater to local tourism. The site is about 700 hectares within the 1,020-hectare Pulau Ubin. Amongst the various popular attractions on the island is Chek Jawa, a previous [coral reef](/wiki/Coral_reef) 5,000 years ago, Chek Jawa can be said to be virtually unspoilt. The wetlands are unique as several ecosystems can be observed in one area and supports a variety of marine wildlife comparable to other islands, such as [sea hares](/wiki/Sea_hare), [sea squirts](/wiki/Sea_squirt), [octopuses](/wiki/Octopus), [starfishes](/wiki/Starfish), [sand dollars](/wiki/Sand_dollar), fishes, [sponges](/wiki/Sea_sponge), [cuttlefishes](/wiki/Cuttlefish) and [nudibranches](/wiki/Nudibranch). A boardwalk runs through the mangrove, allowing visitors to observe the plant and marine life at close range. During low tide, a limited number of people are allowed to walk on the tidal flats. The prominent Chinese temple, [Fo Shan Teng Tua Pek Kong Temple](/wiki/Fo_Shan_Ting_Da_Bo_Gong_Temple), is also another frequently visited site. ### Mountain biking Mountain biking is a popular activity on Pulau Ubin and the island is home to one of Singapore's mountain bike trails, [Ketam Mountain Bike Park](/wiki/Ketam_Mountain_Bike_Park) which was built in 2007. The trail is approximately 8 kilometres long, varies in elevation and features a wide range of terrain from open meadows to thick jungle and is well-marked with signs indicating the difficulty level of each section. While a large proportion of visitors to the island bring their own bicycles, rental cycle vendors are prevalent in Ubin town. ## Transport Visitors may travel to Pulau Ubin from the [main island of Singapore](/wiki/Main_island_of_Singapore) via a 10-minute [bumboat](/wiki/Bumboat) ride from the Changi Point Ferry Terminal (previously known as the [Changi Village](/wiki/Changi_Village) jetty). In 2008, the one-way ticket price was increased from [S$](/wiki/Singapore_dollar)2.00 to [S$](/wiki/Singapore_dollar)2.50 per passenger. It was further increased to [S$](/wiki/Singapore_dollar)3.00 from 7 September 2015 onwards. Since June 2022, it has been [S$](/wiki/Singapore_dollar)4.00. Every bumboat can carry 12 passengers and the captain will wait until his boat has reached the maximum capacity. People who do not want to wait can pay [S$](/wiki/Singapore_dollar)48.00 for the whole bumboat and leave without waiting. Transportation around the island can be either be done via bicycles of which the rental price range anywhere from [S$](/wiki/Singapore_dollar)8.00 to [S$](/wiki/Singapore_dollar)27.00 (for the entire day) depending on the condition of the bike, number of gears etc. For longer distance travel around the island, individuals can call taxi service (which is arranged by small coach buses), to get to scenic spots there. ## Ecological projects ### Hornbill Conservation Project The [National Biodiversity Centre](/wiki/National_Biodiversity_Centre), in partnership with [Wildlife Reserves Singapore](/wiki/Mandai_Wildlife_Group), [Nanyang Technological University](/wiki/Nanyang_Technological_University), and researchers Marc Cremades and Ng Soon Chye, implemented the Hornbill Conservation Project to aid in the breeding and recovery of the [Oriental pied hornbill](/wiki/Oriental_pied_hornbill) (*Anthracoceros albirostris*) which had previously become extinct in Singapore but has since started to re-establish itself in places like Pulau Ubin and Changi. Hornbills require tree cavities to nest in. However, tree cavities of sufficient size to accommodate the female hornbill and her young are not common in Singapore. The implementation of artificial nest boxes at Pulau Ubin and Changi have been successful and video cameras are even installed within the nest boxes to provide a better understanding of the behavioural and feeding patterns of these birds. ### Seahorse Monitoring Project Since May 2009, the National Biodiversity Centre, together with volunteers from [National Parks Board](/wiki/National_Parks_Board) and nature groups such as Wild Singapore and TeamSeaGrass, initiated a project to monitor identified populations of seahorse (*[Hippocampus kuda](/wiki/Hippocampus_kuda)*) and pipefish (*[Syngnathoides biaculeatus](/wiki/Syngnathoides_biaculeatus)*) in several locations including Pulau Ubin for conservation management purposes. The data gathered will help to estimate the population size, growth rate of individuals and track their movements in their natural habitats. ## In popular culture - In 1989, SBC (now renamed Mediacorp), filmed a television drama named *Good Morning, Sir*. The drama was set in the 1950s where a woman from the [main island of Singapore](/wiki/Singapore_Island) went to Pulau Ubin to work as a teacher. - In 1999, [Mediacorp](/wiki/Mediacorp) filmed a [Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)) television drama called *My Teacher, My Friend* about the lives of students in the primary school that used to exist on Pulau Ubin. - In 2006, Mediacorp broadcast a [Kids Central](/wiki/Kids_Central) (now [Okto on 5](/wiki/Channel_5_(Singaporean_TV_channel))) television drama series titled *Ubin Boy*. The plot revolved around two main characters, Steven (a mainland citizen) and his cousin Ah Boy living in Pulau Ubin. - In the [Danny Wallace](/wiki/Danny_Wallace_(humorist)) book *[Yes Man](/wiki/Yes_Man_(book))*, Wallace visits Pulau Ubin after it is suggested to him (and to which he must agree) after he visits Singapore. He is told the island is a paradise and must visit it by a local taxi driver. - *[The Amazing Race 25](/wiki/The_Amazing_Race_25)* visited this island when the teams arrived in Singapore. - [Mediacorp](/wiki/Mediacorp) filmed a [Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)) television drama called *[Hand In Hand](/wiki/Hand_In_Hand_(Singaporean_TV_series))* in 2015 about four siblings in search of a suspicious figure on Pulau Ubin who looks like their father. - [Fo Shan Ting Da Bo Gong Temple](/wiki/Fo_Shan_Ting_Da_Bo_Gong_Temple) - [German Girl Shrine](/wiki/German_Girl_Shrine) - [1972 Pulau Ubin murder](/wiki/1972_Pulau_Ubin_murder) ## Notes - Chua Ee Kiam (2000), *Pulau Ubin – Ours to Treasure*, Simply Green, Singapore. [ISBN](/wiki/ISBN_(identifier)) 981-04-3088-4 - Victor R Savage, Brenda S A Yeoh (2003), *Toponymics – A Study of Singapore Street Names*, Eastern Universities Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-205-1 - *A Guide to Pulau Ubin*, Singapore Environmental Heritage Series, Mobil Oil Singapore Pte Ltd & The Nature Society (Singapore) Library resources about **Pulau Ubin** - Resources in your library - Resources in other libraries - National Parks Board – Pulau Ubin - Pulau Ubin Heritage Trail - Tua Pek Kong Temples - Pulau Ubin Heritage Trail - German Girl Shrine - Pulau Ubin Heritage Trail - Siau Ming En (9 September 2017). \"Five new species of fauna recorded in Pulau Ubin\". *[Today](/wiki/Today_(website))*.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:45:49.538849",
  "title": "Pulau Ubin",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Pulau_Ubin"
}