{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:45:34.396327"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Pulau Samulun\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2020)* *(Learn how and when to remove this message)*Subzone of Boon Lay Planning Area in Singapore **Pulau Samulun** is an offshore [island](/wiki/Island) in [Jurong Industrial Estate](/wiki/Jurong_Industrial_Estate), Singapore. It is separated from mainland Singapore by Selat Samulun. It is only less than a kilometre away from Singapore mainland. Formerly Jurong Shipyard’s main repair facility, the island's shipyard has since closed down, and [Sembmarine](/wiki/Sembmarine) has confirmed that the land has been returned to the Singapore government. The island also formerly housed a food centre that catered to the workers working there. Samulun is from \"sembulun\" a tribe of [Orang Laut](/wiki/Orang_Laut) who once lived here. Before the island was expropriated for industrial development in 1961 with the relocation of 150 families, there was a mosque on top of a knoll and a school catering to the local Malay community. A bridge joining Jurong Industrial Estate and Pulau Semulun (as it was then known) was completed in 1964 which was the second largest bridge in Singapore. There is only one road in Pulau Samulun called Jalan Samulun and it links Shipyard Road in mainland Singapore to Pulau Samulun. ## Transport [SMRT Buses](/wiki/SMRT_Buses) Jurong Industrial Service 249 travels between [Boon Lay Bus Interchange](/wiki/Boon_Lay_Bus_Interchange) and Jalan Samulun. It is also one of the 2 Singapore public bus services that ply outside of Singapore mainland apart from cross border services (160, 170 and 950). This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:45:34.396019",
  "title": "Pulau Samulun",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Pulau_Samulun"
}