{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:45:25.697428"
  },
  "content": "Place in Singapore **Pulau Busing** is a restricted-access island and a hub for oil shipping located off the southwestern coast of Singapore. The island is occupied by Tankstore Ltd, a [petroleum storage](/wiki/Petroleum_storage) company. Heavily industrialised, the island is home to oil and chemical storage facilities, at least one marine offshore terminal, and a [fuel oil](/wiki/Fuel_oil) refinery. ## Name It appears as *Po. Busing* in Franklin & [Jackson](/wiki/Philip_Jackson_(surveyor))'s 1828 Plan of Singapore. *Pulau* is simply Malay for \"island\". *Busing* comes perhaps from the Malay *busung pasir* or *busong pasir* (\"a mound of sand or a dune\") or from *pusing* (\"a turning point\"). ## Description It is north of [Pulau Hantu](/wiki/Pulau_Hantu). It is west of [Pulau Bukom](/wiki/Pulau_Bukom), which is a similarly reclaimed island used for oil storage. Pulau Busing is next to the shipping channel and had a natural deep waterfront harbour of deeper than 16 metres. There are 112 tanks (with a total capacity of 2 million cubic metres) on the island's tank farm ([oil terminal](/wiki/Oil_terminal)). The only access to the island (limited to authorized personnel) is by ferry that departs from the [Pasir Panjang](/wiki/Pasir_Panjang) ferry terminal. ## History Together with [Jurong Island](/wiki/Jurong_Island) and neighbouring offshore islands, the island is part of the integrated storage and trading hub that was developed by [Jurong Town Corporation](/wiki/Jurong_Town_Corporation), which leases it to Tankstore, an oil storage company. Before reclamation, Pulau Busing had a land area of 2.5 hectares. It has seen major land reclamation to its southern shores. Up to the 1980s, it was still fringed by coral reefs on its northern and southern shores. Pulau Busing is an important feeding and roosting ground for migratory shore birds. On 20 March 2018, a petroleum tank on the island caught fire. It took 128 firefighters from the [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) six hours to extinguish the fire. This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:45:25.697140",
  "title": "Pulau Busing",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Pulau_Busing"
}