{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:45:31.473198"
  },
  "content": "* *Pulau Saigon** (alternatively spelled as **Pulo Saigon**) was a small island in the [Singapore River](/wiki/Singapore_River). It used to be located between the banks of [Robertson Quay](/wiki/Robertson_Quay). The island was shown as a mangrove marsh in an 1839 map. Subsequent maps have shown it to be located closer to the northern bank of the river. It was first featured by name as *Kampong Saigon* on a map of 1878. In 1888, British projects to increase the width and depth of the Singapore River made it easier to access existing warehouses on Pulau Saigon, which in turn made other parts of the island commercially viable. Quays and bridges were built and many of the island's original buildings were demolished and replaced by those from new industries ranging from slaughtering [cattle](/wiki/Cattle), manufacturing [pottery](/wiki/Pottery), and burning [rubbish](/wiki/Waste). These former industrial enterprises of Pulau Saigon make it useful for archaeological study. Pulau Saigon became an extension of the mainland when the western arm of the river was drained in 1972. By 1988, the only extant buildings at Pulau Saigon were old warehouses in disrepair. In 1991, the eastern arm of the river was drained as well and the island was completely merged with the mainland at Magazine road. It is no longer depicted on modern maps of Singapore. In February and March 2016, an exhibit at the Archaeological Library of the [National University of Singapore](/wiki/National_University_of_Singapore) by [Debbie Ding](/wiki/Debbie_Ding) featured speculative examples of artefacts from the island. This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:45:31.472862",
  "title": "Pulau Saigon",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Pulau_Saigon"
}