{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:45:51.923975"
  },
  "content": "Planning Area and HDB Town in the North-East Region, SingaporePlanning Area and HDB Town in North-East Region, Singapore **Punggol** ([IPA](/wiki/International_Phonetic_Alphabet): /ˈpɒŋɡoʊl/ *PONG-gohl*) is a [planning area](/wiki/Planning_Areas_of_Singapore) and [new town](/wiki/New_towns_of_Singapore) situated on the Tanjong Punggol peninsula in the [North-East Region of Singapore](/wiki/North-East_Region,_Singapore). The town directly borders [Sengkang](/wiki/Sengkang) to the south and shares riverine boundaries with the planning area of [Seletar](/wiki/Seletar) to the west and [Pasir Ris](/wiki/Pasir_Ris) to the east. Bounding the town to the north and north-east is the [Straits of Johor](/wiki/Straits_of_Johor), with [Coney Island](/wiki/Coney_Island,_Punggol) included as a part of the Punggol planning area. Under the Punggol 21 initiative, plans to turn the area into a new residential town were announced in 1996 and development of the town started in 1998. Due to the Asian financial crisis in 1997 and the financial troubles within the construction industry in 2003, the plan did not fully materialise. In 2007, a new initiative, the Punggol 21-plus plan, was introduced to redevelop the area into a waterfront town. Punggol is divided into 11 districts: Canal, Coney Island, Crescent, Matilda, Northshore, Punggol Central, Punggol Field East, Punggol Field West, Punggol Downtown, Punggol Point and Waterway West. ## Etymology Punggol Point or Tanjong Punggol appears as Tanjong Rangon on Franklin and [Jackson's](/wiki/Philip_Jackson_(surveyor)) 1828 map of Singapore. *Punggol*, also spelled Ponggol, means \"hurling sticks at the branches of fruit trees to bring them down to the ground\" in [Malay](/wiki/Malay_language). It could also refer to a place where fruits and forest produce are offered wholesale and carried away. These possible names suggest that Punggol was a fruit-growing district. The place is said to take its name from the river [Sungei Ponggol](/wiki/Sungei_Punggol). Ponggol also means \"a stump of a tree\", especially \"a high stump\". There are suggestions that the district's name is based on [Tamil](/wiki/Tamil_language) ([Pongal](/wiki/Thai_Pongal), \"the feast of the boiling rice\", celebrated when the sun enters the sign of [Capricorn](/wiki/Capricornus)). However, the word *Ponggol* or *Punggol* is definitely [Malay](/wiki/Malay_language).[*citation needed*] ## History ### Early history Located in the vicinity of the Punggol Jetty, Punggol was believed to have existed 200 years ago before [Sir Stamford Raffles](/wiki/Sir_Stamford_Raffles) founded Singapore. The Punggol area used to be a well-established rural district dotted with farmhouses and farm structures, which were serviced by roads and dirt tracks. It was one of the oldest settlements in Singapore. The original settlers were predominantly [Malays](/wiki/Malays_in_Singapore). The early Chinese immigrants, who settled in Punggol from the mid 19th century onwards, were engaged in plantation work, mainly rubber. As the population of the Chinese increased, many Chinese villagers were then engaged in poultry, pig or fish farming, as well as farm produce. The last pig farm closed down in 1990. [Hydroponic](/wiki/Hydroponic) non-pollutive vegetable farms and orchid farms used to flourish along the Cheng Lim Farmways and Buangkok Farmways, along with old [kampongs](/wiki/Kampung) and low-rise residential areas. Most of these farms have given way to the high-rise [HDB](/wiki/Housing_and_Development_Board) [flats](/wiki/Apartment) of [Sengkang New Town](/wiki/Sengkang_New_Town) and Punggol New Town. Historically, Punggol was populated mostly by [Teochews](/wiki/Teochew_people) and [Catholics](/wiki/Catholic). However, the original settlers were predominantly [Malays](/wiki/Malays_(ethnic_group)). The end of Upper Serangoon Road is known to Teochews as *kangkar* or \"[river bank](/wiki/Bank_(geography))\" or \"[river mouth](/wiki/River_mouth)\". [Ferries](/wiki/Ferries) were used on the [Serangoon River](/wiki/Sungei_Serangoon) as transport. An old market was also located here. The Catholic [missionaries](/wiki/Missionaries) arrived here 140 years ago and set up churches and schools. A Malay kampong, which has since been cleared, could also be found at Tanjong Punggol. At the end of Punggol Port Road, Indonesian and Malaysian fishermen auctioned their catch at the wholesale fish market. ### World War II Between 18 February to 4 March 1942, during [World War II](/wiki/World_War_II), the Hojo Kempei (auxiliary military police), under the supervision of the [Kempeitai](/wiki/Kenpeitai_East_District_Branch) in Singapore, rounded up suspected anti-Japanese civilians within the Singapore Chinese population during [Sook Ching](/wiki/Sook_Ching) . On 28 February 1942, around 300-400 Chinese civilians were killed at [Punggol Point](/wiki/Punggol_Point) by the Hojo Kempei firing squads. The victims were part of around 1,000 Chinese males who were previously rounded up during a search of the Chinese community living at Upper Serangoon Road. The location was declared as a national heritage site with a plaque commemorating the victims of the massacre. ### Post-war Punggol In the 1960s, basic amenities like piped water, electricity, paved roads, and [drainage systems](/wiki/Sewage) were introduced through government and self-help programmes. It was also at this time that television became popular and antennas could be seen installed on many kampong rooftops. Punggol was also known for its sumptuous seafood and boatels that provided services like docking and renting of boats for boating, [water skiing](/wiki/Water_skiing) and [skindiving](/wiki/Scuba_diving) lessons. These seafood restaurants and boatels have since been relocated in the mid-1990s to facilitate [land reclamation](/wiki/Land_reclamation) works. Poultry and pig farms were also gradually phased out when redevelopment commenced in the 1970s. The last pig farm closed down in 1990. Land vacated by resettled farmers were then tendered out on short-term leases for non-pollutive agricultural activities, which included hydroponic non-pollutive vegetable and orchid farms that used to flourish along the Cheng Lim Farmways and Buangkok Farmways. These farms existed along with old kampongs and low-rise residential areas. All of these farms have given way to the high-rise HDB flats of Sengkang New Town and [Punggol New Town](/wiki/Punggol_New_Town). ### Punggol 21 In his [National Day Rally](/wiki/National_Day_Rally) speech on 18 August 1996, then-Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) announced the [Singapore Government](/wiki/Singapore_Government)'s plan to develop Punggol, known as \"Punggol 21\". Punggol 21 was a new model for housing, which would feature a new concept in housing as a model for new towns in the 21st century. It would have a mix of private houses and high-grade HDB flats grouped into smaller, distinctly designed estates. Each estate would contain between 1,200 and 2,800 units, with a common neighbourhood green. Every housing unit would be located within 300 m (980 ft) of the nearest [LRT](/wiki/Light_Rail_Transit_(Singapore)) station. Schools, libraries, and [community clubs](/wiki/Community_centre) would be clustered for convenience, and there would be three commercial centres, including shopping centres. A few months after the speech, Punggol 21, which was part of [Cheng San Group Representation Constituency](/wiki/Cheng_San_Group_Representation_Constituency) then, became an election [carrot](/wiki/Carrot_and_stick) for the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) to beat a [Workers' Party](/wiki/Workers%27_Party_of_Singapore) team led by [J.B. Jeyaretnam](/wiki/J.B._Jeyaretnam) and [Tang Liang Hong](/wiki/Tang_Liang_Hong). At the [general election in 1997](/wiki/1997_Singaporean_general_election), the five-man PAP team managed to retain Cheng San GRC with 54.8% of the valid votes. However, Punggol 21 did not materialise fully as [Singapore's economy](/wiki/Singapore%27s_economy) was affected by the [Asian economic crisis](/wiki/Asian_economic_crisis) in 1997. Although construction began the next year, it was stopped when demand for new flats fell sharply. Plans were again delayed when the construction industry in Singapore experienced financial troubles in 2003. As a result, only some 16,000 flats, out of the 80,000 planned units, have been built as at 2007. There was only one shopping mall in the estate, Punggol Plaza, and there were no recreational facilities like [cinemas](/wiki/Cinema_(place)) or swimming pools. As of January 2016, a second shopping mall in the estate, [Waterway Point](/wiki/Waterway_Point), has opened, and many more recreational facilities have since been planned within the estate. #### Punggol 21-plus In his National Day Rally speech on 19 August 2007, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) offered a new vision for Punggol New Town, and introduced the \"Punggol 21-plus\" plan to re-vitalise the town. Under the new plan, [Sungei Punggol](/wiki/Sungei_Punggol) and [Sungei Serangoon](/wiki/Sungei_Serangoon), which flank the town, will be dammed up to create a freshwater lake and serve as a [reservoir](/wiki/Water_reservoir). A 4.2 km (2.6 mi) long, 20–30 m (66–98 ft) wide [man-made waterway](/wiki/Canal) was planned to run through the estate, linking both rivers. Work on it started in 2009, and was completed on 26 October 2011. When it was built, there will be recreational facilities like water sports for [kayaking](/wiki/Kayaking) and [canoeing](/wiki/Canoeing), gardens and parks with [jogging](/wiki/Jogging) and cycling tracks, [rooftop gardens](/wiki/Rooftop_garden), eateries for [al fresco dining](/wiki/Al_fresco_dining) and a [floating island](/wiki/Floating_island). The \"Punggol 21-plus\" project involves 18,000 new HDB and private flats, and about 3,000 new flats will be built in Punggol New Town every year. Punggol New Town is projected to have 96,000 units when fully developed in the long term. Waterfront housing will have stepped courtyards. There will be a promenade on the northern sea front, stretching about 8.7 km (5.4 mi). An integrated waterfront commercial and residential development has also been planned at the town centre, which will be built on both banks of the waterway. The site for this project was put up for sale and named [Waterway Point](/wiki/Waterway_Point) with condominium – [Watertown](/wiki/Punggol_Watertown). There will also be other facilities within the town centre, which includes a community club, regional library and hawker centre in the future. Punggol Central will be converted into a tree-lined boulevard with landscaping. [Coney Island](/wiki/Coney_Island,_Singapore), on the other hand, was opened to the public in 2015. ## Demographics ### Population history Resident Population 2000-2024YearPop.±%2000240—2001710+195.8%200212,860+1711.3%200324,450+90.1%200436,360+48.7%200542,500+16.9%200646,860+10.3%200751,060+9.0%200854,560+6.9%200956,950+4.4%201059,390+4.3%201164,530+8.7%201274,730+15.8%201388,070+17.9%201498,140+11.4%2015109,750+11.8%2016130,380+18.8%2017146,640+12.5%2018161,570+10.2%2019170,560+5.6%2020174,450+2.3%2021176,190+1.0%2022185,810+5.5%2023194,750+4.8%2024199,400+2.4%2024204,150+2.4%Source: ### Age profile The data below is from the population report published by the Singapore Department of Statistics as of June 2025. Age group (years)MalesFemalesTotal population% of total population0–46,0105,82011,8305.795–97,7607,45015,2107.4510–147,7007,06014,7607.2315–196,0705,72011,7905.7820–244,7404,5409,2804.5525–294,6604,9109,5704.6930–347,1708,80015,9707.8235–399,32010,89020,2109.9040–4410,43011,66022,09010.8245–499,1709,09018,2608.9450–547,8607,37015,2307.4655–595,4305,10010,5305.1660–644,6604,3709,0304.4265–693,5003,8607,3603.6170–742,7003,1105,8102.8575–791,8402,2704,1102.0180–847409601,7000.8385–893905709600.4790+1403304700.23Age group (years)MalesFemalesTotal population% of total population0–1421,47020,33041,80020.4815–6469,51072,450141,96069.5465+9,31011,10020,41010.00 The population distribution of Punggol in 2025 demonstrates a relatively young demographic. There is a higher population concentration among younger and middle-aged groups, with the male and female population peaking at the 40-44 age range at 5.11% and 5.71% respectively. Punggol has a notably high concentration of children, with 20.5% of the population being 0 to 14 years old, significantly higher than the national average of 13.6%. In contrast, the elderly population is relatively low, with 10.0% of the population aged above 65, significantly lower than the national average of 18.8%. This is mainly due to Punggol being a relatively new residential area, attracting many young families and new homeowners. ### Household As of 2025, there were 178,170 people living in [HDB](/wiki/Housing_and_Development_Board) flats, representing 87.3% of the population. This is significantly higher than the national proportion of HDB dwellers (75.8%), reflecting a greater prevalence of public housing in the area. Among the population, 81,890 residents, or 40.1% of the population, live in 4-room HDB Flats, making it the most common type of dwelling. 25,210 residents (12.3%) live in condominiums and other apartments, while 370 residents (0.18%) live in landed properties. As of 2020, the average household size in Punggol is 3.37. Among the 56,166 households in Punggol, the most common household size is two persons, representing 23.2% of total households. This is closely followed by a household size of four persons, representing 22.8% of all households. Punggol has a [home ownership](/wiki/Owner-occupancy) rate of 92.5% as of 2020. This is higher than the national home ownership rate of 87.9%, making Punggol the fifth-highest in home ownership rate among all planning areas in Singapore. ### Ethnicity Ethnic groups in Punggol (2010−2020) Year[Chinese](/wiki/Chinese_Singaporeans)[Malays](/wiki/Malay_Singaporeans)[Indians](/wiki/Indian_Singaporeans)Others[Pop.](/wiki/Population)PercentagePop.PercentagePop.PercentagePop.Percentage**2010**47,20179.48%6,84211.52%3,8216.43%1,5222.56%**2015**84,89077.35%14,48013.19%7,7207.03%2,6702.43%**2020**131,94075.63%26,05014.93%12,1906.99%4,2702.45% Consistent with the rest of Singapore, Punggol has an ethnically diverse population, with a majority Chinese population, constituting 75.63% of the population as of 2020. This is slightly higher than the national proportion of 74.35%, though the proportion has been decreasing over the years. Notably, the proportion of Indian residents in Punggol, 6.99%, is lower than the national average of 8.96%, placing Punggol as one of the planning areas with the lowest proportion of Indian residents in Singapore. ### Religion Consistent with the rest of Singapore, the largest religion in Punggol is [Buddhism](/wiki/Buddhism_in_Singapore), with 45,742 practising residents (33.80% of the population). The second most common group consists of residents with [no religion](/wiki/Irreligion_in_Singapore) (28,518 residents, 21.07%), followed by [Christianity](/wiki/Christianity_in_Singapore), with 23,965 Christians, including 9,104 Catholics (6.73%). [Islam](/wiki/Islam_in_Singapore) is practised by 20,960 residents (15.49%). Other religious affiliations include [Taoism](/wiki/Taoism_in_Singapore) and [other Chinese religions](/wiki/Chinese_folk_religion) (10,550 residents, 7.79%), [Hinduism](/wiki/Hinduism_in_Singapore) (4,976 residents, 3.68%), and [Sikhism](/wiki/Sikhism_in_Singapore) (280 residents, 0.21%). Compared to the national average of 5.00%, there is a notably lower proportion of practising Hindus in Punggol. ### Education As of 2020, 98.1% of the population above 15 is literate, above the national literacy rate of 97.1%. 71.9% of residents are literate in two languages, with the most common language pair being English and Chinese (53.4%). 6.74% of Punggol residents are literate in three or more languages. 43,473 residents (34.9% of the population) in Punggol have attained a university qualification, slightly higher than the national average of 32.1%. In contrast, 8,601 residents, or 6.91% of the population, have no educational qualifications, ranking the 6th lowest in Singapore. ### Language Languages most frequently spoken at home, Punggol (2020 census)Languagespercent[English](/wiki/Singapore_English)55.2%[Mandarin Chinese](/wiki/Mandarin_Chinese)29.3%[Malay](/wiki/Malay_Language)7.3%[Chinese dialects](/wiki/Chinese_dialects)6.0%[Tamil](/wiki/Tamil_Language)1.2%[Other Indian languages](/wiki/Languages_of_India)0.55%Others0.39% The proportion of residents in Punggol using [English](/wiki/English_language) as the most frequently spoken language (55.2%) is higher than the national average of 48.3%. Additionally, there are 1,840 [Tamil](/wiki/Tamil_Language) speakers, representing 68.3% of the 2,695 [Indian language](/wiki/Languages_of_India) speakers in Punggol. ### Employment and income According to the 2020 Census of Population, 95,536 residents aged 15 years and over in Punggol are employed, out of the 100,781 in the [labour force](/wiki/Workforce). This equates to an employment rate of 94.8%, slightly higher than the [national employment rate](/wiki/Employment_in_Singapore) of 94.2%. The remaining 34,565 residents aged above 15 (25.5%) in Punggol are outside the labour force. Among the employed residents in Punggol aged 15 years and over, most earn a gross monthly income of between S$3,000 and S$3,999, with 11.5% being in that category. 5.4% earn less than S$1,000 per month, while 4.8% earn above S$15,000 per month. According to the 2020 Census of Population, most resident households have a monthly household income of $20,000 and over, encompassing 10.8% of all households. The second highest category for monthly household income is between S$15,000 and $17,499, encompassing 7.3% of all households. 6.3% of all households have no employed person. ## Subzones Punggol currently has seven subzones. SubzonePopulationPopulation density (/km2)Area (km2)[Coney Island](/wiki/Coney_Island,_Singapore)001.33Matilda52,96037,2961.42Northshore18,42012,8811.43*Punggol Canal*001.11Punggol Field48,54035,1741.38Punggol Town Centre25,22020,5041.23Waterway East54,26037,1641.46**Total****199,400****21,349****9.34** *Subzones indicated in italics are currently under development* ## Amenities ### Transportation Prior to 2000s, Punggol Road was the only main road to get to the rest of Singapore. Urban development into the area has been accelerated with the introduction of better transportational options. The [Tampines Expressway](/wiki/Tampines_Expressway) (TPE) links Punggol New Town up with Singapore's [expressway](/wiki/Controlled-access_highway) network. The [Kallang-Paya Lebar Expressway](/wiki/Kallang-Paya_Lebar_Expressway), which provides a direct route to the [city area](/wiki/Central_Area,_Singapore) via TPE, was fully opened in September 2008. New roads were also built to ease [traffic congestion](/wiki/Traffic_congestion) on Punggol Road. In terms of public transport, the [North-East line](/wiki/North_East_Line) opened on 20 June 2003, and [Punggol Temporary Bus Interchange](/wiki/Punggol_Temporary_Bus_Interchange) on 30 November 2003. The [Punggol LRT line](/wiki/Punggol_LRT_line)'s east loop commenced operations on 29 January 2005, and the west loop on 29 June 2014, beginning with [Nibong](/wiki/Nibong_LRT_station), [Sumang](/wiki/Sumang_LRT_station) and [Soo Teck](/wiki/Soo_Teck_LRT_station) stations. An additional station on the North East line, [Punggol Coast](/wiki/Punggol_Coast_MRT_station), commenced operations in 2024, serving commuters in Punggol North. The bus interchange opened in 2025 to serve commuters in Punggol North as Punggol Coast Bus Interchange, these include Services 34, 34A, 117 and 117M. ### Commercial facilities Punggol Plaza Strategically located near [Coral Edge LRT station](/wiki/Coral_Edge_LRT_station), Punggol Plaza is the first shopping mall in Punggol New Town. Opened in September 2004, it offers residents the convenience of fulfilling all their marketing needs at one place, with an [NTUC FairPrice](/wiki/NTUC_FairPrice) supermarket located on the third floor of the plaza and a [food court](/wiki/Food_court) operated by *Koufu* on the ground floor. Free shuttle services between Punggol Plaza and Sengkang New Town have been provided since September 2004. Waterway Point Located beside the [Punggol Waterway](/wiki/Punggol_Waterway_Park) and [Punggol MRT/LRT station](/wiki/Punggol_MRT/LRT_station), Waterway Point is the largest mall located in Punggol New Town. It is integrated with a town square and a visitors' centre which provides an avenue for residents and the public to learn more about the heritage of Punggol through exhibitions and civic and community events and also features the first underground and largest suburban cineplex in Singapore. The mall had a soft launch on 18 January 2016, and was officially opened on 19 April that year. Oasis Terraces Oasis Terraces was announced in October 2015 by the Housing and Development Board (HDB) as part of two new neighbourhood centres in Punggol next to [Oasis LRT station](/wiki/Oasis_LRT_station), the other one being Northshore Plaza. Oasis Terraces also houses the Punggol Polyclinic which opened on 24 November 2017, offering outpatient medical care, X-ray, physiotherapy, podiatry services and women health services such as screening for cervical and breast cancer. The mall opened on 15 June 2018. Northshore Plaza I & II Northshore Plaza I & II are twin shopping malls built as a part of the new-generation neighbourhood centres by HDB; like Oasis Terraces. Northshore Plaza I opened on 29 October 2021; located at Northshore District next to [Samudera LRT station](/wiki/Samudera_LRT_station) and linked to Northshore Plaza II via a linkbridge across Northshore Drive, whereas Northshore Plaza II opened on 21 January 2022. Punggol Coast Mall Opened as part of the Punggol Digital District in March 2025, is linked directly to the [Punggol Coast](/wiki/Punggol_Coast_MRT_station) MRT and Punggol Coast Bus Interchange. It is also located beside the Singapore Institute of Technology Campus Heart. ### Recreational facilities Punggol Waterway Park Punggol Waterway Park is a riverine park located along the Punggol Waterway. Opened on 23 October 2011, the park is designed with four themes to cater to residents of all ages. It also provides residents opportunities for leisure activities such as jogging and cycling which can be carried out along the promenade at both sides of the waterway. [SAFRA](/wiki/SAFRA_National_Service_Association) Punggol Clubhouse Located near Punggol Waterway Park beside [Sam Kee LRT station](/wiki/Sam_Kee_LRT_station) on the Punggol LRT West Loop, the SAFRA Punggol Clubhouse is a five-storey recreational facility. Announced to be built in June 2014, the clubhouse caters to mainly NSmen and their families features an indoor water playground and a large eco-themed childcare centre. Completed in 2016, the clubhouse houses 10 F&B outlets such as themed restaurants, alfresco dining and quick-service outlets. Its other amenities includes a gym, bowling alley, karaoke outlet and a lounge for members. Punggol Safra was officially opened on 24 April 2016. Punggol Regional Sports Centre Punggol Regional Sports Centre was announced in 2018. It was mentioned in Vision 2030 and will open in 2026. One Punggol One Punggol was announced in 2018 as Punggol Town Hub, it is an integrated community facility like [Our Tampines Hub](/wiki/Our_Tampines_Hub). The development took its present name in 2021. The Punggol Town Hub was completed at the end of 2023 and it is right next to the LRT station Sam Kee, connected by an overhead bridge. It includes [Punggol Regional Library](/wiki/Punggol_Regional_Library), a Community Club and a Hawker Centre which is all opened and a blood donation centre. Marina Country Club The boat club has a childcare, restaurant, pub and fishing & prawning pools. It used to be only connected with a small road from Punggol Seventeenth Avenue. Presently, it is accessible by Northshore Walk and bus service 384. ### Religious institutions Masjid Al Islah Masjid Al Islah is located within the densely populated Punggol New Town at 30 Punggol Field. The mosque serves the Muslim community in Punggol. Church of the Transfiguration The Church of the Transfiguration is the latest Catholic church to be built in Singapore and will serve an estimated 15,000 Catholics and is expected to be one of the largest parishes in Singapore. Fo Guang Shan (Singapore) Fo Guang Shan (Singapore) is located at Punggol Place and opened in October 2007. The Temple building comprises the main shrine hall, a visitor centre, a dining room, a hall for sutra manuscripts, a columbarium, multi-purpose classrooms, a teahouse, an open-air terrace, car park and other modern facilities. Punggol Joint Temple Punggol Joint Temple is a combined temple built in 2007 and is located along Tebing Lane. The temple complex houses three constituent temples, which are Sheng Jia Temple, Tian Jun Temple and Tian Ci Gong (Society of Love & Compassion). Sheng Jia Temple's main deity is the Monkey God and has a long history of more than 40 years. All of their temple workers work voluntarily and on a free-will basis. ### Educational institutions There are currently eleven primary schools and four secondary schools in Punggol New Town. Primary schools - Edgefield Primary School (育德小学) originally opened in January 2001 but could not attract enough students to make even one class. It opened in January 2002. - Greendale Primary School (绿苑小学), was one of the six new primary schools built in new housing estates and towns so as to cater to smaller class size. - Horizon Primary School (励众小学) opened in 2010. - Mee Toh School (弥陀学校) moved from Race Course Road to Punggol New Town in January 2005. It now has a student population of 1,800. - Northshore Primary School opened in 2021. - Oasis Primary School opened in 2016 along with Punggol Cove and Waterway Primary Schools. - Punggol Cove Primary School opened in 2016 along with Oasis and Waterway Primary Schools. - Punggol Green Primary School opened in 2013 to serve the Punggol West community. It is located at 98 Punggol Walk, next to Punggol Sapphire and Punggol Ripples. - Punggol View Primary School, opened in 2013, operating as a single-session school so as to commit more space and time for holistic education. - Waterway Primary School opened in 2016 along with Oasis and Punggol Cove Primary Schools. - Valour Primary School opened in 2020. Secondary schools - [Edgefield Secondary School](/wiki/Edgefield_Secondary_School) opened in 2011. - [Greendale Secondary School](/wiki/Greendale_Secondary_School) opened in January 2006. - [Punggol Secondary School](/wiki/Punggol_Secondary_School) opened in 2000. - [Yusof Ishak Secondary School](/wiki/Yusof_Ishak_Secondary_School) moved from Bukit Batok to Punggol New Town in 2022. Tertiary institutions - [Singapore Institute of Technology](/wiki/Singapore_Institute_of_Technology) International schools - [Global Indian International School](/wiki/Global_Indian_International_School) - One World International School ### Bibliography - Victor R Savage, Brenda S A Yeoh (2003). *Toponymics – A Study of Singapore Street Names*. Singapore: Eastern Universities Press. [ISBN](/wiki/ISBN_(identifier)) 981-210-205-1. - *Singapore : the encyclopedia*. Singapore: Editions Didier Millet. 2006. [ISBN](/wiki/ISBN_(identifier)) 981-4155-63-2. [OCLC](/wiki/OCLC_(identifier)) 71732902. - \"Transcript of Prime Minister Lee Hsien Loong's National Day Rally English Speech on 19 August 2007 at NUS University Cultural Centre\". *[Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts_(Singapore))*. 19 August 2007. Archived from the original on 27 September 2007. Retrieved 2 September 2007. - Pasir Ris-Punggol Town Council - Pasir Ris-Punggol GRC Town Portal - Punggol History and Community updates - Punggol News\n",
  "language": "en",
  "processed_at": "2026-01-12T11:45:51.923638",
  "title": "Punggol",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Punggol"
}