{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:45:59.471137"
  },
  "content": "1°24′24″N 103°54′7″E﻿ / ﻿1.40667°N 103.90194°E﻿ / 1.40667; 103.90194 Residential condominiums in Punggol, Singapore **Watertown** is a [sustainable integrated development](/wiki/Green_building) located in [Punggol](/wiki/Punggol_New_Town), [Singapore](/wiki/Singapore), next to [Punggol MRT/LRT station](/wiki/Punggol_MRT/LRT_station). Designed by RSP Architects Planners & Engineers, the project features a retail and residential component; and is [Punggol](/wiki/Punggol)'s first integrated waterfront development, with the Punggol Waterway located right next to the development. The residential component consists of 11 [residential condominium](/wiki/Condominium) towers ranging from 11 storeys to 14 storeys which are located above the retail component, the [Waterway Point](/wiki/Waterway_Point). Waterway Point was completed by end 2015 and the condominium was completed in 2017. ## History The development was announced in October 2011 by property developer Frasers Centerpoint Limited. Jointly developed with Far East Organization and Sekisui House, it features 992 units comprising suites, SOHO apartments, sky patios, and condominium apartments. ## Retail ### Waterway Point Waterway Point comprises a mixed tenant of approximately 30% F&B, 40% retail, 15% entertainment, 15% others (education institutions, banks, civic & community amenities such as a library). It is the first mall in Singapore to be integrated with a town square and a visitors’ centre which provides an avenue for residents and the public to learn more about the heritage of Punggol through exhibitions and civic and community events. The mall had a soft launch on 18 January 2016, and was officially opened on 19 April that year. ## Residential ### Design The condominium towers are designed to suit different lifestyles and has different apartment types. The first apartment style which is known as the Suites, ranges from 1-bedroom to 2-bedrooms which will have a floor area of 50 to 55 square metres. The second apartment style is known as SOHO (Small office, Home office), ranges from 2-bedrooms to 3-bedrooms and has a floor area of 55 to 78 square metres. The third apartment style known as the Condominiums, ranges from 2-bedrooms to 3-bedrooms with a floor area of 87 to 112 square metres. The last apartment style known as the Sky Patio, ranges from 2-bedrooms to 4-bedrooms will have a floor area of 91 to 136 square metres. Green features The residential towers feature a [sustainable design](/wiki/Green_building) and was awarded the BCA Green Mark Gold Plus award in 2014. The [building envelope](/wiki/Building_envelope) of the towers are designed to minimize heat gain and the towers also features high performance glazing as well as cool paints to minimize heat gain as well. Extensive greenery is also incorporated into the condominium to reduce the island heat of Singapore and all lifts within the development uses regenerative drives to conserve energy. Appliances such as eco-friendly refrigerators, washing machines & air-conditioners are provided within each apartment. Gas water heaters are also provided for up to 73% of the units ### Facilities There are various recreational facilities within the residential towers, such as swimming pools, BBQ cabana, deck terrace, landscape garden, gym, tennis court and spa steam rooms. ### Sales launch On 18 January 2012, Far East Organisation launched a preview sales with 255 units and sold 160 units within the first 5 hours of the launch. The official sales launch was on 20th of that month and prices for the apartments ranged from $980 to $1500 psf (per square foot). - Unit Types - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:45:59.470643",
  "title": "Punggol Watertown",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Punggol_Watertown"
}