{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:45:55.813451"
  },
  "content": "Park in Punggol, Singapore **Punggol Point Park**, formerly known as **Punggol Point**, is located in [Punggol](/wiki/Punggol), north-east of Singapore. ## History **Punggol Beach** was one of the sites where Chinese civilians were killed during the [Sook Ching Massacre](/wiki/Sook_Ching_Massacre). The location has now been declared as a national heritage site. There is a plaque commemorating the Sook Ching Massacre. The inscription on the plaque reads: > On 23 February 1942, some 300–400 Chinese civilians were killed along Punggol [foreshore](/wiki/Foreshore) by *Hojo Kempei* (auxiliary military police) firing squad. They were among tens of thousands who lost their lives during the Japanese *Sook Ching* operation to purge suspected anti-Japanese civilians among Singapore's Chinese population between 18 February and 4 March 1942. The victims who perished along the foreshore were among 1,000 Chinese males rounded up following a house-to-house search of the Chinese community living along [Upper Serangoon Road](/wiki/Upper_Serangoon_Road) by Japanese soldiers. > — National Heritage Board. The remains of some victims from the [Sook Ching massacre](/wiki/Sook_Ching_massacre) would later be discovered by beach goers and fishermen. In 13 March 1977, a human skull and some bones was brought to light when a man dug a hole in the sand around the area. In December 1997, a man digging for earthworms as bait found a skull with two gold teeth as well as parts of an arm and a leg near the shore. ## Present A jetty known as **Punggol Point Jetty** had been an iconic part of Punggol Point and it has been there for a very long time. Punggol Point was also a home to a cluster of popular seafood restaurants in the 1980s and the 1990s. The area, including the jetty that is situated there, underwent development and reopened as Punggol Point Park on 20 November 2011. ## Getting there The place can be reached from New Punggol Road. After its redevelopment into Punggol Point Park, a new road named Punggol Point Road leads into a public carpark for visitors. By public transport, it is a walking distance away from [Punggol Point LRT station](/wiki/Punggol_Point_LRT_station). It is also accessible by taking bus service 84G/84W from [Punggol Bus Interchange](/wiki/Punggol_Bus_Interchange) at Punggol Town Centre. - [Changi Beach Park](/wiki/Changi_Beach_Park) - [Belakang Mati Beach](/wiki/Belakang_Mati_Beach) - [Sook Ching](/wiki/Sook_Ching)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:45:55.813157",
  "title": "Punggol Point Park",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Punggol_Point_Park"
}