{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:45:57.703018"
  },
  "content": "Regional library in Singapore **Punggol Regional Library** ([Chinese](/wiki/Simplified_Chinese): 榜鹅区域图书馆; [Malay](/wiki/Malay_language): *Perpustakaan Wilayah Punggol*) is a [regional library](/wiki/Public_library) located in [Punggol](/wiki/Punggol), Singapore within One Punggol, with a connecting bridge to [Sam Kee LRT station](/wiki/Sam_Kee_LRT_station) and within walking distances of [Punggol Temporary Bus Interchange](/wiki/Punggol_Temporary_Bus_Interchange), [Waterway Point](/wiki/Waterway_Point) and [Punggol MRT/LRT station](/wiki/Punggol_MRT/LRT_station). It is the fourth regional library to be built after the [Tampines](/wiki/Tampines_Regional_Library), [Woodlands](/wiki/Woodlands_Regional_Library) and [Jurong Regional libraries](/wiki/Jurong_Regional_Library). On 30 January 2023, its first two floors were opened to the public. The remaining 3 levels were opened a few months later on 5 April 2023. The library is equipped with a range of accessible features to cater to persons with disabilities. There are calm pods that provide a quiet and safe space, as well as assistive keyboards with large print keys to aid persons with visual impairment. There is a MakeIT space that provides facilities for 3d printing, digital cutting, robotics, and more. Workshops and materials are free for all NLB members. ## History Announced on 7 October 2018, the library will be scheduled to open in 2021 along with a hawker centre, childcare centre, healthcare facilities and a revamped Punggol Vista Community Centre as part of the Punggol Town Hub integrated development. It was announced in 2021, that the library will open in the first quarter of 2023 with inclusive features for the disabled. ## Notes This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:45:57.702585",
  "title": "Punggol Regional Library",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Punggol_Regional_Library"
}