{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:46:04.292886"
  },
  "content": "Cemetery in the East Region, Singapore The **Pusara Abadi Muslim Cemetery**, or simply **Pusara Abadi**, is a burial ground located within the [Choa Chu Kang Cemetery](/wiki/Choa_Chu_Kang_Cemetery) in [Choa Chu Kang](/wiki/Choa_Chu_Kang), [Singapore](/wiki/Singapore). Initially an extension of the older [Pusara Aman Muslim Cemetery](/wiki/Pusara_Aman_Muslim_Cemetery), the burial ground was later regarded as a separate cemetery. It mainly consists of burials that were reinterred from cemeteries and mausoleums which were cleared for redevelopment. ## Etymology The name of the cemetery, \"Pusara Abadi\" is a literal translation of \"Eternal Abode\" in the [Malay language](/wiki/Malay_language). It is two words; Pusara, meaning cemetery or abode, and Abadi, meaning eternal or never-ending. Alternative translations include \"Eternal Cemetery\" or \"Cemetery of Eternity.\" ## History The Pusara Abadi Muslim Cemetery was originally a burial ground conceived as an extension of the Pusara Aman Muslim Cemetery, but was later considered to be separate from it. The earliest existing mention of the cemetery was in the *Berita Harian* newspaper on 18 January 1979, in an article which notified the public about the exhumation of graves at [Sembawang Park](/wiki/Sembawang_Park) that were to be reinterred at the Pusara Abadi Muslim Cemetery. Later in November of that year, the former 100 year old mausoleum of Bismillah Wali, a prominently visited religious site located at Bedok, was demolished, with the remains of Bismillah Wali and a patron saint Syed Mustafa al-Aydarus being reinterred at the cemetery. Then in 1981, the remains of five Indian Muslim workers buried at Pulau Hantu Kecil were exhumed and reinterred at the cemetery. During the 1990s, bodies exhumed from the Bidadari Cemetery that was to be demolished for redevelopment would be reinterred in the Pusara Abadi Muslim Cemetery. In 1993, the graves of [Tok Lasam](/wiki/Tok_Lasam) and his wife in a cemetery at Siglap were to be transferred to the Pusara Abadi Muslim Cemetery, which sparked public outcry. Although most of the cemetery was successfully removed, the workers were unable to exhume the graves of Tok Lasam and his wife due to an unspecified reason. A second attempt to exhume the graves was made in 1998. However, the graves were eventually left alone and are still in their original location along Jalan Sempadan, located in the field behind a modern housing estate and have been renovated with a concrete platform ever since. With Singapore's increasing redevelopment and construction of new housing between the 1990s to 2000s, the mausoleums of Sufi Muslim mystics, known as Keramat, were demolished with the entombed remains being exhumed and reinterred into the cemetery. One such example was a mausoleum near the [Kallang MRT station](/wiki/Kallang_MRT_station) which was exhumed in the 2010s with the deceased being reinterred at Pusara Abadi Muslim Cemetery. As of 2021, the cemetery was still active and used for burials that were not reinterrments. ## Notable burials - Siti Maryam (d. 1852) a trader from either [Yemen](/wiki/Yemen) or [Baghdad, Iraq](/wiki/Baghdad,_Iraq) who migrated to Singapore and was originally buried in an enshrined mausoleum at Kallang, before the mausoleum was demolished and her grave relocated to this cemetery. - Oli Chivli Kutti Mamoo (d. 1962) an Indian Muslim pharmacist who was known by his title \"Bismillah Wali.\" Originally buried in the mausoleum of Syed Mustafa al-Aydarus at Bedok, both graves were exhumed and reinterred at this cemetery, while the mausoleum was demolished. - [Muslim cemeteries in Singapore](/wiki/Muslim_cemeteries_in_Singapore) - [Pusara Aman Muslim Cemetery](/wiki/Pusara_Aman_Muslim_Cemetery) - [Kubur Kassim](/wiki/Kubur_Kassim)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:46:04.292591",
  "title": "Pusara Abadi Muslim Cemetery",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Pusara_Abadi_Muslim_Cemetery"
}