{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:46:06.505159"
  },
  "content": "Historic cemetery in the East Region, Singapore The **Pusara Aman Muslim Cemetery** ([Jawi](/wiki/Jawi_script): مقبرة بوسارا أمان الإسلامية) sometimes known simply as **Pusara Aman**, is a cemetery situated along the Jalan Bahar road within [Lim Chu Kang](/wiki/Lim_Chu_Kang), [Singapore](/wiki/Singapore). It is the only Muslim cemetery that is still in use as of today. The cemetery is part of a larger funerary complex, the [Choa Chu Kang Cemetery](/wiki/Choa_Chu_Kang_Cemetery). ## Etymology The name \"Pusara Aman\" is a literal translation of \"Peaceful Cemetery\" in the Malay language. It is a combination of two words, \"Pusara\" (meaning cemetery) and \"Aman\" (meaning peaceful). ## History Intended to replace the Bidadari Cemetery that was being cleared for urbanization, the Pusara Aman Muslim Cemetery was officially opened in 1974, although there had been earlier burials at the site along Jalan Bahar road prior to that year. The Ministry of Health had also ordered the construction of a mosque to serve the congregants at the cemetery, which was completed two years earlier in 1972 and later served as a funeral parlour. Due to a lack of space, the Pusara Aman Muslim Cemetery was temporarily closed for burials in 1995, with a new extension being developed and at least 10,000 bodies being moved to this new extension. The cemetery was reopened for burials after this new extension was completed, although it was met with some criticism during its initial opening due to the general public finding it difficult to navigate. Part of the cemetery was exhumed in 2020 to make way for an expansion of the nearby [Tengah Air Base](/wiki/Tengah_Air_Base); at least 35,000 graves were affected. During the COVID-19 pandemic, the cemetery was closed to public visiting. Funerals and subsequent burials continued to be held during the pandemic, but with extensive supervision and safety measures taken. After the pandemic, the cemetery resumed its regular operations, with noticeable increase in community and volunteer activities from youths at its mosque. The cemetery is the only functional Muslim cemetery in Singapore. It is currently located on Temporary Occupation License (TOL) land, with the cemetery's management working with relevant services to preserve it and its mosque with funeral parlour. ## Funeral parlour ### Masjid Pusara Aman The cemetery's main funeral parlour is Masjid Pusara Aman, a small mosque built in 1972 under orders of the National Environment Agency. Within the mosque, regular funerary services like washing the dead and preparing the body for burial are performed. ## Notable burials - [Zubir Said](/wiki/Zubir_Said), the composer of Singapore's national anthem - [Othman Wok](/wiki/Othman_Wok), former Minister of Social Affairs from 1963–1977 and later Singaporean ambassador to Indonesia - At least two or three Sufi Muslim mystics of unknown name; whose remains were exhumed from their mausoleums that were demolished for urbanisation and reinterred in Pusara Aman Muslim Cemetery ## Accessibility Bus services 172 and 405 lead to the cemetery's mosque and funeral parlour. ## Gallery - [Muslim cemeteries in Singapore](/wiki/Muslim_cemeteries_in_Singapore) - [Kubur Kassim](/wiki/Kubur_Kassim)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:46:06.504828",
  "title": "Pusara Aman Muslim Cemetery",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Pusara_Aman_Muslim_Cemetery"
}