{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:46:07.519190"
  },
  "content": "Singaporean steamed rice flour sweet snack ***Putu piring*** ([Jawi](/wiki/Jawi_script): ڤوتو ڤيريڠ‎) is a round-shaped [steamed](/wiki/Steaming) rice flour *[kueh](/wiki/Kueh)* (dessert) or sweet snack filled with palm sugar popular in [Singapore](/wiki/Singapore). Commonly associated with [Singaporean cuisine](/wiki/Singaporean_cuisine), it is usually made using stainless steel molds with a distinctive flower shape. It is a traditional dessert among the [Malay community of the country](/wiki/Malay_Singaporeans). There are two variations of *putu piring*. There is a thicker and rounder version as well as flatter version with a disc-like shape. Its composition can be compared to the cylindrical *[putu bambu](/wiki/Kue_putu)* that is eaten in Indonesia, which are steamed using bamboo tube containers instead and are of a different colour. ## Ingredients *Putu piring* is made primarily from finely pounded [rice flour](/wiki/Rice_flour) or [glutinous rice flour](/wiki/Glutinous_rice_flour), and contains fillings of either ground peanut or brown [palm sugar](/wiki/Palm_sugar) mixed with shredded coconut. The typical preparation method involves rapid [steaming](/wiki/Steaming) of both the flour and the filling. Once ready, it is served on [pandan leaves](/wiki/Pandan_leaf) to give it a sweet flavor and scent. In the 1980s, the invention of special steam carts and stainless steel molds for making *kueh tutu* helped to popularize this street snack in Singapore on a wider scale, and saw many *kueh tutu* outlets selling it in many major supermarkets. ### Kueh tutu / Putu mayam *Putu piring* bears some similarities to *kueh tutu*, and is often confused with it. However, there are distinct differences. Also unique to Singapore, it is instead filled with coconut or peanut and is smaller in size. Kueh tutu is also eaten without grated coconut. It also leans towards more of a Singaporean Chinese dessert, having been created by Tan Eng Huat, who first sold it in Singapore during the 1930s at [Bukit Pasoh Road](/wiki/Bukit_Pasoh_Road). There is also *putu mayam* that is popular with the Singaporean Indian community. ## Cultural impact A traditional dessert among the [Singaporean Malay](/wiki/Singaporean_Malay) community, the street dessert has seen international prominence outside of Singapore ever since the 21st century. Putu piring was featured on the [Netflix TV series](/wiki/List_of_original_programs_distributed_by_Netflix), *[Street Food (TV series)](/wiki/Street_Food_(TV_series))* in Season 1 Episode 8 that featured Singapore. The stall featured was located at Haig Road in eastern Singapore and is owned by fifth-generation owner Nooraisha Hashim. The dessert is also on the Michelin-Recommended List which featured this same stall. - *[Mont baung](/wiki/Mont_baung)* - *[Puttu](/wiki/Puttu)* - *[Puto (food)](/wiki/Puto_(food))* - *[Kue putu](/wiki/Kue_putu)* - *[Kue](/wiki/Kue)* - *[Klepon](/wiki/Klepon)* - [Bhapa pitha](/wiki/Bhapa_pitha) - [Idli](/wiki/Idli) - [List of steamed foods](/wiki/List_of_steamed_foods) - Putu piring on the Singapore Infopedia, a Singapore Government Agency Website - Kueh tutu on the Singapore Infopedia, a Singapore Government Agency Website Portals: - Food - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:46:07.518751",
  "title": "Putu piring",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Putu_piring"
}