{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:46:13.924817"
  },
  "content": "Singapore-based ornamental fish service providerThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Qian Hu Corporation\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2023)* *(Learn how and when to remove this message)* **Qian Hu Corporation Limited** ([Chinese](/wiki/Chinese_language): 仟湖集团) is a [Singapore](/wiki/Singapore)-based ornamental fish service provider, with services ranging from the farming, importing, exporting and distribution of ornamental fish, to their specialty of breeding Dragon Fish (aka [Arowana](/wiki/Arowana)). Qian Hu exports more than 500 species and varieties of ornamental fish. It is located at 71 Jalan Lekar, Singapore 698950 off [Old Choa Chu Kang Road](/wiki/Choa_Chu_Kang_Road). It is one of the largest ornamental fish exporter, had a 2001 turnover of $22.5 million (in US dollars) and was also the first Singaporean company to achieve the [ISO 9002](/wiki/ISO_9000). Other services they offer also include the manufacturing and distribution of more than 5000 types of aquarium and pet accessories locally, as well as worldwide. It exports fish to more than 45 countries across the globe, with primary markets in Japan, China, Taiwan, the United Kingdom, Germany, France, as well as the rest of Europe and North Asia. Qian Hu has offices and outlets in three other countries: Malaysia, China and Thailand. ## History On 12 December 1998, the company was incorporated under the Act as Qian Hu Fish Farm Pte Ltd to take over the partnership of Qian Hu Trading and Yi Hu, respectively established in 1988 and 1989. Qian Hu Corporation Limited was listed on the [Singapore Exchange](/wiki/Singapore_Exchange)’s (SGX) Stock Exchange of Singapore Dealing and Automated Quotation system ([SESDAQ](/wiki/SESDAQ)) in the year 2000. By November 2002, it was moved to the Main Board of the Singapore Exchange. In December 2002, Qian Hu was present at the Malaysia International Pet Expo 2002. In 2015, Qian Hu Corporation's head of research of research and development, Alex Chang Kuok Weai, caused controversy when he smuggled 20 bags of live and dead endangered fish in his luggage into [Adelaide](/wiki/Adelaide), [Australia](/wiki/Australia). - investing.businessweek.com - finance.google.com[*dead link*]\n",
  "language": "en",
  "processed_at": "2026-01-12T11:46:13.924551",
  "title": "Qian Hu Corporation",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Qian_Hu_Corporation"
}