{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:46:17.658155"
  },
  "content": "Singaporean multinational e-commerce platformSome of this article's listed sources **may not be reliable**. Please help improve this article by looking for better, more reliable sources. Unreliable citations may be challenged and removed. *(September 2024)* *(Learn how and when to remove this message)* **Qoo10** was a [Southeast Asian](/wiki/Southeast_Asian) [e-commerce](/wiki/E-commerce) [platform](/wiki/Business_model#Platform), formerly known as **GMarket**, headquartered in Singapore. It operates localized [online marketplaces](/wiki/Online_marketplace) across Singapore, Indonesia, Malaysia, [mainland China](/wiki/Mainland_China), and [Hong Kong](/wiki/Hong_Kong), and on one international online marketplace. It optimizes its platform and services for [small and medium enterprise](/wiki/Small_and_medium-sized_enterprises) merchants. ## History Qoo10 was founded as a subsidiary of Qoo10 [Pte. Ltd.](/wiki/Private_company_limited_by_shares), in 2010 by Giosis Pte. Ltd., a [joint venture](/wiki/Joint_venture) between [Gmarket](/wiki/G-Market) [founder](/wiki/Organizational_founder) Ku Young Bae and [eBay](/wiki/EBay). Gmarket was founded in South Korea in 2000 as a subsidiary of Interpark. In December 2007, Gmarket was established in Japan[*citation needed*]. Gmarket was next established in Singapore in December 2008.[*citation needed*] In April 2009, Ku Young Bae sold Gmarket to eBay. In May 2010, Giosis Pte. Ltd. was established as a joint venture between Ku and eBay to further develop Singapore and Japan marketplaces, and expand in the region. In March and April 2011, Gmarket was established in Indonesia and Malaysia respectively.[*citation needed*] In September, Gmarket launched its global marketplace.[*citation needed*] In May 2012, Gmarket was rebranded as Qoo10. In January 2013, Qoo10 was established in China.[*citation needed*] In January 2015, Qoo10 was established in Hong Kong.[*citation needed*]. In July, Giosis raises US$82.1 million in [series a funding](/wiki/Series_A_funding) from [Singapore Press Holdings](/wiki/Singapore_Press_Holdings), [eBay](/wiki/EBay), [Oak Investment Partners](/wiki/Oak_Investment_Partners), [Saban Capital Group](/wiki/Saban_Capital_Group), Brookside Capital, and UVM 2 Venture Investments The company stated their intention to use the funds to accelerate Qoo10's technology growth and service development, while investing in additional infrastructure and talent acquisition. In April 2018, eBay completed [acquisition](/wiki/Takeover) of Giosis Private Limited and its Japan properties, including Qoo10.jp [ja], which will operate independently from other Qoo10 sites. eBay relinquished its stakes in Giosis' non-Japanese businesses, which moved under newly established parent company, Qoo10 Pvt. Ltd. In October 2019, Qoo10 acquired [ShopClues](/wiki/ShopClues), an Indian e-commerce platform. In February 2024, Qoo10 acquired [Wish.com](/wiki/Wish.com), an American e-commerce platform for approximately $173 million. At that time, the Qoo10.com site rebranded the logo from Qoo10 to Wish+. But the Tmon and WeMakePrice refund issue cause the name to be retracted to Qoo10. In August 2024, Qoo10 reportedly cut over 80% of its workforce in Singapore. This restructuring followed reports of financial instability within Qoo10's South Korean operations, where the platform had allegedly defaulted on payments to local merchants and consumers in July 2024. The payment delays, aggravated by the retrenchments of account managers, prompted several merchants to file small claims and police reports. In September 2024, the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) ordered Qoo10 to suspend payment services in Singapore, due to excessive unfulfilled orders and payment obligations to merchants and customers. Qoo10 also ceased operations in Malaysia, shutting down its Malaysian platform, *Qoo10.my*, as part of its broader effort to consolidate resources amidst its financial difficulties. On 11 November 2024, Qoo10 was ordered to wind up in Singapore after the [Singapore High Court](/wiki/Singapore_High_Court) found the company to be insolvent. ## Awards and recognition - Qoo10 was named as the \"Best Online Retailer\" at *AsiaOne's People Choices Awards*, 2015 & 2016. - In January 2016, Qoo10 was ranked 4th among 259 local and global brands with the most positive image, just after [Singapore Airlines](/wiki/Singapore_Airlines), [Apple iPhone](/wiki/IPhone) and [WhatsApp](/wiki/WhatsApp). - In 2016, Qoo10 was voted \"Best Electronics Shopping Portal\" at *Tech Awards* 2016 organized by Singaporean tech magazine HWM and [HardwareZone](/wiki/HardwareZone). - In 2017, CGS-CIMB and Euromonitor statistics figured Qoo10 Singapore captured 32.6% of market share in Singapore's e-commerce market. - Data insights from [metasearch engine](/wiki/Metasearch_engine) iPrice showed that Qoo10 consistently holds the top spot for monthly user website visits among e-commerce platforms in Singapore. - Qoo10 Singapore Archived December 11, 2015, at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:46:17.657913",
  "title": "Qoo10",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Qoo10"
}