{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:46:24.027118"
  },
  "content": "Planning Area and HDB Town in Central Region, SingaporePlanning Area and HDB Town in Central Region, Singapore **Queenstown** is a [planning area](/wiki/Planning_Areas_of_Singapore) and [satellite residential town](/wiki/New_towns_of_Singapore) situated on the south-westernmost fringe of the [Central Region of Singapore](/wiki/Central_Region,_Singapore). It borders [Bukit Timah](/wiki/Bukit_Timah) to the north, [Tanglin](/wiki/Tanglin) to the northeast, [Bukit Merah](/wiki/Bukit_Merah) to the east and southeast, as well as [Clementi](/wiki/Clementi,_Singapore) to the northwest and west. Its southern and southwesternmost limits are bounded by the [Pandan Strait](/wiki/Pandan_Strait). Developed by the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) in the 1950s and subsequently by the [Housing and Development Board](/wiki/Housing_and_Development_Board) in the 1960s, Queenstown was the first satellite town to be built in the country. Most apartments within the township consists of simple one, two, or three-room flats, typically in low-rise, walk-up blocks. Major development work was carried out during the first Five-Year Building Programme between 1960 and 1965. A total of 19,372 dwelling units were constructed between 1952 and 1968. The headquarters of [Grab](/wiki/Grab_(company)), [Razer](/wiki/Razer_Inc.) and the [Asia-Pacific Economic Cooperation](/wiki/Asia-Pacific_Economic_Cooperation) (APEC) are located in Queenstown. ## Etymology Queenstown was named after [Queen Elizabeth II](/wiki/Elizabeth_II) to mark Her Majesty's [coronation](/wiki/Coronation_of_Queen_Elizabeth_II) in 1953. The area was previously known by the [Mandarin Chinese](/wiki/Mandarin_Chinese) name *Wu-wei-gang* ([Wade Giles](/wiki/Wade_Giles): Wu-wei-kang), or in [Hokkien](/wiki/Hokkien) as Boh Beh Kang. The arterial road Queensway was officially named in 1954. ## History Previously, the area which Queenstown currently occupies was a large [swampy](/wiki/Swamp) [valley](/wiki/Valley) with a channel running through in a southeastern direction. On either side of this agricultural area were hills – *feng xing* and *feng ling*. The former was a rubber plantation and the latter, a cemetery also known as *boh beh kang*. The village in the area, with mainly [Hokkien](/wiki/Min_Nan) and [Teochew](/wiki/Teochew_dialect)-speaking dwellers was also the area was inhabited by hundreds of people in [attap](/wiki/Nypa_fruticans)-roofed huts, cultivating vegetables, growing fruits and rearing pigs and chickens. Buller Camp, a British [military camp](/wiki/Military_camp), was also set up there until 1953 when it was cleared for the new housing estate. During [World War II](/wiki/World_War_II), [Pasir Panjang Ridge](/wiki/Pasir_Panjang) became a battleground during the [Japanese Invasion of Singapore](/wiki/Japanese_invasion_of_Singapore), where a [fierce battle](/wiki/Battle_of_Pasir_Panjang) was fought between the defending [Malay Regiment](/wiki/Malay_Regiment) and the Japanese troops in February 1942. Despite its valiant efforts to defend [Bukit Chandu](/wiki/Bukit_Chandu) (Opium Hill in Malay), a key strategic defence position, the Malay Regiment was eventually defeated as it was greatly outnumbered. In 2002, [a war museum](/wiki/Reflections_at_Bukit_Chandu) was opened in Bukit Chandu to commemorate the Battle of Pasir Panjang. In 1947, the Housing Committee of Singapore highlighted the problem of inadequate housing in Singapore. The report proposed the decentralisation of the population away from the city with the building of self-contained residential areas in the suburbs. This proposal was believed to be an influence of the [New town](/wiki/New_town) movements in post-war [Britain](/wiki/The_United_Kingdom). The area was subsequently chosen by Singapore Improvement Trust (SIT) as a site for housing development due to its proximity to the successful first public housing scheme in [Tiong Bahru](/wiki/Tiong_Bahru). Plans for the development of the area were first announced to the general public on 27 September 1953, with construction of Queenstown's first estate, [Princess Margaret](/wiki/Princess_Margaret,_Countess_of_Snowdon) Estate (named after HM Elizabeth II's younger sister) having already begun last in July last year. By late 1953, a preliminary batch of 3-room flats was ready for occupation. By 1956, work on the Princess Margaret Estate (later shortened to Princess Estate) had more than 1,000 [flats](/wiki/Apartment) comprising one, two and three-room units and 68 terrace houses. A ceremony was held in October that year for Forfar House, a 14-storey block which was a prominent landmark in those days as it was the tallest HDB flat at that point of time. The area continued to develop as a self-contained community. Some of the facilities and amenities developed included the Town Centre and the Swimming and Sports Complex. The former was fully completed in 1969 with three cinemas and a variety of outlets including an [emporium](/wiki/Marketplace), a fresh food market, a maternity and child health centre, a [bowling alley](/wiki/Bowling_alley) and a nightclub cum restaurant. The swimming complex was completed in August 1970. In the 1970s, the success of the new town led to the development of [Buona Vista](/wiki/Buona_Vista) and [Holland Village](/wiki/Holland_Village,_Singapore), using the older neighbourhoods of Queenstown as a model. However, by the 1980s, the area had become a mature estate with a higher proportion of [senior citizens](/wiki/Senior_citizen) residing in the area than elsewhere, and a gradual migration of the younger generation into other HDB new towns. ## Geography Queenstown is bounded by the Ulu Pandan Canal, [Ghim Moh](/wiki/Ghim_Moh) Housing Estate and the former Tanglin Camp area to the north, Alexandra Road to the east, Clementi Road to the west and the sea to the south. It covers an area of approximately 2,188 [ha](/wiki/Hectare). The total population (1990 census) is 126,071 with 31,131 housing units. It consists of 16 subzones, namely [Ghim Moh](/wiki/Ghim_Moh), Holland Drive, Commonwealth, Tanglin Halt, Margaret Drive, Mei Chin, Queensway, Portsdown, [Buona Vista](/wiki/Buona_Vista), [Singapore Polytechnic](/wiki/Singapore_Polytechnic), [Dover](/wiki/Dover,_Singapore), [National University](/wiki/National_University_of_Singapore), Kent Ridge, [Pasir Panjang](/wiki/Pasir_Panjang), Pasir Panjang II, and the Port. [Pasir Panjang](/wiki/Pasir_Panjang) lies to the south of Queenstown (*Pasir Panjang* in [Malay](/wiki/Malay_language) means \"long sandy beach\"). The coastline was dotted with [Malay](/wiki/Malay_people) villages, the main economic activities being fishing and [small-scale agriculture](/wiki/Small-scale_agriculture). Only after the war, did the development of the area begin, with [bungalows](/wiki/Bungalow) along the coastline being built in the 1950s. Today, Pasir Panjang is a popular recreational area for [sea sports](/wiki/Water_sports) and attractions such as the [Haw Par Villa](/wiki/Haw_Par_Villa). ## Main housing estates The main housing areas within Queenstown include: - **Princess Estate** is the first subdistrict of the Queenstown District consists of several precincts like Strathmore and Dawson. It is also the first rebuilt estate under SERS. - **Duchess Estate** is the second subdistrict of Queenstown district which consists of Queenstown Centre and Margaret Drive. Several blocks of 2-storey and 3-storey flats are located in this area. It is also the second rebuilt estate under SERS. - **[Tanglin Halt](/wiki/Tanglin_Halt)** consists of rows of ten storey flats. The remaining HDB flats at Tanglin Halt will be demolished by 2021. It is also the third rebuilt estate under SERS. - **[Commonwealth Estate](/wiki/Commonwealth,_Singapore)** is located near [Commonwealth MRT station](/wiki/Commonwealth_MRT_station) and consists of precincts like Commonwealth Close and Commonwealth Crescent. It is best known for having a fantastic view of Singapore's Downtown. It is also the fourth rebuilt estate under SERS, to be demolished together with Tanglin Halt. - **Queen's Close** is a cluster of flats bounded by Mei Ling district, Portsdown Road and Alexandra Road. Queen's Crescent is now demolished and redevelopment will only begin in 2021. - **Mei Ling/Mei Chin** is built from the excavation of two hills, Hong Lim and Hong Yin Hill which are used for cemetery purposes. It is also where Queenstown district got its name Boh Beh Kang, or a river with no source. - **[Buona Vista](/wiki/Buona_Vista)** is the last district built in Queenstown. However, it has developed a distinct and unique identity today that is commonly not linked with Queenstown. - **[Dover](/wiki/Dover,_Singapore)** is a small neighbourhood located in the south of Buona Vista. It is also commonly not associated with Queenstown despite being under its planning area. Dover is known to have many schools around its neighbourhood and [National University of Singapore](/wiki/National_University_of_Singapore) and [Singapore Polytechnic](/wiki/Singapore_Polytechnic) is also located in this region. - **[Ghim Moh](/wiki/Ghim_Moh)** is an estate located beside Buona Vista known for its attractive food. It consists of 28 blocks. - **Margaret Drive**: Penrith an upcoming private condominium development in the Margaret Drive area, adding modern residential options to this historic district. ### Forfar Heights Forfar House, or Block 39, was built in 1956 by the Singapore Improvement Trust (SIT) as a 14-storey block (which at that time was the tallest residential building in Singapore, holding the record until the building of a 20-story block at Selegie in 1963). Also known as *Chap Si Lao*, it was an early part of the mixed height development of the area. The new blocks at Forfar Heights are featured with blue glazing and blue floodlights at the roofline, reminiscent of the early days, where many units were characterised by the blue glass in their windows, by which the district was acquired its [Hokkien](/wiki/Min_Nan) name *Lam Po Lay*. Block 39, Forfar Square, had 106 three-room-flats, four shops, and an eating house, until it was demolished in the early 2000s together with the surrounding SIT blocks under the Selective *en bloc* Redevelopment Scheme (SERS). Currently, the new Forfar Heights consists of two 40-storey blocks (Blk 48, 52) and three 30-storey blocks (Blk 49–51). Residency was offered to residents from the old Forfar House and Blocks 6A & 6B Margaret Drive in 1996, and residents from Block 172–175 Stirling Road & Block 96 Margaret Drive in 2001. The new blocks were launched on *Tree Planting Day 2005 and SERS Completion Ceremony* on 6 November 2005 with guest of honour, [Minister Mentor](/wiki/Minister_Mentor) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) and Member of Parliament for [Tanjong Pagar](/wiki/Tanjong_Pagar) GRC. The name for Forfar Heights had its origin from Forfar Square, which like most Queenstown street names, was connected to the [British royal family](/wiki/British_royal_family). The name *Forfar* comes from *The Royal Burgh of Forfar*, a Scottish town near the childhood home of [Queen Elizabeth the Queen Mother](/wiki/Queen_Elizabeth_the_Queen_Mother).[note 1] ## Demographics Being the first satellite HDB town in Singapore, Queenstown has one of the highest proportions of elderly aged 65 and above. Many of the residents live in smaller 2-room and 3-room flats. As a result, Queenstown earned its reputation as an \"elderly town\". Further developments in Dawson located in Princess Estate have attracted many young Singaporeans to this area in the 2000s as part of the urban renewal efforts. It was announced in 2006 that Margaret Drive will be developed into a modern district with amenities. Due to the comparatively longer heritage of Queenstown district, local community has flourished. Various online communities such as MyQueenstown have been introduced by the local, independent parts of the district. This has certainly changed the image of the district. ## Transportation ### Mass Rapid Transit There are 9 [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) stations that serve the planning area, across 2 lines, the [East West Line](/wiki/East%E2%80%93West_Line_(Singapore)) and the [Circle Line](/wiki/Circle_Line_(Singapore)). Both lines have an interchange station at Buona Vista station. The 9 stations are: - **EW19** [Queenstown](/wiki/Queenstown_MRT_station) - **EW20** [Commonwealth](/wiki/Commonwealth_MRT_station) - **EW21** **CC22** [Buona Vista](/wiki/Buona_Vista_MRT_station) - **EW22** [Dover](/wiki/Dover_MRT_station) - **CC21** [Holland Village](/wiki/Holland_Village_MRT_station) - **CC23** [one-north](/wiki/One-north_MRT_station) - **CC24** [Kent Ridge](/wiki/Kent_Ridge_MRT_station) - **CC25** [Haw Par Villa](/wiki/Haw_Par_Villa_MRT_station) - **CC26** [Pasir Panjang](/wiki/Pasir_Panjang_MRT_station) ### Bus There are 3 bus terminals within the planning area. [Buona Vista Bus Terminal](/wiki/Buona_Vista_Bus_Terminal) is located along Holland Drive while Ghim Moh Bus Terminal is located along Ghim Moh Road. Both of which are near to the Buona Vista MRT Station. Kent Ridge Bus Terminal is located within the vicinity of the Kent Ridge campus of the [National University of Singapore](/wiki/National_University_of_Singapore), at the western portion of the planning area. All three bus terminals within the planning area are anchored by Clementi Bus Package under [Bus Contracting Model](/wiki/Bus_Contracting_Model). ### Roads Queenstown planning area is connected by road to the rest of Singapore via the [Ayer Rajah Expressway](/wiki/Ayer_Rajah_Expressway), a major expressway connecting western Singapore to the [Central Area](/wiki/Central_Area,_Singapore), and also to [Johor](/wiki/Johor) via the [Tuas Second Link](/wiki/Malaysia%E2%80%93Singapore_Second_Link). Major roads in the planning area include Queensway, which is part of the [Outer Ring Road System](/wiki/Outer_Ring_Road_System) (ORRS), a semi-expressway, together with Portsdown Avenue. Queensway intersects with Commonwealth Avenue, a major road that parallels the East West Line and continues into Commonwealth Avenue West at Buona Vista. At the southern portion, the [West Coast Highway](/wiki/West_Coast_Highway,_Singapore) is a major arterial road that links the district of Pasir Panjang to the [Jurong Industrial Estate](/wiki/Jurong_Industrial_Estate) to the west and the Central Area to the east. At the eastern border with Bukit Merah, Alexandra Road is a major road that connects [Pasir Panjang Road](/wiki/Pasir_Panjang_Road) with Ayer Rajah Expressway, Queensway and Commonwealth Avenue. ### Port The Pasir Panjang Container and Multipurpose terminals, which opened in phases from 2000 to 2017, was built off reclaimed land along the coast of Pasir Panjang and supplements the older City Terminals. Located along Harbour Drive in Pasir Panjang, it is currently the largest port facility in the [Port of Singapore](/wiki/Port_of_Singapore), operated by [PSA](/wiki/PSA_International). All Pasir Panjang terminals are expected to close by 2040 as operations will be consolidated at Tuas Port. ## Education ### Primary schools - [Fairfield Methodist School (Primary)](/wiki/Fairfield_Methodist_School_(Primary)) - [New Town Primary School](/wiki/New_Town_Primary_School) - [Queenstown Primary School](/wiki/Queenstown_Primary_School) ### Secondary schools - [Anglo-Chinese School (Independent)](/wiki/Anglo-Chinese_School_(Independent)) - [Fairfield Methodist School (Secondary)](/wiki/Fairfield_Methodist_School_(Secondary)) - [New Town Secondary School](/wiki/New_Town_Secondary_School) - [Queenstown Secondary School](/wiki/Queenstown_Secondary_School) - [Queensway Secondary School](/wiki/Queensway_Secondary_School) - [School of Science and Technology, Singapore](/wiki/School_of_Science_and_Technology,_Singapore) ### Tertiary institutions - [Anglo-Chinese Junior College](/wiki/Anglo-Chinese_Junior_College) - [National University of Singapore](/wiki/National_University_of_Singapore) (Kent Ridge Campus) - [Singapore Institute of Technology](/wiki/Singapore_Institute_of_Technology) (Main Campus until September 2024) - [Singapore Polytechnic](/wiki/Singapore_Polytechnic) ### Other schools - Anglo-Chinese School (International) - [Dover Court International School](/wiki/Dover_Court_International_School) - [ESSEC Business School](/wiki/ESSEC_Business_School) - [INSEAD Asia](/wiki/INSEAD) - [Rainbow Centre](/wiki/Rainbow_Centre) - [S P Jain School of Global Management](/wiki/S_P_Jain_School_of_Global_Management) - [Tanglin Trust School](/wiki/Tanglin_Trust_School) - [United World College of South East Asia](/wiki/United_World_College_of_South_East_Asia) - [MDIS UniCampus](/wiki/Management_Development_Institute_of_Singapore) ## Other amenities ### Places of worship #### Chinese temples - Phoh Teck Siang Tng Temple - Poh Ern Shih Temple - [Tiong Ghee Temple](/wiki/Tiong_Ghee_Temple) #### Churches - Aldersgate Methodist Church - Church of Christ, Pasir Panjang - Church of our Saviour - Church of the Blessed Sacrament - Church Of The Good Shepherd - Emmanuel Evangelical Free Church - Faith Methodist Church - Free Community Church - Holy Covenant Methodist Church - Living Waters Methodist Church - Nazareth Bible-Presbyterian Church - New Creation Church - Norwegian Seamen's Mission - Pasir Panjang Christ Church - Pasir Panjang Hill Brethren Church - Queenstown Lutheran Church - Reformed Evangelical Church (Singapore) - St. John's - St. Margaret's Church - The 'Fisherman of Christ' Fellowship #### Hindu temples - Sri Muneeswaran Temple #### Mosques - Masjid Ahmad - [Masjid Hang Jebat](/wiki/Masjid_Hang_Jebat) - Masjid Hussain Sulaiman - [Masjid Jamek Queenstown](/wiki/Masjid_Jamek_Queenstown) - Masjid Mujahidin - Musollah Prayer Hall - [Surau Ghim Moh](/wiki/Surau_Ghim_Moh) ### Shopping centres - [Alexandra Retail Centre](/wiki/MTower) (ARC) - Anchorpoint - Dawson Place - Holland Piazza - Holland Road Shopping Centre - Margaret Market - One Holland Village - [Queensway Shopping Centre](/wiki/Queensway_Shopping_Centre) - Raffles Holland V - Rochester Mall - The Star Vista - Viva Vista Shopping Mall ### Parks - Alexandra Canal Linear Park - Canterbury Park - [HortPark](/wiki/HortPark) - [Kent Ridge Park](/wiki/Kent_Ridge_Park) - one-north Park - Pasir Panjang Park Connector - Ridout Tea Garden - [West Coast Park](/wiki/West_Coast_Park) ### Community centres/clubs - Buona Vista Community Club - Dover Community Centre - Queenstown Community Centre - Ulu Pandan Community Club ### Sports facilities - Queenstown ActiveSG Stadium - Sports @ Buona Vista - Winchester Tennis Arena ### Hospitals - [Alexandra Hospital](/wiki/Alexandra_Hospital) - [National University Hospital](/wiki/National_University_Hospital) ### Tourist attractions - [Haw Par Villa](/wiki/Haw_Par_Villa) - [Lee Kong Chian Natural History Museum](/wiki/Lee_Kong_Chian_Natural_History_Museum) - [NUS Museum](/wiki/NUS_Museum) - [Reflections at Bukit Chandu](/wiki/Reflections_at_Bukit_Chandu) - Singapore portal - [My Queenstown Heritage Trail](/wiki/My_Queenstown_Heritage_Trail) ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T11:46:24.026730",
  "title": "Queenstown, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Queenstown,_Singapore"
}