{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:46:37.657554"
  },
  "content": "Chinese-Malay-Indian-Others (CMIO) modelThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Race in Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2013)* *(Learn how and when to remove this message)*This article may **require cleanup** to meet Wikipedia's quality standards. The specific problem is: **Inline parentheses citation format needs to be removed.** Please help improve this article if you can. *(June 2024)* *(Learn how and when to remove this message)* The concept of race or ethnicity in contemporary [Singapore](/wiki/Singapore) emerged from the attitudes of the [colonial authorities](/wiki/British_Empire) towards race and ethnicity. Before the early 2000s, the four major races in Singapore were the Chinese, Malays, Indians and Eurasians. Today, the Chinese-Malay-Indian-Others (CMIO) model is the dominant organising framework of **race in Singapore**. Race informs government policies on a variety of issues such as political participation, public housing and education. However, the state's management of race, as well as the relevance of the CMIO model, has been a point of contention amongst some in recent years. ## Historical background The practice of classifying the local population based on their races or ethnicities was born out of British colonial practices. Race categories were enshrined through local censuses and the issuance of identity cards. In the early British censuses of British Malaya, ethnic lines were often drawn by birthplace and linguistic or linguistic group. In these censuses, labels such as ‘Hokkien’, ‘Boyanese’ and ‘Bengali’ were being used. In the 1891 census, races began to be grouped into broader categories such as Chinese, Malay, and Indian. Up until the 20th century, the largely first and second-generation immigrant population retained strong ties to their respective homelands. These communities continued to be influenced by the ideological movements in their homelands. Such movements included the [Chinese Civil War](/wiki/Chinese_Civil_War), the [Indian independence movement](/wiki/Indian_independence_movement), and the [decolonisation efforts](/wiki/Decolonization) in peninsular Malaya and Indonesia. As such, each immigrant community maintained their own sense of nationalism. When Singapore was part of the Federation of Malaysia from 1963 to 1965, [inter-racial tensions were rife](/wiki/History_of_Singapore#Racial_tension), culminating in incidents such as [the 1964 Race Riots](/wiki/1964_race_riots_in_Singapore). At the same time, Singaporean political leaders such as Lee Kuan Yew began to advocate for a “[Malaysian Malaysia](/wiki/Malaysian_Malaysia)”, opposing the Malaysian Federal Government's vision of an ethnic-based Malay Malaysia. After Singapore's split from Malaysia, the Singapore government pushed for the development of a “Singaporean Singapore” identity based on racial equality, with race acting as a secondary identifier alongside the Singaporean national identity. Special rights for Malays were legislated into the Singapore Constitution, symbolically recognising the community as the indigenous people of the land. Singapore also formally adopted four official languages - English, Chinese, Malay (which remains the national language) and Tamil - and implemented a multilingual education policy. ## Government policies According to the [Immigration and Checkpoints Authority (ICA)](/wiki/Immigration_and_Checkpoints_Authority), the child's race registered on their Birth Certificate \"can follow that of the child's father, mother or an acceptable mixed race if the parents are of different races\". The race field cannot be left blank during registration. If parents cannot decide on their child's race at the time of registration, the child's race is provisionally recorded as the father's. The option to record a child's race as double-barrelled (e.g. Chinese-Indian) was introduced in 2010 by the [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)). Previously, mixed-race Singaporeans were allowed to choose between either of their parents' races and no allowance was made for mixed-race children, with the exception of [Eurasians](/wiki/Eurasians_in_Singapore). For relevant Government policies (e.g. the Ethnic Integration Policy), the first component of a double-barrelled race is used. Singaporeans are allowed to change their race twice: once before the age of 21, and once at or after the age of 21. They would have to execute a Statutory Declaration stating their reason(s) for the change, and undertaking not to change their race again. ### Constitution Racial equality and non-discrimination are set out in Article 12 of the Singapore Constitution, which states: > \"12.—(1) All persons are equal before the law and entitled to the equal protection of the law. > (2) Except as expressly authorised by this Constitution, there shall be no discrimination against citizens of Singapore on the ground only of religion, race, descent or place of birth in any law or in the appointment to any office or employment under a public authority or in the administration of any law relating to the acquisition, holding or disposition of property or the establishing or carrying on of any trade, business, profession, vocation or employment. > (3) This Article does not invalidate or prohibit — > (a) any provision regulating personal law; or > (b) any provision or practice restricting office or employment connected with the affairs of any religion, or of an institution managed by a group professing any religion, to persons professing that religion.\" The Constitution also recognises the special position of Malays as the indigenous people of the land in Article 152: > \"152.—(1) It shall be the responsibility of the Government constantly to care for the interests of the racial and religious minorities in Singapore. > (2) The Government shall exercise its functions in such manner as to recognise the special position of the Malays, who are the indigenous people of Singapore, and accordingly it shall be the responsibility of the Government to protect, safeguard, support, foster and promote their political, educational, religious, economic, social and cultural interests and the Malay language.\" ### Language policies The four official [languages](/wiki/Language) (English, Mandarin, Malay, Tamil) are recognised in Article 153 of the Singapore Constitution. English is the language of administration, and is also seen as a common language for the different races to communicate with one another. Mandarin, Malay and Tamil were designated as the ‘Mother Tongues’ of the three respective ethnic groups. The then-Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), in particular, believed that learning one's Mother Tongue helped maintain one's understanding of cultural values. A bilingual education policy was also introduced, mandating that students learn English as their first language and their respective Mother Tongues (determined by their officially registered race). Today, all students are expected to learn an official Mother Tongue Language. However, Singaporeans who have lived abroad for extended periods, as well as international students, may be granted exemptions from the Mother Tongue language requirement on a case-by-case basis. ### Presidential Council for Minority Rights (PCMR) The [Presidential Council for Minority Rights (PCMR)](/wiki/Presidential_Council_for_Minority_Rights) is a non-elected government body which examines legislation to ensure that they do not discriminate against any racial or religious communities. ### Parliamentary and Presidential Elections According to the Parliamentary Elections Act, each [Group Representation Constituency (GRC)](/wiki/Group_Representation_Constituency) must include one member of the minority race such as a Malay or Indian. However, a [by-election](/wiki/By-elections_in_Singapore) need not be held to fill a vacancy in any GRC triggered by the death or resignation of an MP, even if there are no other minority candidates in that GRC, or for any other reason. From 2017 onwards, the [presidential elections](/wiki/Presidential_elections_in_Singapore) will be reserved for a racial group if that racial group has not represented for five terms. If there are no eligible candidates from that group, the election would be opened to candidates of all races, and the “reserved election” would be deferred to the next Presidential election. The [first reserved Presidential Election was held in 2017](/wiki/2017_Singaporean_presidential_election). Under the constitutional changes, a person is considered to be part of a racial group if they self-identify as that race, and if they are also considered to be part of that race by a committee. The government stated that using these criteria, rather than something prescriptive written into legislation, meant that the racial restriction could evolve with the social conception of race without needing another constitutional amendment. The Community Committees are the same as those who evaluate minority representatives during GRC candidate selection. For 2017, a panel of 16 individuals evaluated presidential candidates. ### Public housing The Ethnic Integration Policy (EIP) implemented by the [Housing and Development Board (HDB)](/wiki/Housing_and_Development_Board), prevents the formation of ethnic enclaves by setting a quota to ensure that the racial composition of each Housing and Development Board (HDB) block reflects the national ethnic make-up of Singapore. This is aimed to promote daily interactions among diverse communities and foster social harmony. The policy was first introduced in 1989, and aims to foster social harmony and mutual understanding by ensuring that no single racial group dominates any particular area, which can help to prevent racial segregation and prevent the formation of ethnic enclaves. ### CPF contribution to community funds By default, all employees are required to contribute to self-help groups’ funds, namely: [Chinese Development Assistance Council (CDAC)](/wiki/Chinese_Development_Assistance_Council) Fund, Mosque Building and Mendaki Fund (MBMF), [Singapore Indian Development Association (SINDA)](/wiki/Singapore_Indian_Development_Association) Fund and Eurasian Community Fund (ECF). Contribution to the self-help group depends on the race and/or religion of the employee which is indicated on the [National Registration Identity Card (NRIC)](/wiki/National_Registration_Identity_Card). Contributions are deducted from an employee's wages as well as their share of their [Central Provident Fund (CPF)](/wiki/Central_Provident_Fund) contribution. However, employees have the option of opting-out from contributing to their respective self-help groups. ### National service Malays were virtually excluded from [conscription](/wiki/National_service_in_Singapore) from the beginning of the draft in 1967 until 1977 and, after the policy was eased, were assigned mainly to serve in the [police](/wiki/Singapore_Police_Force) and [civil defence](/wiki/Singapore_Civil_Defence_Force) (fire brigade), not active combat roles. In *The Roar of the Lion City* (2007), military analyst Sean Walsh claimed that \"official discrimination against the Malay population remains an open secret\". The Ministry of Defence contests the charge, noting that there are \"Malay pilots, commandos and air defence personnel\", and stating that \"the proportion of eligible Malays selected for specialist and officer training is similar to the proportion for eligible non-Malays.\" ### Racial Harmony Day Racial Harmony Day is celebrated on 21 July, on the anniversary of [the 1964 Race Riots](/wiki/1964_race_riots_in_Singapore). First launched in 1997 by the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) in schools, the event has since expanded in reach. Today, grassroots organisations such as the [People's Association](/wiki/People%27s_Association_(Singapore)) and the [Community Development Councils](/wiki/Community_Development_Council) also celebrate Racial Harmony Day. ### Addressing racism in Singapore Education in Singapore has been used for the purpose of creating nationhood and building citizenship (Hill and Lian, 2013, p67-68, 78–80). One of the key objectives of citizenship education is its promotion of social cohesion and racial harmony (Tan & Tan, 2014). This has been achieved through the introduction of specialised curriculum, such as [civics](/wiki/Civics) in 1967, Education for Living in 1974 and [social studies](/wiki/Social_studies) in 2001 and the appropriation of [mother tongue languages](/wiki/First_language) for citizenship education. Learning of mother tongue languages was tied to the learning of certain values, which would insulate the society from [westernisation](/wiki/Westernization) (Gopinathan, 1974, p63), while one of the key aims for social studies is “to develop citizens who have empathy towards others and who will participate responsibly and sensibly in a multi-ethnic, multicultural and multi-religious society” (Sim, 2001, p75). Underlying these broad objectives is the need for future citizens to be acculturated to the Singaporean identity so as to be [race-blind](/wiki/Color_blindness_(racial_classification)) or blinded to racial categories in order to perpetuate racial harmony in Singapore. However, there have been instances of racism in Singapore's education system which could possibly perpetuate existing racial prejudices. Khoo & Lim (2004, p201-208) highlights instances of [racial stereotyping](/wiki/Ethnic_stereotype) among trainee teachers who had gone through the education system of Singapore. Chinese trainee teachers cited negative views of other races, seeing the Malays as lazy and Indians as being noisy and boisterous, while viewing the Chinese as hardworking and ambitious. As future educators who are tasked with the teaching of values such as racial harmony and equality, social cohesion, and unity, it is questionable whether educators are sufficiently equipped or trained to be sensitive to issues of race in the classroom. Mansouri & Jenkins (2010, p96) pointed out that teachers who adopt racially, and culturally insensitive teaching practices can perpetuate certain racial bias as norms. As a result, the effectiveness of the education system in ‘creating’ race-blind citizens is undermined and being colour or race-blind can also inadvertently create a society that denies negative racial experience (Challenge, 2017). Chew (2018, p5) also suggests that research should be done to gauge the effect of racism on the educational achievements of Malays and thereafter, examine the purported [egalitarian](/wiki/Egalitarianism) nature of Singapore's education system. Another instance of how schools can perpetuate racism lies in the structural features of the education system which encourage [self-segregation](/wiki/Auto-segregation), which can predominantly be observed in Special Assistance Plan (SAP) schools. They effectively segregated the Chinese students from the students of the other races, curtailing inter-mingling among different racial groups, despite constant reassurance from the state of the relevancy of the programme (*The Straits Times*, 2019). These students could spend up to ten years, cocooned away in a Chinese environment, bereft of interactions with people of other races excepting their teachers. Such racial isolation can heighten racial bias and tensions, which can culminate in racist bullying in schools. A female Malay student studying in a Chinese SAP school experienced multiple episodes of racism over a few years (Mothership, 2020). The incident is vastly different from normal bullying cases observed in schools. It highlights prevalent racist practices within the student community in which students had been socialised into and reinforces existing racial and ethnic relations [among the Chinese students] (Velayutham, 2017, p461). These episodes of everyday racism highlight the reproduction of structured systems of power, in which the Malay is seen to be inferior to the Chinese (Velayutham, 2017, p464), and these power dynamics are realised at the ground level, in schools by racist Chinese students. The inopportune appearance of a student of a different race within an all-Chinese community might have also provided an avenue or outlet for the unleashing of these inherently held racist ideologies (See McClelland & Auster (1990) for a parallel example of racial discrimination by the whites against the blacks in a predominantly white college). In the Mothership (2020) article, the female student's elder sister exchange of tweets with a Member of Parliament, Tan Chuan Jin expressed possibly a long-held unhappiness and frustration against a perceived \"Chinese\" [authoritarian](/wiki/Authoritarianism) state and the greater Chinese community. Such a line of thought is not new; see Mutalib (2011) for a discussion on the Malay dilemma in Singapore. Possible reasons for the unhappiness could stem from a multitude of reasons – such as [workplace discrimination](/wiki/Employment_discrimination) and insufficient state involvement in race issues (IPS, 2019, p58-63). Barr (2006, p16) highlighted the lack of intermingling with members of other races in a study of 263 English-speaking women, despite them going through the education system. This example serves to remind us that it is highly possible for students to racially segregate themselves in schools and in outside settings, despite the best efforts of educators and well-thought out policies to mix them. Mansouri & Jenkins (2010) states that the choice of language usage among students in schools allow them to exercise exclusion, in both formal and informal settings. This is problematic as “relations of power, dominance and exploitation [in a racial setting] is reproduced and legitimised” (Mansouri & Jenkins, 2010, p96). This might send the wrong signal to students that racial bias is normal. The adoption of racist curriculum represents a major fallacy on the part of the state authorities. Barr (2006, p18-24) highlighted the advent of pedagogy with racial stereotyping from the 1980s within the education system. An example would be the raced exemplification of the characteristics of people belonging to the four main races, Chinese, Malay, Indian and Others (Eurasians) in stories or images in English textbooks. The Chinese are often depicted in a positive light, while the Malays and Indians are often depicted negatively. The racialisation of young children in schools in the 1980s elevated community levels of racial consciousness, contradicting the state's narrative of racial harmony, equality, and cohesion. In the 2000s, there were considerable attempts by MOE to reduce racial stereotyping in the design of English textbooks, but it is important to note that while these English texts are presented more objectively, young students still perceive the world through the lenses of race. This is partly attributed to the practices associated with the state in differentiating people by their physical characteristics and ethnic markers, and the unconscious, subconscious and conscious acculturation to racial stereotyping in their interactions with racially biased people in their lives (Challenge (2017) & Shelby (2003, p156-180). In a study done by Blanton & Jaccard (2008), it was revealed that while it is probable that people may lack explicit understanding and influence over the causes and impacts of their racial prejudice, there is insufficient evidence to show that people possess innate, unconscious racist attitudes. Racist bias from students could possibly arise from the way they process the cues around them to react in certain socially accepted behaviours, regardless of it being racist or not. It is thus important to note that biases and prejudices along racial lines will continue to exist in society. Hence, policies and measures fashioned by state and non-state actors will play a critical role in managing racism in Singapore. There is a real need to shift away from the current use of laws to police and suppress racial conflicts. Onepeople.sg was launched by the state in 2007 as an organisation that champions racial harmony initiatives in Singapore. Through their programmes, they provide people with a safe environment and space to air different views and seek understanding through sincere conversations centred on empathy (Today, 2020). Such outreach efforts seek to break the [taboo](/wiki/Taboo) of discussing racial issues in the public and private sphere, and to also acknowledge the existence of ethnic issues. In schools, teachers can get students to work in ethnically mixed groups, encourage cross-groups friendships and tackle racism by countering it with positive statements. When given more opportunities to mingle, there is increased understanding, leading to reduced prejudices. The Meranti Project in the National Institute of Education also promotes collaboration among teachers in dealing with diversity in the classroom, which helps to reduce racial bias among teachers. This in turn helps them to reduce racial bias in their students (Challenge, 2017). In general it appears that while Singaporean believe in an egalitarian and a meritocratic society, there remains a general reluctance to discuss racial issues. Though there are some individuals who are more than willing to discuss their views in private. In 2020 the Straits Times argued that it is possible to have constructive discussions about race in Singapore. ## Debate The Singapore state's treatment of race has also faced criticism from some academics. Scholar S. Velayutham argues that the state's constant focus on the “spectre of racial violence has literally erased the notion of racism from public and official discourses”. Velayutham also argues and that “the need to maintain racial harmony, social cohesion and tolerance is repeatedly voiced to render racist practices as non-occurrences”. Other scholars such as N. Purushotam take issue with the orientalist underpinnings of the CMIO classification, and argue that continued adherence to the model merely avoids reconceptualisation of the term “race”. The “Others” category has also been criticised, with scholar Elaine Ho contending that the grouping of ethnic groups into the category “glosses over their social heterogeneity and different needs”. In 2025 debate, Law and Home Affairs Minister [K. Shanmugam](/wiki/K._Shanmugam) argued that eliminating the CMIO administrative framework \"will result in the Government not being able to identify and address the differences between racial groups\", pointing out that since France removed the collection of race-based data in 1978, the racial tensions remain and France has seen a surge in race-related offences in recent years. He added that the Government’s view is that the lack of race-based data prevents measuring and understanding the difficulties that different races face in different areas, and prevents effective intervention to resolve those issues. Nevertheless, CMIO framework retains majority mainstream support among Singaporeans. A 2016 joint survey by [Channel NewsAsia](/wiki/Channel_NewsAsia) and the [Institute of Policy Studies](/wiki/Institute_of_Policy_Studies_(Singapore)) showed that a majority of respondents believed that the CMIO classification helps build trust between the races (69%), fosters greater interaction between races (69%) and safeguards minority rights (71%). In a 2017 interview with local newspaper TODAY, the survey's lead researcher Mathew Mathews said that “[t]he answer is not dismantling the framework, the answer is to ensure that all the communities continue to be embracing (of others).” ## Academic research A literature review in 2018 found 13 studies that investigated racism in Singapore. Given the limitations of the studies, the review made four recommendations for future research: (a) develop a reliable and valid instrument to assess racism, (b) conduct experimental research to examine racism perpetuated by the majority or institutions, (c) examine the negative effects of racism, and (d) develop and evaluate interventions for racism. Following the recommendations, racism was examined in an experimental study. In a simulated hiring decision task, Singaporean Chinese participants rated a Malay job applicant as less competent, less suitable for the job, and recommended them a lower salary ($2890.94 vs $2992.73) than an equally qualified Chinese applicant. The study provided the first and only experimental evidence of racism in Singapore. - [Malayisation](/wiki/Malayisation) - [Demographics of Singapore](/wiki/Demographics_of_Singapore) ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T11:46:37.657238",
  "title": "Race in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Race_in_Singapore"
}