{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:46:41.992586"
  },
  "content": "Neighbourhood in Bukit Merah, SingaporePlace **Radin Mas** is a neighbourhood within [Telok Blangah](/wiki/Telok_Blangah) Estate, located in [Bukit Merah](/wiki/Bukit_Merah), Singapore. ## Etymology The area was named after *Radin Mas Ayu* ([Jawi](/wiki/Jawi_alphabet): رادين مس ايو; [Javanese](/wiki/Javanese_language): ꦫꦢꦶꦤ꧀ꦩꦱ꧀ꦲꦪꦸ), a princess of the [Javanese](/wiki/Javanese_people) Royal Court. Her name literally translates to *Princess of Golden Beauty*. ## History **Kampong Radin Mas** was a small [Malay](/wiki/Malays_in_Singapore) village situated on the foothills of [Mount Faber](/wiki/Mount_Faber) in [Telok Blangah](/wiki/Telok_Blangah). According to legend, Puteri Radin Mas Ayu was a young and very beautiful princess. After her mother died in a fire which was planned by some enemies who intended to kill both mother and daughter, she fled from Java for Singapore together with her father, the crown prince, to avoid persecution at the hands of her uncle, the sultan. The area that was named after her was where her home was located when she first landed in Singapore. She was buried near her first home at [Telok Blangah](/wiki/Telok_Blangah). The tomb and a shrine, locally known as *Makam Puteri Radin Mas*, still stands today at Mount Faber Road, near the junction with Telok Blangah Road. There was an old village mosque nearby that also bore her name. It was, however, removed in 2001 to extend the road going up to Mount Faber. Radin Mas came to be of prominence during 2007's [National Day Rally](/wiki/National_Day_Rally) when Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) called it as the model of Singapore by 2020 when the proportion of Singaporeans above 65 years of age is expected to be 1 in 6. ## Present Today, while no street bears the name, the area is frequently referred to as *Radin Mas*. A road flyover and a few buildings are also named after her, such as Radin Mas Primary School and Radin Mas Community Club. [Radin Mas SMC](/wiki/Radin_Mas_Single_Member_Constituency) is also named in her honour, as a ward from 1976 to 1988 and since 2011. There is also a Tahfiz school named Sekolah Ugama Radin Mas named after her at Masjid Darul Amaan in Eunos. The school has been in operation since 1956. - Reference from National Library of Singapore Infopedia Website - Radin Mas Primary School - GoogleMaps StreetView of Makam Puteri Radin Mas Ayu 1°16′09″N 103°49′38″E﻿ / ﻿1.2693°N 103.82727°E﻿ / 1.2693; 103.82727 This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:46:41.992341",
  "title": "Radin Mas, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Radin_Mas,_Singapore"
}