{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:46:43.927416"
  },
  "content": "Singaporean activist and former politician **Raeesah Begum binte Farid Khan** (born 10 November 1993) is a Singaporean social activist and former politician. A former member of the opposition [Workers' Party](/wiki/Workers%27_Party_(Singapore)) (WP), she was the [Member of Parliament](/wiki/Parliament_of_Singapore#Members_of_Parliament) (MP) for the [Compassvale](/wiki/Compassvale) division of [Sengkang Group Representation Constituency](/wiki/Sengkang_Group_Representation_Constituency) (GRC) between 2020 and 2021. Raeesah resigned from the WP on 30 November 2021 after she admitted to repeatedly lying in [Parliament](/wiki/Parliament_of_Singapore) on multiple occasions. ## Early life Raeesah is the daughter of ethnic [Malay](/wiki/Singaporean_Malay) parents of mixed-race ancestry. Her father, Farid Khan bin Kaim Khan, is a marine service businessman of mixed [Indian](/wiki/Indian_Singaporeans)-[Pakistani](/wiki/Pakistani_diaspora) descent and a candidate in the [2017 presidential election](/wiki/2017_Singaporean_presidential_election). His wife, Naeemah Shaik bte Abu Bakar, is of [Arab](/wiki/Arab_Singaporeans) descent. She has a younger brother, Yusuf Khan. Raeesah studied economics and marketing at [Murdoch University](/wiki/Murdoch_University). ## Career In 2016, Raeesah founded the Reyna Movement, an organisation aiming to empower marginalised women and children through up-skilling programs and community engagement. It has worked with women's shelters, the homeless, at-risk children and low-income families in Singapore. ### Political career Raeesah became a member of the WP in 2018, having previously volunteered in the party's [grassroots](/wiki/Grassroots) activities. On 30 June 2020, she, [Jamus Lim](/wiki/Jamus_Lim), [He Ting Ru](/wiki/He_Ting_Ru), and [Louis Chua](/wiki/Louis_Chua) were announced as the party's candidates for [Sengkang GRC](/wiki/Sengkang_GRC) in the [2020 general election](/wiki/2020_Singaporean_general_election). She was also the youngest WP candidate in the general election. Before Polling Day, two separate police reports were lodged against Raeesah for allegedly making two online comments, both regarding racial and religious discrimination. The WP later supported Raeesah; she also apologised and released a statement stating that her intention was \"never to cause social divisions but to raise awareness on minority issues\", adding that she regretted her \"insensitive\" comments. Netizens claimed that the resurfacing of her past comments was a political move, with hashtags such as \"#IStandWithRaeesah\" trending on Twitter. At the election, the WP team won 52.12% of the vote, defeating the governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP) in an [upset victory](/wiki/Upset_(competition)) that secured a second [GRC](/wiki/Group_representation_constituency) for the WP. On 17 September of the same year, the [Singapore Police Force](/wiki/Singapore_Police_Force) (SPF) issued her with a warning over her reported posts. #### Allegations against the police On 3 August 2021, Raeesah made an allegation against the SPF during a parliamentary debate on empowering women. She alleged that, in 2018, a police officer made inappropriate comments about a 25-year-old rape victim whom she had accompanied to make a police report, and gave recommendations to increase sensitivity in investigations. [Desmond Tan](/wiki/Desmond_Tan_(politician)), Minister of State for Home Affairs, subsequently called the allegations \"serious\" and \"[needing] investigation\". When asked for details, Raeesah declined, saying that she did not wish to retraumatise the victim, affirming that the anecdote was not an isolated case. She also agreed to file a parliamentary question if it was about questions related to the issue, adding that the speech was not to cast aspersions on the police and clarifying later that the police can be the solution. She also said she was unsuccessful in contacting the victim after the incident happened, adding that she would communicate directly with the [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) in the future if a similar situation occurred. On 4 October, [K. Shanmugam](/wiki/K._Shanmugam), Minister for [Law](/wiki/Ministry_of_Law_(Singapore)) and Home Affairs, said the police had checked their records and found no cases that fit Raeesah's description; he asked her to provide more details about the alleged mishandling of the case. In response, Raeesah reaffirmed her statement but, citing concerns about confidentiality, declined to reveal any further details, including the police station they went to. On 20 October, the police said that an extensive search had not managed to identify the case in question, adding that Raeesah had also not responded to their requests to provide more details about the case. On 1 November, Raeesah admitted that she had lied on three occasions about the alleged incident in Parliament. She had not accompanied the victim to make a police report, and had heard about the incident from a support group for women who had been victims of sexual assault. She also did not have the victim's consent to share the incident in Parliament. In explaining why she had lied, Raeesah claimed that she had been sexually assaulted at 18 while studying abroad. In response, Leader of the House [Indranee Rajah](/wiki/Indranee_Rajah) expressed sympathy towards Raeesah but raised an official complaint against her for breaching parliamentary privilege and asked for the matter to be referred to the Committee of Privileges. As Indranee and Shanmugam recused themselves from the committee on a one-time basis, [Edwin Tong](/wiki/Edwin_Tong), [Minister for Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth), and [Rahayu Mahzam](/wiki/Rahayu_Mahzam), Parliamentary Secretary for [Communications and Information](/wiki/Ministry_of_Digital_Development_and_Information) and [Health](/wiki/Ministry_of_Health_(Singapore)), were nominated to the committee by Speaker [Tan Chuan-Jin](/wiki/Tan_Chuan-Jin). Later on, Senior Minister of State for Defence and Manpower [Zaqy Mohamad](/wiki/Zaqy_Mohamad) was appointed to replace Minister for Social and Family Development [Masagos Zulkifli](/wiki/Masagos_Zulkifli), who recused himself too. The following day, the WP approved the formation of a separate disciplinary panel to investigate Raeesah's conduct, chaired by [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)), [Sylvia Lim](/wiki/Sylvia_Lim) and [Faisal Manap](/wiki/Faisal_Manap). #### Resignation On 30 November 2021, Raeesah submitted her resignation from the WP and Parliament following the probe over her admission of lying. Raeesah would also post her letter of resignation addressed to the Speaker of Parliament [Tan Chuan-Jin](/wiki/Tan_Chuan-Jin) on her social media accounts. Despite the resignation, the Committee of Privileges announced that it would continue its investigations. Two days later, the Central Executive Committee (CEC) of the WP claimed that, despite having known about the lies the week after her speech, after knowing her circumstances, they allowed her to clarify herself, with Singh, the secretary-general of the party, asking her to make her best efforts in contacting the victim or the individuals involved in that sexual assault case. The matter was supposed to have been clarified in Parliament in September, but a [shingles](/wiki/Shingles) episode made that unlikely. When Raeesah returned to Parliament in October, she repeated her assertions instead of clarifying. The leadership of the WP voted overwhelmingly to ask Raeesah to resign before she did so, otherwise threatening her with expulsion from the party. Instead, before the CEC met on the matter, Raeesah informed Singh that she would resign. The remaining MPs for Sengkang GRC would not step down for a by-election; the Compassvale division was physically divided among them for representation in Parliament. [Faisal Manap](/wiki/Faisal_Manap), vice-chair of the WP and incumbent MP for [Aljunied GRC](/wiki/Aljunied_GRC), was also made an advisor to the Sengkang MPs. Additional support was announced for the Sengkang team during house visits, which were to resume in January. The party also stated that it would \"review how candidates [were] selected for elections as well as vetting of speeches\", while \"[not being] deterred from fielding young and progressive candidates in future elections\". Before the speech was made, Raeesah was told to substantiate the anecdote, an instruction she did not follow. Separately, after [Daniel Goh](/wiki/Daniel_Goh), a former WP [non-constituency MP](/wiki/Non-constituency_MP) (NCMP), told the party leadership in comments to \"take responsibility\", the party said that it would investigate the comments, given that cadres were not to share opinions openly. Goh replied that he had every right as a citizen to comment. He was subsequently expelled from the party in 2023 due to his comments. #### Investigations by the Committee of Privileges After investigations, on 10 February 2022, the Committee of Privileges recommended that Raeesah be fined [S$](/wiki/Singapore_dollar)35,000, with [Singh](/wiki/Pritam_Singh) and Faisal being referred to the Public Prosecutor for prosecution. A parliamentary debate was held on 15 February, with the recommendations accepted. On 29 April, the case was referred to the Police to allow them to interview further witnesses related to the case. ## Personal life Raeesah first met Mahadhir Caffoor in 2017. They married on 14 July 2018. Together, they have a son and daughter. - Raeesah Khan on [Parliament of Singapore](/wiki/Parliament_of_Singapore) - Workers' Party biography Archived 12 July 2020 at the [Wayback Machine](/wiki/Wayback_Machine) [Parliament of Singapore](/wiki/Parliament_of_Singapore)**New constituency** **Member of Parliament for [Sengkang GRC](/wiki/Sengkang_Group_Representation_Constituency)** 2020–2021 Served alongside: **[He Ting Ru](/wiki/He_Ting_Ru), [Jamus Lim](/wiki/Jamus_Lim), [Louis Chua](/wiki/Louis_Chua)**Succeeded by[He Ting Ru](/wiki/He_Ting_Ru) [Jamus Lim](/wiki/Jamus_Lim) [Abdul Muhaimin](/wiki/Abdul_Muhaimin) [Louis Chua](/wiki/Louis_Chua)Portals: - Biography - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:46:43.927024",
  "title": "Raeesah Khan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Raeesah_Khan"
}