{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:46:51.842223"
  },
  "content": "Private healthcare provider in Asia**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **may rely excessively on sources too closely associated with the subject**, potentially preventing the article from being verifiable and neutral. Please help improve it by replacing them with more appropriate citations to reliable, independent sources. *(October 2011)* *(Learn how and when to remove this message)* **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(December 2017)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Raffles Medical Group** (RMG, [Chinese](/wiki/Simplified_Chinese_characters): 莱佛士医疗集团; [pinyin](/wiki/Pinyin): *Lái fú shì yīliáo jítuán*) is a private healthcare provider in Asia, operating medical facilities in thirteen cities in Singapore, China, Japan, Vietnam and Cambodia. ## History In 1976, the group's founders, Dr Loo Choon Yong and Dr Alfred Loh, opened their first two clinics in Singapore's Central Business District with the aim of providing medical services to corporate clients. By 1989, this had grown to five clinics and it was then that the two friends decided to incorporate their clinics into a medical practice group. Expanding after its incorporation, RMG moved into Singapore's HDB heartlands with their first neighbourhood clinic in 1993. The first of these areas included Telok Blangah, Bishan, Ang Mo Kio, Siglap, Tampines, Pasir Ris and Bedok. In 1990, RMG tendered and obtained a contract with the Civil Aviation Authority of Singapore to provide medical services to the passengers transiting through Changi International Airport as well as airport workers. This also marked RMG's first 24-hour clinic. Patients of Raffles Medical Clinics that required specialist care were initially referred to the public hospitals or private specialists. In 1991, RMG appointed specialists in its medical staff. The Group consolidated its specialist service in 1993 with the opening of Raffles SurgiCentre at No. 182 Clemenceau Avenue – the first free-standing day surgery centre at Southeast Asia. It had four operating theatres, 28 recovery beds and two beds in intensive care unit. By 1996, the network of clinics had grown to 30 branches covering most parts of Singapore. When Raffles SurgiCentre saw a lack of space for further expansion, Dr Loo began looking for a site to build a hospital. They eventually settled on Blanco Court, a commercial building at the intersection of North Bridge Road and Ophir Road. Construction works to convert it into a hospital began in 1999. This culminated in the opening of the 380-bed [Raffles Hospital](/wiki/Raffles_Hospital) on 31 March 2001. It consists of 24 different specialist centres which provides specialist services such as obstetrics and gynaecology, cardiology, oncology and orthopaedics. Today, the Group is present in Singapore, China, Vietnam, Cambodia and Japan. The Group runs a network of 106 multi-disciplinary clinics across Singapore and medical centres in Hong Kong, Shanghai and Osaka. Raffles Medical Group also has representative offices in Indonesia, Vietnam, Cambodia, Brunei and Bangladesh, as well as associates throughout the Asia-Pacific region. Airport clinics in Singapore's [Changi International Airport](/wiki/Changi_International_Airport) and Hong Kong's [Chek Lap Kok International Airport](/wiki/Chek_Lap_Kok_International_Airport) are also managed by them. In 2019, the Group opened a 22-storey Raffles Specialist Centre that is next to its existing hospital. In 2024 the hospital said it was looking to expand outside of Singapore, as a combination of high treatment costs, a rising Singapore dollar, and inflation was causing a reduction in foreign patients. ## Medical and clinical support services RMG has a network of clinics with family physicians, specialists and dental surgeons and owns [Raffles Hospital](/wiki/Raffles_Hospital), a tertiary care hospital in Singapore, which accommodates surgical centres, medical laboratories and 24 specialist centres in various areas like Obstetrics & Gynaecology, Cardiology, Oncology and Orthopaedics. RMG also has a consumer healthcare division which develops and distributes [nutraceuticals](/wiki/Nutraceutical), supplements, vitamins and medical diagnostic equipment. RMG also operates three medical centres in Hong Kong and medical centres in Shanghai and Osaka. ## Notable clinical cases Raffles Hospital undertook the surgical separation of a pair of adult craniopagus twins, Laleh Bijani and Ladan Bijani of Iran. The surgery was led by Dr Pierre Lasjaunias, a French neuro-radiologist. Separation was achieved. However, both twins died due to significant blood loss in the blood vessel repairing process. Raffles hospital separated another set of conjoined twins Ji Hye and Sa Rang. They underwent a successful surgery on 22 July 2003. On 16 August, both twins were discharged almost a month after their operation. American Ryan Boarman was bitten by a shark on his right elbow on 25 April 2016. After spending some time in Balinese hospitals, he was transferred to Singapore's Raffles Hospital on 29 April 2016, where he went under the knife of orthopaedic surgeon Dr Lim Yeow Wai. The American had suffered a 360-degree laceration around the elbow, with the shark biting, pulling off and shearing away at least eight muscles and tendons and injuring one nerve and one ligament. Raffles' first birth was on 19 July 2001 at 7:20pm, delivered by Consultant Obstetrician and Gynaecologist, Dr Joan Thong Pao-Wen. The healthy baby girl weighed 3250g at birth. Raffles Hospital's first triplets were delivered a few days before Christmas in 2004. ## Corporate affairs RMG started as a two-clinic practice in 1976 under its founders. In 2009, their revenue grew 8.9% to S$218 million, while profit after tax increased by 20% to S$38 million. The Group's profits continue to grow through the financial year of 2010, reaching S$311 million in 2012. For the first half of 2025 ended 30 Jun, RMG posted a net profit of S$32.1 million for its first half ended Jun 30, up 4.8 per cent from S$30.6 million in the same period a year prior. ### Group Practice Model RMG's medical practice is based on the Group Practice Model, in which its full-time doctors are governed by policies and fee schedules set by the hospital. Recently the Singapore Ministry of Health issued benchmarks for fees, which Raffles claims it will follow. ### Charitable causes RMG's humanitarian arm, Asian Medical Foundation (AMF), is a non-profit organisation was started in 2003 to offer medical expertise in areas with poor access to health care services. AMF sent its first relief mission to Aceh on 26 December to assist in the 2004 Asian tsunami crisis. AMF also sent medical aid to the earthquake victims in Nias, Indonesia and Pakistan in 2005. In 2020, AMF and then-Emeritus Senior Minister (ESM) Goh Chok Tong launched a S$5 million fund to help needy and vulnerable Singaporean seniors whose lives and livelihoods have been affected by Covid-19. - Official Website - Raffles Health\n",
  "language": "en",
  "processed_at": "2026-01-12T11:46:51.841787",
  "title": "Raffles Medical Group",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Raffles_Medical_Group"
}