{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:46:50.652804"
  },
  "content": "* *Raffles House** is a single-storey building built on the [Fort Canning Hill](/wiki/Fort_Canning_Hill), [Singapore](/wiki/Singapore). The original building was a wood and *[atap](/wiki/Nypa_fruticans)* structure built in 1822 that was used as a place of residence by Sir [Stamford Raffles](/wiki/Stamford_Raffles). This building was later rebuilt as a neoclassical-styled **Government House** as the residence of subsequent colonial governors, but it was demolished in 1858 to make way for the construction Fort Canning. The present structure built on the same site is a brick and tile building constructed in 2003. ## History ### Residency House **Residency House**, the original residence of Sir [Stamford Raffles](/wiki/Stamford_Raffles) and his sister's family, was a wooden house with venetians and thatched attap roof, the house was the earliest Singapore's project of [George Drumgoole Coleman](/wiki/George_Drumgoole_Coleman). Coleman, who waited for Raffles to return from [Bencoolen](/wiki/British_Bencoolen), [Sumatra](/wiki/Sumatra) for four months, in the meantime designed the House in speculation for Raffles' residence use. Raffles, upon his return from [Bencoolen](/wiki/British_Bencoolen), [Sumatra](/wiki/Sumatra) in October 1822, impressed with Coleman's design, approved the house. Construction of the house was soon begun on [Singapore Hill](/wiki/Singapore_Hill) in November 1822 and completed by January 1823. Raffles and his wife Sophie would move to the house by early January 1823. On 21 January 1823, Raffles wrote to [William Marsden](/wiki/William_Marsden_(orientalist)) about the house and its scenery. > “We have lately built a small bungalow on Singapore Hill where though the height is inconsiderable, we find great difference in climate. Nothing can be more interesting and beautiful than the view from this spot. I am happy to say the change has had a very beneficial effect on my health, which has been better during the last fortnight than I have known it for two years before. The tombs of the Malay Kings are close at hand, and I have settled that if it is my fate to die here I shall take my place amongst them; this will at any rate be better than leaving my bones at Bencoolen. If it pleases God, we still live in the hope of embarking for Europe towards the end of the year.‟ > > \"I am laying out a botanic and experimental garden, and it would delight you to see how rapidly the whole country is coming under cultivation. My residence here has naturally given much confidence, and the extent of the speculations entered into by the Chinese quite astonished me.\" — [Stamford Raffles](/wiki/Stamford_Raffles), Extensive Speculations of the Chinese, *Memoir of the Life and Public Services of Sir Thomas Stamford Raffles* Singapore, January 21, 1823 On 23 January 1823, Raffles wrote to the [Duchess of Somerset](/wiki/Georgiana_Seymour,_Duchess_of_Somerset) about the house and the hill. > \" Since I last wrote to your Grace, about a month ago, I have had another very severe attack in my head, which nearly proved fatal, and the Doctors were for hurrying me on board ship for Europe without much ceremony. However, as I could not reconcile myself to become food for fishes, I preferred ascending the hill of Singapore, where, if my bones must remain in the East, they would have the honour of mixing with the ashes of the Malayan kings; and the result has been, that instead of dying, I have almost entirely recovered. I have built a very comfortable house, which is sufficient to accommodate my sister's family as well as our own; and I only wish you were here but for half-an-hour, to enjoy the unequalled beauty and interest of the scene. My house, which is one hundred feet front, and fifty deep, was finished in a fortnight from its commencement. When will your cottage be done?\" — [Stamford Raffles](/wiki/Stamford_Raffles), To the Duchess of Somerset., *Memoir of the Life and Public Services of Sir Thomas Stamford Raffles* Singapore, January 23, 1823 ### Government House On 2 February 1824, Raffles and his family would left Singapore for [England](/wiki/England). Raffles' house was bought over by the [British Government](/wiki/British_Government) and renamed as Government House and the hill would known as the **Government Hill**. At the own expense of 2nd [Resident](/wiki/Resident_of_Singapore) [John Crawfurd](/wiki/John_Crawfurd), the house was further extended and redesigned in June by Coleman again with bricks and tiles in the [neoclassical](/wiki/Neoclassical_architecture) style for the residence of [Residents](/wiki/Resident_of_Singapore) and [Governors of Singapore](/wiki/Governors_of_Singapore). The Government House had a clear view of the settlement around [Singapore River](/wiki/Singapore_River) and was featured in many paintings of the area. In 1858, the Government House was eventually demolished and the site handed to the British military for the construction of a [fort](/wiki/Fort) in 1859 known as the [Fort Canning](/wiki/Fort_Canning) which was completed in 1861. Upon its demolition, the Governor's residence was temporarily moved to a villa in Oxley Estate called the **[Pavilion](/wiki/Pavilion,_Singapore)**. ## Rebuilding A modernized version of the house, named Raffles House, was constructed in brick and tile near the site of the former Government House. Completed in 2003, it serves as a venue for events and wedding functions. - [Fort Canning Lighthouse](/wiki/Fort_Canning_Lighthouse) - [Fort Canning Park](/wiki/Fort_Canning_Park) - [Fort Canning Reservoir](/wiki/Fort_Canning_Reservoir) - [The Battle Box](/wiki/The_Battle_Box)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:46:50.652504",
  "title": "Raffles House",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Raffles_House"
}