{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:46:53.805236"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Rainbow Centre\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2023)* *(Learn how and when to remove this message)* The **Rainbow Centre** is a [social service organisation](/wiki/Charitable_organization) in [Singapore](/wiki/Singapore). It operates three special education schools Margaret Drive School (RCMDS), Yishun Park School (RCYPS) and a third one at Woodlands, for infants, children and youths with special needs like [autism](/wiki/Autism), [intellectual disability](/wiki/Intellectual_disability), developmental delay, and multiple disabilities. The Rainbow Centre Margaret Drive School is located at Margaret Drive near [Queenstown MRT station](/wiki/Queenstown_MRT_station), while the Rainbow Centre Yishun Park School is located at Yishun Street 61 near [Khatib MRT station](/wiki/Khatib_MRT_station). Both schools currently run special education programmes and early intervention programmes. ## History Margaret Drive Special School started out in 1987 to cater to children with multiple handicaps. In 1989, the school introduced the programme called Structured Teaching for Exceptional Pupils (STEP) for autistic children aged between two and twelve years. In 1992, the Rainbow Centre was established, with [Ee Peng Liang](/wiki/Ee_Peng_Liang) as the first Honorary Patron. In 1995, Rainbow Centre set up the Balestier Special School at NcNair Road as its second school, which was officially opened by [Wee Kim Wee](/wiki/Wee_Kim_Wee) on 1 October 1996. The Margaret Drive School later moved to a new purpose-built building with special facilities to cater to the needs of children with different learning difficulties. The building was officially opened by [Aline Wong](/wiki/Aline_Wong) on 19 July 1999. A programme called *Rainbow Link* was launched in 2002 to promote volunteerism, through support, services and education. Rainbow Centre and [Autism Resource Centre](/wiki/Autism_Resource_Centre) jointly started the [Pathlight School](/wiki/Pathlight_School) in January 2004. This is an autism specific mainstream school for children with autism aged between six and sixteen years old. In 2006, in an attempt to prevent their students from being labelled, Margaret Drive Special School was renamed Rainbow Centre Margaret Drive School (RCMDS) and Balestier Special School was renamed Rainbow Centre Yishun Park School (RCYPS). In 2018, Rainbow Centre Yishun Park School (RCYPS) opened at 11 Marsiling Lane, Singapore 739148 in [Woodlands](/wiki/Woodlands,_Singapore). It is an interim site which took over the space previously occupied by [Si Ling Secondary School](/wiki/Si_Ling_Secondary_School). It will subsequently move to its purpose-built campus at Admiralty Link from 2022. - Rainbow Centre, Singapore. This [Singaporean corporation or company](/wiki/List_of_companies_of_Singapore) article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:46:53.804872",
  "title": "Rainbow Centre",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Rainbow_Centre"
}