{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:46:56.397784"
  },
  "content": "Malay title of monarch ruler **Raja bendahara** ([Jawi](/wiki/Jawi_alphabet): راج بندهار‎) was a Malay title for the [monarch](/wiki/Monarch) of the [Pahang Kingdom](/wiki/Pahang_Kingdom) that existed from 1770 to 1881. The title is a combination of the Sanskrit word [raja](/wiki/Raja) ('king') and [bendahara](/wiki/Bendahara) ('grand vizier'). The successive bendaharas of the [Johor Empire](/wiki/Johor_Empire) ruled Pahang as a [fief](/wiki/Fief) from the late 17th century. By the end of 18th century, the Bendahara emerged as an absolute ruler over the fief, carrying the title 'Raja', following the decentralisation of [Sultan](/wiki/Sultan_of_Johor)'s power and the dismemberment of the empire. ## Origin In classical Malay kingdoms, a bendahara was the most important and highest administrative position in royal court, serving as the chief of all ministers. As a royal adviser, a bendahara was appointed by the raja, who alone could sack him. The position was hereditary and candidates were selected from the male descendants of the [Bendahara family](/wiki/Bendahara_dynasty). The transition of the bendahara into royalty began in the late 17th century, when the last ruler of Johor from the Malacca dynasty, [Mahmud Shah II](/wiki/Mahmud_Shah_II_of_Johor) died without a male heir. Tun Abdul Jalil, the Bendahara of Johor, became the next [Sultan of Johor](/wiki/Sultan_of_Johor), assuming the title [Abdul Jalil Shah IV](/wiki/Abdul_Jalil_Shah_IV_of_Johor). During his reign, the eastern state of Pahang was established as a special province of the Bendahara family and ruled directly by the successive bendaharas of the empire. Self-rule was established during the reign of [Tun Abdul Majid](/wiki/Tun_Abdul_Majid_of_Pahang) when the state's status was changed from a *tanah pegangan* (a fief) to *tanah kurnia* ('granted land'), thus the ruling bendahara acquired the title raja ('king') in Pahang, also known as *raja bendahara'.* ## List of Raja Bendahara of Pahang NameJawi NameReignal titleReign[Tun Abdul Majid II](/wiki/Tun_Abdul_Majid_of_Pahang)تون عبد المجيدSri Paduka Dato' Bendahara Paduka Raja1770–1802[Tun Muhammad II](/wiki/Tun_Muhammad_of_Pahang)تون محمدSri Paduka Dato' Bendahara Sri Maharaja1802–1803[Tun Koris I](/wiki/Tun_Koris_of_Pahang)تون قرظSri Paduka Dato’ Bendahara Paduka Raja1803–1806[Tun Ali](/wiki/Tun_Ali_of_Pahang)تون عليSri Paduka Dato’ Bendahara Sewa Raja1806–1847[Tun Muhammad Tahir II](/wiki/Tun_Mutahir_of_Pahang)تون محمد طاهرSri Paduka Dato’ Bendahara Sri Maharaja1847–1863[Tun Ahmad](/wiki/Sultan_Ahmad_al-Muadzam_Shah)تون أحمدSri Paduka Dato’ Bendahara Sewa Raja1863–1881 ## Bibliography - Ahmad Sarji Abdul Hamid (2011), *The Encyclopedia of Malaysia*, vol. 16 - The Rulers of Malaysia, Editions Didier Millet, [ISBN](/wiki/ISBN_(identifier)) 978-981-3018-54-9 - Linehan, William (1973), *History of Pahang*, Malaysian Branch Of The Royal Asiatic Society, Kuala Lumpur, [ISBN](/wiki/ISBN_(identifier)) 978-0710-101-37-2 - (Tun) Suzana (Tun) Othman (2002), *Institusi Bendahara: Permata Melayu yang Hilang: Dinasti Bendahara Johor-Pahang (The Bendahara Institution: The Lost Malay Jewel: The Dynasty of Bendahara of Johor-Pahang)*, Pustaka BSM Enterprise, [ISBN](/wiki/ISBN_(identifier)) 983-40566-6-4\n",
  "language": "en",
  "processed_at": "2026-01-12T11:46:56.397499",
  "title": "Raja bendahara",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Raja_bendahara"
}