{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:46:59.841798"
  },
  "content": "Traditional folk song \"**Rasa Sayang**\" (pronounced [ˈrasa 'sajaŋ], literally \"loving feeling\") or \"**Rasa Sayange**\" (pronounced [ˈrasa 'sajaŋɛ]) in Indonesia is a folk song from the [Malay Archipelago](/wiki/Malay_Archipelago), popular in [Brunei](/wiki/Brunei), [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia) and [Singapore](/wiki/Singapore). Being a [pantun](/wiki/Pantun), \"Rasa Sayang\" has an alternating [rhyming scheme](/wiki/Rhyme_scheme) of ABAB with equal [syllabic](/wiki/Syllable) lengths to maintain rhythm, with the sole exception being the opening verse, which has a different syllabic length with the other verses. Divided into two, the first and second line are often unrelated from the third and fourth, the first and second line is used to establish a rhyming pattern while the third and fourth line is the desired message to be given to the listener. ## In Brunei, Malaysia, and Singapore \"Rasa Sayang\" (also known as \"Rasa Sayang Hey\") is a [Malay](/wiki/Malay_language) folk song. The basis of \"Rasa Sayang\" is similar to [Dondang Sayang](/wiki/Dondang_Sayang) and Malay folk songs, which take their form from the *[pantun](/wiki/Pantun)*, a traditional [ethnic Malay](/wiki/Ethnic_Malay) poetic form. *Problems playing this file? See media help.*Malay lyricsEnglish translationPoetic English Translation *Rasa sayang, hey!* *Rasa sayang sayang, hey!* *Hey, lihat nona jauh,* *Rasa sayang sayang, hey!* *Buah cempedak di luar pagar,* *Ambil galah tolong jolokkan;* *Kami budak baru belajar,* *Kalau salah tolong tunjukkan.* *Pulau pandan jauh ke tengah,* *Gunung Daik bercabang tiga;* *Hancur badan di kandung tanah,* *Budi yang baik dikenang juga.* *Dua tiga kucing berlari,* *Mana sama si kucing belang;* *Dua tiga boleh ku cari,* *Mana sama adik seorang.* *Pisang emas dibawa berlayar,* *Masak sebiji di atas peti;* *Hutang emas boleh dibayar,* *Hutang budi dibawa mati.* I've got that loving feeling, hey! I've got that loving feeling, hey! See that girl in the distance, I've got that loving feeling, hey! The [cempedak](/wiki/Cempedak) fruit is outside the fence, Take a pole and poke it down; I'm just a child trying to learn, So if I'm wrong, then please tell me. Pandan Island far in midst, With the three peaked Mount [Daik](/wiki/Daik); While the body decomposes in earth, Good deeds remain to be remembered. Two or three cats are running around, With the striped one which can vie; Two or three I can find, Which girl can compare with you. [Pisang emas](/wiki/Cavendish_banana) brought on a sailing trip, One ripens on a box; If gold is owed, it can be repaid, But if it is gratitude, it is carried to the grave. I've got that loving feeling, hey! I've got that loving feeling, hey! See that girl in the distance, I've got that loving feeling, hey! Where cempedak tree grows without the fence, Go prod them gently with a stake; A youthful learner I, so hence, Be please to point out each mistake. The Pandan Island is far from land, Have three peaks does the Daik Mountain; Though the self has rot in the sand, The good deeds are never forgotten. Two or three cats are running around, The cat with stripes is the one superior; Two or three (gals) can be easily found, But not the same as having you, my dear. With golden plantains sail away, Whilst on a chest lies one that's ripe; The debts of gold we can repay, But debts of kindness last through life. ## In Indonesia *Problems playing this file? See media help.* \"Rasa Sayange\" is an [Ambonese Malay](/wiki/Ambonese_Malay) folk song, a [Malay creole](/wiki/Malay_trade_and_creole_languages) originating from [Maluku](/wiki/Maluku_Islands), specifically [Ambon](/wiki/Ambon,_Maluku). Ambonese Malay lyricsEnglish translation *Rasa sayange* *Rasa sayang, sayange* *E, lihat dari jauh,* *Rasa sayang, sayange* *Mana kancil akan dikejar* *Kedalam pasar cobalah cari* *Masih kecil rajin belajar* *Sudah besar senanglah diri* *Kalau ada sumur di ladang* *Boleh kita menumpang mandi* *Kalau ada umurku panjang* *Boleh kita berjumpa lagi* Oh, I've got that loving feeling I've got that endearing, loving feeling Hey, looking from afar I've got that endearing, loving feeling If there's a [mouse-deer](/wiki/Chevrotain), we'll chase it We'll try and go search in the [market](/wiki/Wet_market) When you study early from a young age You'll be happy when you grow older If there's a well in the field We can stop by to wash ourselves If I live long to an old age We can meet each other again Another more modern variant with an additional [Indonesian](/wiki/Indonesian_language) verse goes as follows: Original lyricsEnglish translation *Rasa sayange* *Rasa sayang, sayange* *E, lihat dari jauh,* *Rasa sayang, sayange* *Jalan-jalan ke Surabaya* *Jangan lupa membeli pita* *Jangan suka memandang saya* *Nanti bisa sakit mata* *Kalau ada sumur di ladang* *Boleh kita menumpang mandi* *Kalau ada umurku panjang* *Boleh kita berjumpa lagi* Oh, I've got that loving feeling I've got that endearing, loving feeling Hey, looking from afar I've got that endearing, loving feeling Take a vacation to Surabaya And don't forget to buy ribbons Stop looking at me like that You're going to hurt your eyes If there's a well in the field We can stop by to wash ourselves If I live long to an old age We can meet each other again ## 2007 Malaysian tourism response Controversy over the song's provenance came to a head in 2007 when the Malaysian Tourism Board released the Rasa Sayang Commercial, an advertisement used as part of [Malaysia](/wiki/Malaysia)'s \"Truly Asia\" tourism campaign. Some Indonesians have accused Malaysia of heritage theft. Indonesian news sites reported that it is a song of the [Maluku Islands](/wiki/Maluku_Islands), that it has appeared in early Indonesian films and recordings. Around a thousand Indonesians demonstrated outside the Malaysian embassy in Jakarta in November 2007 to protest the use of \"Rasa Sayang\" and other cultural items such as [Reog Ponorogo](/wiki/Reog_Ponorogo) in such adverts. In order to prevent what they considered cultural appropriation, the Indonesian government started making an inventory of such songs as cultural properties of the country. Malaysia in turn argued that the song is widely sung throughout the [Malay Archipelago](/wiki/Malay_Archipelago), and that it belongs to the people of the archipelago, Malaysians and Indonesians alike. In cases where people have been migrating, trading and intermingling for centuries in a region, it may be difficult to make claim of cultural property. Malaysian Tourism Minister [Adnan Mansor](/wiki/Tengku_Adnan) stated, \"It is a folk song from the [Nusantara](/wiki/Nusantara_(archipelago)) (Malay Archipelago) and we are part of the Nusantara.\". The Malaysian Minister of Culture, Arts and Heritage, [Rais Yatim](/wiki/Rais_Yatim), recognize that \"Rasa Sayange\" is a shared property, between Indonesia and Malaysia. ## Early recordings and uses In 1938, a British documentary film titled \"FIVE FACES\" features \"Rasa Sayang\" as one of the background songs. In a report from the Singaporean newspaper *[The Straits Times](/wiki/The_Straits_Times)* on May 10, 1958, an unnamed singer in [British Malaya](/wiki/British_Malaya) confessed to having sung the \"Rasa Sayang\" in front of a public audience for the first time over 20 years ago. This suggests that the song was already known and performed publicly as early as the 1930s. In 1939, \"Rasa Sayang\" was among the songs played on [Penang](/wiki/Penang) radio. In 1943, \"Rasa Sayang\" appeared in the Japanese film *[Marai no Tora](/wiki/Marai_no_Tora)*, which depicted the exploits of a Japanese secret agent [Tani Yutaka](/wiki/Tani_Yutaka) in [Malaya](/wiki/British_Malaya) during the [World War II](/wiki/World_War_II). In 1950 and 1954, \"Rasa Sayange\" was used in the soundtracks of Indonesian films [Darah dan Doa](/wiki/Darah_dan_Doa) and [Lewat Djam Malam](/wiki/Lewat_Djam_Malam) directed by [Usmar Ismail](/wiki/Usmar_Ismail). In a report from *[The Straits Times](/wiki/The_Straits_Times)* on August 20, 1958, *The World Assembly of Youth (WAY)* conference held in [New Delhi](/wiki/New_Delhi) has officially adopted the beloved Malayan folk song “Rasa Sayang” as its theme tune. In 1959, a [comedy film](/wiki/Comedy_film) in Malay language titled *Rasa Sayang Eh* was produced by [Cathay Keris](/wiki/Cathay_Organisation) in Singapore. On April 1, 1959, \"Rasa Sayang\" was performed by Malay students from Malaya in [Sydney](/wiki/Sydney) during an exhibition held to raise funds for the [United Nations International Children’s Emergency Fund (UNICEF)](/wiki/UNICEF), which was officiated by the wife of the Malayan High Commissioner, Datin Gunn Lay Teik. In 1960, [George de Fretes](/wiki/George_de_Fretes) released an album titled *Indonesian Classics No.1*, it features a variety of Indonesian folk songs including \"Rasa Sayange\"*.* In 1960, the Hindi version of the song was used in the movie [Singapore](/wiki/Singapore_(1960_film)), sung by [Lata Mangeshkar](/wiki/Lata_Mangeshkar) and [Mohammed Rafi](/wiki/Mohammed_Rafi). In 1962, the [Lokananta](/wiki/Lokananta) Solo record company distributed [LP records](/wiki/LP_record) as souvenirs to the participants of the [4th Asian Games in 1962](/wiki/1962_Asian_Games) held in [Jakarta](/wiki/Jakarta), the LP included several Indonesian folk songs including \"Rasa Sayange\". In 1989, Singaporean singer-songwriter [Dick Lee](/wiki/Dick_Lee) produced a rendition of the song while including patriotic descriptions of [Singaporean](/wiki/Singapore) culture. - Music portal - Malaysia portal - Indonesia portal - Singapore portal - [Dondang Sayang](/wiki/Dondang_Sayang) - [List of Indonesian folk songs](/wiki/List_of_Indonesian_folk_songs) - [Music of Indonesia](/wiki/Music_of_Indonesia) - [Music of Malaysia](/wiki/Music_of_Malaysia) - [Music of Singapore](/wiki/Music_of_Singapore) - [Pantun](/wiki/Pantun) ## Bibliography - [Biran, Misbach Yusa](/wiki/Misbach_Yusa_Biran) (2009a). *[Sejarah Film 1900–1950: Bikin Film di Jawa](/wiki/Sejarah_Film_1900%E2%80%931950)* [*History of Film 1900–1950: Making Films in Java*] (in Indonesian). Jakarta: Komunitas Bamboo working with the Jakarta Art Council. [ISBN](/wiki/ISBN_(identifier)) 978-979-3731-58-2. - Malaysian Tourism advertisement with a modified version of Rasa Sayang in the background - *Insulinde zooals het leeft en werkt*, with Rasa Sayange in the background - Rasa Sayang Hey in the Japanese film *Marai no Tora* (1943)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:46:59.841394",
  "title": "Rasa Sayang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Rasa_Sayang"
}