{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:47:08.603263"
  },
  "content": "Singaporean writerThis biography of a living person **needs additional citations for verification**. Please help by adding reliable sources. Contentious material about living persons that is unsourced or poorly sourced **must be removed immediately** from the article and its talk page, especially if potentially libelous. *Find sources:* \"Rebecca Chua\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2020)* *(Learn how and when to remove this message)* **Rebecca Chua** (born 1953) is an author in [Singapore](/wiki/Singapore) writing in English. She received an honours degree in English from the [University of Singapore](/wiki/National_University_of_Singapore) in 1976. Chua then became a journalist for *[Her World](/wiki/Her_World)* magazine. In 1979, she was awarded a Rotary Fellowship in Journalism to pursue a Master's in Mass Communications in the United States. Five of her short stories were included in the 1976 anthology *The Sun In Her Eyes: Stories by Singapore Women*. In 1977, two of her stories \"The Morning After\" and \"The Washerwoman’s Daughter\" were broadcast over the [BBC World Service](/wiki/BBC_World_Service). Various short stories and some of her poems were included in the Southeast Asian Artistic collection under the auspices of ASEAN (Association of Southeast Asian Nations) anthology *Singapore Writing*. Her work has also appeared in *The Asia Magazine*, *The Commonwealth Magazine*, *Female*, *Her World* and *[The Straits Times](/wiki/The_Straits_Times)*. Her first collection of short stories *The Newspaper Editor and Other Stories* was published in 1981; it received a commendation at the National Book Development Council of Singapore's 1982 book awards. In 2001, her play *Between The Lines* was performed at the New Ideas Festival in [Toronto](/wiki/Toronto). Five other plays have been workshopped in Toronto, and one in Singapore. This article about a Singaporean writer is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:47:08.602846",
  "title": "Rebecca Chua",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Rebecca_Chua"
}