{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:47:18.016029"
  },
  "content": "Gift envelope containing cash A **red envelope**, **red packet**, **lai see** ([Chinese](/wiki/Chinese_language): 利是; [Cantonese Yale](/wiki/Yale_romanization_of_Cantonese): *laih sih*), **hongbao** or **ang pau** ([traditional Chinese](/wiki/Traditional_Chinese_characters): 紅包; [simplified Chinese](/wiki/Simplified_Chinese_characters): 红包; [pinyin](/wiki/Pinyin): *hóngbāo*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *âng-pau*) is a gift of money given during holidays or for special occasions such as weddings, graduations, and birthdays. It originated [in China](/wiki/Chinese_culture) before spreading across parts of Southeast Asia and other countries with sizable [ethnic Chinese populations](/wiki/Overseas_Chinese). In the mid-2010s, a digital equivalent to the practice emerged within [messaging apps](/wiki/Messaging_app) with [mobile wallet](/wiki/Mobile_wallet) systems localized for the [Chinese New Year](/wiki/Chinese_New_Year), particularly [WeChat](/wiki/WeChat). ## Usage Red envelopes containing cash, known as *hongbao* in [Mandarin](/wiki/Mandarin_language) and *laisee* in [Cantonese](/wiki/Cantonese), are gifts presented at social and family gatherings such as [weddings](/wiki/Chinese_marriage) or holidays such as [Chinese New Year](/wiki/Chinese_New_Year); they are also gifted to guests as a gesture of hospitality. The [red color](/wiki/Color_in_Chinese_culture) of the [envelope](/wiki/Envelope) symbolizes [good luck](/wiki/Good_luck) and wards off [evil spirits](/wiki/Demon). In Chinese, the red packet is also called \"money warding off old age\" (壓歲錢; *yāsuì qián*) for [Chinese New Year](/wiki/Chinese_New_Year). The act of requesting red packets is normally called **tao hongbao** ([Chinese](/wiki/Traditional_Chinese_characters): 討紅包; [pinyin](/wiki/Pinyin): *tǎo hóngbāo*) or **yao lishi** (Chinese: 要利是; pinyin: *yào lìshì*), and, in the south of China, **dou lishi** (Chinese: 逗利是; pinyin: *dòu lìshì*; Cantonese Yale: *dauh laih sih*). Red envelopes are usually given out to the younger generation who are normally in school or unmarried. The amount of money contained in the envelope usually ends with an even digit, following [Chinese beliefs](/wiki/Numbers_in_Chinese_culture); odd-numbered money gifts are traditionally associated with funerals.An exception exists for the number nine, as the pronunciation of *nine* (Chinese: 九; pinyin: *jiǔ*) is [homophonous](/wiki/Homophonous) to the word *long* (久; *jiǔ*), and is the largest single digit. In some regions of China and among the [Chinese diaspora](/wiki/Overseas_Chinese), odd numbers are favored for weddings because they are difficult to divide. One widespread tradition is that money should not be given in fours, or the number four should not appear in the amount, such as in 40, 400, and 444, as the pronunciation of the word *four* (四; *sì*) is similar to the word *death* (死; *sǐ*). When giving money, new bills are favored over old bills. It is common to see long bank queues before Chinese New Year holding people waiting to acquire new bills. At wedding banquets, the amount offered is usually intended to cover the cost of the attendees as well as signify goodwill to the newlyweds. The amounts given are often recorded in ceremonial ledgers for the new couple to keep. In southern China, red envelopes are typically given by the married to the unmarried during Chinese New Year, mostly to children. In northern and southern China, red envelopes are typically given by the elders to those under 25 (30 in most of the three northeastern provinces), regardless of marital status.[*citation needed*] The money is usually in the form of notes to make it difficult to judge the amount before opening. In Malaysia it is common to add a coin to the notes, particularly in *hongbao* given to children, signifying even more luck. It is traditional to avoid opening the envelopes in front of the relatives out of courtesy. However, to receive an envelope, the youth [kowtow](/wiki/Kowtow) to thank their elders. In Hong Kong, red envelopes are traditionally opened on or after [the 7th day of the Lunar New Year](/wiki/Renri). During Chinese New Year supervisors or business owners give envelopes to employees. In [Suzhou](/wiki/Suzhou,_Jiangsu), children keep the red envelope in their bedroom after receiving it. They believe that putting the red envelope under their bed can protect the children. This action relates to the Chinese \"壓 *yā*\". Those **yasui qian** would not be used until the end of Chinese New Year. They also receive fruit or cake during the celebration. It is traditional to give an actor a red packet when he or she is to play a dead character, or pose for a picture for an obituary or a grave stone. Red packets are also used to deliver payment for favorable service to [lion dance](/wiki/Lion_dance) performers, religious practitioners, teachers, and doctors. Red packets as a form of bribery in China's film industry, were revealed in 2014's [Sony hack](/wiki/Sony_Pictures_Entertainment_hack). In the Chinese communities of [Singapore](/wiki/Singapore), [Malaysia](/wiki/Malaysia), [Hong Kong](/wiki/Hong_Kong) and [Macao](/wiki/Macao), it is also customary for red packets to be given to service staff, such as security guards, cleaners, domestic helpers and doormen during the first few days of the [Lunar New Year](/wiki/Lunar_New_Year). ### Virtual red envelopes Chinese [instant messaging](/wiki/Instant_messaging) and [social networking](/wiki/Social_networking_service) platforms have offered a virtual version of red envelopes, also referred to as *e-hongbao*,** via their [mobile payment](/wiki/Mobile_payment) features, allowing users to similarly distribute gifts of money to contacts and groups. The practice was popularized by [WeChat](/wiki/WeChat), which first introduced its red envelope feature via [WeChat Pay](/wiki/WeChat_Pay) during the Chinese New Year holiday in 2014. The launch included an on-air promotion during the [CCTV New Year's Gala](/wiki/CMG_New_Year%27s_Gala)—China's most-watched television special—where viewers could win red envelopes as prizes. WeChat Pay adoption increased following the launch, and over 32 billion virtual envelopes were sent over the Chinese New Year holiday in 2016—a tenfold increase over 2015. The feature's popularity spawned imitations from other vendors; a \"red envelope war\" emerged between WeChat owner [Tencent](/wiki/Tencent) and its historic rival, [Alibaba Group](/wiki/Alibaba_Group), who added a similar function to its payment service, and outbid Tencent to hold a similar promotion during the CCTV Gala in 2016. Analysts estimated that over 100 billion digital red envelopes would be sent over the New Year holiday in 2017. In 2019, WeChat added the ability for the virtual packets to be customized with covers created by brands, which can also link to and integrate with their respective WeChat presences (such as [Mini Programs](/wiki/WeChat#WeChat_Mini_Program)). This feature would be utilized as a form of seasonal marketing and [viral](/wiki/Viral_marketing) engagement. One study reported that this popularization of virtual red packets comes from their contagious feature, as users who receive red packets feel obligated to follow. In January 2022, the American mobile payments service [Venmo](/wiki/Venmo) introduced a similar feature called \"gift-wrapping\", which similarly allows sent money to be concealed and decorated with a themed animation (which, at launch, included several Chinese New Year-themed animations). Venmo parent company [PayPal](/wiki/PayPal) cited increases in use of the red envelope [emoji](/wiki/Emoji) (🧧) by users around the Chinese New Year. ## History The history of the red packet dates to the [Han dynasty](/wiki/Han_dynasty). People created a type of coin to ward off evil spirits, *\"yasheng qian\"* (Chinese: 压胜钱; pinyin: *yāshèng qián*), which was inscribed with auspicious words, such as \"May you live a long and successful life\". It was believed to protect people from sickness and death. In the [Tang dynasty](/wiki/Tang_dynasty), the Chinese New Year was seen as the beginning of spring, and in addition to congratulations, elders gave money to children to ward off evil spirits. After the [Song](/wiki/Song_dynasty) and [Yuan](/wiki/Yuan_dynasty) dynasties, the custom of giving money in the Spring Festival evolved into the custom of giving children lucky money. The elderly would thread coins with a red string. The [Ming](/wiki/Ming_dynasty) and [Qing](/wiki/Qing_dynasty) dynasties featured two kinds of lucky money. One was made of red string and coins, sometimes placed at the foot of the bed in the shape of a dragon. The other was a colorful pouch filled with coins. In Qing dynasty, the name \"*yāsuì qián*\" (压岁钱) emerged. The book *Qīng Jiā Lù* (清嘉录) recorded that \"elders give children coins threaded together by a red string, the money is called *yasui qian*.\" From the [Republic of China (1912–1949)](/wiki/Republic_of_China_(1912%E2%80%931949)) era, it evolved into 100 coins wrapped in red paper, meaning \"May you live a hundred years!\". Due to the lack of holes in modern-day coins, red envelopes became more prevalent. Later, people adopted banknotes instead of coins. After the founding of [the People's Republic of China](/wiki/China) in 1949, the custom of the elders giving the younger generation money continued. ## Other customs Other similar traditions also exist in other countries in Asia. ### Ethnic Chinese In [Thailand](/wiki/Thailand), [Myanmar](/wiki/Myanmar) (Burma), and [Cambodia](/wiki/Cambodia), the Chinese diaspora and immigrants introduced the practice of red envelopes. ### Cambodia In Cambodia, red envelopes are called *ang pav* or *tae ea* (\"give *ang pav*\"). *Ang pav* are delivered with best wishes to younger generations. *Ang pav* is an important gift as a symbol of good luck from the elders. *Ang pav* can be presented on the day of Chinese New Year or *Saen Chen*, when relatives gather. The gift is kept as a worship item in or under the pillowcase, or somewhere else, especially near the bed of young while they are sleeping. *Ang pav* can be either money or a cheque, and more or less according to the donors. *Ang pav* are not given to someone in family who has a career, while such a person has to gift their parents and/or their younger children or siblings. At weddings, the amount offered is scaled to cover the cost of the attendees as well as help the newlyweds. ### Vietnam Red envelopes are a traditional part of Vietnamese culture. They are considered to be lucky money and are typically given to children during [Vietnamese New Year](/wiki/Vietnamese_New_Year). They are generally given by elders and adults, where a greeting or offering health and longevity is exchanged. Common greetings include *\"*Sống lâu trăm tuổi*\"* (𤯩𥹰𤾓歲), *\"*An khang thịnh vượng*\"* (安康興旺), *\"*Vạn sự như ý*\"* (萬事如意) and *\"*Sức khỏe dồi dào*\"* (飭劸洡𤁠), wishing health and prosperity. The typical name for lucky money is *lì xì* (利市) or, less commonly, **mừng tuổi** (𢜠歲). ### South Korea In [South Korea](/wiki/South_Korea), a monetary gift is given to children by their relatives during the New Year period. Bags known as *bokjumeoni* (복주머니) are used instead of red envelopes. ### Japan Monetary gifts called *[otoshidama](/wiki/Otoshidama)* (お年玉) are given to children during the [New Year period](/wiki/Japanese_New_Year). White or decorated envelopes (お年玉袋, *otoshidama-bukuro*) are used instead of red, with the name of the receiver usually written on the front. A similar practice, *[shūgi-bukuro](/wiki/Sh%C5%ABgi-bukuro)* (祝儀袋), is observed for Japanese weddings, but the envelope is folded rather than sealed, and decorated with an elaborate bow, called *[mizuhiki](/wiki/Mizuhiki)* (水引). ### Philippines In the [Philippines](/wiki/Philippines), [Chinese Filipinos](/wiki/Chinese_Filipino) (known locally as \"Filipino-Chinese\") exchange red envelopes (termed *ang pao*) during the [Lunar New Year](/wiki/Lunar_New_Year) or \"Chinese New Year\". Red envelopes have gained acceptance in the broader Philippine society. Filipinos with no Chinese heritage appropriated the custom for occasions such as birthdays and in giving monetary *[aguinaldo](/wiki/Aguinaldo)* during [Christmas](/wiki/Christmas_in_the_Philippines) and [New Year](/wiki/New_Year). Due to the phonetics of most Philippine languages, red envelopes are nowadays more well known as *ampaw*. ### Green envelope [Malay](/wiki/Malays_(ethnic_group)) Muslims in [Malaysia](/wiki/Malaysia), [Brunei](/wiki/Brunei), [Indonesia](/wiki/Indonesia), and [Singapore](/wiki/Singapore) adopted the Chinese custom as part of their [Eid al-Fitr](/wiki/Eid_al-Fitr) ([Malay](/wiki/Malay_language): *[Hari Raya Aidilfitri](/wiki/Hari_Raya_Aidilfitri)*) celebrations, but instead of red packets other colored envelopes are used, most commonly green. Customarily a family gives a generally small amount of money in a green envelope, and may send it to friends and family unable to visit. [Green](/wiki/Green#In_religion) is used for its traditional association with [Islam](/wiki/Islam). The adaptation of the red envelope is based on the Muslim custom of *[sadaqah](/wiki/Sadaqah)*, or voluntary charity. While present in the [Qur'an](/wiki/Qur%27an), *sadaqah* is less formally established than the sometimes similar practice of *[zakat](/wiki/Zakat)*, and in many cultures this takes a form closer to gift-giving and generosity among friends than charity. I.e. no attempt is made to give more to guests \"in need\", nor is it a religious obligation. Among the [Sundanese people](/wiki/Sundanese_people), a boy who had been recently circumcised is given monetary gifts known as *panyecep* or *uang sunatan*. ### Purple envelope The tradition of *ang pao* was adopted by local Indian Hindu populations of [Singapore](/wiki/Indian_Singaporeans) and [Malaysia](/wiki/Malaysian_Indian) for [Deepavali](/wiki/Diwali). They are known as *Deepavali ang pow* (in Malaysia), *purple ang pow* or simply *ang pow* (in Singapore). Yellow colored envelopes for Deepavali were give in the past.[*self-published source*] - [Chinese marriage](/wiki/Chinese_marriage) - [Chinese social relations](/wiki/Chinese_social_relations) - [Color in Chinese culture](/wiki/Color_in_Chinese_culture) - [Eidi](/wiki/Eidi_(gift)) - [Gift economy](/wiki/Gift_economy) - [Hell money](/wiki/Hell_money) ## Sources - Chengan Sun, \"Les enveloppes rouges : évolution et permanence des thèmes d'une image populaire chinoise\" [Red envelopes : evolution and permanence of the themes of a Chinese popular image], PhD, Paris, 2011. - Chengan Sun, *Les enveloppes rouges* (Le Moulin de l'Etoile, 2011) [ISBN](/wiki/ISBN_(identifier)) 978-2-915428-37-7. - Helen Wang, \"Cultural Revolution Style Red Packets\", Chinese Money Matters, 15 May 2018. - How to Give Lai See in Hong Kong Archived 22 January 2009 at the [Wayback Machine](/wiki/Wayback_Machine) - Red Packet: Sign of Prosperity - Gallery: Chinese New Year Red Envelopes - Will The Paper Red Packet Be Replaced By An Electronic Red Envelope? - A red envelope with a collection of value-Lai See - Money envelopes in the British Museum Collection Portals: - Society - China\n",
  "language": "en",
  "processed_at": "2026-01-12T11:47:18.015777",
  "title": "Red envelope",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Red_envelope"
}