{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:47:16.891540"
  },
  "content": "Maritime flag of Singapore The **Red Ensign of Singapore** is a [civil ensign](/wiki/Civil_ensign) used by privately owned, non-military ships that are registered in [Singapore](/wiki/Singapore). The overall design of the ensign is a modification of the [national flag](/wiki/Flag_of_Singapore), with the ratio of the width to the length extended to 1:2. The ensign was created by law in 1966. The use of this ensign is regulated by the [Maritime and Port Authority of Singapore](/wiki/Maritime_and_Port_Authority_of_Singapore) (MPA). According to the MPA, the Red Ensign is the only ensign to be used on Singaporean civilian ships, and the national flag is not an acceptable substitute. The ensign must be hoisted on all Singaporean ships on entering or leaving port. ## History In 1966, a year after [Singapore's independence from Malaysia](/wiki/Singapore_in_Malaysia), a document entitled *Singapore Merchant Marine Ensign* and numbered Misc. 5 of 1966, was laid before [Parliament](/wiki/Parliament_of_Singapore) on 6 September 1966 by the [Deputy Prime Minister](/wiki/Prime_Minister_of_Singapore). The document created a civil ensign that was to be used on ships registered in Singapore. The Red Ensign has been in use since then. ## Design According to the Parliamentary paper Misc. 5 of 1966, the background of the ensign is red with the ratio of its width to its length being one by two. In contrast, the ratio of the national flag of Singapore is two by three. In the centre of the ensign is a white ring, which surrounds a [crescent](/wiki/Crescent) and five stars also coloured white. The five stars are arranged such that they form a [pentagon](/wiki/Pentagon) in the middle. The crescent and stars are taken from the national flag, although in the ensign the crescent appears underneath rather than to the left of the stars, similar to the national coat of arms. According to a 1999 circular *National Colours for Singapore Ships* issued by the [Maritime and Port Authority of Singapore](/wiki/Maritime_and_Port_Authority_of_Singapore) (MPA), the red colour of the civil ensign is the same as that of the national flag. The shade of red has been defined by the [Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts) as [Pantone](/wiki/Pantone) 032. ### Construction sheet The MPA's 1999 circular includes a construction sheet with detailed dimensions for the manufacture of the flag. The sheet is in inches and centimetres. The overall dimensions of the flag are 36 inches (91.44 cm) by 72 inches (182.88 cm). The space between the top of the ensign to the top of the ring, and the bottom of the ring to the bottom of the ensign, is 9.7 inches (24.64 cm). The outer [diameter](/wiki/Diameter) of the ring is 16.6 inches (42.16 cm), and the ring itself is 0.95 inches (2.41 cm) in thickness. The outer curve of the crescent has a [radius](/wiki/Radius) of 5.45 inches (13.84 cm). Each star fits within a circle with a diameter of 3.2 inches (8.13 cm), and the centres of the five stars are positioned 72[°](/wiki/Degree_(angle)) from each other along the [circumference](/wiki/Circumference) of an imaginary circle with a radius of 3.25 inches (8.26 cm). The centre of the imaginary circle is 6.4 inches (16.26 cm) from the lowest point of the inner curve of the crescent. ## Regulations Section 36(1) of the Merchant Shipping Act of 1995 empowers the relevant [Minister](/wiki/Minister_(government)) to prescribe an ensign for Singaporean ships, which shall then be the \"proper colours for a Singapore ship.\" Section 36(2) goes on to state that the [master of a ship](/wiki/Captain_(nautical)), the [ship's owner](/wiki/Ship-owner) if he is on board, and any other person hoisting colours may be fined up to [S$](/wiki/Singapore_dollar)1,000 if, instead of the Red Ensign, any other \"distinctive national colours\" are hoisted on board any Singapore ship without the Minister's consent. Under section 37 of the Act, if a Singapore ship fails to hoist the Red Ensign on entering or leaving any port, the ship master may be fined up to $1,000. The MPA's 1999 circular calls the attention of owners, masters and officers of Singapore ships to sections 36 and 37 of the Merchant Shipping Act. In particular, paragraph 3 of the circular points out that \"the Singapore national flag does not [substitute] the Red Ensign\". ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T11:47:16.891120",
  "title": "Red Ensign of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Red_Ensign_of_Singapore"
}