{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:47:10.058814"
  },
  "content": "Building in Singapore, Singapore **Red Cross House** is a building on Penang Lane in Singapore which serves as the headquarters of the [Singapore Red Cross Society](/wiki/Singapore_Red_Cross_Society). ## History In its annual report for 1957, the Singaporean branch of the [British Red Cross](/wiki/British_Red_Cross) announced that it intended to construct a permanent premises for the society for $300,000, of which $95,000 had already been raised. The building was to house its offices and lecture halls. By June 1959, negotiations for a piece of land on which the building was to be built, which was then on the corner of Penang Lane and Canning Rise, were under way. Lady Ena Mary Goode, the wife of Sir [William Goode](/wiki/William_Allmond_Codrington_Goode) and the then president of the Singaporean branch of the Red Cross Society, laid the building's foundation stone on 19 November 1959. Construction, which was estimated to cost $120,000, began in July 1960. It was officially opened by then-[Yang di-Pertuan Negara of Singapore](/wiki/Yang_di-Pertuan_Negara_of_Singapore) [Yusof Ishak](/wiki/Yusof_Ishak) on 5 September 1961. The building was initially two stories, featuring a concrete canopy in the shape of a boomerang hanging over its main entrance. It was designed by prominent architect and artist Ho Kok Hoe, who served as the president of the Singapore Art Society. The building was the Singaporean branch of the society's first permanent location. In January 1982, the organisation formed a committee the feasibility of establishing a permanent blood donation centre within the building. Plans for the centre, which was to be the second of its kind in Singapore, were being finalised by April. It was established in the building's ground floor in the following year. The building was gazetted for conservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) in May 2014. It has been placed on the Orchard Heritage Trail by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)).\n",
  "language": "en",
  "processed_at": "2026-01-12T11:47:10.058444",
  "title": "Red Cross House (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Red_Cross_House_(Singapore)"
}