{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:47:22.781706"
  },
  "content": "Residential skyscraper in Singapore **Reflections at Keppel Bay** in [Singapore](/wiki/Singapore) is a [luxury](/wiki/Luxury_real_estate) waterfront residential complex on approx 84,000 m² of land with 750m of shoreline. It was completed in 2011, offering 1129 units with a 99-year leasehold. The six distinctive curved glass towers afford [panoramic](/wiki/Panorama) views of [Mount Faber](/wiki/Mount_Faber) and [Sentosa](/wiki/Sentosa). The complex was designed by [Daniel Libeskind](/wiki/Daniel_Libeskind), who is known for creating the [World Trade Center Memorial](/wiki/World_Trade_Center_Memorial) masterplan. The local architect was DCA Architects. ## Location Reflections at Keppel Bay is located on Keppel Bay View, off Telok Blangah Road. Neighbouring condominiums are Caribbean at Keppel Bay and Corals at Keppel Bay. The nearest MRT station to the complex is [Telok Blangah MRT station](/wiki/Telok_Blangah_MRT_station), while also within walking distance to the shopping malls [HarbourFront Centre](/wiki/HarbourFront_Centre) and [VivoCity](/wiki/VivoCity). A free shuttle bus for residents to VivoCity which runs at 30-minute intervals, or 15 minutes at peak hours. ## Awards Reflections at Keppel Bay won the FIABCI Prix D’Excellence Awards (Residential High-Rise) in 2013 and The Chicago Athenaeum International Architecture Award in 2012. Locally, it won the BCA Universal Design Mark Platinum Award in 2013 in recognition of the accessibility features of the condominium, which was highly usable by older people, people without disabilities, and people with disabilities. - Reflections at Keppel Bay - Reflections at Keppel Bay on Daniel Liebeskind Official Website - More about Reflections at Keppel Bay ## Gallery This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:47:22.781391",
  "title": "Reflections at Keppel Bay",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Reflections_at_Keppel_Bay"
}