{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:47:23.965633"
  },
  "content": "Singaporean political party The **Reform Party** (**RP**) is a [political party](/wiki/List_of_political_parties_in_Singapore) in [Singapore](/wiki/Singapore). According to its constitution, the party seeks to promote \"political, social and economic reform; restoration of full human rights; a fairer and just distribution of wealth with the elimination of poverty; an independently appointed judiciary; and a fully elected and sovereign parliament\". Its philosophy states that \"That every member of the society is born with fundamental rights which cannot be abrogated... and that it is the paramount duty of the society to promote the human dignity of its every single member.\" Since 2020, the party has embarked on a green manifesto. RP was founded by opposition veteran and lawyer [J. B. Jeyaretnam](/wiki/J._B._Jeyaretnam), former Secretary-General of the [Workers' Party](/wiki/Workers%27_Party_of_Singapore) (WP) and the first opposition candidate in post-independence Singapore, on 3 July 2008. Around three months after the party's foundation, J.B. Jeyaretnam died on 30 September, and the leadership was taken over by his son, [Kenneth Jeyaretnam](/wiki/Kenneth_Jeyaretnam). ## History ### Founding and change in leadership RP was founded by lawyer and veteran politician J.B. Jeyaretnam in 2008. Formerly from WP, J.B. Jeyaretnam (then a [Non-Constituency Member of Parliament](/wiki/Non-Constituency_Member_of_Parliament)) was sued by [Senior Minister](/wiki/Senior_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Goh Chok Tong](/wiki/Goh_Chok_Tong) and Tamil PAP MPs on [defamation](/wiki/Defamation) charges, and had to pay about S$1.5 million to his opponents. In 2001, he was declared bankrupt after incurring a debt of more than S$600,000 (which also barred the right to stand for elections, or represent as member of parliament). He subsequently resigned from WP, citing that the party had failed to support him with the payment. In May 2007, J.B. Jeyaretnam was discharged from bankruptcy and in September, reinstated to the bar. He would go on to register and form RP on 3 July 2008, where he became the pro-tem Secretary-General. On 30 September, around three months after founding RP, J.B. Jeyaretnam died following a heart attack, and over a thousand people attended his funeral. K. Jeyaretnam, who at the time, was residing with his family in the United Kingdom, and had never participated in politics, took over as secretary-general in April 2009. ### First election and by-election On 8 May 2010, the party announced six candidates to contest the [2011 general election](/wiki/2011_Singaporean_general_election), which included K. Jeyaretnam. However, several members who joined the party subsequently resigned to join other parties, including [Jeannette Chong-Aruldoss](/wiki/Jeannette_Chong-Aruldoss), [Tony Tan Lay Thiam](/wiki/Tony_Tan_Lay_Thiam) and wife [Hazel Poa](/wiki/Hazel_Poa), and [Nicole Seah](/wiki/Nicole_Seah). Earlier on, the party was invited by [Chiam See Tong](/wiki/Chiam_See_Tong) to join the [Singapore Democratic Alliance](/wiki/Singapore_Democratic_Alliance) (SDA) with RP setting out 11 conditions to join the SDA. However, the rest of the leadership of SDA voted not to make a decision on the list of conditions, and the discussion was leaked to the press. As a result, K. Jeyaretnam decided against RP joining the SDA. During the [2011 general election](/wiki/2011_Singaporean_general_election), RP fielded two teams to contest [West Coast](/wiki/West_Coast_GRC) and [Ang Mo Kio GRCs](/wiki/Ang_Mo_Kio_GRC), which were led respectively by [Minister of Trade & Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) [Lim Hng Kiang](/wiki/Lim_Hng_Kiang) and [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), both of the [People's Action Party](/wiki/People%27s_Action_Party) (PAP). In his first campaign speech in late April 2011, K. Jeyaretnam said that competition in politics would lead to better and more intelligent policies for Singapore. He also noted that the ruling [People's Action Party](/wiki/People%27s_Action_Party) (PAP) would likely open the floodgates to more foreigners to enter Singapore again once they formed the next government. However, RP's electoral debut was unable to bear fruit, as RP lost both contests to the PAP, with a combined vote share of less than 35%. More members subsequently left the party. A [by-election](/wiki/2013_Singaporean_by-election) in [Punggol East SMC](/wiki/Punggol_East_Single_Member_Constituency) was held on 26 January 2013 after the resignation of [speaker](/wiki/Speaker_of_Parliament_(Singapore)) [Michael Palmer](/wiki/Michael_Palmer_(politician)) on 12 December 2012. K. Jeyaretnam participated in the by-election, but was defeated by WP's [Lee Li Lian](/wiki/Lee_Li_Lian) in a rare four-cornered contest. K. Jeyaretnam forfeited his S$14,500 election deposit as he garnered only 1.2% of the valid votes cast (per electoral rules, the threshold of retaining the deposit is 12.5%, or one-eighth, of the valid votes cast for the constituency). ### Further electoral defeats and leadership changes During the [2015 general election](/wiki/2015_Singaporean_general_election), RP fielded 11 candidates to contest three constituencies, Ang Mo Kio and West Coast GRCs, as well as [Radin Mas SMC](/wiki/Radin_Mas_SMC), a ward that used to be part of J.B. Jeyaretnam's former [Anson constituency](/wiki/Anson_Constituency). The election also marked the debut of activists [Roy Ngerng](/wiki/Roy_Ngerng) and [M Ravi](/wiki/M_Ravi). On 7 September, RP released its manifesto. On 11 September, following the general election, RP found their electoral performance dwindled, compared to the last election, as they garnered only 20.60% of vote share in the three constituencies. This was mostly attributed to the large swing from the opposition to the ruling party, seen in the 2015 general election. In 2018, RP with six political parties ([People's Power Party](/wiki/People%27s_Power_Party_(Singapore)) (PPP), [Singaporeans First](/wiki/Singaporeans_First) (SF), [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) (SDP), [Democratic Progressive Party](/wiki/Democratic_Progressive_Party_(Singapore)) (DPP), [National Solidarity Party](/wiki/National_Solidarity_Party_(Singapore)) (NSP), and [Peoples Voice Party](/wiki/Peoples_Voice_(Singapore)) (PV), held a meeting, that was led by former PAP MP [Tan Cheng Bock](/wiki/Tan_Cheng_Bock), to discuss the formation of a coalition for the next election. During the [2020 general election](/wiki/2020_Singaporean_general_election), RP fielded six candidates in two constituencies, Ang Mo Kio GRC and Radin Mas SMC. Breaking with tradition, the party chose not to contest West Coast GRC, to avoid a three-corner fight with [Progress Singapore Party](/wiki/Progress_Singapore_Party), a new party led by Tan Cheng Bock. Initially intending to contest [Yio Chu Kang SMC](/wiki/Yio_Chu_Kang_Single_Member_Constituency), RP alleged that PSP had failed to abide by an agreement that RP would cede West Coast GRC to PSP while PSP would refrain from contesting Yio Chu Kang SMC. In response, the PSP rebutted that no such agreement existed. During the campaigning period, K. Jeyaretnam did not participate in the campaigning activities nor turn up for televised broadcasts as he was serving a mandatory 14-day [Stay Home Notice](/wiki/Stay-at-home_order) after a visit to the United Kingdom. On 10 July, the party won neither constituencies, with returning vote shares of 28.09% and 25.97% respectively. RP improved their party's vote share by 27.84% from the last election. On 5 August, K. Jeyaretnam removed chairman Andy Zhu and treasurer Noraini Yunus from the CEC, and replaced them with CEC member [Charles Yeo](/wiki/Charles_Yeo) and deputy treasurer Mahaboob Baatsha, respectively. Several members subsequently left the party and followed Zhu and Noraini to form the [Singapore United Party](/wiki/Singapore_United_Party). ### PAR membership and subsequent withdrawal On 15 January 2022, Yeo temporarily relinquished his chairmanship of the party due to his arrest over alleged offences of criminal breach of trust and forgery in the course of his work. In June 2023, the RP, along with DPP, PV and PPP, formed the [People's Alliance for Reform](/wiki/People%27s_Alliance_for_Reform) (PAR). K. Jeyaretnam did not participate in the 2025 general election. Instead, RP had one candidate, Mahaboob Baatsha, who contested [Queenstown SMC](/wiki/Queenstown_SMC). Baatsha received 18.88% of the vote against incumbent PAP MP [Eric Chua](/wiki/Eric_Chua) who received 81.12% of the vote. In July 2025, RP would withdraw from the PAR. ## Objectives RP's objectives, as espoused in its constitution are summarised as follows: - Establish an elected and sovereign government whose [Cabinet](/wiki/Cabinet_of_Singapore) acts under the law and is checked by [Parliament](/wiki/Parliament_of_Singapore) - Appoint an independent [Judiciary](/wiki/Judicial_system_of_Singapore) - Secure political, social and economic rights of citizens - Effect a fair wealth distribution and eliminate poverty ## Organisation RP is unique among the political parties in Singapore, both government and opposition, in that its party structure does not follow a cadre based system of political organisation. The party constitution states that the Party Conference is the supreme governing authority. ## Leadership ### List of secretaries-general NoNameYears1[J. B. Jeyaretnam](/wiki/J._B._Jeyaretnam)2008–20092[Kenneth Jeyaretnam](/wiki/Kenneth_Jeyaretnam)2009–present ### Central Executive Committee TitleNameChairYasmine Valentina *acting*Secretary-General[Kenneth Jeyaretnam](/wiki/Kenneth_Jeyaretnam)TreasurerMahaboob BaatshaMemberJanice Chin Mei LinYasmine ValentinaJahanghir Ibrahim ## Electoral performance ### Parliament ElectionLeaderVotes%SeatsNCMPsPositionResultContestedTotal+/–SeatsWonLost(/wiki/2011_Singaporean_general_election)[Kenneth Jeyaretnam](/wiki/Kenneth_Jeyaretnam)86,2944.28%110110 / 870 / 3 5thNo seats(/wiki/2015_Singaporean_general_election)59,5172.63%110110 / 890 / 3No seats(/wiki/2020_Singaporean_general_election)54,5992.19%6060 / 930 / 2 7thNo seats #### Seats contested ElectionConstituencies contestedContested vote %+/–(/wiki/2011_Singaporean_general_election)[6-member GRC](/wiki/Group_representation_constituency): [Ang Mo Kio](/wiki/Ang_Mo_Kio_Group_Representation_Constituency); 5-member GRC: [West Coast](/wiki/West_Coast_Group_Representation_Constituency);31.8%—N/a(/wiki/2015_Singaporean_general_election)6-member GRC: Ang Mo Kio; 4-member GRC: West Coast; [SMC](/wiki/Constituencies_of_Singapore): [Radin Mas](/wiki/Radin_Mas_Single_Member_Constituency)20.6% 11.2%(/wiki/2020_Singaporean_general_election)5-member GRC: Ang Mo Kio; SMC: Radin Mas27.8% 7.2% ### By-election ElectionLeaderConstituency contestedVotes%SeatsResultContestedTotal+/–WonLost(/wiki/2013_Singaporean_by-election)[Kenneth Jeyaretnam](/wiki/Kenneth_Jeyaretnam)[Punggol East SMC](/wiki/Punggol_East_SMC)13531.2%010 / 1Lost - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:47:23.965149",
  "title": "Reform Party (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Reform_Party_(Singapore)"
}