{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:47:32.781216"
  },
  "content": "Islamic organization for rehabilitation of radicalised individuals The **Religious Rehabilitation Group** ([Abbreviation](/wiki/Abbreviation): RRG; [Malay](/wiki/Malay_language): *Kumpulan Pemulihan Keagamaan*; [Jawi](/wiki/Jawi_alphabet): كومڤولن ڤموليهن كاڬامأن; [Chinese](/wiki/Chinese_language): 宗教改造小组; [Tamil](/wiki/Tamil_language): மத மறுவாழ்வு குழு) is an organization of voluntary [Islamic scholars](/wiki/Ulama) and [teachers](/wiki/Teachers_in_Islam) in Singapore who assist in the religious rehabilitation and counselling of [radicalised](/wiki/Radicalization) and self-radicalised individuals. Formed in 2003, RRG's initial mission was to rehabilitate detained members of the regional terrorist group, [Jemaah Islamiyah](/wiki/Jemaah_Islamiyah) (JI). Soon, RRG's focus was expanded to provide counselling and financial support for families of the detainees to prevent further radicalisation. Over the years, RRG has extended its outreach to the wider community in efforts to dispel misinterpretations of Islamic concepts and prevent them from falling under the influence of [extremist terrorist ideology](/wiki/Religious_terrorism). The work of RRG has received domestic and international praise. Among the aspects of RRG's work that were lauded include the counselling and care of families of detainees, and its implementation of rehabilitation in an academic environment where it is willing to study and adapt. ## History The RRG was co-founded by Ustaz Ali Haji Mohamed and Ustaz Hasbi Hassan in April 2003 following the arrest and detention of Jemaah Islamiyah members in December 2001 and August 2002. In RRG's early beginnings, several Islamic teachers viewed RRG with suspicion, perceiving it to be merely a tool of the Government. Dr Mohamed Fatris Bakaram, [Mufti](/wiki/Mufti) of the [Islamic Religious Council of Singapore](/wiki/Islamic_Religious_Council_of_Singapore) (MUIS), said that this was a psychological challenge that the Muslim community has to face, and that preachers and teachers must stand up and develop self-confidence in order to guide the community. ## Efforts ### Counselling and outreach efforts Since its formation, RRG has performed more than 1,500 counselling sessions, which also extend to the family members of detainees. In collaboration with other agencies, RRG conducts workshops and seminars at schools, [madrasahs](/wiki/Madrasah), and mosques. Since its inception, RRG has written and published a series public education material, which include two counselling manuals and information booklets. On 1 June 2016, RRG launched a mobile app. ### Welfare of family members RRG makes it a priority to maintain the social welfare of family members of detainees. The counselling and care of family members ensure that rehabilitation continues at home even after the release of a detainee. Ustazah Kalthom Md Isa, an RRG counsellor, said: \"We want the family members to be on the same page in terms of religious understanding. They play a key part in rehabilitating the detainees back into life after they are released.\" ### Contemporary challenges A contemporary focus is now turned to young Muslims and education. In light of terror-related propaganda online, the RRG is also turning its attention to [cyberspace](/wiki/Cyberspace). ## Accolades - [Berita Harian](/wiki/Berita_Harian_(Singapore)) Achiever of The Year Award (2014), presented by [Prime Minister Lee Hsien Loong](/wiki/Prime_Minister_of_Singapore) - Singapore portal\n",
  "language": "en",
  "processed_at": "2026-01-12T11:47:32.780939",
  "title": "Religious Rehabilitation Group (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Religious_Rehabilitation_Group_(Singapore)"
}