{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:47:31.071191"
  },
  "content": "Part of a series on the[Culture of Singapore](/wiki/Culture_of_Singapore)[History](/wiki/History_of_Singapore) - [Singaporeans](/wiki/Singaporeans) - [Immigration](/wiki/Immigration_to_Singapore) - [Holidays](/wiki/Public_holidays_in_Singapore) - [Languages](/wiki/Languages_of_Singapore) - [Multiculturalism](/wiki/Demographics_of_Singapore) - [Symbols](/wiki/National_symbols_of_Singapore) - [Women](/wiki/Women_in_Singapore) [Topics](/wiki/Outline_of_Singapore) - [Architecture](/wiki/Architecture_of_Singapore) - [Art](/wiki/Visual_art_of_Singapore) - [Cinema](/wiki/Cinema_of_Singapore) - [Cuisine](/wiki/Singaporean_cuisine) - [Festivals](/wiki/List_of_festivals_in_Singapore) - [Hawker centre](/wiki/Hawker_centre) - [Literature](/wiki/Singaporean_literature) - [Media](/wiki/Media_of_Singapore) - [Music](/wiki/Music_of_Singapore) - [National Service](/wiki/National_service_in_Singapore) - [Politics](/wiki/Politics_of_Singapore) - Religion - [Sports](/wiki/Sports_in_Singapore) - [Singlish](/wiki/Singlish) - [Television](/wiki/Television_in_Singapore) Research - [Bibliography](/wiki/Bibliography_of_Singapore) Symbols - [Anthem](/wiki/Majulah_Singapura) - [Flag](/wiki/Flag_of_Singapore) - [Flower](/wiki/Papilionanthe_Miss_Joaquim) - [Symbol](/wiki/Merlion) - [Oath Of Allegiance](/wiki/Singapore_National_Pledge) - Singapore portal - v - t - e **Religion in Singapore** is characterised by a wide variety of religious beliefs and practices due to its diverse ethnic mix of people originating from various parts of the world. A [secular state](/wiki/Secular_state), [Singapore](/wiki/Singapore) is commonly termed as a \"[melting pot](/wiki/Melting_pot)\" or \"[cultural mosaic](/wiki/Cultural_mosaic)\" of various religious practices originating from different religions and religious denominations around the world. Most major religious denominations are present in the country, with the Singapore-based Inter-Religious Organisation (IRO) recognising 10 major religions. A 2014 analysis by the [Pew Research Center](/wiki/Pew_Research_Center) found Singapore to be the world's most religiously diverse nation. The most followed religion among residents[a] in Singapore is [Buddhism](/wiki/Buddhism), with a plurality of 31.1% of the resident population identifying themselves as adherents at the most recent decennial census in 2020. A large number of [Buddhists in Singapore](/wiki/Buddhism_in_Singapore) are [Chinese](/wiki/Chinese_Singaporean), with 40.4% of the ethnic Chinese population in Singapore identifying as Buddhist. Sizeable numbers of non-Chinese ethnic groups in Singapore also practice Buddhism. [People with no religious affiliation](/wiki/Irreligion_in_Singapore) ([atheist](/wiki/Atheism), [agnostic](/wiki/Agnosticism) or other irreligious life stances) form the second largest group at 20% of the population. [Christianity](/wiki/Christianity_in_Singapore) comes in at 18.9%. [Islam](/wiki/Islam_in_Singapore), at 15.6%, is followed mainly by [Malays](/wiki/Malay_Singaporean), though there are also many [Indians](/wiki/Indian_Singaporean) adhering to it. [Taoism](/wiki/Taoism_in_Singapore) comes in at 8%. [Hinduism](/wiki/Hinduism_in_Singapore), at 5%, is followed mainly by [Indians](/wiki/Indian_Singaporean). ## History and culture The [Armenian Church of Gregory the Illuminator](/wiki/Armenian_Church,_Singapore) is the oldest church in Singapore, having been completed in 1836. It was also the first building in Singapore to have an electricity supply, having had the first electric [fans](/wiki/Fan_(implement)) and lights. Today, the church no longer holds [Armenian](/wiki/Armenian_Apostolic_Church) services, as the last Armenian priest retired in the 1930s. Nonetheless, the church and its grounds have been preserved, with various [Coptic Orthodox Church of Alexandria](/wiki/Coptic_Orthodox_Church_of_Alexandria) and [Oriental Orthodox Church](/wiki/Oriental_Orthodox_Church) services still held in it.[*citation needed*] In the middle of the 20th century, a number of race and religion-related riots occurred in Singapore, including the [Maria Hertogh riots](/wiki/Maria_Hertogh_riots) and the [1964 Race Riots](/wiki/1964_Race_Riots). The Singapore government has since adopted a policy of promoting religious tolerance in Singapore.[*citation needed*] However, some religions or denominations are officially banned by the government, as they are deemed as [cults](/wiki/Cults), such as [Jehovah's Witnesses](/wiki/Jehovah%27s_Witnesses) and the [Unification Church](/wiki/Unification_Church), although their followers practised in secrecy in the 2010s. Some religions, especially those practised by [Chinese ethnic groups](/wiki/List_of_ethnic_groups_in_China), have merged their places of worship with other religions such as Hinduism and Islam, such as the Loyang Tua Pek Kong Temple.[*citation needed*] Additionally, South Bridge Street, a major road through the old [Chinatown](/wiki/Chinatown,_Singapore), houses the [Sri Mariamman Temple](/wiki/Sri_Mariamman_Temple,_Singapore) and the [Masjid Jamae](/wiki/Masjid_Jamae) Mosque, which served Chulia Muslims from India's [Coromandel Coast](/wiki/Coromandel_Coast). Most [Singaporeans](/wiki/Singaporeans) celebrate the major festivals associated with their respective religions.[*citation needed*] The variety of religions is a direct reflection of the diversity of races: The Chinese are mainly Buddhists, Taoists, Christian, Muslim or irreligious. [Malays](/wiki/Malaysian_Malays) are predominantly Muslims (98.8%), while [Indians](/wiki/Malaysian_Indians) are mostly Hindus (57.3%), but with significant numbers of Muslims, Buddhists, Christians and Sikhs from the Indian ethnic groups. Taoist and Confucian doctrines and deities, together with ancestral worship, are combined in various ways in the [Chinese folk religions](/wiki/Chinese_folk_religion) and [Chinese folk religious sects](/wiki/Chinese_salvationist_religions).[*citation needed*] ## Statistics and demographics The Singapore census includes detailed data on religion and ethnicity, and is taken on a ten or five-year basis. 1980–2020 statistics for major religions and philosophies by the Singapore Census Religion198019902000201020152020Num.%Num.%Num.%Num.%Num.%Num.%[Buddhism](/wiki/Buddhism)26.7%31.1%1,060,66242.5%1,032,87933.3%33.2%1,074,15931.1%[No religion](/wiki/Irreligion)13.1%14.3%370,09414.8%527,55317.0%18.4%692,52820.0%[Christianity](/wiki/Christianity)9.9%12.5%364,08714.6%569,24418.4%18.8%654,35518.9%└ [Catholicism](/wiki/Catholicism)—N/a—N/a—N/a—N/a118,9804.8%219,1337.1%6.8%242,6817.0%└ Other Christian—N/a—N/a—N/a—N/a245,1079.8%350,11111.3%12.0%411,67411.9%[Islam](/wiki/Islam)16.2%15.4%371,66014.9%457,43514.7%14.0%539,25115.6%[Taoism](/wiki/Taoism)30.0%22.4%212,3448.5%339,14910.9%10.0%303,9608.8%[Hinduism](/wiki/Hinduism)3.6%3.7%99,9044.0%157,8545.1%5.0%172,9635.0%Other religions0.5%0.6%15,8790.6%21,6350.7%0.6%21,8780.6%Population100%100%2,494,630100%3,105,748100%100%3,459,093100% The figures for the percent of Singaporeans practiced religion by ethnicity for the past four decades are as follows: Percent of population practicing religions and philosophies by ancestry ReligionCensus19801990200020102020**[Chinese](/wiki/Chinese_Singaporeans)**[Buddhism](/wiki/Buddhism)34.3%39.5%53.6%43.0%40.3%[No religion](/wiki/Irreligion)16.4%17.6%18.6%21.8%25.7%[Christianity](/wiki/Christianity)10.9%14.1%16.5%20.1%21.6%[Taoism](/wiki/Taoism)38.2%28.5%10.8%14.4%11.6%Other religions0.2%0.3%0.5%0.7%0.8%**[Malays](/wiki/Malay_Singaporeans)**[Islam](/wiki/Islam)99.6%99.7%99.5%98.7%98.8%Other religions0.3%0.2%0.4%1.1%0.8%[No religion](/wiki/Irreligion)0.1%0.1%0.1%0.2%0.4%**[Indians](/wiki/Indian_Singaporeans)**[Hinduism](/wiki/Hinduism)56.5%53.2%55.4%59.0%57.3%[Islam](/wiki/Islam)21.8%26.3%25.6%21.7%23.4%[Christianity](/wiki/Christianity)12.5%12.8%12.1%12.8%12.6%Other religions8.2%6.9%6.3%5.4%4.6%[No religion](/wiki/Irreligion)1.0%0.8%0.6%1.1%2.1% Below are the Singapore's Resident Population Aged 15 years and over by Religion and Age Group: Age GroupBuddhistIrreligiousMuslimChristianTaoistHinduOthers15-2424.9%24.2%21.4%18.6%4.9%5.4%0.6%25-3426.0%26.2%19.4%17.7%6.1%4.0%0.6%35-4430.2%22.3%14.2%18.5%7.2%7.0%0.6%45-5433.3%18.3%13.8%20.6%7.1%6.2%0.7%55+35.1%15.2%13.2%19.0%13.1%3.7%0.7% The above figures refer to the resident population only, and do not include the non-resident population (Singapore authorities do not release figures for the non-resident population, which accounted for 18.33% of Singapore's population in 2005). ## Major religious communities ### Buddhism A plurality of Singaporeans declared themselves as Buddhists, with 31.1% of the Singaporean population being Buddhists in the 2020 census. Most missionaries hail from China, Tibet, Taiwan, Thailand, Myanmar, Sri Lanka and Japan.[*citation needed*] There are Buddhist monasteries and centres from the three major traditions of Buddhism in Singapore: [Theravada](/wiki/Theravada), [Mahayana](/wiki/Mahayana) and [Vajrayana](/wiki/Vajrayana). Most Buddhists in Singapore are Chinese and many of them adhere to Mahayana tradition. Whilst a majority of Buddhists in Singapore are traditionally ethnic Chinese, there are also Buddhists in Singapore that come from other ethnic groups such as the Thai, Sinhalese and Burmese. Due to the presence of Buddhists from these ethnic groups, there are Buddhist centres and temples that serve these communities, such as [Wat Ananda Metyarama Thai Buddhist Temple](/wiki/Wat_Ananda_Metyarama_Thai_Buddhist_Temple), [Sri Lankaramaya Buddhist Temple](/wiki/Sri_Lankaramaya_Buddhist_Temple) and [Burmese Buddhist Temple](/wiki/Burmese_Buddhist_Temple). Buddhism of every tradition is generally represented in Singapore, including [Tibetan Buddhism](/wiki/Tibetan_Buddhism), [Thai Buddhism](/wiki/Buddhism_in_Thailand) and Chinese [Mahayana Buddhism](/wiki/Mahayana_Buddhism).[*citation needed*] Below is the ethnic breakdown of Buddhists according to the 2020 Singapore Census of Population as follows: Ethnic GroupTotal Resident Population of Ethnic GroupPopulation of Resident Ethnic Group registered as BuddhistsPercentage of Resident Ethnic Group registered as BuddhistsPercentage of Buddhist Residents by Ethnic GroupChinese2,606,8811,052,11440.36%97.95%Malays447,7474470.10%0.04%Indians299,0562,0310.68%0.19%Others105,41019,56618.56%1.82%**Overall****3,459,093****1,074,159**31.05%100% ### Christianity 18.9% of Singaporeans identified as Christians in the 2020 census. Of these, 35.8% or 220,900 people identified as Catholics. Among Protestants, the [Methodist Church in Singapore](/wiki/Methodist_Church_in_Singapore) is the largest denomination, with some 42,000 members in 46 churches, as well as Orthodox. Prominent [megachurches](/wiki/Megachurch) have emerged over the last two decades with the rise of the [charismatic movement](/wiki/Charismatic_Movement); these include [New Creation Church](/wiki/New_Creation_Church), [City Harvest Church](/wiki/City_Harvest_Church) and [Faith Community Baptist Church](/wiki/Faith_Community_Baptist_Church), which count among Singapore's 10 largest charities, according to a report by [The Straits Times](/wiki/The_Straits_Times) in 2019. Below are the ethnic breakdown of Christians according to the 2020 Singapore Census of Population as follows: Ethnic GroupTotal Resident Population of Ethnic GroupPopulation of Resident Ethnic Group registered as ChristiansPercentage of Resident Ethnic Group registered as ChristiansPercentage of Christian Residents by Ethnic GroupChinese2,606,881562,86121.59%86.02%Malays447,7472,7430.61%0.42%Indians299,05637,60512.57%5.75%Others105,41051,14648.52%7.82%**Overall****3,459,093****654,355**18.90%100% ### Islam According to the 2020 census, 15.6% of the resident population declared themselves Muslims. Most mosques in Singapore cater to [Sunni](/wiki/Sunni) Muslims due to the vast majority of Singaporean Muslims adhering to the Sunni [Shafi'i](/wiki/Shafi%27i) or [Hanafi](/wiki/Hanafi) school of thought, although there are mosques that cater to the needs of the Shia community as well. There are approximately 200 [Ahmadi](/wiki/Ahmadiyya). Singapore also contains the oldest Muslim women's organisation in the world: [Young Women Muslim Association of Singapore](/wiki/Young_Women_Muslim_Association_of_Singapore). Whilst a majority of Muslims in Singapore are traditionally ethnic Malays, there is also a significantly growing number of Muslims from other ethnic groups. There is a sizeable number of Muslims amongst ethnic Indians that include Tamil Muslims and ethnic [Pakistanis in Singapore](/wiki/Pakistanis_in_Singapore) as well. For this reason, a number of mosques (mostly Tamil-speaking) specifically cater to the needs of the Indian Muslim community.[*citation needed*] Additionally, under the direction of the [Islamic Religious Council of Singapore](/wiki/Majlis_Ugama_Islam_Singapura) (MUIS), English is increasingly being used as the language of administration, religious instruction and sermons for Friday prayers in mosques across Singapore to cater to Muslims who may not necessarily be Malay-speaking. Below is the ethnic breakdown of Muslims according to the 2020 Singapore Census of Population as follows: Ethnic GroupTotal Resident Population of Ethnic GroupPopulation of Resident Ethnic Group registered as MuslimsPercentage of Resident Ethnic Group registered as MuslimsPercentage of Muslim Residents by Ethnic GroupChinese2,606,88111,9530.46%2.22%Malays447,747442,36898.80%82.03%Indians299,05669,96423.39%12.97%Others105,41014,96614.20%2.78%**Overall****3,459,093****539,251**15.59%100% ### Taoism According to the 2020 Census, 8.8% of Singaporeans declared themselves as Taoist. Followers of [Taoism](/wiki/Taoism) (\"The Way\") adhere to the teachings of the ancient Chinese religious philosophy of [Laozi](/wiki/Laozi), the founder of Taoism, also known as the [Pure Celestial Worthy of the Way](/wiki/Three_Pure_Ones). Besides codified Taoism—which in some places, like [Taiwan](/wiki/Taiwan), is mostly represented by the [Zhengyi](/wiki/Zhengyi_Taoism) order—Taoism in Singapore also includes a wide variety of [Chinese folk religious traditions](/wiki/Chinese_folk_religion) and various other religions. [Ancestral worship](/wiki/Ancestor_worship_in_China) is a common practice of the Chinese and the Qingming Festival during the second full moon is observed by the majority. This reflects that Chinese tradition remains extant in modern Singapore. They pray in tribute to their bereaved ancestors, where their spirits are honoured with offerings including food, beverages, [joss paper](/wiki/Joss_paper), [incense sticks](/wiki/Incense), and even paper houses, which are intrinsic practices for Taoists. Although Taoist temples and shrines are abundant in Singapore, the official number of followers has dwindled drastically over the years from 22.4% to 8.5% between the years 1990 to 2000. This, however, may be accounted for by the unclear delineation between Taoism and Buddhism in popular perception. For example, the difference between the two religions can be negligible enough that when a Chinese says that they \"offer incense sticks\" it is usually assumed that they are Buddhist even though they may not actually be Buddhist. The 2010 and 2015 censuses have shown that Taoist identity has declined again to represent about 10% of Singapore's population. Below are the ethnic breakdown of Taoists according to the 2020 Singapore Census of Population as follows: Ethnic GroupTotal Resident Population of Ethnic GroupPopulation of Resident Ethnic Group registered as TaoistsPercentage of Resident Ethnic Group registered as TaoistsPercentage of Taoist Residents by Ethnic GroupChinese2,606,881303,09511.63%99.72%Malays447,7471330.03%0.04%Indians299,056630.02%0.02%Others105,4106690.63%0.22%**Overall****3,459,093****303,960**8.79%100% ### Hinduism According to the latest 2020 census, 5.0% of Singaporeans declare themselves as Hindus. The majority of Singapore's present Hindus are descendants of Indians who migrated soon after the founding of Singapore in 1819. The early temples are still the central points of rituals and festivals, which are held throughout the year. YearPercentIncrease18492.8%19115.0% +2.2%19214.6% -0.4%19315.5% +0.9%19803.6% -1.9%19903.7% +0.1%20004.0% +0.3%20105.1% +1.1%20154.96% -0.14%20205.0% +0.04% Below are the ethnic breakdown of Hindus according to the 2020 Singapore Census of Population as follows: Ethnic GroupTotal Resident Population of Ethnic GroupPopulation of Resident Ethnic Group registered as HindusPercentage of Resident Ethnic Group registered as HindusPercentage of Hindu Residents by Ethnic GroupChinese2,606,8814580.018%0.26%Malays447,7472230.05%0.13%Indians299,056171,32657.29%99.05%Others105,4109560.91%0.55%**Overall****3,459,093****172,963**5.00%100% ### Sikhism The first Sikhs to settle in Singapore came in 1849. As of 2020 Census, there are 12,051 Sikhs (approximately 0.35% of the whole population) was registered in Singapore. Below are the ethnic breakdown of Sikhs according to the 2020 Singapore Census of Population as follows: Ethnic GroupTotal Resident Population of Ethnic GroupPopulation of Resident Ethnic Group registered as SikhsPercentage of Resident Ethnic Group registered as SikhsPercentage of Sikh Residents by Ethnic GroupChinese2,606,881110.0004%0.09%Malays447,747800.02%0.66%Indians299,05610,2653.43%85.18%Others105,4101,6951.61%14.07%**Overall****3,459,093****12,051**0.35%100% ## Small religious communities ### Jainism The [Jain](/wiki/Jainism) community celebrated 100 years in Singapore by rededicating the \"Stanak\" and consecrating the idol of [Mahavira](/wiki/Mahavira). This brought together the two main sects of Jains, the [Śvētāmbara](/wiki/%C5%9Av%C4%93t%C4%81mbara) and [Digambara](/wiki/Digambara). The Singapore Jain Religious Society actively engages in keeping traditions and practices alive by transmitting Jain principles to the next generation. It also has a strong history of community involvement. The Jains have no temple, but the Singapore Jain Religious Society has a building on 18 Jalan Yasin. As of 2006, there were 1,000 Jains in Singapore. ### Zoroastrianism There is a small community of about 300 Parsi Zoroastrians residing in Singapore. There is no [fire temple](/wiki/Fire_temple) in Singapore, but Zoroastrian House is home to the Parsi Zoroastrian Association of South East Asia, and contains a prayer hall for the community. ### Judaism The first Jews to settle in Singapore came from India in 1819. As of 2008, there are still Jews in Singapore. Their religious activities centre around two synagogues, the [Maghain Aboth Synagogue](/wiki/Maghain_Aboth_Synagogue) and the [Chesed-El Synagogue](/wiki/Chesed-El_Synagogue). There were over 1,500 Jewish inhabitants in 1939. Many were interned during [the Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) in [World War II](/wiki/World_War_II), and a number subsequently emigrated to Australia, England, the United States, and Israel. As a result, the community numbered approximately 450 in 1968. In 2005, the number reached 300. Because of a large [Ashkenazi](/wiki/Ashkenazi) immigration rate to Singapore in recent years, the population is now between 800 and 1,000, mostly foreign Ashkenazi Jews. ### Bahá'í Faith K. M. Fozdar (1898–1958) and [Shirin Fozdar](/wiki/Shirin_Fozdar) (1905–1992), were the first to introduce the Bahá'í Faith to Singapore when they settled here in 1950. Shirin Fozdar was well known throughout Singapore and Asia for her work in the cause of women's emancipation. Her arrival in Singapore had been preceded by an article in The Straits Times on 15 September 1950 under the heading \"A Woman with a Message\". Through the efforts of Dr and Mrs Fozdar, by 1952 there were enough Bahá'ís in Singapore to form the first Local Spiritual Assembly. The community has since grown to over 2000 members and today there are five Local Spiritual Assemblies in Singapore. Local Spiritual Assemblies oversee a wide range of activities including the education of children, devotional services, study classes, discussion groups, social functions, observance of holy days, marriages and funeral services. Bahá'í marriage is recognised under the laws of Singapore and the solemniser is appointed by the Registrar of Marriages. The Bahá'ís have been provided with a cemetery in Choa Chu Kang since 1957 and the nine Bahá'í Holy Days have been gazetted since 1972. Members of the first Local Spiritual Assembly of the Bahá'ís of Singapore, incorporated 28 July 1952. The five Local Spiritual Assemblies come under the jurisdiction of the Spiritual Assembly of the Bahá'ís of Singapore, the national governing council which was established in 1972. The national governing council also appoints the executive members of the various offices which plan and carry out social service projects and collaborate with government and non-government organisations. The Bahá'í teachings stress the importance of obedience to civil government and laws. While Bahá'ís may accept non-partisan government appointments, they do not engage in partisan political activity. The members firmly uphold the injunction of Bahá'u'lláh, that 'they must behave towards the government with loyalty, honesty and truthfulness'.[*citation needed*] There is no [Baha'i House of Worship](/wiki/Baha%27i_House_of_Worship) in Singapore, but there is a Baha'i Centre that serves as the administrative headquarters of the religion in Singapore. ## New religious movements ### Brahma Kumaris The [Brahma Kumaris](/wiki/Brahma_Kumaris) are a [millenarian](/wiki/Millenarianism) spiritual movement that originated in [Hyderabad, Sindh](/wiki/Hyderabad,_Sindh) in modern-day Pakistan in the 1930s. Founded by spiritualist and [medium](/wiki/Mediumship) [Lekhraj Kripalani](/wiki/Lekhraj_Kripalani), originally a follower of the [Vaishnavite](/wiki/Vaishnavism) [Vallabhacharya](/wiki/Vallabhacharya) sect, the movement is known for the prominent role played by celibate women in it, and purports to teach an ancient form of meditation known as Raja Yoga. The group has since distanced itself from its Hindu roots, preferring to use the language of [New Age](/wiki/New_Age) and personal growth movements to draw students. Followers believe in an imminent \"End of the World\" situation that is slated to happen before 2036 but in more recent teachings, leaders have downplayed many of the apocalyptic prophecies of the destruction of the planet revealed earlier. Many of the group's beliefs, referred to as \"The Knowledge\", are largely kept hidden from outsiders. The Singapore Brahma Kumaris Centre operates out of its Hindoo Road location in Little India. ### Christian Science [Christian Science](/wiki/Christian_Science) is a [non-trinitarian](/wiki/Nontrinitarianism) Christian [new religious movement](/wiki/New_religious_movement) developed by [Mary Baker Eddy](/wiki/Mary_Baker_Eddy) who argued in her 1875 book *[Science and Health](/wiki/Science_and_Health_with_Key_to_the_Scriptures)* that sickness is an illusion that can be corrected by prayer alone. She founded the [Church of Christ, Scientist](/wiki/Church_of_Christ,_Scientist) in 1879 with 26 followers. The church is known for its [Pulitzer Prize](/wiki/Pulitzer_Prize)-winning newspaper, the *[Christian Science Monitor](/wiki/The_Christian_Science_Monitor)*. In Singapore, the church holds weekly Sunday Services at The Regent Hotel on Cuscaden Road. ### Eckankar [Eckankar](/wiki/Eckankar), a [new religious movement](/wiki/New_religious_movement) founded by [Paul Twitchell](/wiki/Paul_Twitchell) in 1965, is active in Singapore through the Eckankar Satsang Singapore. There is no published data available on the size of the group, which holds meetings at Peace Centre. ### Falun Gong [Falun Gong](/wiki/Falun_Gong) is a [new religious movement](/wiki/New_religious_movement) founded in China by [Li Hongzhi](/wiki/Li_Hongzhi) in the early 1990s. Riding on the [*qigong* boom](/wiki/Qigong_boom) and initially enjoying support from Chinese officialdom, the movement was estimated to have 70 million practitioners in 1999. The Chinese government soon denounced the group as a cult and embarked on a nationwide crackdown. The group was registered as the Falun Buddha Society in 1996 and is headquartered at Geylang Road. The association is believed to have some 500 to 1,000 practitioners in Singapore, and publishes the Singapore edition of *[The Epoch Times](/wiki/The_Epoch_Times)* in English and Chinese. In January 2001, 15 Falun Gong practitioners, mostly Chinese nationals, were charged with illegal assembly after organising an unauthorised vigil at a park in memory of fellow believers they say died in police custody in China. In July 2006, nine members were charged with disseminating material encouraging people to quit the [Chinese Communist Party](/wiki/Chinese_Communist_Party), and another three members were charged with meditating and going on hunger strike outside the Chinese embassy. ### Hare Krishna The [Hare Krishna](/wiki/Hare_Krishna_movement) movement is active in Singapore but not through the [International Society for Krishna Consciousness](/wiki/International_Society_for_Krishna_Consciousness) (ISKCON) which was banned by the government in the 1970s and remains banned today. Foreign ISKCON monks as well as [Srila Prabhupada](/wiki/A._C._Bhaktivedanta_Swami_Prabhupada), founder of the movement, were barred by wary government authorities from entering Singapore, and all attempts by followers to officially register the society failed. Nevertheless, by avoiding affiliation with ISKCON, Hare Krishna followers have subsequently succeeded in registering their societies under different names. These include the Sri Krishna Mandir in Geylang and the Gita Reading Society at the Gauranga Centre in Serangoon. ### Mata Amritanandamayi Math The [Mata Amritanandamayi Math](/wiki/Mata_Amritanandamayi_Math) is a new Hindu movement established in 1981 by Indian guru [Mātā Amritānandamayī Devī](/wiki/Mata_Amritanandamayi), popularly referred to by her followers as \"Amma\", or by the media as the \"hugging saint\". Singapore was the destination of her first trip out of India in 1987 and since then, she has made frequent visits to the city-state, often attracting tens of thousands to [darshan](/wiki/Dar%C5%9Bana) events in recent years. The Amriteswari Society was registered in Singapore in 1993 and is located at Hindoo Road in Little India. ### Latter-day Saints [The Church of Jesus Christ of Latter-day Saints](/wiki/The_Church_of_Jesus_Christ_of_Latter-day_Saints) first began holding meetings in 1963 with a handful of followers that were living in Singapore in 1963. Church membership grew to about 100 in 1970 when the government began restricting proselytisation and visas for missionaries. In 1974, the church created the Singapore [Mission](/wiki/Mission_(LDS_Church)), with [G. Carlos Smith](/wiki/G._Carlos_Smith) as the [mission president](/wiki/Mission_president). By January 1980, Singapore was opened to full-time missionaries. As of 2021, the church claims about 3,400 members in the country and operates three chapels in Bukit Timah, Pasir Panjang, and Sengkang. In August 1992, [Jon Huntsman Jr.](/wiki/Jon_Huntsman_Jr.), a Latter-day Saint was appointed as the [United States Ambassador to Singapore](/wiki/List_of_ambassadors_of_the_United_States_to_Singapore). He served less than a year and left in June 1993. 21 Latter-day Saint missionaries have reportedly been sent out from Singapore to 15 countries. On 4 April 2021 at the 191st Annual General Conference, Church President Russell M. Nelson announced plans to construct a temple in Singapore. The Singapore Temple will be located on [Pasir Panjang](/wiki/Pasir_Panjang) road. ### Nichiren Shōshū [Nichiren Shōshū](/wiki/Nichiren_Sh%C5%8Dsh%C5%AB) is a branch of [Nichiren Buddhism](/wiki/Nichiren_Buddhism) based on the teachings of the 13th-century Japanese priest [Nichiren](/wiki/Nichiren). The Nichiren Shoshu Buddhist Association (Singapore) is located at Sims Avenue. A schism in Japan in 1991 saw the excommunication of Soka Gakkai out of Nichiren Shōshū, following which the respective branches in Singapore also parted ways. ### Quan Yin Famen The [Quan Yin Famen](/wiki/Guanyin_Famen), or the Quan Yin Method, is a transnational [cybersect](/wiki/Cybersectarianism) founded in 1988 by the self-styled Taiwanese-Vietnamese [Ching Hai](/wiki/Ching_Hai), known variously as *Suma Ching Hai* or *Supreme Master Ching Hai*. The sect has been denounced in China as a cult and today propagates its teachings through an online TV station called Supreme Master Television. Ching Hai is the progenitor of the [Loving Hut](/wiki/Loving_Hut) vegan restaurant chain which claims some 200 outlets in 35 countries. The Supreme Master Ching Hai Association (Singapore) is based at the Avari Centre on Geylang Road and runs a Loving Hut restaurant on Joo Chiat Road. ### Sathya Sai Baba movement The [Sathya Sai Baba movement](/wiki/Sathya_Sai_Baba_movement) is a new [Hindu](/wiki/Hindu) religious movement inspired by Indian spiritual guru [Sathya Sai Baba](/wiki/Sathya_Sai_Baba) (1926–2011) who followers claim to be the [avatar](/wiki/Avatar) of [Shiva](/wiki/Shiva) and [Shakti](/wiki/Shaktism) and the [reincarnation](/wiki/Reincarnation) of [Shirdi Sai Baba](/wiki/Sai_Baba_of_Shirdi). During his lifetime, Sai Baba taught the unity of religions and drew crowds with purported [materialisations](/wiki/Materialization_(paranormal)) of *[vibhuti](/wiki/Vibhuti)* and other objects, as well as claims of [miraculous healings](/wiki/Miraculous_healings), [resurrections](/wiki/Resurrection), [clairvoyance](/wiki/Clairvoyance), [bilocation](/wiki/Bilocation) and purported [omniscience](/wiki/Omniscience) and [omnipotence](/wiki/Omnipotence). The movement's history in Singapore goes back to the early 1970s, when a handful of Singaporeans began making trips to India to visit Sai Baba. In 1975, the Sri Satha Sai Society, Singapore was registered, and in 1988, a S$613,500 purchase was made for a 8,000 square foot freehold site at 133 Moulmein Road. ### Shinnyo-en [Shinnyo-en](/wiki/Shinnyo-en) is a Japanese Buddhist order founded in 1936 by [Shinjō Itō](/wiki/Shinj%C5%8D_It%C5%8D) and his wife Tomoji in the tradition of the Daigo branch of [Shingon Buddhism](/wiki/Shingon_Buddhism). The group was formally registered in Singapore in 1994 and claims some 1,800 members who observe rituals and ceremonies at a temple at Jalan Kechot. ### Soka Gakkai [Soka Gakkai](/wiki/Soka_Gakkai) is a [Japanese new religious movement](/wiki/Japanese_new_religions) based on the teachings of the 13th-century Japanese Buddhist priest [Nichiren](/wiki/Nichiren). Founded in Japan in 1930 and affiliated with [Nichiren Buddhism](/wiki/Nichiren_Buddhism), the movement soon made its way to Singapore. The Soka Gakkai Singapore was officially registered in 1972. Its membership was estimated to be about 40,000 people in 25,000 households in 2005. The group has been an active participant at the annual [National Day Parade](/wiki/Singapore_National_Day_Parade) and [Chingay](/wiki/Chingay_parade) events. The association is headquartered in Tampines and runs a Soka Preschool there. In October 2020, it broke ground on a new centre in Punggol. ### Spirit-Medium Cults \"[S]pirit-medium [cult](/wiki/Cult_(religious_practice))[s]\" are common among the [Confucians](/wiki/Confucianism) of Singapore. They often revolve around \"male spirit-mediums, called *[dang-ki](/wiki/Tangki)*\" who \"are subject to involuntary possession by one or more spirits\" that the medium ultimately wants to happen. The *dang-ki* go against Confucian beliefs on the body and mental health by [self-harming](/wiki/Self-harm) \"in public performances.\" \"This behavior is accepted...because they are considered instruments of higher powers, cut off from the world of ordinary mortals.\" Some *dang-ki* believe in a spirit who \"shakes the Heavens [and] comes from the west riding on a tiger and a dragon, bearing a holy seal\". This being's voice is \"like thunder\" and \"makes the *[shen](/wiki/Shen_(Chinese_religion))* (spirits)...and devils tremble\", it wields a sword that can kill evil spirits, and it can bring salvation. ### Transcendental Meditation The [Transcendental Meditation movement](/wiki/Transcendental_Meditation_movement) was founded by Indian guru [Maharishi Mahesh Yogi](/wiki/Maharishi_Mahesh_Yogi) in the mid-1950s. Central to the movement is a specific form of silent, [mantra](/wiki/Mantra) meditation that is practised for 15–20 minutes twice per day and is taught by certified teachers through a standard course of instruction, which costs a fee that varies by country. The Singapore TM Centre is run by The Spiritual Regeneration Movement Foundation of Singapore and located at Cendex Centre on Lower Delta Road. It charges S$1,500 per adult and S$2,400 per family for a course that includes personal instruction and follow-up group sessions. ### True Jesus Church [True Jesus Church](/wiki/True_Jesus_Church) is a [non-trinitarian](/wiki/Nontrinitarianism) [restorationist](/wiki/Restorationism) Christian sect that emerged in 1917 in Beijing, China. With teachings influenced by both the early [Pentecostal](/wiki/Pentecostalism) and [Adventist](/wiki/Adventism) movements, the church practices [Sabbath keeping](/wiki/Sabbath), [speaking in tongues](/wiki/Speaking_in_tongues), [foot washing](/wiki/Maundy_(foot_washing)), [faith healing](/wiki/Faith_healing) and [water baptism](/wiki/Water_baptism) by full body immersion in natural living waters, with head bowed and face downwards. Members of the True Jesus Church Singapore meet in four worship venues: Adam Road, Sembawang, Serangoon and Telok Kurau. ### Tzu Chi [Tzu Chi](/wiki/Tzu_Chi) is a new Buddhist movement that was established in 1966 by the Taiwanese *[bhikkuni](/wiki/Bhikkuni)* Master [Cheng Yen](/wiki/Cheng_Yen). [Tzu Chi Singapore](/wiki/Tzu_Chi_Singapore) was founded in 1993 and headquartered at Elias Road in Pasir Ris. The movement runs clinics providing free general practitioner, traditional Chinese medicine and dental services to elderly residents and low-income households in Redhill and Khatib. It also operates the Lakeside Family Medicine Clinic in Jurong West and a day rehabilitation centre in Jurong East. The group's education mission runs pre-schools in Yishun and Toa Payoh and a Continuing Education Centre at Elias Road. The group's charitable arm provides financial assistance for kidney patients and people with HIV/AIDS. ### World Mission Society Church of God The [World Mission Society Church of God](/wiki/World_Mission_Society_Church_of_God) is a Korean [sabbatarian](/wiki/Sabbatarianism), [restorationist](/wiki/Restorationism) Christian [new religious movement](/wiki/New_religious_movement) established in 1964. The church believes that [Ahn Sahng-hong](/wiki/Ahn_Sahng-hong), a former [Seventh-Day Adventist](/wiki/Seventh-day_Adventist_Church) preacher who died in 1985, is Christ, and refers to his wife [Zahng Gil-jah](/wiki/Zahng_Gil-jah), who is still living, variously as \"God the Mother\", \"Mother Jerusalem\", \"New Jerusalem Mother\", and \"Heavenly Mother\". The World Mission Society Church of God Singapore is located at Cheong Chin Nam Road. ## No religious affiliation As of 2020, 20% of Singaporeans had no religious affiliation. The proportion of Irreligious people is higher among [Chinese](/wiki/Chinese_Singaporeans) people, with one in four Chinese having no religion in the 2020 Census. The Singapore non-religious community itself is very diverse, with many calling themselves [atheists](/wiki/Atheists), [agnostics](/wiki/Agnostics), [free thinkers](/wiki/Free_thinkers), [humanists](/wiki/Humanists), [secularists](/wiki/Secularist), [theists](/wiki/Theists) or [sceptics](/wiki/Sceptics). In addition, there some people who decline religious labels but still practice traditional rituals like ancestor worship. The number of non-religious people in Singapore has risen gradually over the decades. Census reports show that those who said they have no religion rose from 13.0% in 1980 to 17.0% in 2010 and to 20.0% in 2020 . In recent years, social gatherings of non-religious people are becoming popular in Singapore. The Singapore Humanism Meetup is a major network of over 400 secular Humanists, freethinkers, atheists, and agnostics. In October 2010, the [Humanist Society (Singapore)](/wiki/Humanist_Society_(Singapore)) became the first humanist group to be gazetted as a society. Below are the ethnic breakdown of Irreligious according to the 2020 Singapore Census of Population as follows: Ethnic GroupTotal Resident Population of Ethnic GroupPopulation of Resident Ethnic Group registered as IrreligiousPercentage of Resident Ethnic Group registered as IrreligiousPercentage of Irreligious Residents by Ethnic GroupChinese2,606,881669,09725.67%96.62%Malays447,7471,6400.37%0.24%Indians299,0566,4432.15%0.93%Others105,41015,34714.56%2.22%**Overall****3,459,093****692,528**20.02%100% ## Restrictions The constitution provides for religious freedom, subject to restrictions relating to public order, public health, and morality. Publications and public discussions of religious issues are generally [censored](/wiki/OB_marker), along with negative or inflammatory portrayals of religion. The Government does not tolerate speech or actions that it deems could adversely affect racial or religious harmony. In 2023, America-based [Freedom House](/wiki/Freedom_House) scored the country 3 out of 4 for religious freedom. ### Jehovah's Witnesses In 1972, the Singapore government de-registered and banned the activities of [Jehovah's Witnesses](/wiki/Jehovah%27s_Witnesses) in Singapore on the grounds that its members refuse to perform military service (which is obligatory for all male citizens), salute the flag, or swear oaths of allegiance to the state. Singapore has banned all written materials published by the [International Bible Students Association](/wiki/Corporations_of_Jehovah%27s_Witnesses#International_Bible_Students_Association) and the [Watchtower Bible and Tract Society](/wiki/Watchtower_Bible_and_Tract_Society_of_New_York), both publishing arms of the Jehovah's Witnesses. A person who possesses a prohibited publication can be fined up to S$2,000 and jailed up to 12 months for a first conviction. ### Unification church In 1982, the [Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) dissolved the [Holy Spirit Association for the Unification of World Christianity](/wiki/Holy_Spirit_Association_for_the_Unification_of_World_Christianity), also known as the [Unification Church](/wiki/Unification_Church) (and colloquially as \"Moonies\"), for allegedly breaking up families. ### Shincheonji church In February 2020, Singapore began a probe into the unregistered local chapter of the Korean [new religious movement](/wiki/New_religious_movement) [Shincheonji Church of Jesus](/wiki/Shincheonji_Church_of_Jesus). The [apocalyptic](/wiki/Apocalypticism), [messianic](/wiki/Messianism) sect was known for being the centre of the first [COVID-19](/wiki/Coronavirus_disease_2019) outbreak in South Korea. The group had fewer than 100 members in Singapore and operated covertly through a front company called Spasie Enrichment. The Ministry of Home Affairs said the group had earlier tried, and failed, to register a company under the name of Heavenly Culture, World Peace and Restoration of Light. In November 2020, 21 members of the group were arrested for being members of an unlawful society. Five South Korean nationals who held key positions were repatriated and the group's front entities were dissolved. ### Islam In 2011, Wikileaks published diplomatic cables which attributed controversial comments regarding Islam to [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), the Minister Mentor of Singapore's government. Wikileaks quoted Lee as having described Islam as a \"venomous religion\". Lee later denied making the comments. The incident followed Lee's controversial book release *Lee Kuan Yew: Hard Truths to Keep Singapore Going*. In the book, Lee claimed that Singaporean Muslims faced difficulties in integrating because of their religion, and urged them to \"be less strict on Islamic observances\" – an assertion that is seemingly contrary to statistics and studies on the levels of social acceptance, tolerance and interracial marriages practised by Singaporean Muslims. The speakers for broadcasting the [Islamic call to prayer](/wiki/Adhan) were turned inwards to broadcast towards the interior of the mosques as part of a noise abatement campaign in 1974. ## Notes Library resources about **Religion in Singapore** - Resources in your library - Resources in other libraries\n",
  "language": "en",
  "processed_at": "2026-01-12T11:47:31.070786",
  "title": "Religion in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Religion_in_Singapore"
}