{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:47:40.330882"
  },
  "content": "Stockbroking agent A **remisier** (also known as a Commissioned Dealer's Representative) is an agent of a [stockbroking](/wiki/Brokerage_firm) company and receives a commission for each transaction handled (as compared with a [paid dealer's](/wiki/Employee) representative, who is a direct employee of a stockbroking company and whose remuneration structure is based on a fixed monthly salary). Although the origin of the word is [French](/wiki/French_language) (\"remisier\" means \"an intermediary\"), and although remisiers are still a feature of the [Paris Bourse](/wiki/Paris_Bourse), the term is now most commonly used in the context of the [Kuala Lumpur Stock Exchange](/wiki/Kuala_Lumpur_Stock_Exchange) (or [Bursa Malaysia](/wiki/Bursa_Malaysia)) and the [Singapore Stock Exchange](/wiki/Singapore_Stock_Exchange). Historically, remisiers first appeared in the region during the colonial period in [Malaya](/wiki/British_Malaya) (the collective name comprising the Crown Colonies of [Malacca](/wiki/Malacca), [Penang](/wiki/Penang) and [Singapore](/wiki/Singapore); the [Federated Malay States](/wiki/Federated_Malay_States); and the [Unfederated Malay States](/wiki/Unfederated_Malay_States)), where they dealt primarily in rubber and tin-related companies that were listed on the [London Stock Exchange](/wiki/London_Stock_Exchange), on behalf of Malaya-based clients. From the point of view of the stockbroking companies, the use of remisiers allowed them to generate additional trading volumes and revenues without the need to incur a fixed cost base or the need to build a customer base directly. From the point of view of the remisier, the additional financial burden of having to bear – or recompense to the stockbroking company - his or her own operational costs (in today's context, this may include the rental of office space and ancillary costs, telecommunications costs, and computer hardware and software costs) is outweighed by the potential for substantial commission income through his or her 40% share of the trading commission. In addition, a remisier remains the gatekeeper for his or her own client relationships. The relationship between remisiers and their stockbroking company were originally based on loose arrangements which varied substantially, both within the industry at large and also within each firm. As the Malaysian and Singaporean stock markets evolved, the respective regulatory bodies implemented the introduction of standard remisiers' agreements governing the relationship between all remisiers and member companies in the stockbroking industry (under these standard agreements, the remisier is regarded as an agent of the stockbroking company to trade in securities in the name of the company. This relationship was not made explicit in the previous arrangements between remisiers and stockbrokers). In regulatory terms, both remisiers and dealer's representatives are covered by the same licence (a dealer's representative's licence) to enable them to interact with clients and trade shares. The remisier is responsible for any losses which may be incurred by the stockbroking company arising from any securities transaction dealt through him or her. Each remisier has to post a deposit with the stockbroking company to cover clients' losses in the event of default; this [security](/wiki/Security_(finance)) deposit is segregated from other assets that are kept by the stockbroking company on behalf of the clients. The stockbroking company is required to take all relevant and reasonable action against clients for the recovery of indebtedness which should be reimbursed to the remisier in the event that the remisier's security deposit has been utilised towards the satisfaction of indebtedness. Remisiers play an important role on the KLSE and SES, not only in terms of increasing distribution and providing additional liquidity to the market, but also through their role in educating and advising retail investors and the public at large. - Parker, William (1920). *The Paris Bourse and French Finance:*. Original from the University of Michigan: Columbia University. p. 32. Remisier stock exchange.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:47:40.330184",
  "title": "Remisier",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Remisier"
}