{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:47:42.548086"
  },
  "content": "Southeast Asian dish **Rendang**[n 1] is a fried meat or dry [curry](/wiki/Curry#Southeast_Asia) made of meat stewed in coconut milk and spices, widely popular across [Brunei](/wiki/Brunei), [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore), and the [Philippines](/wiki/Philippines), where each version is considered local cuisine. It refers to both a cooking method of [frying](/wiki/Frying) and the dish cooked in that way. The process involves slowly cooking meat in spiced coconut milk in an uncovered pot or pan until the oil separates, allowing the dish to fry in its own sauce, coating the meat in a rich, flavorful glaze. Rooted in [Malay](/wiki/Malay_cuisine) and [Minangkabau](/wiki/Minangkabau_cuisine), rendang developed at the cultural crossroads of the [Malacca Strait](/wiki/Strait_of_Malacca). The dish carries strong Indian influences, as many of its key ingredients are staples in Indian cooking. The introduction of chili peppers by the Portuguese through the [Columbian exchange](/wiki/Columbian_exchange) after the [capture of Malacca](/wiki/Capture_of_Malacca_(1511)) in 1511, played a key role in the evolution of rendang. Malay and Minangkabau traders frequently carried rendang as provisions, allowing the dish to travel naturally through cultural exchange between the [Sumatra](/wiki/Sumatra) and [Malay Peninsula](/wiki/Malay_Peninsula). In 20th century, the deeply rooted migratory tradition of the [Minangkabau people](/wiki/Minangkabau_people) further maintained and contributed to the dish's spread, as they introduced Minang-style rendang to the various places they settled. As a signature dish in Southeast Asian Muslim cuisines—Malay, Minangkabau (as *samba randang*), and [Moro](/wiki/Filipino_cuisine#Regional_dishes#Mindanao) (as *riyandang*)—rendang is traditionally served at ceremonial occasions and festive gatherings, such as wedding feasts and *Hari Raya* ([Eid al-Fitr](/wiki/Eid_al-Fitr) and [Eid al-Adha](/wiki/Eid_al-Adha)). Nowadays, it is commonly served at food stalls and restaurants as a side dish with rice. In 2009, Malaysia recognized rendang as a heritage food. Indonesia granted rendang cultural heritage status in 2013 and officially declared it one of its national dishes in 2018. ## Etymology and definitions Both the *[Kamus Besar Bahasa Indonesia](/wiki/Kamus_Besar_Bahasa_Indonesia)* and *[Kamus Dewan](/wiki/Kamus_Dewan)* define *rendang* as meat cooked with spices and coconut milk until completely dry; *rendang* is also a verb for the action of frying in a pan with or without oil (only in Kamus Dewan). Food historian Khir Johari explains that *rendang* had a broader meaning for frying in general before the prevalence of *goreng*. For instance, [Munshi Abdullah](/wiki/Abdullah_Abdul_Kadir) in his 1838 [travelogue to Kelantan](/wiki/Kisah_Pelayaran_Abdullah_ke_Kelantan) described the [people of Terengganu](/wiki/Terengganuan_Malays) enjoying **rendang pisang** ([fried banana fritters](/wiki/Banana_fritter)) — what the Malays now called *goreng pisang* or *pisang goreng*.: 191–193 A 1960 article from Azizah Ja'afar in [Berita Harian](/wiki/Berita_Harian)'s Dewan Wanita section[n 2] lists *rendang* as \"frying with a generous amount of oil\", similar to **merendang pisang** or *[jemput-jemput](/wiki/Jemput-jemput)* (fried fritters), where the things being fried would float in the hot oil. This distinguishes *rendang* from *goreng*, which involves little to no oil, as seen in dishes like *[nasi goreng](/wiki/Nasi_goreng)* or *[mi goreng](/wiki/Mee_goreng)*. Additionally, \"rendang\" is also the name of a traditional Malay dish known for its rich, spicy flavors, such as *rendang santan* (meat cooked in coconut milk), and *rendang pedas* (spiced meat). The meanings of *rendang* from 17th-century Malay wordlists. YearAuthorDescription1623C. Wiltens, and S. Danckaertsto fry in butter or oil, to fry, to fricassee1677F. Gueynierto fry in a pan, to fricassee, to sauté Linguist Tom G. Hoogervorst's etymological research traces *rendang* back to the 17th-century Malay wordlists. The name *rendang* comes from the frying process; by the late 19th century, *rendang* was associated more specifically with a type of dry curry by British colonial officials in Malaya, where it is noted that Malays distinguished *rendang* as a dry curry and *[gulai](/wiki/Gulai)* as a wet curry. In olden times, *rendang* was often translated to English as \"fried meat\" or \"dry curry\". *Rendang* entered *[Oxford English Dictionary](/wiki/Oxford_English_Dictionary)* through Malay and Indonesian *rendang* which also cognates with [Minangkabau](/wiki/Minangkabau_language) *randang*. Gusti Asnan notes that the earliest recorded mention of *randang* in the Minangkabau context appears in J.L. van der Toorn's Minangkabau-Malay-Dutch dictionary published in 1891. This word in turn comes from *marandang*, which means cooking food slowly until the food becomes dry.[*citation needed*] The [Minangkabau people](/wiki/Minangkabau_people) brought rendang as a provision because of its ability to last a long time when moving to other regions. ## History ### Timeline of documentation #### The first known use of the word Food historian Fadly Rahman traces the earliest reference to rendang to the early 16th-century Malay manuscript *[Hikayat Amir Hamzah](/wiki/Hikayat_Amir_Hamzah)* associated with the [Malacca Sultanate](/wiki/Malacca_Sultanate)[n 3] (1400–1528). Written during the spread of Islam in the Malay world, this adaptation of the Persian [Hamzanama](/wiki/Hamzanama) was later compiled into Malay and intended to inspire Malacca's soldiers in their fight against the Portuguese in 1511. In Malay version, there mentioned the words \"rendang\" and \"merendang\" (roasting) which is quoted as follows: > ...Khoja Buzurjumhur Hakim pun pergi pula ke kedai orang merendang daging kambing, lalu ia berkata ‘beri apalah daging kambing rendang ini barang segumpal... Translation: > ...Khoja Buzurjumhur Hakim went to the stall where people were *merendang* (roasting) goat meat and said, 'give me just a piece of this goat meat *rendang*...' This passage suggests that *merendang* refers to a cooking technique, while *rendang* describes the resulting dish have been part of the Malay vocabulary since the 16th century. #### Earliest references in European texts Hoogervorst's research, traces the modern term *rendang* back to the Malay-Dutch dictionary first compiled in [Ambon](/wiki/Ambon_Island) and published by Caspar Wiltens and Sebastiaan Danckaert in 1623, where it was defined as \"to fry in butter or oil, to fry, to fricassee\". The dictionary was expanded and updated multiple times. According to Fadly Rahman, the author of the dictionary attempted to translate *rendang* using a European dish, something that his readers would be familiar with — [fricassee](/wiki/Fricassee), a French cooking method that involves cutting meat into pieces and braising it. #### As a tradition in royal Malay banquets Khir Johari notes that *rendang tumis* is mentioned in the *[Hikayat Hang Tuah](/wiki/Hikayat_Hang_Tuah)*, a classic Malay literary masterpiece from around the 17th-century. Another manuscript, *[Hikayat Awang Sulung Merah Muda](/wiki/Hikayat_Awang_Sulung_Merah_Muda)*, reflects 18th-century life and cooking traditions. In the narration, a prince hunts and captures a *[pelanduk](/wiki/Tragulus)* (mouse deer), which is then prepared in various styles — *tumis*, *rendang*, and *gulai*. Tumis refers to a dish that is more like soup, while rendang resembles the slow-cooked dish we know today. These manuscripts offer a glimpse into the Malay cuisine of the 17th and 18th centuries. Historical records from the 19th century, including newspaper reports and travelogues, often described the key ingredients of *rempah* (spice paste) used in rendang, as well as its regional variations. Renowned for his refined taste and hospitality, [Sultan Abu Bakar](/wiki/Abu_Bakar_of_Johor) of [Johor](/wiki/Johor_Sultanate) frequently hosted lavish banquets at his [Istana Besar](/wiki/Istana_Besar) in Johor Bahru.[n 5] In 1873, [J.F.A. McNair](/wiki/John_Frederick_Adolphus_McNair) described a royal Malay banquet featuring dishes such as *rendang [tenggiri](/wiki/Spanish_mackerel)* and *rendang chinchang [Plentong](/wiki/Plentong)*.: 457–460 In 1881, when [King David Kalākaua](/wiki/Kal%C4%81kaua) of [Hawaii](/wiki/Hawaiian_Kingdom) visited Johor, Sultan Abu Bakar served *rendang tenggiri* as part of the royal reception. #### Made popular through cookbooks and newspapers By the early 20th century, rendang recipes began appearing in published cookbooks and newspapers across [British Malaya](/wiki/British_Malaya) and the [Dutch East Indies](/wiki/Dutch_East_Indies). On 2 February 1917, [Soenting Melajoe](/wiki/Soenting_Melajoe) featured an article by Datoek Soetan Maharadja, noting that Europeans residing in Palembang, Batavia, and Kupang had written to Minangkabau women, sending money through the magazine's editor to request the preparation and delivery of “rendang Alam Minangkabau”. *The \"Mem's\" Own Cookery Book: 420 Tried and Economical Recipes for Malaya* (1920) by Mrs. Kinsey, published in Singapore, included a recipe for \"rundang\" that used curry powder and could be served with spaghetti.[n 6] In 1936, R.A. Kardinah's *Cooking Guide for Ladies*, published in Batavia, featured a chicken rendang recipe that emphasized slow cooking, though it adapted traditional ingredients. #### Contemporary era In Indonesia, rendang is mainly associated with Minangkabau. The popularity of rendang grew with the presence of Minangkabau-style *lepau* (food stalls) in areas where Minangkabau migrants settled. Their presence in new areas played a significant role in popularizing rendang as a signature dish of West Sumatra. Today, rendang stands as the iconic menu item in Minangkabau restaurants, often accompanied by other meat-based dishes. In Malaysia and Singapore, rendang is often paired with iconic dishes such as [nasi lemak](/wiki/Nasi_lemak) — a national favorite — or [lemang](/wiki/Lemang), Malay glutinous rice cooked in bamboo, particularly during festivals like Hari Raya. However, rendang has also become a staple in Malay eateries. It even features on the menus of international restaurants, showcasing its enduring appeal and cultural significance. ### Theories on origin #### From India Rendang, often regarded as an exclusive Malay, Minangkabau dish, is heavily influenced by Indian cuisine. Many of its ingredients, such as cardamom, coriander, garlic, shallots, chili, ginger, galangal, lemongrass, bay leaves, tamarind, and turmeric, are staples in Indian cooking. Winarno and Agustinah believe rendang may have been inspired by curry, a dish combining meat and spices in North India. Indian traders who traveled to West Sumatra brought their culinary traditions with them, possibly influencing the development of rendang. It likely traces its roots to Indian merchants, though it has undergone multiple layers of evolution over time. During this period, Malaysia and Indonesia had yet to emerge as distinct geographical entities, resulting in a deep shared culinary and cultural history. #### From West Sumatra Gusti Asnan notes that the earliest mention of *randang* in Minangkabau culture appears in J.L. van der Toorn's dictionary from 1891. However, he believes that it had been familiar to the Minangkabau people long before this record. Reconstruction of *randang* history by Gusti Asnan[n 7] *Randang* has been known to MinangArgumentationsince the 16th century (or earlier)based on the migration of Minang people to Peninsular Malaysiasince the 1830sbased on the information in H.J.J.L. Ridder de Stuers' report[n 8] Fadly Rahman inferred that rendang is closely associated with the Islamic tradition, the migratory culture, and the commercial ethics of the Minangkabau people. An early reference to “Rendang Minang”, a dish renowned for its ability to last for months and favored by migrants and traders, dates to 1917. ### Possible Portuguese influences According to culinary historian Janet P. Boileau, Portuguese cooks had a unique method of frying meat after braising, unlike the Arab technique of frying before boiling. This approach, adopted by Luso-Asian cooks, may have influenced local culinary practices including rendang.: 61 When the [Portuguese ruled Malacca](/wiki/Portuguese_Malacca) (1511–1641), they brought various cultural and culinary influences to the [Malay Peninsula](/wiki/Malay_Peninsula) and neighboring [Sumatra](/wiki/Sumatra). Portuguese cuisine introduced preservation techniques and terms like *[acar](/wiki/Acar)*, *[belacan](/wiki/Shrimp_paste)*, *[baulu](/wiki/Sponge_cake)*, and *[mentega](/wiki/Butter)*. After [Malacca fell to the Dutch](/wiki/Siege_of_Malacca_(1641)), the [Kristang community](/wiki/Kristang_people) — descendants of Malaccan Portuguese settlers — faced economic challenges and sought cost-effective ways to prepare food. They adopted techniques similar to those used by their counterparts in [Portuguese Macau](/wiki/Portuguese_Macau), such as frying meat with minimal water until it blackened, resembling *bafado*. (*Bafado* is derived from the term *abafado*, which means \"a dish of stew\".) This method led to the creation of the Kristang version of dry beef curry and then spread to the Malay people and reached the Minangkabau. In the early 16th century, the arrival of [Tomé Pires](/wiki/Tom%C3%A9_Pires) and the writings of [João de Barros](/wiki/Jo%C3%A3o_de_Barros) marked the beginning of Portuguese influence in [West Sumatra](/wiki/West_Sumatra) during the Portuguese control of Malacca. This contact likely introduced culinary elements such as *Abafado*, meaning “a dish of stew,” which evolved into *bafado* and was later adapted as *balado* in [Minangkabau](/wiki/Minangkabau_language), which has since become a widely recognized culinary term in [Minangkabau cuisine](/wiki/Padang_cuisine). With both *bafado* and *balado* serving food preservation purposes, and considering the movement of [Minangkabau](/wiki/Minangkabau_people) traders across the [Malacca Strait](/wiki/Strait_of_Malacca) from [Sumatra](/wiki/Sumatra) to [Peninsula Malaysia](/wiki/Peninsular_Malaysia), it reflects Luso's culinary influence may be spread due to human traffic activities between two regions. ## Cultural significance Rendang was officially recognized by Malaysia as a National Heritage food in 2009, celebrated for its rich diversity across the country. *Rendang campur* was declared in 2012. *Randang* from West Sumatra was granted cultural heritage status in 2013 by the Indonesian government. Rendang holds a special place in Malay and Minangkabau society, celebrated for its deep cultural significance and often reserved for special occasions such as Eid, weddings, and important gatherings. In villages, making rendang is a communal effort, with large amounts of meat being cooked in a giant cast-iron cauldron. During the final stage, people work together, stirring with a wooden oar-like spatula for hours to ensure even cooking. This slow frying removes moisture, allowing the meat to absorb the spices while preventing burning or breaking. The essence of rendang lies in its meticulous cooking process, where meat or chicken is slow-cooked with fresh coconut milk, aromatic spices, and herbs. This harmonious blend of ingredients represents unity and balance within the Malay community. Beyond its exquisite taste, rendang embodies hospitality, cultural pride, and a connection to heritage. Malay food traditions make the most of coconuts, knowing that the best coconut milk comes from mature coconuts. People with coconut palms could easily choose the right coconut for *rendang* the next day.: 204–205 Oil plays an important role in the dish's presentation, adding a glossy finish whether used for sautéing or naturally released during cooking.: 351 Rendang is traditionally associated with festive occasions and ceremonial meals. For example, it took center stage in the royal celebration during the *Santapan Nasi Berastakona* at [Istana Iskandariah](/wiki/Istana_Iskandariah) following the [Perak Sultan](/wiki/Sultan_of_Perak)'s coronation. Various styles of rendang were served alongside layers of yellow, white, and black glutinous rice in an intricately carved silver octagonal vessel called the *Astakona*, symbolizing sustenance and harmony. Notable Perak variations of rendang such as *rendang tok*, *rendang ayam*, and *rendang udang*, were thoughtfully prepared and arranged around the rice centerpiece, showcasing the dish's ceremonial importance. In Minangkabau culture, there are three types of food: *makanan adat* (traditional ceremonial food), *samba adat* (ceremonial dishes), and *makan beradat* (formal dining traditions). Rendang belongs to the category of *samba adat*, which is essential for traditional ceremonies. One key example is *rendang daging kerbau* (buffalo meat rendang), which symbolizes legitimacy in cultural rituals. Buffalo meat is particularly significant and cannot be substituted, as it is tied to the recognition of a tribal leader's title.: 16 Rendang, a celebrated dish from the Minangkabau region, is tied to a folk tale about Princess Puti Ranti, a humble and skilled cook. In a royal cooking competition, jealous rivals sabotaged her *gulai*, causing it to blacken. Despite this, the dish turned out delicious, and Puti Ranti won the contest. The delighted king named the dish *rendang*, combining her name and that of her future fiancé, Danggala. This story reflects Rendang's significance as a symbol of heritage and pride in Minangkabau culture.: 5–7 Each ingredient in rendang is reported to carry philosophical symbolism in Minangkabau culture and represents its key values and principles that reflect the way of life and social structure of the people. Rendang has a special position in the culture of the [Minangkabau people](/wiki/Minangkabau_people). The [Minangkabau people](/wiki/Minangkabau_people) are famous for their Merantau culture, which is to leave their hometowns in [West Sumatra](/wiki/West_Sumatra). Minang people in the land area used to travel to the [Strait of Malacca](/wiki/Strait_of_Malacca) to [Singapore](/wiki/Singapore) which took about a month through the river, because along the way there were no villages, the nomads prepared a long-lasting food supply, namely Rendang. [CNN International](/wiki/CNN_International) conducted a worldwide poll in 2011; it named rendang as the world's most delicious dish, ranking first among 50 dishes.: 1–2 Just prior to that ranking, the staff had put rendang at number eleven. The published article called rendang an \"[Indonesian dish](/wiki/Indonesian_cuisine)\". According to Fadly Rahman, many Indonesians don't just see this ranking as proof of rendang's exceptional taste; rather, it has been widely used by the government and culinary communities to reinforce that rendang is an Indonesian dish, not [Malaysian](/wiki/Malaysian_cuisine). However, what often goes unnoticed is how this claim transforms rendang from a symbol of culinary excellence into a dish laden with political significance. In 2018, a judge on [MasterChef UK](/wiki/MasterChef_UK) sparked controversy by criticizing a contestant's rendang for not being \"crispy enough\". The remark drew strong reactions from Malaysians, Singaporeans, and Indonesians, leading to widespread debate. In response, some local eateries even created their own crispy versions of rendang. ### Philosophy Rendang holds deep philosophical significance for the Minang people of [West Sumatra](/wiki/West_Sumatra), embodying the values of deliberation and consensus (*musyawarah dan mufakat*). It is rooted in four key ingredients, each symbolizing an essential pillar of Minangkabau society. *Dagiang* (beef) represents the *niniak mamak* (traditional tribal leaders), *karambia* (coconut) symbolizes the *cadiak pandai* (intellectuals), *lado* (chili) stands for the *alim ulama* (religious scholars who strictly uphold teachings), and *cook* (spices) represents the broader [Minangkabau](/wiki/Minangkabau_people) community. Symbolism behind *randang* ingredients in Minangkabau culture: 21–27 IngredientSymbolismDescriptionmeat *(dagiang)**niniak mamak*, *datuak*, or *pangulu*all three terms refer to tribal or community leaders who are believed to bring prosperity to future generations. They are also seen as unifying figures for all members of the community.coconut milk *(karambia)**cadiak pandai*These intellectuals foster unity among groups and individuals, resolve conflicts, and act as protectors. They also serve as lawmakers for Minangkabau tribes.chili *(lado)**alim ulama*Religious scholars symbolize firmness and dedication in teaching and upholding religious values.spice mixture *(pemasak)**dubalang*, *manti*, or *bundo kanduang*In Minangkabau society, every individual has a distinct role, each contributing to the promotion and preservation of Minangkabau culture. This collective participation is a cornerstone of social life. The [Minangkabau](/wiki/Minangkabau_people) philosophy in cooking rendang includes three main values: patience, wisdom, and perseverance. The cooking process that requires careful selection of ingredients reflects the good values of the human being. ## Composition and cooking method Rendang is most often described as meat [slow-cooked](/wiki/Slow-cooked) in coconut milk and spices until it becomes tender. If cooked properly, dry rendang can last for as long as four weeks. Prior to [refrigeration](/wiki/Refrigeration) technology, this style of cooking enabled preservation of large amounts of meat in the tropical climate, and therefore became a popular cooking technique. Its durability is one of the reasons that today, prepackaged rendang is sent as food aid relief for natural disaster survivors in Indonesia. The preferred [cut of beef](/wiki/Cut_of_beef) for rendang is lean meat of the rear leg; i.e. topside or [round](/wiki/Round_steak) beef, which is considered perfect for slow cooking. Rendang is rich in spices. Along with the main [meat](/wiki/Beef) ingredient, rendang uses [coconut milk](/wiki/Coconut_milk) and a paste of mixed ground spices, including [ginger](/wiki/Ginger), [galangal](/wiki/Galangal), [turmeric](/wiki/Turmeric) leaves, [lemongrass](/wiki/Lemongrass), garlic, [shallots](/wiki/Shallot), [chillis](/wiki/Chili_pepper) and other spices. This spice mixture is called *pemasak* in Minangkabau. The spices, garlic, shallot, ginger and galangal used in rendang have [antimicrobial](/wiki/Antimicrobial) properties and serve as natural organic preservatives. Although some [culinary](/wiki/Culinary_arts) experts describe rendang as a [curry](/wiki/Curry), the dish is usually not considered as such in Indonesia or Malaysia since it is richer and contains less liquid than is normal for [curries](/wiki/Indonesian_curry). Traditionally the term *rendang* does not refer to a certain type of dish. The verb *merendang* actually refers to a method of slow cooking; continuously churning the ingredients in a pot or frying pan, on a small fire, until all of the liquids evaporate and the meat is well done. Traditional Padang rendang takes hours to cook. Cooking rendang involves pounding and grinding ingredients as well as slow cooking, and so is time-consuming and requires patience. The meat pieces are slowly cooked in [coconut milk](/wiki/Coconut_milk) and spices until almost all the liquid is gone, allowing the meat to become tender and absorb the condiments. The cooking process changes from boiling to frying, as the liquid evaporates and the coconut milk turns to coconut oil. Cooking the meat until tender with almost all the liquid evaporated requires great care, keeping it from getting burnt. Because of its generous use of numerous spices, rendang is known for having a complex and unique taste. Rendang is often served with [steamed rice](/wiki/Steamed_rice), *[ketupat](/wiki/Ketupat)* (a compressed rice cake) or *[lemang](/wiki/Lemang)* (glutinous rice cooked in bamboo tubes), accompanied with vegetable side dishes such as boiled [cassava](/wiki/Cassava) leaf, *cubadak* (young [jackfruit](/wiki/Jackfruit) *[gulai](/wiki/Gulai)*), [cabbage](/wiki/Cabbage) *gulai* and *lado* (red or green chilli pepper [sambal](/wiki/Sambal)). ### Cooking process - *merendang* Azizah Ja'afar describes the cooking process of *rendang* (merendang) as involves simmering the meat in spiced coconut milk in an uncovered pot or pan until the coconut milk's oil separates and coats the meat, giving it a rich, glossy finish. With a slow fire and constant stirring, it takes around three hours for five kilograms of meat to reduce from a broth (when all the ingredients come together in a wok). From there, it requires an additional two hours before reaching the traditional rendang consistency. **Three stages of *merendang* cooking** StagesDescription First StageThe meat slowly simmers in a rich blend of coconut milk and spices, starting with a gentle boil in the creamy broth. Second StageAs the liquid gradually reduces, the coconut milk releases its natural oils, causing the cooking process to shift from simmering to slow frying. Third and Final Stage: RendangOver time, the meat deepens in color, frying in its own thickened sauce until it's coated in a dark, flavorful paste. ## Types ### Types of *rendang* in Malay Peninsula and Singapore Betty Yew's cookbook *Rasa Malaysia*, published in 1982, features 16 rendang recipes that highlight regional nuances.[*better source needed*] Rendang can be made with a variety of proteins, including buffalo, chicken, duck, mutton, venison, shellfish, birds, and grasshoppers. Popular regional variations include *rendang kerbau* ([buffalo](/wiki/Water_buffalo) rendang) from Rembau and *rendang udang galah* (giant freshwater prawn rendang) from Lenggong. Vegetable ingredients like [jackfruit](/wiki/Jackfruit), *pucuk teh*,[*further explanation needed*] *pucuk lampin*,[*further explanation needed*] and *pucuk maman* (*[Cleome gynandra](/wiki/Cleome_gynandra)*) are often added, reflecting the ingenuity of Malay communities in utilizing local resources. In Perak, rendang is deeply rooted in royal culinary traditions. Notable varieties include *rendang tok*, *rendang ayam* (chicken rendang), and *rendang udang* (shrimp rendang). *Rendang tok*, a specialty from Bukit Chandan, is a dry curry made with cubed beef, coconut milk, and a rich blend of spices such as cloves, star anise, cumin, cinnamon, chilies, and turmeric. It is enhanced with pan-toasted desiccated coconut and thin strips of coconut flesh, giving it a unique texture and aroma. The final dish is dark and intensely flavorful. Perak's rendang recipes also incorporate unique ingredients like forest fruits, including *kelepong* (a seasonal plant from the fig family).[*further explanation needed*] In Lenggong, popular rendang varieties include *rendang [dendeng](/wiki/Dendeng)*, and *rendang pedas daging dengan lambuk* (spicy beef with *lambuk* yam[*further explanation needed*] rendang).[*page needed*] There is also *rendang daging masak hitam* that is commonly served at Malay weddings. This version stands out from other rendang dishes in the region because it's made without coconut milk, giving it a distinct flavor and appearance. Negeri Sembilan is known for two main types of rendang: *rendang kuning* (yellow rendang) and *rendang hitam* (black rendang). Both are cooked until completely dry. *Rendang kuning* shares ingredients with the region's signature dish, *[gulai kuning](/wiki/Masak_lemak_lada_api)*, such as *[cili api](/wiki/Bird%27s_eye_chili)*, turmeric, and coconut milk. In Negeri Sembilan, beef is less commonly used due to its higher water content, which makes it harder to achieve the desired dryness. A traditional recipe also features *pucuk ubi* (young tapioca leaves), cooked until the mixture is dry and the leaves turn a deep brown color.: 116–117 *Rendang daun puding* is a type of *rendang kuning* that incorporates *daun puding*[*further explanation needed*] while *rendang kacang* includes chicken organs and long beans for added flavor and texture. In Tebing Tinggi, Bintong, Perlis, there's a unique dish called *rendang serai*, where the main ingredient is thinly sliced lemongrass. It's cooked with a blend of ingredients like *belimbing buluh* (a sour local fruit), coconut milk, kurma spices, onions, and either fresh or dried prawns. In Malacca, a fiery version called *rendang cili api*, made with bird's eye chilies, coconut milk, and spices, often features unique ingredients like cockles *(rendang kerang)*. In Johor, the traditional *rendang asli* includes bird's eye chilies and thick soy sauce for a distinctive flavor profile.[*page needed*] Basmah, a dish popular in Penang and Kedah, closely resembles rendang as it also uses coconut milk and toasted coconut gratings. However, it stands out for its use of a greater variety of fresh spices. In Terengganu and Kelantan, a dish called kerutuk is made from meat mixed with spices and cooked until thick, also said to resemble rendang. The Kristang also has their version of dry beef curry. Among older generations of Singapore Malays, rendang wasn't limited to just the classic meat version either. Variations included cattle liver rendang, pigeon rendang, eel rendang, shellfish rendang, jackfruit rendang (prized for its fibrous, meat-like texture), and banana blossom rendang. Some recipes even incorporated petite potatoes to add a carbohydrate element to balance the dish's rich protein and fat content. For extra depth of flavor, a few tablespoons of *[kerisik](/wiki/Kerisik)* (toasted, grated coconut) could be mixed in. *Rendang hijau* (green rendang), once a prized dish among the Riau-Singapore nobility, can still be found in the homes of some descendants, though it is becoming increasingly rare. ### Types of *rendang* in West Sumatra Today, rendang is widely enjoyed beyond ceremonial settings and has become a popular souvenir in Padang. While traditionally made with buffalo meat or beef, rendang now features a variety of ingredients. These include chicken, which cooks faster and is more economical; duck, common in areas like Payakumbuh; goat meat, often enjoyed in Agam; and seafood options like shellfish and salted fish. Other creative versions include *randang talua*, made with tapioca flour and eggs, and shredded beef or chicken rendang, which resembles meat floss but with thicker fibers.: 33–43 In Minangkabau, *randang* is broadly categorized into two styles based on regional influences: *randang darek* and *randang pasisia*. These variations reflect the geographical and cultural diversity of the highland (darek) and coastal (pasisia) areas of West Sumatra. Each variation of Rendang highlights the versatility of its signature spices, adapting to the availability of ingredients across different regions. Two types of Minangkabau *randang* Characteristics*Randang Darek**Randang Pasisia*Shapecut into smaller piecescut into larger piecesColorlong cooking process gives a darker, blackish-brown colorhas a lighter brown color due to shorter cooking timesAromasmoky, fragrant aromaaroma of spices, which are more abundant and prominentTexturetender, and its bran (caramelized coconut) is crunchymore tender, with the bran being crunchier and oilierFlavornatural ingredients, resulting in a slightly sweet flavorricher in herbs and spices, creating an aromatic taste *Randang darek* focuses on long cooking times, smaller pieces, and a smoky flavor, while *randang pasisia* highlights spice richness, tenderness, and suitability as a daily dish. Both offer unique qualities that reflect their regional culinary traditions. ## Variations ### Indonesia Rendang is made from beef (or occasionally [beef liver](/wiki/Beef_liver), [chicken](/wiki/Chicken_(food)), [duck](/wiki/Duck_(food)), [mutton](/wiki/Mutton), [water buffalo](/wiki/Domestic_buffalo), or vegetables like [jackfruit](/wiki/Jackfruit) or [cassava](/wiki/Cassava)). Chicken or duck rendang also contains [tamarind](/wiki/Tamarind) and is usually not cooked for as long as beef rendang. The [original Minangkabau rendang](/wiki/Padang_cuisine) has two categories, *rendang darek* and *rendang pesisir*. *Rendang darek* (‘land rendang’) is an umbrella term for dishes from old regions in mountainous areas of the [Minangkabau Highlands](/wiki/Minangkabau_Highlands) such as [Batusangkar](/wiki/Batusangkar), [Agam](/wiki/Agam_Regency), [Lima Puluh Kota](/wiki/Limapuluh_Koto_Regency), [Payakumbuh](/wiki/Payakumbuh), [Padang Panjang](/wiki/Padang_Panjang) and [Bukittinggi](/wiki/Bukittinggi). It mainly consists of beef, offal, poultry products, jackfruit, and many other vegetables and animal products that are found in these places. *Rendang pesisir* ('coastal rendang') is from the coastal regions of Minangkabau such as [Pariaman](/wiki/Pariaman), [Padang](/wiki/Padang), [Painan](/wiki/Painan) and [Pasaman](/wiki/Pasaman). It mainly consists of seafood, although it is not unusual for it to include beef or water buffalo meat. Minangkabau Rendang variations: 1. *Rendang ayam*: chicken rendang, speciality of [Batusangkar](/wiki/Batusangkar) and [Bukittinggi](/wiki/Bukittinggi). 2. *Rendang ati ampela*: rendang made of chicken innards; [liver](/wiki/Liver_(food)) and [gizzard](/wiki/Gizzard). 3. *Rendang babat*: [tripe](/wiki/Tripe) rendang, made of tripes of cattle. 4. *Rendang baluik (rendang belut)*: [eel](/wiki/Eel_as_food) rendang, speciality of [Solok](/wiki/Solok). In the Solok dialect, it is also called ‘*randang baluk*’. 5. *Rendang bilih (bilis)*: [bilis fish](/wiki/Mystacoleucus_padangensis) rendang, specialty of [Padang Panjang](/wiki/Padang_Panjang). In [Sumatra](/wiki/Sumatra), *ikan bilis* refers distinctly to *Mystacoleucus padangensis*, a small freshwater fish endemic to [Sumatra](/wiki/Sumatra). In other places, *bilis* might refer to sea [anchovy](/wiki/Anchovies_as_food) instead. 6. *Rendang cubadak (rendang nangka)*: unripe [jackfruit](/wiki/Jackfruit) rendang, speciality of [Payakumbuh](/wiki/Payakumbuh). 7. *Rendang cumi*: [squid](/wiki/Squid_as_food) rendang, a seafood variant of rendang usually consumed in coastal area. 8. *Rendang daging*: meat rendang. The most common rendang is made from beef, but may also be from [water buffalo](/wiki/Water_buffalo), goat, [mutton](/wiki/Mutton) or [lamb](/wiki/Lamb_and_mutton), speciality of [Padang](/wiki/Padang). 9. *Rendang datuk (rendang kering)*: dried beef rendang, that instead of using fresh beef cuts, the pieces of meat are dried for four days prior of cooking. Specialty of [Muara Enim](/wiki/Muara_Enim) in [South Sumatra](/wiki/South_Sumatra). 10. *Rendang daun kayu (samba buruk)*: rendang made of various edible leaves, usually leaves of *ubi kayu*, *jirak*, *mali*, *rambai*, *daun arbai*, mixed with *ikan haruan* ([snakehead](/wiki/Snakehead_(fish)) fish), specialty of Payakumbuh. 11. *Rendang daun pepaya*: young [papaya](/wiki/Papaya) leaf rendang. 12. *Rendang dendeng*: [Dendeng](/wiki/Dendeng) rendang, thinly sliced dried and fried beef cooked in rendang spice. Also can be made from readily available processed [beef jerky](/wiki/Beef_jerky). 13. *Rendang gabus (rendang ikan haruan)*: [Snakehead fish](/wiki/Snakehead_(fish)) rendang, popular in Payakumbuh. 14. *Rendang gadih*, *rendang tumbuk* or *rendang payakumbuh*: [Minced beef](/wiki/Minced_beef) rendang, *tumbuk* or pounded beef shaped into balls mixed with coconut, specialty of [Payakumbuh](/wiki/Payakumbuh), [West Sumatra](/wiki/West_Sumatra). 15. *Rendang hati*: cow liver rendang, speciality of [Minangkabau](/wiki/Minangkabau_people). 16. *Rendang ikan asap (rendang ikan salai)*: [smoked fish](/wiki/Smoked_fish) rendang, usually made of smoked *ikan pari* or ray fish, specialty of [Minangkabau](/wiki/Minangkabau_people). 17. *Rendang itiak (rendang bebek)*: duck rendang, speciality of [Bukittinggi](/wiki/Bukittinggi) and [Payakumbuh](/wiki/Payakumbuh). 18. *Rendang jamur*: mushroom rendang. 19. *Rendang jantung pisang*: [banana blossom](/wiki/Banana_blossom) rendang, speciality of [Minangkabau](/wiki/Minangkabau_people). 20. *Rendang jariang (rendang jengkol)*: *[jengkol](/wiki/Archidendron_pauciflorum)* rendang, commonly popular in [West Sumatran](/wiki/West_Sumatra) towns, especially [Bukittinggi](/wiki/Bukittinggi), [Payakumbuh](/wiki/Payakumbuh), [Pasaman](/wiki/Pasaman) and [Lubuk Basung](/wiki/Lubuk_Basung). 21. *Rendang kambing*: [goat meat](/wiki/Goat_meat) redang. 22. *Rendang jo kantang*: beef rendang with baby potatoes, speciality of [Kapau](/wiki/Kapau). 23. *Rendang kepiting (rendang ketam)*: [crab](/wiki/Crab_meat) rendang, which is crab cooked in rendang spices with sweet soy sauce. 24. *Rendang lele*: [Catfish](/wiki/Catfish) rendang. 25. *Rendang lidah*: [beef tongue](/wiki/Beef_tongue) cooked as rendang. 26. *Rendang limpa*: offal rendang made of cattle [spleen](/wiki/Spleen). 27. *Rendang lokan (rendang tiram)*: marsh clam rendang, speciality of coastal [Minangkabau](/wiki/Minangkabau_people) regions such as [Pariaman](/wiki/Pariaman), [Painan](/wiki/Painan) and [Pesisir Selatan](/wiki/Pesisir_Selatan). 28. *Rendang maco*: rendang that uses a type of [salted fish](/wiki/Salted_fish), specialty of [Limapuluh Koto](/wiki/Lima_Puluh_Kota_Regency). 29. *Rendang medan*: rendang variant from [Medan](/wiki/Medan) in [North Sumatra](/wiki/North_Sumatra), slightly different to [Minangkabau](/wiki/Minangkabau_people) rendang. It is more fatty and wet akin to kalio and usually less hot and spicy. 30. *Rendang padang*: [Padang](/wiki/Padang) rendang commonly sold in [Padang](/wiki/Padang) restaurants nationwide, dry rendang that uses lean fatless meat. 31. *Rendang pakis (rendang pucuk paku)*: vegetable rendang made from *pakis* or [fern](/wiki/Fern) leaf, specialty of [Pasaman](/wiki/Pasaman_Regency). 32. *Rendang paru*: cow's lung rendang, speciality of [Payakumbuh](/wiki/Payakumbuh). 33. *Rendang patin*: *[Pangasius](/wiki/Pangasius)* catfish rendang. 34. *Rendang petai*: stir fried *[petai](/wiki/Parkia_speciosa)* and common [green beans](/wiki/Green_bean) in rendang spices. 35. *Rendang pucuak ubi (rendang daun singkong)*: cassava leaf rendang, speciality of [Minangkabau](/wiki/Minangkabau_people). 36. *Rendang punai (rendang burung dara)*: rendang made of *burung punai* or [green pigeon](/wiki/Green_pigeon). 37. *Rendang puyuh*: rendang made of *burung puyuh* or [quail](/wiki/Quail_as_food). 38. *Rendang rawit*: an extra hot and spicy dried rendang spices mixed with dried *cabai rawit* ([bird's eye chili](/wiki/Bird%27s_eye_chili)). Not exactly a dish, but more a [condiment](/wiki/Condiment) akin to [serundeng](/wiki/Serundeng), [bawang goreng](/wiki/Bawang_goreng) or [chili powder](/wiki/Chili_powder) that sprinkled upon steamed rice or noodle. 39. *Rendang rebung*: rendang made of [bamboo shoot](/wiki/Bamboo_shoot). 40. *Rendang runtiah (rendang suir)*: (lit: \"shredded rendang\") shredded beef or poultry rendang, speciality of Payakumbuh. 41. *Rendang sapuluik itam (rendang pulut hitam)*: dough made of ground black [sticky rice](/wiki/Sticky_rice) cooked and served in rendang spice, specialty of Simalanggang. 42. *Rendang selais*: rendang made of *selais* (*[Kryptopterus](/wiki/Kryptopterus)*) fish, a genus of catfish found in rivers of Sumatra, popular in [Pekanbaru](/wiki/Pekanbaru), Riau. 43. *Rendang tahu*: tofu rendang, a vegetarian variant that uses [tofu](/wiki/Tofu) beancurd instead of meat. 44. *Rendang talua (rendang telur)*: egg rendang, speciality of [Payakumbuh](/wiki/Payakumbuh). 45. *Rendang tempe*: [*tempe*](/wiki/Tempeh) rendang, a vegetarian variant that uses tempeh soybean cake instead of meat. 46. *Rendang teri*: [anchovy](/wiki/Anchovies_as_food) rendang. 47. *Rendang tongkol*: [mackerel tuna](/wiki/Mackerel_tuna) rendang, speciality of coastal [Minangkabau](/wiki/Minangkabau_people) regions. 48. *Rendang tuna*: [tuna](/wiki/Tuna_as_food) rendang. 49. *Rendang tunjang (rendang kikil)*: rendang made of cartilage and tendons of [cow's trotters](/wiki/Cow%27s_trotters). 50. *Rendang ubi*: made of *ubi kayu* or *singkong* (cassava). 51. *Rendang udang*: [shrimp](/wiki/Shrimp_and_prawn_as_food) rendang. 52. *Rendang usus*: intestine rendang, made of [offals](/wiki/Offal); the intestines of either poultry or cattle. The cattle intestine rendang is quite similar with *gulai tambusu*, *gulai iso* or *gulai usus*. #### Rendang outside West Sumatra Today, rendang is quite widespread in Indonesia, mainly because of the proliferation of [Padang](/wiki/Padang) restaurants, which caused rendang to become popular in Indonesian households of various ethnic backgrounds. This has led to the development of variants to accommodate regional preferences. For example, in [Java](/wiki/Java), the rendang—aside from the Padang variety sold in Padang restaurants—tends to be wetter, slightly sweeter, and less spicy to accommodate [Javanese](/wiki/Javanese_people) tastes. Rendang variations outside by the Minangkabau: 1. *Rendang kelinci*: [rabbit meat](/wiki/Rabbit_meat) rendang, popular in [Aceh](/wiki/Aceh). 2. *Rendang babi*: [pork](/wiki/Pork) rendang, the adaptation of rendang by non-[Muslim](/wiki/Muslim) population of [Indonesia](/wiki/Indonesia). Usually consumed in [Christian](/wiki/Christianity)-majority Batak region of [North Sumatra](/wiki/North_Sumatra) and [Hindu](/wiki/Hinduism)-majority island of [Bali](/wiki/Bali). In [Bali](/wiki/Bali), the popularity of rendang has led to this adaptation, since some [Balinese Hindus](/wiki/Balinese_Hinduism) do not consume beef. 3. *Rendang jawa*: [Javanese](/wiki/Javanese_people) adoption of [Minang](/wiki/Minangkabau_people) rendang, which is more soft and moist suited to [Javanese](/wiki/Javanese_people) taste, usually rather sweet and less spicy compared to [Sumatran](/wiki/Sumatra) rendang. Outside of [Indonesia](/wiki/Indonesia), rendang is also known in [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore), [Brunei](/wiki/Brunei), southern [Thailand](/wiki/Thailand), and the southern [Philippines](/wiki/Philippines) as well as in the [Netherlands](/wiki/Netherlands), [Australia](/wiki/Australia), [Taiwan](/wiki/Taiwan), [Belgium](/wiki/Belgium), and [New Zealand](/wiki/New_Zealand). ### In Malaysia Rendang has a long history in Malaysia with distinct versions unique to individual Malaysian states. The different versions of rendang use different ingredients for the spice mix, resulting in differing flavors to the meat. 1. *Rendang ayam*: [chicken](/wiki/Chicken_as_food) rendang. 2. *Rendang ayam goreng*: fried chicken rendang. The popularity of this rendang skyrocketed mainly due to the \"rendangate\" controversy in 2018. 3. *Rendang daging* or *Rendang [Rembau](/wiki/Rembau_District)*: dark, woody coloured meat rendang. Traditionally made using [water buffalo](/wiki/Water_buffalo) meat. These days, beef is commonly used instead. 4. *Rendang daging hitam*: [Kicap manis](/wiki/Sweet_soy_sauce)-based black-coloured beef rendang, a specialty of [Sarawak](/wiki/Sarawak). 5. *Rendang dendeng*: thinly sliced dried meat rendang. 6. *Rendang ikan*: fish rendang. 7. *Rendang ikan pari*: [stingray](/wiki/Stingray) rendang, a specialty of [Perak](/wiki/Perak). 8. *Rendang itik*: [duck](/wiki/Duck_as_food) rendang, a specialty of [Negeri Sembilan](/wiki/Negeri_Sembilan) and [Sarawak](/wiki/Sarawak). In Sarawak, the duck is roasted first so that the meat is soft and not sticky. In Negeri Sembilan, the duck is preferred to be smoked first. 9. *Rendang puyuh*: [quail](/wiki/Quail_as_food) rendang. 10. *Rendang kupang*: [mussels](/wiki/Mussel#As_food) rendang. 11. *Rendang rusa*: [venison](/wiki/Venison) rendang. 12. *Rendang udang*: [prawn](/wiki/Prawn_as_food) rendang, a specialty of Perak. 13. *Rendang kambing*: [goat](/wiki/Goat_meat) rendang. 14. *Rendang kerang*: [cockle](/wiki/Cockle_(bivalve)) rendang. Commonly served as a side dish for *[nasi lemak](/wiki/Nasi_lemak)*. 15. *Rendang ketam*: [crab](/wiki/Crab_as_food) rendang. 16. *Rendang kijing*: [kijing](/wiki/Pilsbryoconcha), a type of shellfish, cooked with rendang spices. 17. *Rendang hati*: beef liver rendang, a specialty of [Johor](/wiki/Johor). 18. *Rendang telur*: boiled egg rendang. 19. *Rendang kunyit* or *rendang [Kuala Pilah](/wiki/Kuala_Pilah)* or *rendang kuning*: yellow-hued rendang, uses fresh [turmeric](/wiki/Turmeric), [lemongrass](/wiki/Lemongrass), and coconut milk but with no onion added at all. 20. *Rendang landak*: [porcupine](/wiki/Porcupine) rendang, an exotic meat rendang, a specialty of [Sekinchan](/wiki/Sekinchan), [Selangor](/wiki/Selangor). 21. *Rendang babi*: [pork](/wiki/Pork) rendang. Non-halal rendang that is eaten only by the Chinese and Peranakan community in Malaysia. 22. *Rendang lengkuas* or *nasu likku*: [galangal](/wiki/Galangal)-based rendang, a specialty of [Bugis](/wiki/Bugis) people in [Sabah](/wiki/Sabah). Two versions exist in Sabah, wet and dry; both are considered rendang in Malaysia. 23. *Rendang lokan*: [lokan](/wiki/Polymesoda) rendang, a specialty of [Sungai Petani](/wiki/Sungai_Petani), [Kedah](/wiki/Kedah). 24. *Rendang berempah*: spice rendang. Emphasizes the abundance of spices in the rendang. 25. *Rendang paru*: beef lung rendang. 26. *Rendang daun maman*: vegetable rendang made from braised *[Cleome gynandra](/wiki/Cleome_gynandra)* (*maman*) leaves, specialty of [Gemencheh](/wiki/Gemencheh), [Negeri Sembilan](/wiki/Negeri_Sembilan),[*page needed*] 27. *Rendang daun pegaga*: vegetable rendang made from [pegaga](/wiki/Pegaga) leaf. 28. *Rendang daun puding*: vegetable rendang made from the edible leaves of the [garden croton](/wiki/Garden_croton), a speciality of [Negeri Sembilan](/wiki/Negeri_Sembilan). 29. *Rendang daun ubi kayu*: vegetable rendang made from cassava leaf. 30. *Rendang jantung pisang*: banana blossom rendang. 31. *Rendang [serundeng](/wiki/Serundeng)*: dry meat floss, derived from rendang. It has a long shelf-life and needs no refrigeration, a specialty of Kelantan. 32. *Rendang Minang*: originated from the [Minangkabau people](/wiki/Minangkabau_people) who settled in Negeri Sembilan during the 16th century, but has since evolved from the Sumatran rendang version of the recipe. 33. *Rendang cili api* or *Rendang Negeri Sembilan* or *Rendang hijau*: greenish-hued rendang, uses [cili api](/wiki/Bird%27s_eye_chili) instead of red chili that is normally used in other rendang versions, a specialty of [Negeri Sembilan](/wiki/Negeri_Sembilan). 34. *Rendang Tok*: dry beef rendang created by the royal cooks of Perak, incorporates spices that were typically inaccessible to the general population. 35. *Rendang Pahang* or *opor daging*: dark red meat stew cooked with rich spice mix. 36. *Rendang Perak*: simpler version of Rendang Tok, a specialty of Perak. 37. *Rendang Rawa*: Rawa version of rendang, less complicated in terms of ingredients. 38. *Rendang Kedah*: reddish-hued rendang, incorporates the use of red sugar, turmeric leaves, kaffir lime leaves due to the Thai influence on the state cuisine, a specialty of [Kedah](/wiki/Kedah). 39. *Rendang Kelantan/Terengganu* or *[kerutuk daging](/wiki/Kerutuk_daging)*: slow-cooked meat mixed with a unique spice known as kerutub, coconut milk, [kerisik](/wiki/Kerisik) and some palm sugar. 40. *Rendang Nyonya*: Peranakan version of rendang, a specialty of [Peranakan](/wiki/Peranakan). 41. *Rendang Sabah*: uses white cumin to replace cinnamon and cloves, a specialty of [Sabah](/wiki/Sabah). 42. *Rendang Sarawak*: incorporates the use of turmeric leaves, a specialty of [Sarawak](/wiki/Sarawak). 43. *Rendang Siam*: Malay-Siamese version of rendang, incorporates the use of Thai inspired ingredients. ### Others #### In the Netherlands The Dutch are familiar with rendang through colonial ties and often serve the wet *kalio* version in the [Netherlands](/wiki/Netherlands)—usually as part of a *[rijsttafel](/wiki/Rijsttafel)*. Indonesian dishes, including rendang, are served in numbers of Indonesian restaurants in Dutch cities, especially [The Hague](/wiki/The_Hague), [Utrecht](/wiki/Utrecht), [Rotterdam](/wiki/Rotterdam) and [Amsterdam](/wiki/Amsterdam). #### In the Philippines In the Philippines, rendang is most commonly associated with the cuisine of the Muslim [Maranao people](/wiki/Maranao_people) of [Mindanao](/wiki/Mindanao). It differs from the Indonesian versions in the use of the native spice mix *[palapa](/wiki/Palapa_(condiment))* as well as the addition of *[muscovado](/wiki/Muscovado)* sugar. ### Fusion rendang Rendang *[bumbu](/wiki/Bumbu_(seasoning))* is sometimes used as the base of other [fusion dishes](/wiki/Fusion_cuisine). Some chefs in Indonesian [sushi](/wiki/Sushi) establishments, for example, have developed a Japanese-Indonesian fusion cuisine with recipes for krakatau roll, [gado-gado](/wiki/Gado-gado) roll, rendang roll and [gulai](/wiki/Gulai) ramen. Several chefs and food industries have experimented with fusing rendang with [sandwiches](/wiki/Sandwich), [burgers](/wiki/Hamburger) and [spaghetti](/wiki/Spaghetti). [Burger King](/wiki/Burger_King) at one time served a rendang-flavoured burger in their Singapore and Indonesia chains for a limited promotion period. Spaghetti with rendang could also be found in [7-Eleven](/wiki/7-Eleven) convenience stores across Indonesia. Rendang is also a popular flavour in Indonesian [instant noodle](/wiki/Instant_noodle) variants, such as [Indomie](/wiki/Indomie) Goreng Rendang. Most recently, there were Taiwanese [baozis](/wiki/Baozi) with rendang fillings sold at Neo Soho Mall in West Jakarta. - Food portal - Indonesia portal - Malaysia portal - Singapore portal - Philippines portal - Rendang at the Wikibooks Cookbook subproject - [Cuisine of Indonesia](/wiki/Cuisine_of_Indonesia) - [Minangkabau cuisine](/wiki/Padang_cuisine) - [Kalio](/wiki/Kalio), Indonesian dish - Similar dishes: - [Kala bhuna](/wiki/Kala_bhuna) - [Saksang](/wiki/Saksang) - [Dinuguan](/wiki/Dinuguan) - [Svartsoppa](/wiki/Svartsoppa) - [Sarapatel](/wiki/Sarapatel) ## Notes - Media related to Rendang at Wikimedia Commons - CNN Indonesia Documentary of Rendang (in Indonesian)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:47:42.547720",
  "title": "Rendang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Rendang"
}