{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:47:44.510469"
  },
  "content": "Democratic system used in Singapore national electionsThis article is part of a series on[Politics of Singapore](/wiki/Politics_of_Singapore)[Constitution](/wiki/Constitution_of_Singapore) - [Law](/wiki/Law_of_Singapore) - [Human rights](/wiki/Human_rights_in_Singapore) [Legislature](/wiki/Parliament_of_Singapore) - **[Parliament](/wiki/Parliament_of_Singapore)** - [Speaker](/wiki/Speaker_of_the_Parliament_of_Singapore) [Seah Kian Peng](/wiki/Seah_Kian_Peng) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the House](/wiki/Leader_of_the_House_(Singapore)) [Indranee Rajah](/wiki/Indranee_Rajah) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)) ([WP](/wiki/Workers%27_Party_(Singapore))) - [14th Parliament](/wiki/14th_Parliament_of_Singapore) - [Constituencies](/wiki/Constituencies_of_Singapore) [Executive](/wiki/Government_of_Singapore#Composition) - **[President of Singapore](/wiki/President_of_Singapore)** ([list](/wiki/List_of_presidents_of_Singapore)) - [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) ([I](/wiki/Independent_politician)) - **[Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore)** - [Lawrence Wong](/wiki/Lawrence_Wong) ([PAP](/wiki/People%27s_Action_Party)) - [Cabinet](/wiki/Cabinet_of_Singapore) - [Ministries](/wiki/Organisation_of_the_Government_of_Singapore) - [The Reserves](/wiki/Reserves_of_the_Government_of_Singapore) [Judiciary](/wiki/Judicial_system_of_Singapore) - **[Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore)** - [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Sundaresh Menon](/wiki/Sundaresh_Menon) - **[Court of Appeal](/wiki/Court_of_Appeal_of_Singapore)** - [Prakash](/wiki/Judith_Prakash) - [Tay](/wiki/Tay_Yong_Kwang) - [Chong](/wiki/Steven_Chong) - [Ang](/wiki/Belinda_Ang) - **[High Court](/wiki/High_Court_of_Singapore)** - [State Courts](/wiki/State_Courts_of_Singapore) [Elections](/wiki/Elections_in_Singapore) - [Presidential elections](/wiki/Presidential_elections_in_Singapore) - [General elections](/wiki/General_elections_in_Singapore) Singapore portal - [Other countries](/wiki/Outline_of_political_science#Politics_by_region) - v - t - e Singapore has a [multi-party](/wiki/Multi-party_system) [parliamentary system](/wiki/Parliamentary_system) of [representative democracy](/wiki/Representative_democracy) in which the [President of Singapore](/wiki/President_of_Singapore) is the [head of state](/wiki/Head_of_state) and the [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) is the [head of government](/wiki/Head_of_government). [Executive power](/wiki/Executive_power) is vested in the President and the [Cabinet](/wiki/Cabinet_of_Singapore). Cabinet has the general direction and control of the government and is collectively responsible to the [Parliament](/wiki/Parliament_of_Singapore). There are three separate branches of government: the [legislature](/wiki/Legislature), [executive](/wiki/Executive_(government)) and [judiciary](/wiki/Judiciary). [Representative democracy](/wiki/Representative_democracy) began in the 1940s when the number of elected seats in the legislature gradually increased, until a fully elected [Legislative Assembly of Singapore](/wiki/Legislative_Assembly_of_Singapore) was established in 1958. At present, Singapore legislation establishes various mechanisms that fulfil the doctrine of representative democracy. [Parliamentary elections in Singapore](/wiki/Parliamentary_elections_in_Singapore) are required to be held regularly to elect the Parliament by [universal suffrage](/wiki/Universal_suffrage). Although the [right to vote in Singapore law](/wiki/Right_to_vote_in_Singapore_law) is not expressly mentioned in the Constitution, the [Government](/wiki/Government_of_Singapore) has affirmed that the right is implied by the constitutional text. The Constitution vests the three branches of the state with different aspects of governmental power. The executive is made up of the President and the Cabinet, which is headed by the Prime Minister. The Cabinet is accountable to the electorate and is an embodiment of representative democracy. The President is elected by the people to act as a constitutional safeguard in protecting the national reserves and preserving the integrity of the public service. To qualify as a presidential candidate, stringent criteria must be satisfied. The Constitution further provides for the composition of a parliament which encompasses [members of parliament](/wiki/Parliament_of_Singapore#Members_of_Parliament) (MPs) elected through Single Member Constituencies and [Group Representation Constituencies](/wiki/Group_Representation_Constituency), [Non-constituency Members of Parliament](/wiki/Non-constituency_Member_of_Parliament) (NCMPs) and [Nominated Members of Parliament](/wiki/Nominated_Member_of_Parliament) (NMPs). MPs are representatives of the electorate and have the role of raising concerns that the people may have. The Government's view is that representative democracy is better understood as regarding [political parties](/wiki/List_of_political_parties_in_Singapore) rather than individual MPs as the fundamental element in the political system. While the judiciary is not a direct manifestation of the concept of representative democracy, it serves as a check on the Government and the legislature by ensuring that their powers are exercised within the limits established by the Constitution, such as the fundamental liberties in Part IV. The democratic right of Singaporeans to change their government through free and fair elections has not been tested as of yet. From its independence, the governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP) has won every [election](/wiki/Elections_in_Singapore) with varying amounts of support ranging from 60–70% of the popular vote under the [first-past-the-post voting](/wiki/First-past-the-post_voting) system (FPTP). Nevertheless, U.S.-based [Freedom House](/wiki/Freedom_House) has said that elections in Singapore are free from voter suppression and electoral fraud. The right to [freedom of speech and expression](/wiki/Freedom_of_speech), which is guaranteed to [Singapore citizens](/wiki/Singaporean_nationality_law) by [Article 14 of the Constitution of Singapore](/wiki/Article_14_of_the_Constitution_of_Singapore), is essential to the concept of representative democracy. Mechanisms available for the exercise of the right include the freedom of speech and debate in Parliament, [Speakers' Corner](/wiki/Speakers%27_Corner,_Singapore), and the [new media](/wiki/New_media). However, Article 14 enables Parliament to restrict the right to free speech on various grounds. One of these is the protection of reputation. Critics have charged that Cabinet ministers and members of the ruling [People's Action Party](/wiki/People%27s_Action_Party) have used civil defamation suits against opposition politicians to inhibit their activities and exclude them from Parliament. The Government has said that there is no evidence substantiating such claims. In addition, both media ownership and content are carefully regulated by the Government. Article 14 protects the right to [freedom of assembly](/wiki/Freedom_of_assembly) which is relevant to free speech as the latter is often exercised at assemblies and gatherings. Free assembly is restricted in Singapore through laws that require permits to be obtained before events are held, though an exception is made for indoor events involving organisers and speakers who are citizens. The Government has been accused of slowing down the progress of democracy by using the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)) (Cap. 143, 1985 Rev. Ed.) (ISA) to detain political opponents and suppress political criticism. In response, the Government has asserted that no person has been detained purely for their political beliefs. ## Government's understanding of representative democracy [Representative democracy](/wiki/Representative_democracy) has been described as \"a system of government where the people in free elections elect[ ] their representatives to the legislative chamber which occupies the most powerful position in the political system\". The meaning of the term was discussed in the [Parliament of Singapore](/wiki/Parliament_of_Singapore) on 27 August 2008 upon a [motion](/wiki/Motion_(parliamentary_procedure)) moved by [Nominated Member of Parliament](/wiki/Nominated_Member_of_Parliament) [Thio Li-ann](/wiki/Thio_Li-ann), a professor of constitutional law at the [National University of Singapore Faculty of Law](/wiki/National_University_of_Singapore_Faculty_of_Law), for the House to affirm the importance of representative democracy and to call on the [Government](/wiki/Government_of_Singapore) to amend the Parliamentary Elections Act to make the calling of [by-elections](/wiki/By-elections_in_Singapore) mandatory in [Group Representation Constituencies](/wiki/Group_Representation_Constituency) (GRCs) in certain situations. According to Thio, under the view of representative democracy taken by the 18th-century British Member of Parliament (MP) and philosopher [Edmund Burke](/wiki/Edmund_Burke), \"an MP is no mere delegate who simply mouths his constituents' views. An MP is chosen for his 'mature judgement' and 'enlightened conscience.'\" Thus, an MP \"has to represent his constituents in tending to municipal affairs\", but also \"be concerned with national affairs\", and, \"as a party member, he must toe the party line\". In addition, an MP of a minority ethnic group in a GRC \"has to carry the concerns of his particular minority community as well\". For this reason, she felt that if the seat of a minority MP in a GRC became vacant, it should be incumbent on the Government to call a by-election to fill it. Opposing the motion, [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) noted that the Burkean model of representative democracy \"puts the emphasis on choosing candidates to become MPs as the fundamental element of the whole scheme\", with the result that \"if an MP dies or resigns, ... he has to be replaced, so a by-election has to be held promptly without delay\". However, in the Government's view, representative democracy is better understood as having an \"emphasis on choosing political parties to form the government and to have political parties as the fundamental element in the system\": > Parties will field candidates to contest in general elections. They have to be high quality people – with integrity, ability, commitment, drive – all the attributes which we look for in an ideal candidate. But the candidate is not on his own. He carries the banner of the party. ... [H]e identifies himself for the party's manifesto, the programmes and the promises that the party makes. ... In this scheme, if voters in the general election support the party and vote its candidates in, and they form a majority in Parliament, then that party with a majority in Parliament forms the government. And that party has a mandate, not only because it so happens that this specific group of MPs, at this moment, supports it, but because it stood in a general election and the voters gave it the mandate, and indirectly, through the MP, voted for this party to form the government of the country, and to govern the country until the next general elections are called. Therefore, the emphasis in this system is on the ruling Party delivering on its programmes and promises. Consequently, if a parliamentary seat falls vacant mid-term, it does not have to be filled immediately as \"[t]he vacancy does not affect the mandate of the Government, nor its ability to deliver on its programmes or promises. And this mandate continues until the next general election is called, when the incumbent team will render account to the electorate.\" The Prime Minister said that the Singapore system of government was based on this model for two reasons: first, to \"encourage voters to think very carefully when they are voting during general elections, because you are not only voting for your representative in the constituency, you are voting for the government in the country\"; and, secondly, \"to maximise the chances of a stable, effective government in between general elections\". ## History Singapore was colonised by the British in the 19th century, during which society was ruled according to [English law](/wiki/English_law). The result was the transplantation of the Western idea of representative democracy into [Singapore's legal system](/wiki/Law_of_Singapore). This idea has taken root and developed tremendously since the end of World War II into what it is today. ### Before World War II After Singapore was founded in 1819, she was under the jurisdiction of British rule. For a long time, representative democracy was non-existent. In 1920, a [select committee](/wiki/Select_committee_(parliamentary_system)) which was established to reform the [Legislative Council](/wiki/Legislative_Council_of_Singapore) argued that Singapore was not ready for democratic ideas – to allow people to elect members into the Legislative Council might result in giving the \"professional politician the opportunity of obtaining power by playing on religious and social prejudices\". Even though the Council lacked popular representation of the locals, the population was generally satisfied with the system and the policies of the [Governor of the Straits Settlements](/wiki/List_of_British_Governors_of_the_Straits_Settlements) were influenced by opinions expressed by the public and in the press. ### After World War II It was only in 1946, after the [Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) and the disbanding of the [Straits Settlements](/wiki/Straits_Settlements), that the people were allowed to elect members into the Legislative Council. The council then consisted of at least 22 but not more than 24 members. Only nine members were elected, out of which the Singapore Chamber of Commerce, the [Chinese Chamber of Commerce](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry) and the Indian Chamber of Commerce were each allotted one seat. The other six seats were to be filled by democratic elections based on [universal suffrage](/wiki/Universal_suffrage). Elections were held for the first time on 20 March 1948. Even so, the general public was apathetic towards the new political situation and the British regarded this as the major impediment to the development of democratic government in Singapore. Thus, a constitutional commission headed by Sir [George Rendel](/wiki/George_William_Rendel) was set up in 1953 to recommend changes in the constitutional system, with the aim of increasing widespread participation in the central and local government of Singapore. The Government accepted most of the Rendel Commission's recommendations in its report of February 1954. One suggested reform was to transform the Legislative Council into an Assembly of 32 members, of whom 25 would be elected. The \"Leader of the House\" or \"Chief Minister\" would be the leader of the largest political party in the Assembly or of a coalition of parties assured of majority support. Representation by the Chambers of Commerce was also removed. The amended [Constitution of Singapore](/wiki/Constitution_of_Singapore) also provided for a Council of Ministers appointed by the Governor upon the recommendation of the Chief Minister, consisting of three unelected Official Members and six Elected Members. As the Constitution was unclear on the powers of the ministers, the discretion to make crucial decisions and formulate policies was understood to reside in the Governor and the Official Members. ### Self-governance, merger with Malaysia, and independence A fully elected [Legislative Assembly](/wiki/Legislative_Assembly_of_Singapore) was finally established in 1958, when Singapore relinquished its colonial status to become a self-governing state. Its powers extended to areas not previously under its purview, such as defence and foreign policy. This situation remained throughout [merger with Malaysia](/wiki/Singapore_in_Malaysia) in 1963, and after separation from Malaysia and full [independence](/wiki/History_of_the_Republic_of_Singapore#Independence_from_Malaysia) in 1965. In the Proclamation of Singapore contained in the [Independence of Singapore Agreement 1965](/wiki/Independence_of_Singapore_Agreement_1965) entered into between Malaysia and Singapore, Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) proclaimed on behalf of the people and Government of Singapore that as from 9 August 1965 Singapore \"shall be forever a sovereign democratic and independent nation, founded upon the principles of liberty and justice and ever seeking the welfare and happiness of her people in a more just and equal society\". After independence, the [Parliament of Singapore](/wiki/Parliament_of_Singapore) remained fully elected until 1984, when amendments to the Constitution and the Parliamentary Elections Act were passed to provide for [Non-constituency Members of Parliament](/wiki/Non-constituency_Member_of_Parliament) (\"NCMPs\"). NCMPs, who are declared elected by the [returning officer](/wiki/Returning_officer#Singapore), consist of the best performing losers in [general elections](/wiki/Parliamentary_elections_in_Singapore) based on the percentage of votes cast. The scheme ensures that opposition representation is accounted for in the Parliament. In 1990, yet another type of unelected Member was introduced – the [Nominated Member of Parliament](/wiki/Nominated_Member_of_Parliament) (\"NMP\"). These non-partisan Members were brought in to provide alternate views on policies that differed from the opinions espoused by the [political parties](/wiki/List_of_political_parties_in_Singapore) represented in Parliament. ## Voting ### Role in a representative democracy [Voting](/wiki/Voting) is regarded as key to representative democracy, which requires that the leaders of a country are elected by the people. The basis of this concept is that everyone should be treated equally and everyone has equal rights. Every person, therefore, has a right to one vote, and no more, in the choice of representatives. The [right to vote](/wiki/Suffrage) is a primary right, a right of fundamental importance by which other rights are protected. It is one of the important bulwarks of a representative democracy and in this regard, the ballot box is the people's ultimate mechanism to control the shaping of government policies. However, it must be recognised that voting is not an infallible litmus test for democracy; rather, it functions as a procedural device that is normally regarded as the best instrument for securing the ideal of self-governance. ### Right to vote The [right to vote in Singapore](/wiki/Right_to_vote_in_Singapore_law) is an implied constitutional right arising from various provisions in the Constitution. These include Articles 65 and 66, which provide for a maximum term of five years for each Parliament and for a general election to be held within three months after Parliament is [dissolved](/wiki/Parliament_of_Singapore#Sessions). In a parliamentary debate in 2009, NMP Thio Li-ann suggested that the Government should amend the Constitution to expressly include a right to vote. She said: > A right of fundamental importance should be recognised as a fundamental right and constitutionally entrenched. Only the most important rights and interests are constitutionalised ... The right to vote is not an ancillary or new-fangled right; it is fundamental and long-established. Thio noted that in 1966 the [Wee Chong Jin](/wiki/Wee_Chong_Jin) Constitutional Commission had considered it \"necessary and wise\" to [constitutionally entrench](/wiki/Entrenched_clause) the right to vote by making it removable only by a majority of two-thirds of the electorate voting at a national [referendum](/wiki/Referendum). In addition, she cited the case of *[Taw Cheng Kong v. Public Prosecutor](/wiki/Public_Prosecutor_v._Taw_Cheng_Kong#Constitutional_arguments_before_the_High_Court)* (1988), where the [High Court](/wiki/High_Court_of_Singapore) had made a statement which seemed to indicate that the right to vote is a privilege rather than a right. In reply, [Minister for Law](/wiki/Ministry_of_Law_(Singapore)) [K. Shanmugam](/wiki/K._Shanmugam) affirmed that the right to vote is indeed a constitutional right. He noted that it cannot be a privilege in a representative democracy since that would imply that there exists an institution superior to the body of citizens which can grant such a privilege. He also asserted that, ultimately, \"it is the mettle of the people and its leadership\" that determine whether the Constitution is abided by as the supreme law of the land. In response to Thio's point on the views of the Wee Chong Jin Constitutional Commission, Shanmugam said that at the time the report was rendered the electorate was immature and unfamiliar with the importance of voting, a result of the country's history of colonial rule. In contrast, the high voter turnout rates in every election since then evidenced that Singaporeans have realised this point. With regard to the *Taw Cheng Kong* case, Shanmugam stated that since the Court's observations were *[obiter](/wiki/Obiter_dictum)*, they were unlikely to be treated as setting a [precedent](/wiki/Precedent). ### First-past-the-post system The \"[first-past-the-post](/wiki/First-past-the-post_voting)\" voting system, also known as the simple [plurality voting system](/wiki/Plurality_voting_system), is used in Singapore for electing the President as well as [Members of the Parliament](/wiki/Parliament_of_Singapore#Elected_Members). This system has been criticised as undemocratic because the eventual winner may have won only a minority of the total votes cast, despite having secured the most votes in absolute terms among all the candidates. Thus, there might be cases where an elected politician can be said to have won the mandate of only a minority of voters, and that his or her election is therefore not an accurate reflection of the voters' will. As constitutional lawyer Sir [William Wade](/wiki/Henry_William_Rawson_Wade) has said: \"If it is accepted that a democratic Parliament ought to represent so far as possible the preferences of the voters, this system is probably the worst that could be devised.\" In the [2006 general election](/wiki/2006_Singaporean_general_election), despite only achieving 66.6% of the total votes cast, the ruling [People's Action Party](/wiki/People%27s_Action_Party) (\"PAP\") was returned to power with 82 out of the 84 seats. While there were more opposition members elected to the Parliament in the [2011 general election](/wiki/2011_Singaporean_general_election), PAP held on to 81 of 87 seats in the Parliament despite securing only 60.1% of the votes. Also, during the [2011 presidential election](/wiki/2011_Singaporean_presidential_election), President [Tony Tan Keng Yam](/wiki/Tony_Tan_(Singaporean_president)) won with only 35.2% of the total votes. ### Eligibility to vote Voting in Singapore is [compulsory](/wiki/Compulsory_voting). Any citizen above 21 years of age who is not disqualified by the factors in section 6 of the Parliamentary Elections Act is required to vote in person. There is no constitutional provision stipulating any qualifications for voters, and as the Act is an ordinary piece of legislation the disqualifying factors may be changed by a simple majority (more than 50%) of votes in Parliament. To be eligible to vote at a contested election in any constituency, a voter's name must be on the latest certified register of electors for that constituency. The name of the voter will be included in the register of electors for a constituency if on the cut-off date for the production of the register of electors the voter is a [citizen of Singapore](/wiki/Singaporean_nationality_law), at least 21 years old, and ordinarily resident or deemed to be ordinarily resident in Singapore at an address that is in that constituency. For the purpose of preparing or revising a register of electors, information stated on a voter's [National Registration Identity Card](/wiki/National_Registration_Identity_Card) is used to determine that he or she complies with the above requirements, unless the facts are shown to be otherwise. ## Democratic institutions ### Legislature The Legislature of Singapore consists of the [President](/wiki/President_of_Singapore) and the Parliament. The concept of representative democracy is embodied in the Legislature and is given effect in part through various parliamentary innovations that have been introduced over the years, such as Group Representation Constituencies, Non-constituency Members of Parliament and Nominated Members of Parliament. #### Constituencies There are two types of [constituencies](/wiki/Constituencies_of_Singapore) (electoral divisions) in Singapore: Single Member Constituencies (SMCs) and Group Representation Constituencies (GRCs). In SMCs candidates vie individually for parliamentary seats, whereas in GRCs the contest is between teams of candidates. Under the GRC scheme, which came into effect on 1 June 1988, the Government may, having regard to the number of voters in a particular constituency, advise the President to declare it to be a GRC and designate it as a constituency in which at least one of the candidates is from the [Malay](/wiki/Malays_in_Singapore) community, or from the [Indian](/wiki/Indians_in_Singapore) or some other minority community in Singapore. Each team in a GRC may have between three and six candidates. The GRC scheme seeks to ensure a [multiracial](/wiki/Multiracialism) Parliament and seeks to secure \"the long-term political stability of Singapore ... by ensuring that Parliament will always be multi-racial and representative of our society, and ... by encouraging the practice of multi-racial politics by all political parties\". It also encourages political parties to appeal to all races with moderate policies, and not to one race or another with chauvinist or extremist policies. Further, it has been suggested that the scheme puts a \"premium on parties which can field credible teams\", thereby demonstrating that they are \"fit not just to become MPs but to form the government\". The GRC scheme has been criticised as weakening the candidate–voter relationship, because it may be more difficult for voters to feel that candidates actually represent them when there are a number of candidates in a team to vote for. Most voters elect MPs whom they can identify with and are better able to represent their interests. It would be much easier for voters to identify with a single candidate than with a team of, say, four individuals. Also, since there will be key vote pullers in every GRC, the unknown or unpopular candidate is \"dragged into Parliament on the coat-tails of the major vote-puller\". This alienates the electorate from its representatives, thereby undermining the idea of representation. Since the people \"cannot clearly identify themselves with the candidates ... responsibility for choices cannot be ascribed to the people\". In addition, it has been suggested that the GRC scheme merely provides an appearance of a united, multiracial Parliament. In fact, minority representatives are required to vote according to their [party line](/wiki/Party_line_(politics)); they are not allowed to vote specifically in the interests of their racial groups. The multiracial element in Parliament has been artificially imposed by way of a [racial quota](/wiki/Racial_quota) to ensure that the minorities are represented. #### Non-constituency Members of Parliament The NCMP Scheme was introduced in 1984 to ensure the presence of Opposition Members in Parliament. The NCMP Scheme serves to ensure that the voices of the minority are still heard. Thus, to qualify as an NCMP, the candidate must have won at least 15% of the total number of votes. The powers of an NCMP are restricted in Art 39(2) of the Constitution: an NCMP cannot vote on a [bill](/wiki/Bill_(proposed_law)) to amend the Constitution; a supply, supplementary supply or final supply bill; a [money bill](/wiki/Money_bill); a [vote of no confidence](/wiki/Motion_of_no_confidence) in the Government; or a motion for removing the President from office. Despite the aim of the NCMP scheme to ameliorate the impacts of the first-past-the-post system, its legitimacy is highly doubted. It is based neither on a clear electoral mandate like ordinary MPs, nor on expertise or specialisation (as in the case of NMPs). As a result, the privileges of NCMPs are severely curtailed and this limits their effectiveness as alternative voices in Parliament. Further, critics question the exact purpose of the scheme. It is unclear as to whether NCMPs serve to represent the minority in the first-past-the post system, or is an apparent representation that would not affect PAP's decision-making. Nevertheless, it still seems to be a mechanism for representation of the minority opposition. #### Nominated Members of Parliament The NMP scheme was introduced in 1990 and serves to introduce into Parliament alternative, independent and non-partisan views from minorities and experts. This is said to effectively raises the level of political discourse. Women, for example, who are usually under-represented in parliament, may be appointed as an NMP to provide alternate views. A special [select committee](/wiki/Parliament_of_Singapore#Select_committees) of Parliament nominates candidates to be appointed as NMPs by the President on the advice of the [Cabinet](/wiki/Cabinet_of_Singapore). In 2010, the number of NMPs was increased from six to nine. NMPs share the same powers and privileges as NCMPs. The NMP scheme was not introduced without controversy, which may lead one to question the effectiveness of the scheme in strengthening representative democracy. Despite the protests of many PAP MPs, the [party whip](/wiki/Parliament_of_Singapore#Party_whip) was enforced to effect the passing of this scheme. Criticism of the scheme mainly revolved around the dilution of the democratic legitimacy of the Parliament since the electorate has no say in choosing the NMP based on his or her merits. Further, there may be doubts as to the NMP's commitment and willingness to serve as an MP, since the NMP bypasses the electoral process. The scheme has also given rise to allegations that it serves as another platform for the PAP to undercut support for the opposition. On the other hand, NMP [Paulin Tay Straughan](/wiki/Paulin_Tay_Straughan) has argued that NMPs, being non-partisan, do not replace either PAP or opposition MPs. During general elections, Singaporeans still continue to elect MPs who best represent their interests, and NMPs do not feature in the equation. In other words, the NMP scheme has never compromised the democratic process of free elections. #### By-elections A by-election is an election held in between general elections to fill a vacant parliamentary seat. Article 49 of the Constitution states that a vacancy not due to a dissolution of Parliament \"shall be filled by election in the manner provided by or under any law relating to the Parliamentary elections\". However, when a vacancy arises in a GRC, no election needs to be held unless all the MPs have vacated their seats. The Prime Minister has full discretion with regards to the timing of the by-election and he is not obliged to call a by-election within any fixed timeline. Whether a time frame should be imposed for the calling of by-elections has been subject to much debate. Several arguments have been advanced by the Government. First, when a voter casts a vote for a candidate, he is also voting for the political party that the candidate is a member of. Thus, once the party has received the voter's mandate, a vacant seat will not affect this mandate. Requiring the other members in a GRC to vacate their seats so that a by-election can be called would be unfair to them. Secondly, the Government believes that a GRC can function if it is lacking a member, as MPs from other constituencies can help to address the needs of residents in that GRC. However, Thio Li-ann believes that it is undesirable that the law does not impose a time frame for the calling of by-elections. If a by-election is not called promptly upon a parliamentary seat falling vacant, the electors in the GRC in question will be represented to a lesser extent. This is particularly pertinent where more than one MP vacates his or her seat or when the seat vacated is that of a minority candidate. Should the latter situation arise, the rationale behind the GRC scheme – to guarantee minority representation in Parliament – would be defeated. In an SMC, only one candidate is elected to represent the constituency in question. Thus, if an SMC parliamentary seat is vacated and the Prime Minister exercises discretion not to call a by-election in the SMC, the constituency's residents will not only lack a representative in Parliament but will also be without a [Town Council](/wiki/Town_council#Singapore) chairman. Finally, where an MP of the ruling party vacates his or her seat, a counterpart in a neighbouring ward may take over his or her functions, thus eliminating the need for a by-election. However, this arrangement may not work if an opposition MP vacates his or her seat and no by-election is called, because of the dearth of opposition MPs in Parliament. Therefore, the voters in the opposition ward will be denied of representation until the next general election. ### Elected President Singapore's Elected Presidency scheme was created as a constitutional safeguard for the nation's future to prevent irresponsible governance. Being directly elected by the people gives the President legitimacy and moral authority to serve as a check on the executive's powers. The President's two main responsibilities are the protection of Singapore's past reserves and the preservation of the integrity of the public service. However, the President's role is custodial and ceremonial – he does not exercise executive powers. In fact, the President is generally required to act in accordance with the advice of the Cabinet, or of a Minister acting under the general authority of the Cabinet, in the exercise of his functions under the Constitution or any other written law, unless the contrary is expressly provided for. #### Stringent eligibility requirements and the Presidential Elections Committee's role Thio Li-ann has said that the democratic character of the process for [electing the President](/wiki/Presidential_elections_in_Singapore) may be hampered by the application of stringent, elitist criteria, such that it becomes a \"clear obstacle to the unmediated expression of the citizens' preferences\". Imposing more stringent criteria for the President than for the Prime Minister appears unreasonable, considering how the Prime Minister's governing powers are far more substantial than that of the President. Among other things, candidates have to be above 45 years of age and must either presently hold or in the past have held high public office or directorships in private sector companies with paid-up capitals of at least [S$](/wiki/Singapore_dollar)100 million. It has been estimated that \"only just over 400 people have the necessary financial or administrative experience to qualify as spelt out in the constitution\". These onerous qualifying criteria have greatly reduced the pool of candidates, and have been criticised as \"technocratic rather than democratic\". In response to the criticisms, Prime Minister Lee Hsien Loong argued that the qualification process is necessary and was \"carefully designed to ensure that the electorate is presented with qualified candidates\". The Prime Minister asserted it would be \"reckless\" to adopt less stringent criteria, though such criteria can be \"refined further over time\". Potential presidential candidates are vetted by an unelected three-member Presidential Elections Committee (\"PEC\"). The PEC is not constitutionally obliged to give reasons behind its decisions to award or deny a certificate of eligibility. Its decision is not subject to legal or political scrutiny, and its verdict is final. There has been criticism of how [Andrew Kuan](/wiki/Andrew_Kuan), who applied to be a candidate in the [2005 presidential election](/wiki/2005_Singaporean_presidential_election), was denied a certificate of eligibility. Before the PEC could reach a decision on the matter, he was reportedly discredited though statements from various people which were published in the media that alleged incompetence and cast doubt on his character. Subsequently, Kuan was denied a certificate, the PEC stating that his seniority and responsibility as the [Jurong Town Corporation](/wiki/JTC_Corporation)'s Group Chief Financial Officer were not comparable to the experience of a chairman or chief executive officer of a [statutory board](/wiki/Government_of_Singapore#Statutory_boards) or a company with a paid-up capital of at least $100 million, as required by the Constitution. There is no legal requirement for the PEC to interview prospective candidates, and it did not do so to allow Kuan to explain his side of the story. As a result, the unopposed incumbent S.R. Nathan was declared the President for a second term. Possible reforms might be for prospective candidates to have the right to publicly respond to negative accusations before the PEC, and for the PEC to be more transparent with regard to the reasons for their decisions concerning the eligibility of candidates. A more democratised process open to public scrutiny would give citizens a role to play, thus enhancing the notion of representative democracy. #### Uncontested elections After [Ong Teng Cheong](/wiki/Ong_Teng_Cheong), the first Elected President, had stepped down, the subsequent [presidential elections in 1999](/wiki/1999_Singaporean_presidential_election) and (/wiki/2005_Singaporean_presidential_election) were uncontested, and [S.R. Nathan](/wiki/S._R._Nathan) was deemed to have been elected unopposed for two consecutive terms. Thio has commented: > The right to vote in competitive elections is integral to a functioning democracy and its underlying principles of representation, participation, and legitimacy. Unfortunately, the phenomenon of election by default, a regular feature of Singapore's parliamentary and presidential elections, only harms the practice of democracy. She has suggested that to ensure that the institution of the Elected President continues to be legitimate, even if there is only one candidate in an election a vote should be held, and the candidate only declared elected if he or she receives at least a specified percentage of votes. ### Prime Minister and the Cabinet Singapore's Prime Minister is the Head of the Government of Singapore. The President appoints as Prime Minister an MP who, in his or her judgement, is likely to command the confidence of a majority of the MPs. This is a [power that the President exercises](/wiki/Powers_of_the_President_of_Singapore) in his or her personal discretion. The President then acts in accordance with the advice of the Prime Minister to appoint other Ministers from among the Members of Parliament. These Ministers, together with the Prime Minister, form the Cabinet. The Cabinet has the general direction and control of the Government and is [collectively responsible](/wiki/Cabinet_collective_responsibility) to Parliament. This scheme can be seen as a mechanism for representation. First, MPs are chosen by the electorate to represent their concerns and needs in Parliament. Secondly, the Prime Minister, who is vested with the confidence of majority of the MPs, and the Cabinet which is made up of popularly elected MPs, effectively represent the views of the electorate as he heads the Government. The structure of the executive is therefore based on the concept of political representation. ## Role of the judiciary ### Appointment and independence of judges Article 93 of the Constitution vests [judicial power](/wiki/Judicial_system_of_Singapore#Judicial_power) in the [judiciary](/wiki/Judicial_system_of_Singapore). Rather than being elected, the [Chief Justice](/wiki/Chief_Justice_of_Singapore), Judges of Appeal, and the judges of the [Supreme Court](/wiki/Supreme_Court_of_Singapore) are appointed by the President if he, acting in his discretion, concurs with the advice of the Prime Minister. In the [Subordinate Courts](/wiki/Subordinate_Courts_of_Singapore), district judges and magistrates are appointed by the President on the recommendation of the Chief Justice. The idea of the [rule of the majority](/wiki/Majority_rule) means that people should only be governed by laws passed by their elected representatives. Thus, unelected judges influencing the laws that govern people through the making of decisions seems incompatible with the idea of representative democracy. It has also been said that a judicial \"last word\" would put the judiciary at odds with Parliament, as the judiciary is not directly accountable to the people. However, even though the appointment of judges is [counter-majoritarian](/wiki/Counter-majoritarian_difficulty) in nature, this does not mean that the concept of representative democracy is undermined, as it appears that a counter-majoritarian judiciary more effectively upholds the Constitution and the concept of representative democracy. Because of this vital responsibility that the judiciary has, it is important that the judiciary is [independent](/wiki/Judicial_independence_in_Singapore) of the political branches of government. As [Alexander Hamilton](/wiki/Alexander_Hamilton) put it: \"The complete independence of the courts of justice is peculiarly essential in a limited constitution\". Singapore's judiciary, however, has been criticised as lacking independence and impartiality. According to the [United Nations Special Rapporteur](/wiki/United_Nations_Special_Rapporteur) on the independence of judges and lawyers, the criticisms involving judicial bias \"could have stemmed from the very high number of cases won by the government or members of the ruling party in either contempt or defamation suits brought against government critics, whether media or individual\". The Government is alleged to have used the judiciary as a tool to deluge their political opponents like [J.B. Jeyaretnam](/wiki/J._B._Jeyaretnam), [Tang Liang Hong](/wiki/Tang_Liang_Hong) and Dr. [Chee Soon Juan](/wiki/Chee_Soon_Juan) with litigation, in some cases causing bankruptcy and, eventually, removal from the political scene. In a 2008 report, the [International Bar Association](/wiki/International_Bar_Association) Human Rights Institute (\"IBAHRI\") claimed that the \"slim likelihood\" of a successful defence to defamation, combined with high damages awarded in cases involving PAP officials, \"sheds doubt on the independence of the judiciary in these cases\". Allegations of this nature have previously been denied in parliamentary debates, and the [Ministry of Law](/wiki/Ministry_of_Law_(Singapore)) has said the IBAHRI's allegation that there are reasons to worry about the executive's influence over judicial decision-making is not supported by evidence. In 2000, [Senior Minister](/wiki/Senior_Minister_of_Singapore) Lee Kuan Yew noted that \"[o]ur judiciary and the rule of law are rated by WEF [[World Economic Forum](/wiki/World_Economic_Forum)], IMD [[International Institute for Management Development](/wiki/International_Institute_for_Management_Development)] and PERC [Political and Economic Risk Consultancy] as the best in Asia\". ### Upholding the Constitution The Constitution embodies the idea of representative democracy, as it provides for alternative voices and minority representation in Parliament through the GRC, NCMP and NMP schemes. The [Chief Justice of Canada](/wiki/Chief_Justice_of_Canada), [Beverley McLachlin](/wiki/Beverley_McLachlin), has commented that democracy itself is a lot more complicated than elected persons making law. Democracy not only requires majority rule, but rule that protects individuals and groups of individuals whilst promoting fairness. As Martin Taylor puts it: > As our understanding of the nature of modern democratic government improves, it becomes increasingly apparent that majority rule, while an essential ingredient of the system, can operate in ways which are as undemocratic as the rule of the minority – that democracy has to do not only with who exercises the power of the state, by and for the people, but also with the manner in which the state treats those who seek its assistance, or are obliged to submit to its authority, and with what the state allows people to decide and do of, by and for themselves. \"Majority rule\" must be subject to limits, as an elected government may still pass or be tempted to pass unconstitutional and undemocratic laws, such as laws affecting fundamental liberties guaranteed by constitutions. The Singapore Constitution provides safeguards against such behaviour by the majority, and prescribes limits to their powers in the form of, among other things, the fundamental liberties in Part IV of the document. The courts have asserted that the judiciary thus has the power and duty to ensure the observance of constitutional provisions, and is also responsible for declaring invalid any exercise of legislative power exceeding the limits conferred by the Constitution, or contravening any prohibition that the Constitution provides. Supreme Court judges take an oath to defend and protect the Constitution before assuming office. This is done through [judicial review](/wiki/High_Court_of_Singapore#Judicial_review_jurisdiction), where the judiciary prevents the Parliament from enforcing unconstitutional laws by striking down such laws. Thus, the judiciary essentially upholds the idea of representative democracy that the Constitution embodies when playing its counter-majoritarian role of serving as a check on Parliament and a \"Protector of the Individual\". ### Purposive interpretation of statutes A key idea of democracy is that \"people may consent to be governed by laws made by ... democratically elected representatives\". Judges are required to interpret statutes in a manner that gives \"effect to the intent and will of Parliament\". By interpreting statutes according to Parliament's intention, the judiciary upholds the notion of representative democracy as it makes sure that the people are ruled accurately by the laws made by their elected leaders. Thus, the role of judges in [interpretation](/wiki/Statutory_interpretation) is essential to democracy. Judges are required to interpret laws in the light of section 9A(1) of the Interpretation Act, which requires an interpretation that would \"promote the purpose or object\" underlying written law is to be \"preferred\" over an interpretation that would not, thus mandating a [purposive interpretation](/wiki/Purposive_approach). The Interpretation Act provides for the types of extrinsic materials and the circumstances under which such extrinsic materials can be referred to, to aid judges in determining the purpose of the statute. Thus, when determining the purpose of a statutory provision, a judge can refer to relevant extrinsic materials such as the explanatory statement relating to the bill in which the provision appears and the speech made in Parliament by a minister moving a motion for the [second reading](/wiki/Reading_(legislature)#Second_reading) of the bill, when circumstances call for it. The view has been taken that judges may assign meaning to vague constitutional provisions or statutes on the basis of their own ideological preferences, hence disregarding Parliament's intention. This criticism arguably does not suggest the need to abandon interpretation by reference to the legislature's intention, but serves to highlight the importance of the need to use the power of interpretation in an appropriate manner. ## Freedom of speech and expression Democracy essentially means rule of the people. To build a democratic society and rule, there must be citizen participation by an informed electorate. The [freedom to speak and express](/wiki/Freedom_of_speech) is thus crucial for the formation of public opinion on political questions, and is indispensable to the discovery and spread of political truth. In Singapore, the right to freedom of speech and expression is guaranteed to [citizens](/wiki/Singaporean_nationality_law) by [Article 14(1)(a)](/wiki/Article_14_of_the_Constitution_of_Singapore) of the Constitution, though it is subject to many qualifications. Parliament may by law impose restrictions on the right as it considers necessary or expedient in the interest of the security of Singapore, friendly relations with other countries, public order or morality, and restrictions designed to protect the [privileges of Parliament](/wiki/Parliament_of_Singapore#Privileges_and_immunities) or to provide against [contempt of court](/wiki/Contempt_of_court), defamation or incitement to any offence. ### Role in a representative democracy Upholding the concept of representative democracy requires the protection of freedom of expression. This paves the way for discussion of the state of affairs in the country, as expressed by representatives of the people, which include members of the ruling party elected into government as well as opposition politicians. Free discourse about political ideas and government plans can facilitate the acknowledgement of current weaknesses or limitations. This is justified in the name of public interest as the legislature, administration and governmental institutions will then strive to make improvements. Restricting speech inevitably prevents ascertainment and publication of true facts and accurate judgements – it entails an unwarranted \"assumption of infallibility\" on the part of the government. As argued by [John Stuart Mill](/wiki/John_Stuart_Mill) and analysed by [Eric Barendt](/wiki/Eric_Barendt), allowing freedom of speech ensures that the government's policies are right and appropriate to legislate; even the possibility of false speech should not prevent genuine expression of true beliefs. Nevertheless, since inflammatory speech that may provoke disorder must be prevented, a government should be entitled to prioritise public order considerations over permitting individuals to express their personal opinions. Balancing the risk of damage and disorder against long-term benefits of uninhibited debate is imperative. ### Government's position As society matures, the Singapore Government has taken greater cognisance of educated and informed Singaporeans who place greater value on their rights of expression and call for a less restrictive culture. In 2004, Lee Hsien Loong, then Deputy Prime Minister, expressed how the Government would be \"increasingly guided by the consensus of views in the community with regards to morality and decency issues\" in a bid to \"pull back from being all things to all citizens\". However, he emphasised the caveat of \"opening up more choices for citizens, without imposing on the whole of society\". Civic participation may be engaged through debates on policies and national issues, but criticism which \"scores political points and undermines the government's standing, whether or not this is intended\" will not be treated lightly. When the opposition criticises an action or policy, the Government \"necessarily has to rebut or even demolish them, so not to lose its moral authority\". In a parliamentary speech on 28 February 2008, Deputy Prime Minister [Wong Kan Seng](/wiki/Wong_Kan_Seng) said that the Government had adjusted its policies in relation to various types of expression. For instance, in 2000 it had created [Speakers' Corner](/wiki/Speakers%27_Corner,_Singapore) as an outdoor venue for political speeches. Use of this venue was liberalised in 2004 to include performances and exhibitions. All public talks held indoors involving organisers and speakers who are Singapore citizens are also exempted from the licensing requirements of the Public Entertainments and Meetings Act. However, freedom of speech and expression, though characteristic and imperative in a self-professed democracy, is not unfettered. The Government thus continues to require licences for events where the speeches relate to race or religion, and does not permit outdoor demonstrations to be held. ### Mechanisms for the exercise of free speech #### Freedom of speech and debate in Parliament The most direct way of upholding representative democracy is for elected MPs to highlight and address the concerns of the electorate during Parliament sessions. Opposition MPs, NCMPs and NMPs fulfil the important role of representing diverse views and enunciating various needs to the Parliament. At the general election in May 2011, six opposition MPs from the [Workers' Party of Singapore](/wiki/Workers%27_Party_of_Singapore) were elected to Parliament. In section 5 of the Parliament (Privileges, Immunities and Powers) Act, enacted pursuant to Article 63 of the Constitution, the freedom of MPs to speak and express themselves in Parliament is provided for in the following terms:\n",
  "language": "en",
  "processed_at": "2026-01-12T11:47:44.510090",
  "title": "Representative democracy in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Representative_democracy_in_Singapore"
}