{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:39:54.102381"
  },
  "content": "Air service branch of Singapore's militaryMilitary unit The **Republic of Singapore Air Force** (**RSAF**) is the [aerial](/wiki/Aerial_warfare) [service branch](/wiki/Military_branch) of the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF) responsible for [controlling](/wiki/Air_supremacy) and defending the airspace of the country, and providing air support to the [Army](/wiki/Singapore_Army) and [Navy](/wiki/Republic_of_Singapore_Navy). It was established in 1968 as the **Singapore Air Defence Command** (**SADC**) before renaming to its current name in 1975. As one of the larger and more technologically advanced air forces in Southeast Asia, the RSAF has undertaken a significant role in Singapore's [military defence](/wiki/Total_Defence_(Singapore)#Military_defence) strategy since its formation. The RSAF is one of the more modern air forces in the region. The RSAF currently has four domestic airbases – [Paya Lebar](/wiki/Paya_Lebar_Air_Base), [Changi](/wiki/Changi_Air_Base), [Sembawang](/wiki/Sembawang_Air_Base) and [Tengah](/wiki/Tengah_Air_Base) – as well as a training detachment at the civilian airport of [Seletar](/wiki/Seletar_Airport). The RSAF also has overseas detachments in various countries, most notably in Australia, France, Thailand and the United States. As of 2023, the RSAF has a strength of 6,000 active personnel. ## History ### Early years In January 1968, the United Kingdom, which by this time had lost most of its global prestige especially after the [Suez Crisis](/wiki/Suez_Crisis) and was facing major financial difficulties that were greatly exacerbated by the [devaluation of the pound](/wiki/Pound_sterling#Bretton_Woods), announced the imminent withdrawal of all its troops \"[East of Suez](/wiki/East_of_Suez)\" by the end of 1971. Prior to then, Singapore had depended heavily on Britain's [Royal Air Force](/wiki/Royal_Air_Force) (RAF) for its air defence, while the newly established [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF) had concentrated its efforts mainly on building up the land-based [Singapore Army](/wiki/Singapore_Army). The predecessor to the RSAF, the SADC, was formed on 1 September 1968. The SADC's immediate task was to set up the Flying Training School to train pilots. Qualified flying instructors were obtained through [Airwork Services Limited](/wiki/Airwork_Services), a company specialising in defence services. Basic training for pilots was carried out using two Cessna light aircraft hired from the Singapore Flying Club. The SADC also enlisted the help of the Royal Air Force which introduced the first flying training syllabus and provided two ex-RAF pilots as instructors, as well as facilities and services at [Seletar Airport](/wiki/Seletar_Airport). Finally, the first batch of six pilot trainees were sent to the [United Kingdom](/wiki/United_Kingdom) in August 1968 to undergo training in various technical disciplines. The training was based on the [Hawker Hunter](/wiki/Hawker_Hunter), the SADC's first air defence fighter. The following month, another pioneer group of technicians, this time from the rotary wing, were sent to France to begin their technical training on the [Aérospatiale Alouette III](/wiki/A%C3%A9rospatiale_Alouette_III) helicopter. In 1969, a number of local RAF technicians were released to join the fledgling SADC. These [local technicians (local other ranks)](/wiki/RAF_other_ranks) had experience working on fixed-wing RAF aircraft such as the Hawker Hunter, [Gloster Javelin](/wiki/Gloster_Javelin), [English Electric Canberra](/wiki/English_Electric_Canberra), [English Electric Lightning](/wiki/English_Electric_Lightning) and [Avro Shackleton](/wiki/Avro_Shackleton); as well as rotary-wing RAF aircraft such as the [Bristol Belvedere](/wiki/Bristol_Belvedere), [Westland Wessex](/wiki/Westland_Wessex) and [Westland Whirlwind](/wiki/Westland_Whirlwind_(helicopter)). Eight [Cessna 172K](/wiki/Cessna_172) aircraft—the SADC's first—arrived in May 1969 to be used for basic pilot training. By December, the first batch of students completed the course. Of these, six were sent to the UK to receive further training. On their return to Singapore in 1970, they were ready to operate the then newly acquired Hawker Hunter fighter aircraft. The pace of training pilots and ground crew picked up gradually. On 1 August 1969, Minister for the Interior and Defence, [Lim Kim San](/wiki/Lim_Kim_San), inaugurated the Flying Training School (FTS) at [Tengah Air Base](/wiki/Tengah_Air_Base) (then known as RAF Tengah). The inauguration of FTS brought SADC closer to its goal of fulfilling the heavy responsibility of defending Singapore's airspace. The subsequent arrival of the [BAC Strikemasters](/wiki/BAC_Strikemaster) in 1969, used for advanced phase flying training, meant that pilot trainees were now able to earn their initial wings locally rather than overseas. The first batch of locally trained fighter pilots were trained at the FTS and graduated in November 1970. Amongst this batch was 2LT [Goh Yong Siang](/wiki/Goh_Yong_Siang), who later rose to the appointment of Chief of Air Force on 1 July 1995. Gradually, the SADC had its own pilots, flying instructors, air traffic controllers, and ground crew. When Britain brought forward its plan to withdraw its forces by September 1971, the SADC was suddenly entrusted with a huge responsibility and resources. Britain's former air bases—[Tengah](/wiki/Tengah_Air_Base), [Seletar](/wiki/Seletar_Airport), [Sembawang](/wiki/Sembawang_Air_Base) and [Changi](/wiki/Changi_Air_Base)—were handed over to the SADC, as well as its air defence radar station and [Bloodhound II](/wiki/Bristol_Bloodhound) surface-to-air missiles. In 1973, the SADC procured [Shorts Skyvan](/wiki/Short_SC.7_Skyvan) search-and-locate aircraft and [Douglas A-4 Skyhawk](/wiki/Douglas_A-4_Skyhawk) fighter-bombers. With a reliable mix of fighters, fighter-bombers, helicopters and transport aircraft, the SADC was ready to assume the functions of a full-fledged air force. On 1 April 1975, the SADC was renamed the Republic of Singapore Air Force (RSAF). One of its first commanders was LTC Ee Tean Chye. ### 21st century The RSAF celebrated its 50th anniversary in 2018 with the theme \"Our Home, Above All\". The RSAF celebrated its Golden Jubilee with an extended flypast during the national day parade on 9 August and also performed 2 sessions of aerial display at the [Marina Barrage](/wiki/Marina_Barrage) on 11 and 12 August. **Combat operations** - 2004–2008: [Multi-National Force – Iraq](/wiki/Multi-National_Force_%E2%80%93_Iraq). Aircraft participated in the [Iraq War](/wiki/Iraq_War) and returned home after two or three months of deployment in the [Persian Gulf](/wiki/Persian_Gulf) without any ground troops involved. Singapore's withdrawal was acknowledged on 23 December 2008. - May 2007–June 2013: [International Security Assistance Force](/wiki/International_Security_Assistance_Force). Deployment of close to 500 personnel including those from the Republic of Singapore Air Force, as part of Singapore's contributions to the multinational stabilisation and reconstruction efforts in [Afghanistan](/wiki/War_in_Afghanistan_(2001%E2%80%932021)). - 2014–2015: [Military intervention against ISIL](/wiki/Military_intervention_against_ISIL). Offering military aid in the ongoing [war on terror](/wiki/War_on_terror) with a [Boeing KC-135 Stratotanker](/wiki/Boeing_KC-135_Stratotanker) and assistant intelligence analysts. ### Description of logo The crest consists of the national coat of arms supported by the silver wings of the Air Force within a bowl of golden laurels. ## List of chiefs of Air Force No.PortraitName (born–died)Term of officeRef.Took officeLeft officeTime in officeCommander, Singapore Air Defence Command1Ee Tean Chye197019721–2 yearsDirector Air Staff1John Francis Langer197319751–2 years2W E Kelly197519750 years3D J Rhodes197519760–1 years4Murray Alexander Turnbull197619770–1 years5Liu Ching Chuan197719802–3 yearsDeputy Commander, Republic of Singapore Air Force1Colonel [Michael Teo Eng Cheng](/wiki/Michael_Teo_Eng_Cheng) (born 1948)198019821–2 years2Gary Yeo Ping Yong198219841–2 years(1)Colonel [Michael Teo Eng Cheng](/wiki/Michael_Teo_Eng_Cheng) (born 1948)198419850–1 yearsCommander, Republic of Singapore Air Force1Brigadier-general [Michael Teo Eng Cheng](/wiki/Michael_Teo_Eng_Cheng) (born 1948)198519904–5 yearsChief of Air Force1Brigadier-General [Michael Teo Eng Cheng](/wiki/Michael_Teo_Eng_Cheng) (born 1948)1 May 199031 August 19922 years, 122 days2Major-General [Bey Soo Khiang](/wiki/Bey_Soo_Khiang) (born 1955)1 September 199230 June 19952 years, 302 days3Major-General [Goh Yong Siang](/wiki/Goh_Yong_Siang) (born 1951)1 July 199530 June 19982 years, 364 days4Major-General [Raymund Ng Teck Heng](/wiki/Raymund_Ng) (born 1956)1 July 19981 April 20012 years, 274 days5Major-General [Lim Kim Choon](/wiki/Lim_Kim_Choon) (born 1958)1 April 200124 March 20064 years, 357 days6Major-General [Ng Chee Khern](/wiki/Ng_Chee_Khern) (born 1965)24 March 200610 December 20093 years, 261 days7Major-General [Ng Chee Meng](/wiki/Ng_Chee_Meng) (born 1968)10 December 200925 March 20133 years, 105 days8Major-General [Hoo Cher Mou](/wiki/Hoo_Cher_Mou) (born 1966)25 March 201328 March 20163 years, 3 days9Major-General [Mervyn Tan Wei Ming](/wiki/Mervyn_Tan) (born 1972)28 March 201622 March 20192 years, 359 days10Major-General [Kelvin Khong Boon Leong](/wiki/Kelvin_Khong) (born 1976)22 March 201922 March 20245 years, 0 days11Major-General [Kelvin Fan Sui Siong](/wiki/Kelvin_Fan) (born 1980)22 March 2024*Incumbent*1 year, 296 days ## Organisation ### Commands and units On 5 January 2007, Defence Minister [Teo Chee Hean](/wiki/Teo_Chee_Hean) announced that the Air Force organisation chart will be re-structured into five major commands, namely the Air Defence and Operations Command (ADOC), the Air Combat Command (ACC), the Participation Command (PC), the Air Power Generation Command (APGC) and the Unmanned Aerial Vehicle (UAV) Command (UC). The first to be inaugurated was ADOC, along the restructuring announcement. Air Defence and Operations Command is the principal agency in charge of planning and executing peacetime operations and air defence. ADOC is also responsible for providing ground-based air defence units of the RSAF. Unmanned Aerial Vehicle Command was the second command to be inaugurated and become operational in May 2007. The next command to be inaugurated was PC in January 2008.[*citation needed*] The last two commands, ACC and APGC, were inaugurated together in August 2008 in conjunction with the RSAF 40th Anniversary. The ACC will bring together fighter and transport squadrons under one command, with central planning, control and execution of the air battle in operations. The APGC will enhance the missions of the ACC by ensuring that all air bases remain operational at all times, as well as improving the servicing and turn-around of aircraft to ensure continuous and responsive operations.[*citation needed*] #### Air Combat Command (ACC) The ACC (\"Poised And Deadly\") is responsible for the planning, control and execution of the air battle in operations. It brings together all fighter and transport squadrons that will carry out these tasks under a single command which will be responsible for training the pilots and aircrew to think and operate in a fully integrated way. The ACC consists of the following groups: - HQ ACC - Integrated Systems Development Group (ISDG) - Operations Development Group (ODG) - Fighter Group (FG) (\"Decisive And Deadly\") - 140 Squadron (\"Stand Firm In Defence\") - 142 Squadron (\"Honour And Glory\") - 143 Squadron (\"We Dare\") - 145 Squadron (\"Swift And Valiant\") - 149 Squadron (\"Steadfast\") - Peace Carvin II – Luke Air Force Base, Arizona, USA - Peace Carvin V – Mountain Home Air Force Base, Idaho, USA - Transport Group (TG) (\"Project And Deliver\") - 111 Squadron (\"Vigilance In Control\") - 112 Squadron (\"Determined To Deliver\") - 121 Squadron (\"Seek And Destroy\") - 122 Squadron (\"Dependable\") #### Air Power Generation Command (APGC) The APGC (\"Generate And Sustain\") is set up to enable the RSAF to generate and sustain effective, timely and robust air power to meet the operational needs of the SAF. With the APGC, higher operational efficiency within each RSAF Air Base, and secondly, greater integration across the four bases are achieved. Units are classified under Air Base Operability (ABO) and Aircraft Generation (AcG). The APGC consists of the following groups: - HQ APGC - Operations Development Group (ODG) - Airbase Medical Operations Centre (AMOC) - Changi Air Base (\"Together In Excellence\") - 208 Squadron (\"Reliable And Vigilant Always\") - 508 Squadron (\"Unrivalled Support\") - 608 Squadron (\"Vigour And Vigilance\") - 708 Squadron (\"Agile And Dependable\") - 808 Squadron (\"Ready And Vigilant\") - under 5 AELG - Paya Lebar Air Base (\"Strength Through Readiness\") - 207 Squadron (\"Support Towards Excellence\") - 507 Squadron (\"Forever Onward\") - 607 Squadron (\"Dare Us\") - 707 Squadron (\"Resolute And Responsive\") - 7 Air Engineering and Logistics Group (7 AELG) (\"Pride In Support\") - 807 Squadron (\"Swift And Effective\") - 817 Squadron (\"Dedicated And Precise\") - Sembawang Air Base (\"Swift And Resolute\") - 206 Squadron (\"Precision In Control\") - 506 Squadron (\"Steadfast Support\") - 606 Squadron (\"Uphold And Persevere\") - 706 Squadron (\"Swift And Reliable\") - 6 Air Engineering and Logistics Group (6 AELG) (\"Swift And Steadfast\") - 806 Squadron (\"Agile And Expeditious\") - 816 Squadron (\"Precise And Dependable\") - Tengah Air Base (\"Always Vigilant\") - 205 Squadron (\"Excellence And Beyond\") - 505 Squadron (\"Swift and Tenacious\") - 605 Squadron (\"Alert And Steadfast\") - 705 Squadron (\"Zeal In Duty\") - 5 Air Engineering and Logistics Group (5 AELG) (\"Excellence Always\") - 805 Squadron (\"Responsive And Dependable\") - 815 Squadron (\"Swift And Precise\") The four support squadrons still remain organic to each Base but are under direct command of APGC. These four squadrons are: Airfield Maintenance Squadron (AMS), Ground Logistics Squadron (GLS), Field Defence Squadron (FDS) and Flying Support Squadron (FSS). The Airbase Medical Operations Centre (AMOC) was formed from the Medical Flights of each GLS in November 2025. #### UAV Command (UC) The main structures under UC (\"Persistent And Precise\") are Operations & System Development Group (OSDG), headed by the Deputy Commander of UC. UC consists of the following groups: - HQ UC - UAV Group (UG) (\"Persistent And Focused\") - 116 Squadron (\"Courageous And Tenacious\") - 119 Squadron (\"Precise And Cohesive\") - 128 Squadron (\"Focused And Ready\") - Imagery Exploitation Group (IXG) (\"Precise And Timely\") - 129 Squadron (\"Swift And Sharp\") - 138 Squadron (\"Poised To Deliver\") - 1 Air Engineering and Logistics Group (1 AELG) (\"Swift And Sure\") - 801 Squadron (\"Swift And Dependable\") - 811 Squadron (\"Persistent And Sure\") #### Air Defence & Operations Command (ADOC) The ADOC (\"Vigilant & Ready\") consist of the following: - HQ ADOC - Air Surveillance Control Group (ASCG) (\"Vigilant And Decisive\") - 200 Squadron (\"Sense Fight Kill\") - 202 Squadron (\"Decisive And Resilient\") - 203 Squadron (\"Serve To Preserve\") - National Air Defence Group (ADG) (\"Ever Vigilant\") - 160 Squadron (\"Alert Always\") - 163 Squadron (\"Above The Best\") - 165 Squadron (\"Pride In Protection\") - Air Operations Control Group (AOCG) (\"Always In Control\") - 9 Air Engineering and Logistics Group (9 AELG) (\"With Unity We Support\") - 113 Squadron (\"Mission First\") - 809 Squadron (\"Ready And Swift\") - 819 Squadron (\"Precise And Reliable\") #### Participation Command (PC) The PC (\"Integrate & Dominate\") consists of the following groups: - HQ PC - Operations Development Group (ODG) - Helicopter Group (HeliG) (\"Dare & Will\") - 120 Squadron (\"Strive To Achieve\") - 123 Squadron (\"Swift And Precise\") - 125 Squadron (\"Swift And Bold\") - 126 Squadron (\"Ready And Able\") - 127 Squadron (\"Strength Courage Swiftness\") - Peace Vanguard (\"Forging Ahead\") – Marana, Arizona, USA - Tactical Air Support Group (TASG) (\"Integrated & Ready\") - 1 Medical Squadron (\"Courage And Conviction\") - 101 Squadron - 102 Squadron - 103 Squadron (\"Swift and Prompt\") - 105 Squadron (\"Robust And Resolute\") - Divisional Air Defence Group (DAG) (\"Vigilant And Lethal\") - 3 Divisional Air Defence Artillery (\"Vigilant And Valiant\") - 6 Divisional Air Defence Artillery (\"Vigilant And Valiant\") - 9 Divisional Air Defence Artillery (\"Vigilant And Valiant\") - 18 Divisional Air Defence Artillery (\"Always Ahead\") - 201 Squadron (\"Deploy Detect Defend\") - DAG MTC (\"Move Forward Safely\") #### Air Force Training Command (AFTC) The Air Force Training Command Archived 5 December 2019 at the [Wayback Machine](/wiki/Wayback_Machine) (AFTC) is an amalgamation of the former Air Force School, Flying Training School and UAV Training school which facilitates training of future pilots and ground crew of the RSAF. It is located at 550 Airport Road, Singapore 534236. The training schools and squadrons under AFTC (\"Excellence\") consist of the following: - HQ AFTC - Flying Training Institute (FTI) (\"Strength Through Knowledge And Skills\") - 124 Squadron (\"Strive For Excellence\") - 130 Squadron (\"Aim To Strike\" or \"Eagle\") – RAAF Base Pearce, Perth, Western Australia, Australia - 150 Squadron (\"Forward We Strive\") – Cazaux Air Base, France - Air Grading Centre (\"Soar Through Knowledge\") – Jandakot, Perth, Western Australia - Standards Squadron (\"Pride Through Professionalism\") - UAV Training School (\"Redefine Perfection\") - Air Warfare Training Institute (AWTI) (\"Excellence Through Knowledge And Skills\") - AWO School (\"Competency Through Knowledge\") - ADSS School (\"Look Forward\") - AOSX School - Air Intelligence School - Air Engineering Training Institute (AETI) (\"Towards Excellence\") - Advanced AFE School (\"Inspiring Excellence\") - Aircraft Engineering School (\"Engineering Excellence\") - Civil Engineering School (\"Excellence In Resilience\") - Networks, C2 and Air Defence School (\"Excellence In Networked Air Defence\") - Supply Chain School (\"Delivering Excellence\") - Training Development Group (TDG) #### Retired units - 130 Squadron (Flying Training School at Tengah) (1968-1994) BAC Strikemaster and S211 - 131 Squadron (\"Harrier\") (1983-1986 at Paya Lebar, 1979-1983 at Tengah) T-33A and S211 - 141 Squadron (\"Detect To Deter\") (1972- c.2008) Hawker hunters and F-5 also known as the Merlins - [144 Squadron](/wiki/144_Squadron,_Republic_of_Singapore_Air_Force) (\"Dare To Excel\") (1979- c 2015) F-5E/T ## Air bases This section **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources in this section. Unsourced material may be challenged and removed. *(November 2021)* *(Learn how and when to remove this message)* - **[Changi Air Base (West)](/wiki/Changi_Air_Base_(West))** - [121 Sqn](/wiki/121_Squadron,_Republic_of_Singapore_Air_Force) 10 Fokker 50 (Transport), 8 Fokker 50 ME2 (Maritime patrol) - **[Changi Air Base (East)](/wiki/Changi_Air_Base_(East))** - 112 Sqn 6 Airbus A330 MRTT (Aerial refuelling) - **[Paya Lebar Air Base](/wiki/Paya_Lebar_Air_Base)** - 122 Sqn 10 C-130H (Transport) - [142 Sqn](/wiki/142_Squadron,_Republic_of_Singapore_Air_Force) 20 F-15SG (Strike) - [149 Sqn](/wiki/149_Squadron,_Republic_of_Singapore_Air_Force) 20 F-15SG (Strike) - **[Sembawang Air Base](/wiki/Sembawang_Air_Base)** - [120 Sqn](/wiki/120_Squadron,_Republic_of_Singapore_Air_Force) 20 AH-64D Longbow Apache (Attack) - 123 Sqn 8 S-70B Seahawks (ASW) - 124 Sqn 5 EC120 Colibri (Training) - [125 Sqn](/wiki/125_Squadron,_Republic_of_Singapore_Air_Force) 16 H225M (Transport/SAR) - [126 Sqn](/wiki/126_Squadron,_Republic_of_Singapore_Air_Force) CH-47SD, CH-47F (Heavylift/SAR) - [127 Sqn](/wiki/127_Squadron,_Republic_of_Singapore_Air_Force) CH-47SD, CH-47F (Heavylift/SAR) - **[Tengah Air Base](/wiki/Tengah_Air_Base)** - [111 Sqn](/wiki/111_Squadron,_Republic_of_Singapore_Air_Force) 4 G550 (AEW & C) - 116 Sqn Hermes 450 (Reconnaissance) - [140 Sqn](/wiki/140_Squadron,_Republic_of_Singapore_Air_Force) 9 F-16C (Interceptor), 6 F-16D Blk 52 (Strike) - [143 Sqn](/wiki/143_Squadron,_Republic_of_Singapore_Air_Force) 5 F-16C (Interceptor), 8 F-16D Blk 52 (Strike) - [145 Sqn](/wiki/145_Squadron,_Republic_of_Singapore_Air_Force) 20 F-16 Blk 52+ - [RSAF Black Knights](/wiki/RSAF_Black_Knights) – RSAF's aerobatic team. (Disbanded) - **[Chong Pang Camp](/wiki/Chong_Pang_Camp) SADA (Singapore Air Defence Artillery)** - 3rd DA RBS-70 SAM, IGLA SAM, Giraffe Radar - 6th DA RBS-70 SAM, IGLA SAM, Giraffe Radar - 9th DA RBS-70 SAM, IGLA SAM, Giraffe Radar - 18th DA RBS-70 SAM, Mistral SAM - [165 Sqn](/wiki/165_Squadron,_Republic_of_Singapore_Air_Force) Rapier SAM, RBS-70 SAM, SPYDER SAM - **[Lim Chu Kang Camp II](/wiki/Lim_Chu_Kang_Camp_II) SADA (Singapore Air Defense Artillery)** - 163 Sqn Raytheon I-HAWK SAM (Medium altitude air defence)(*being replaced by Aster 30 SMTP) - 160 Sqn Oerlikon 35 mm AA Guns (Airfield defence) - **[Choa Chu Kang Camp](/wiki/Choa_Chu_Kang_Camp)** - 201 Sqn FPS 117 Radar (Fighter control, SAM control, Surveillance, ASP) - **Other assets of SADA (Singapore Air Defense Artillery)** - 203 Sqn LORADS Radar (RASP, SAR, \"listening watch\" for distress signals) - **Murai Camp** - 119 Sqn [IAI Heron](/wiki/IAI_Heron) (Reconnaissance) - 128 Sqn 400 IAI Searcher (Reconnaissance) - **Classified** - 200 Sqn 'Air Defence'[*citation needed*] - 202 Sqn 'Network Management' ## Overseas detachments - [BA 120 Cazaux Airbase (France)](/wiki/Cazaux_Air_Base) - 150 Sqn, 12 × [Alenia Aermacchi M-346 Master](/wiki/Alenia_Aermacchi_M-346_Master) - **[Luke Air Force Base](/wiki/Luke_Air_Force_Base) (United States)** - [425 FTS](/wiki/425th_Fighter_Squadron), 8 × F-16C, 6 × F-16D+ ([Peace Carvin II F-16 Training](/wiki/F-16_Fighting_Falcon_operators#Summaries_of_F-16_deliveries)) - **[Mountain Home Air Force Base](/wiki/Mountain_Home_Air_Force_Base) (United States)** - [428 FTS](/wiki/428th_Fighter_Squadron), 20 × F-15SG, (Peace Carvin V F-15 Training) - **[Oakey Army Aviation Centre](/wiki/Oakey_Army_Aviation_Centre) (Australia)** - [127 Sqn](/wiki/127_Squadron,_Republic_of_Singapore_Air_Force), 6 × CH-47D (Training/Support for army exercises) - **[RAAF Base Pearce](/wiki/RAAF_Base_Pearce) (Australia)** - 130 Sqn, 19 × PC-21 (Basic Training) - **Silverbell Army Heliport (United States)** - E/1-285th AVN, 8 × AH-64SG (AH-64SG Training) - **[Udorn Royal Thai Air Force Base](/wiki/Udorn_Royal_Thai_Air_Force_Base) (Thailand)** - For F-16 training with [Royal Thai Air Force](/wiki/Royal_Thai_Air_Force) ## Overview The backbone of the RSAF is formed by the Block 52/52+ [F-16 Fighting Falcons](/wiki/F-16_Fighting_Falcon). These are armed with US-supplied [AIM-120C AMRAAM](/wiki/AIM-120_AMRAAM) missiles and [LANTIRN](/wiki/LANTIRN) targeting pods, laser guided munitions and [conformal fuel tanks](/wiki/Conformal_fuel_tank) for long-range strike. While Singapore initially bought as many as 70 F-16 planes, on 18 November 2004, it was announced that the RSAF would offer its remaining 7 F-16A/Bs to the [Royal Thai Air Force](/wiki/Royal_Thai_Air_Force). It is believed that these early Block 15OCU aircraft were upgraded to \"Falcon One\" standard by [ST Aerospace](/wiki/ST_Aerospace) before the transfer and delivered in late 2005. In return, the RSAF was permitted to train at the [Udon Royal Thai Air Force Base](/wiki/Udon_Thani_International_Airport) in north-east Thailand for a specified number of days each year. This would mean that the RSAF will operate only the Block 52/52+ model, as many as 62 F-16CJ/DJ planes.[*definition needed*] Due to severe airspace constraints within Singapore, the RSAF operates its aircraft at several overseas locations to provide greater exposure to its pilots. With the F-16C/D Fighting Falcons, [KC-135R Stratotankers](/wiki/KC-135_Stratotanker), [AH-64D Apaches](/wiki/AH-64_Apache) and [CH-47SD Chinook](/wiki/CH-47_Chinook#CH-47D) helicopters based in the United States, the [Marchetti S-211s](/wiki/Aermacchi_S-211), [PC-21s](/wiki/Pilatus_PC-21), and [Super Puma](/wiki/Eurocopter_Super_Puma) helicopters in [Australia](/wiki/Australia), and the [Alenia Aermacchi M-346 Master](/wiki/Alenia_Aermacchi_M-346_Master) in France, almost one third of the force's inventory is based outside Singapore. In 1994, the RSAF commenced a modernisation program for its fleet of approximately 49 operational (R)[F-5E and F-5F](/wiki/Northrop_F-5#Singapore) aircraft. The upgrade was performed by Singapore Technologies Aerospace (STAero) and the upgraded aircraft were designated (R)F-5S and F-5T respectively, operating from Paya Lebar Air Base. These upgraded F-5S/T, equipped with the Galileo Avionica's FIAR Grifo-F X-band Radar are thought to be capable of firing the AIM-120 AMRAAM missile but to date, no actual live-firing has actually been reported. For [in-flight refuelling](/wiki/In-flight_refuelling), four KC-135Rs and four [KC-130Bs](/wiki/Lockheed_Martin_KC-130) are commissioned to support the fighter force of F-16C/Ds and (R)F-5S/Ts. [Airborne Early Warning and Control](/wiki/Airborne_Early_Warning_and_Control) (AEW&C) capability was introduced in 1987 when four [E-2C Hawkeyes](/wiki/E-2_Hawkeye) were delivered to 111 Squadron. The duty of [Maritime Patrol and Coastal surveillance](/wiki/Maritime_patrol) is performed by the eight Fokker 50 MPA (entered service in 1991) of 121 Squadron, which can be armed with long-range anti-shipping [AGM-84 Harpoon](/wiki/Harpoon_(missile)) missiles and ASW torpedoes. As part of its fleet renewal process, the RSAF officially withdrew its fleet of [ST Aerospace A-4SU Super Skyhawk](/wiki/ST_Aerospace_A-4SU_Super_Skyhawk) from front-line service on 31 March 2005 after 31 years of operations. The A-4SUs' achievements included flying directly from Singapore to the Philippines, incorporating the RSAF's first air-to-air refuelling mission in 1986, as well as the excellent aerobatic display of the 'red and white' Super Skyhawks flown by the [RSAF Black Knights](/wiki/RSAF_Black_Knights) during Asian Aerospace 1990. A month before its retirement, the Skyhawk squadron won top honours in a strike exercise against its more modern F-16 and F-5 counterparts. Singapore ordered a total of twenty [AH-64D Apache Longbow](/wiki/AH-64_Apache) attack helicopters in two batches. After a long period of negotiations over the delivery of the sophisticated Longbow [Fire-control radar](/wiki/Fire-control_radar), the first batch of eight aircraft, fitted with the Fire Control Radar, was delivered on 17 May 2002. The second batch of 12 Apaches were ordered in 2001 even before the first delivery took place. All of the initial eight Apaches are based in the United States. Three of the Apache Longbows returned in January 2006 at the request of the Minister of Defence. Apart from the fifteen CH-47SDs delivered from 1996, a new batch of fifteen aircraft was ordered in 1997, with an option of four extra airframes. At least 30 CH-47SD have been delivered and are in service at Sembawang Air Base. It is believed that these had been upgraded to the SD standard prior to delivery. Eight CH-47SDs were also deployed to support the relief efforts in the aftermath of the [2004 Indian Ocean earthquake and tsunami](/wiki/2004_Indian_Ocean_earthquake_and_tsunami). It was the first and one of the few countries to reach the affected areas. The RSAF deployed dozens of C-130Hs, CH-47SDs and AS 332Ms there along with three of the RSN's latest Landing Ship Tanks (RSS Endurance, RSS Persistence and RSS Endeavour of the [*Endurance* class LST](/wiki/Endurance_class_landing_platform_dock_ship)) as well as [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) vehicles, engineers, and medical teams. In September 2005, the RSAF sent three CH-47SD Chinook helicopters, later augmented by a fourth CH-47SD Chinook, to provide assistance in the rescue and evacuation of stranded civilians after [Hurricane Katrina](/wiki/Hurricane_Katrina) struck New Orleans and nearby areas in the United States. The [humanitarian effort by Singapore](/wiki/Singaporean_response_to_Hurricane_Katrina) involved more aircraft than any other foreign countries. Since 2003, the RSAF has also made deployments of KC-135 tankers and C-130 aircraft to the [Persian Gulf](/wiki/Persian_Gulf) in support of the multinational efforts for the [reconstruction of Iraq](/wiki/Reconstruction_of_Iraq). RSAF personnel have carried out airlift, transportation and supply, and air-to-air refuelling missions in support of the multinational forces, assisting the [Coalition](/wiki/Multinational_force_in_Iraq) in carrying supplies and personnel, transporting humanitarian material and conducting medical evacuation operations. In September 2013, Defence Minister [Ng Eng Hen](/wiki/Ng_Eng_Hen) stated in a parliamentary reply that Singapore would soon acquire the [Aster 30](/wiki/Aster_(missile_family)#Land_systems) land-based missile system. RSAF day is celebrated on 1 September annually, in 2018 a combined flypast including the new A330 MRTT with a special 50th anniversary livery took place at [Tengah Air Base](/wiki/Tengah_Air_Base). ## Personnel Military ranks in the Singapore Armed Forces are identical across the three services except for the flag ranks of the [RSN](/wiki/Republic_of_Singapore_Navy). They are based on the Army model. The official table of ranks stops at three stars for all four services. Like the [Navy](/wiki/Republic_of_Singapore_Navy), the majority of Air Force personnel are regulars. This is due to the specialised and technical nature of many jobs. The employment of [National Servicemen](/wiki/Conscription_in_Singapore) in various roles are limited mostly to the infantry-like Field Defence Squadrons which do not require such specialised training. ## Aircraft In February 2003, Singapore joined the [JSF program's](/wiki/F-35_Lightning_II#Security_Cooperative_Participants_(SCP)) System Design and Development (SDD) Phase, as a Security Co-operation Participant (SCP). The first deliveries of the [F-35 Lightning II](/wiki/F-35_Lightning_II) are not expected before 2021, but replacement for the bulk of the A-4SUs was needed by 2007. As a start, 20 F-16D Block 52+ have been delivered from 2003 under project Peace Carvin IV. The RSAF embarked on its Next Generation Fighter (NGF) programme to replace the aging A-4SUs. The original list of competitors was shortlisted to the final two – [Dassault Rafale](/wiki/Dassault_Rafale) and the [Boeing](/wiki/Boeing_Defense,_Space_%26_Security) [F-15SG Strike Eagle](/wiki/McDonnell_Douglas_F-15E_Strike_Eagle#F-15SG). The F-15SG is a variant of the F-15E Strike Eagle and is similar in configuration to the F-15K sold to [South Korea](/wiki/South_Korea), but differs in the addition of the [APG-63(V)3](/wiki/APG-63_and_APG-70#AN/APG-63(V)3) active electronically scanned array (AESA) radar developed by [Raytheon](/wiki/Raytheon). The F-15SG is powered by two [General Electric](/wiki/General_Electric) [F110-GE-129](/wiki/General_Electric_F110) 29,400 lbf (131 kN) thrust engines. The DSTA (Defense Science & Technology Agency) conducted a detailed technical assessment, simulations, and other tests to assess the final selection. On 6 September 2005, it was announced that the F-15SG had won the contract over the Rafale. An initial order placed in 2005 for 12 aircraft with the option to purchase 8 more. On 22 October 2007, Singapore's [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) (MINDEF) exercised the option to purchase eight more F-15SG fighters as part of the original contract signed in 2005. Along with this buy, an additional order for four F-15SGs was made, bringing the total number of F-15SGs purchased by the start of 2008 to 24. In January 2005, it was announced that 6 [Sikorsky S-70](/wiki/Sikorsky_S-70)B (derivative of [SH-60 Seahawk](/wiki/SH-60_Seahawk)) naval helicopters will be purchased, complete with anti-surface and anti-submarine weapons and sensors. 2 more Seahawks were ordered in 2013. The Seahawks are operated by RSAF pilots, with System Specialists of the [Republic of Singapore Navy](/wiki/Republic_of_Singapore_Navy) operating the sensors and weaponry. They operate from the Navy's new [*Formidable* class frigates](/wiki/Formidable_class_frigate), and when operating from land are based at Sembawang Air Base. All 20 AH-64D Longbow attack helicopters have been delivered to the RSAF. 12 of these were deployed back to Singapore and took part in combined arms exercises with the Army, with the remaining 8 helicopters being part of the Peace Vanguard detachment based in the United States. In April 2007, it was announced that the 4 E-2C Hawkeyes were to be replaced with 4 Gulfstream G550s fitted with the [IAI EL/W-2085](/wiki/IAI_EL/W-2085) radar which would become the primary airborne early warning aircraft for the RSAF. Not included in the deal is an additional G550 as an AEW trainer, which will be acquired and maintained by ST Aerospace on behalf of RSAF. In July 2010, the [Alenia Aermacchi M-346 Master](/wiki/Alenia_Aermacchi_M-346_Master) was selected by the RSAF to replace the A-4SU in the Advanced Jet Training (AJT) role, currently based at **BA 120 Cazaux Air Base** in France. In a press release by the MINDEF on 28 September 2008, ST Aerospace had been awarded the contract to acquire twelve M-346 and a ground based training system on behalf of RSAF. As stipulated in the contract, ST Aerospace will act as the main contractor to maintain the aircraft after delivery by Alenia Aermacchi while Boeing would supply the training system. Delivery date is scheduled from 2012 onwards. The backbone of the transport fleet are the four KC-130B, one KC-130H and five C-130H Hercules transport aircraft, which are expected to remain in service through 2030, will be undergoing an extensive modernisation process to bring all ten existing airframes to the same common standard. The first airframe, a KC-130B, was returned to frontline service on 21 September 2010. ST Aerospace, the main contractor behind the project, is expected to upgrade the other nine airframes for the RSAF within the next seven years. Included in the package is the replacement of cockpit [flight management system](/wiki/Flight_management_system) with a modern [glass cockpit](/wiki/Glass_cockpit) avionics suite, central engine displays to replace analogue gauges, improved voice communications, digital autopilot, flight director as well as a digital weather radar, which will make the aircraft [Global Air Traffic Management](/wiki/Global_Air_Traffic_Management)-compliant. Also, the C-130Bs will receive an [auxiliary power unit](/wiki/Auxiliary_power_unit) and [environmental control system](/wiki/Environmental_Control_System) in common with the C-130Hs. Once the upgrade is completed, this will effectively give the RSAF five KC-130Hs and five C-130Hs. In December 2010, the RSAF issued a letter of request to inspect stored ex-US Navy [P-3C Orion](/wiki/P-3C_Orion) aircraft that have been retired from active duty. Lockheed Martin believes the RSAF has a requirement of 4 to 5 of these aircraft, which would be modernised extensively before reintroduction into active service. On 30 June 2018, Defence Minister [Ng Eng Hen](/wiki/Ng_Eng_Hen) announced that the F-16's replacement will be announced soon. Meanwhile, the KC-135Rs are being replaced by the A330 MRTT while replacements for other fixed-wing aircraft and helicopters are announced. On 18 January 2019, MINDEF officially confirmed the procurement of F-35s for a full evaluation of their capabilities and suitability before deciding on a full fleet to replace the aging F-16 fleet. On 1 March 2019, MINDEF announced that they will send a Letter of Request (LOR) to purchase 4 F-35s with an option of 8 more after the evaluation. On 9 January 2020 the U.S. [Defense Security Cooperation Agency](/wiki/Defense_Security_Cooperation_Agency) approved a possible sale to Singapore of four F-35B short takeoff and vertical landing ([STOVL](/wiki/STOVL)) variants with the option to purchase an additional eight F-35Bs and up to 13 [Pratt & Whitney F135](/wiki/Pratt_%26_Whitney_F135) engines and other related equipment for an estimated total cost of $2.75 billion. On 24 February 2023, MINDEF exercised its option and purchased an additional 8 F-35Bs currently on track for delivery by 2028, with the originally purchased 4 expected to be delivered by 2026. On 28 February 2024, [Dr Ng Eng Hen](/wiki/Ng_Eng_Hen) announced in parliament the procurement of 8 F-35A's expected to be delivered by 2030, tallying up a total of 20 F-35's on delivery. On 3 March 2025, Defence Minister Ng Eng Hen announced that the Fokker-50 Maritime Patrol Aircraft's replacement will be announced soon, with the [Boeing P-8A](/wiki/Boeing_P-8A) and [Airbus C295](/wiki/Airbus_C295) in consideration. On 10 September 2025, new Defence Minister [Chan Chun Sing](/wiki/Chan_Chun_Sing) informed [US Secretary of Defense](/wiki/US_Secretary_of_Defense) [Pete Hegseth](/wiki/Pete_Hegseth), that Singapore had decided to acquire 4 Boeing P-8As to replace the Fokker-50 Maritime Patrol Aircraft during his introductory visit to the US. Through its social media sites, the RSAF announced on 3 November 2025 that MINDEF/SAF will replace the [Hermes 450 (H450) UAV](/wiki/Elbit_Hermes_450), which had been in service since 2007 and was 'becoming obsolete', with the [Hermes 900 (H900) Unmanned Aerial Vehicle (UAV)](/wiki/Elbit_Hermes_900). ## Equipment ### Aircraft AircraftOriginRoleVariantIn serviceNotes[Combat aircraft](/wiki/Military_aircraft#Combat_aircraft)[F-15E Strike Eagle](/wiki/McDonnell_Douglas_F-15E_Strike_Eagle)[United States](/wiki/United_States)[Strike fighter](/wiki/Strike_fighter)[F-15SG](/wiki/McDonnell_Douglas_F-15E_Strike_Eagle#F-15SG)40[F-16 Fighting Falcon](/wiki/General_Dynamics_F-16_Fighting_Falcon)United States[Multirole](/wiki/Multirole_combat_aircraft)[F-16C/ D/D+](/wiki/General_Dynamics_F-16_Fighting_Falcon_variants#F-16C/D)59[F-35 Lightning II](/wiki/Lockheed_Martin_F-35_Lightning_II)United StatesMultirole[F-35A](/wiki/Lockheed_Martin_F-35A_Lightning_II) [F-35B](/wiki/Lockheed_Martin_F-35B_Lightning_II)20 on order[AEW&C](/wiki/Airborne_early_warning_and_control)[Gulfstream G550](/wiki/Gulfstream_G550)[Israel](/wiki/Israel) / United States[AEW&C](/wiki/Airborne_early_warning_and_control)[EL/W-2085](/wiki/EL/W-2085)4[Maritime patrol](/wiki/Maritime_patrol_aircraft)[Fokker 50](/wiki/Fokker_50)[Netherlands](/wiki/Netherlands)[Maritime patrol](/wiki/Maritime_patrol_aircraft)5[Boeing P-8](/wiki/Boeing_P-8_Poseidon)United StatesMaritime Patrol[P-8A](/wiki/P-8A)4 on order[Tanker](/wiki/Aerial_refueling)[KC-130 Hercules](/wiki/Lockheed_Martin_KC-130)United States[Aerial refueling](/wiki/Aerial_refueling) / [Transport](/wiki/Military_transport_aircraft)[KC-130B/H](/wiki/Lockheed_Martin_KC-130#Variants)5[Airbus A330 MRTT](/wiki/Airbus_A330_MRTT)[Europe](/wiki/Europe)Aerial refueling / Transport[KC-30A](/wiki/Airbus_A330_MRTT#Variants)6[Transport](/wiki/Military_transport_aircraft)[Fokker 50](/wiki/Fokker_50)NetherlandsTransport4[C-130 Hercules](/wiki/Lockheed_C-130_Hercules)United StatesTransport[C-130H](/wiki/Lockheed_C-130_Hercules#Variants)5[Helicopters](/wiki/Helicopter)[AH-64 Apache](/wiki/Boeing_AH-64_Apache)United States[Attack](/wiki/Attack_helicopter)[AH-64D](/wiki/Boeing_AH-64_Apache#AH-64D)19[CH-47 Chinook](/wiki/Boeing_CH-47_Chinook)United StatesTransport / [Utility](/wiki/Utility_helicopter)[CH-47SD/F](/wiki/Boeing_CH-47_Chinook#Other_export_models)26[SH-60 Seahawk](/wiki/Sikorsky_SH-60_Seahawk)United States[ASW](/wiki/Anti-surface_warfare) / [SAR](/wiki/Search_and_rescue)[S-70B](/wiki/Sikorsky_SH-60_Seahawk#Export_versions)8[Airbus Helicopters H225M](/wiki/Eurocopter_EC725)[France](/wiki/France)Transport / Utility133 on order[Trainer aircraft](/wiki/Trainer_aircraft)[Alenia M-346](/wiki/Alenia_Aermacchi_M-346_Master)[Italy](/wiki/Italy)[Primary trainer](/wiki/Trainer_aircraft)12[Pilatus PC-21](/wiki/Pilatus_PC-21)[Switzerland](/wiki/Switzerland)[Trainer](/wiki/Trainer_aircraft)19[Eurocopter EC120](/wiki/Eurocopter_EC120_Colibri)FranceTrainer5[UAV](/wiki/Unmanned_aerial_vehicle)[Hermes 900](/wiki/Elbit_Hermes_900)Israel[ISTAR](/wiki/ISTAR)rumoured 12Some copies possibly acquired before; pending order for more.[Hermes 450](/wiki/Elbit_Hermes_450)IsraelISTARunknownTo be replaced by Hermes 900.[Heron 1](/wiki/IAI_Heron)IsraelISTARunknown[Orbiter 4](/wiki/Aeronautics_Defense_Orbiter)IsraelISTARunknown #### Retired aircraft Previous aircraft operated by the RSAF consisted of the [Northrop Grumman E-2 Hawkeye](/wiki/Northrop_Grumman_E-2_Hawkeye), [Hawker Hunter F.74S](/wiki/Hawker_Hunter), [BAC Strikemaster Mk.84](/wiki/BAC_Strikemaster), [BAC Jet Provost T.52A](/wiki/BAC_Jet_Provost), [Lockheed T-33A](/wiki/Lockheed_T-33), [A-4S Skyhawk](/wiki/Douglas_A-4_Skyhawk), [A-4SU Super Skyhawk](/wiki/ST_Aerospace_A-4SU_Super_Skyhawk), [Northrop F-5S](/wiki/Northrop_F-5), [S.211](/wiki/SIAI-Marchetti_S.211), [Eurocopter AS332 Super Puma](/wiki/Eurocopter_AS332_Super_Puma), [Aérospatiale Alouette III](/wiki/A%C3%A9rospatiale_Alouette_III), [Bell 212](/wiki/Bell_UH-1N_Twin_Huey), [Bell UH-1H/B](/wiki/Bell_UH-1_Iroquois), the [Aérospatiale AS350](/wiki/Eurocopter_AS350_%C3%89cureuil), [Eurocopter Fennec](/wiki/Eurocopter_Fennec) helicopter, [Cessna 172](/wiki/Cessna_172)K, [Short Skyvan](/wiki/Short_Skyvan), [SIAI-Marchetti SF.260](/wiki/SIAI-Marchetti_SF.260), and the [Boeing KC-135](/wiki/Boeing_KC-135_Stratotanker). Previous drone fleet of the RSAF included the [Tadiran Mastiff](/wiki/Tadiran_Mastiff), [IAI Scout](/wiki/IAI_Scout) and [IAI Searcher](/wiki/IAI_Searcher). ### Armament NameOriginTypeNotes[Air-to-air missile](/wiki/Air-to-air_missile)[AIM-120C-5/C-7/C-8 AMRAAM](/wiki/AIM-120_AMRAAM)[United States](/wiki/United_States)[Beyond-visual-range missile](/wiki/Beyond-visual-range_missile)604 missiles obtained[AIM-9J/P/S Sidewinder](/wiki/AIM-9_Sidewinder)United StatesAAM400 / 264 / 96[AIM-9X Sidewinder](/wiki/AIM-9_Sidewinder#AIM-9X)United StatesAAM200 missiles obtained[AIM-7 Sparrow](/wiki/AIM-7_Sparrow)United StatesAAM400 missiles obtained[RAFAEL Python 4](/wiki/Python_(missile))[Israel](/wiki/Israel)AAM600 missiles obtained[Air-to-surface missile](/wiki/Air-to-surface_missile)/[Bombs](/wiki/Bombs)[GBU-10/GBU-12/GBU-49/GBU-50](/wiki/GBU-12_Paveway_II)United States[Laser-guided bomb](/wiki/Laser-guided_bomb)68 / 140[CBU-105](/wiki/CBU-105)United StatesUnguided bomb*Unknown*[GBU-38/B JDAM](/wiki/Joint_Direct_Attack_Munition)United StatesGPS / INS guided bomb700[GBU-39/B](/wiki/GBU-39_Small_Diameter_Bomb)United States[Precision-guided](/wiki/Precision-guided_munition) [glide bomb](/wiki/Glide_bomb)20 *(pending delivery)*[GBU-54/B LJDAM](/wiki/Joint_Direct_Attack_Munition)United StatesAir to groundUnknown[AGM-65B/D/G Maverick](/wiki/AGM-65_Maverick)United StatesAir to ground350[BGM-71 TOW](/wiki/BGM-71_TOW)United StatesAnti-armor500[AGM-114 Hellfire](/wiki/AGM-114_Hellfire)United StatesAnti-armor192[AGM-154A-1/C JSOW](/wiki/AGM-154_Joint_Standoff_Weapon)United StatesAir to ground214[Anti-ship missile](/wiki/Anti-ship_missile)[AGM-84 Harpoon](/wiki/Harpoon_(missile))United States44 missiles obtained ### Air defence NameOriginTypeIn serviceNotes[SAM](/wiki/Surface-to-air_missile)[MBDA SAMP/T](/wiki/Aster_(missile_family)#Land_systems)[France](/wiki/France) / [Italy](/wiki/Italy)[SAM](/wiki/Surface-to-air_missile) system12 launchersSAMP/T battery includes a command and control vehicle, Arabel radar, and up to six launchers, each with eight missiles[Rafael](/wiki/Rafael_Advanced_Defense_Systems) [SPYDER](/wiki/SPYDER)[Israel](/wiki/Israel)SAM system12 launchers75 [Python-5](/wiki/Python_(missile)#Python-5) / 75 [Derby](/wiki/Python_(missile)#Derby) missiles[MIM-23 Hawk](/wiki/MIM-23_Hawk)[United States](/wiki/United_States)SAM system4 systemsBeing replaced by ASTER 30[MBDA Mistral](/wiki/MBDA_Mistral)FranceSAM system600 missiles[Mechanised Igla](/wiki/Variants_of_the_M113_armored_personnel_carrier#Singapore)United States / [USSR](/wiki/USSR)SAM system300 missilesSix ready-to-fire Soviet Igla SAMs configured for short-range air defense (SHORAD) with some equipped with an advanced fire-control radar[MANPADS & AA Guns](/wiki/Anti-aircraft_warfare)[RBS 70](/wiki/RBS_70)[Sweden](/wiki/Sweden)[MANPADS](/wiki/MANPADS)500 missiles[9K38 Igla](/wiki/9K38_Igla)USSRMANPADS350 missiles[Oerlikon 35 mm twin cannon](/wiki/Oerlikon_35_mm_twin_cannon)[Switzerland](/wiki/Switzerland)Towed [anti-aircraft gun](/wiki/Anti-aircraft)34 ### Radars This section **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources in this section. Unsourced material may be challenged and removed. *(November 2021)* *(Learn how and when to remove this message)* [Radar](/wiki/Radar) systems consist of one [Lockheed Martin](/wiki/Lockheed_Martin) [AN/FPS-117](/wiki/AN/FPS-117) unit, and a six [Giraffe radar](/wiki/Giraffe_radar)’s from [Ericsson](/wiki/Ericsson) telecommunications. NameOriginTypeIn serviceNotesRadars[Lockheed Martin](/wiki/Lockheed_Martin) [AN/FPS-117](/wiki/AN/FPS-117)[United States](/wiki/United_States)Air search [radar](/wiki/Radar) system1Lockheed Martin P-STARUnited States20Thales-Raytheon Groundmaster 200[France](/wiki/France) / United States[Ericsson](/wiki/Ericsson) [GIRAFFE](/wiki/GIRAFFE_Radar)-S/AMB[Sweden](/wiki/Sweden)6Elta Systems EL/M-2084[Israel](/wiki/Israel)4[Tethered Aerostat Radar System](/wiki/Tethered_Aerostat_Radar_System)United States[Airborne ground surveillance](/wiki/Airborne_ground_surveillance) system2 ## Bases NameLocationUnit(s)[Changi Air Base](/wiki/Changi_Air_Base)[Changi](/wiki/Changi) - HQ Air Combat Command (HQ ACC) - HQ Air Surveillance and Control Group (HQ ASCG) - 112 Squadron (112 SQN) - [121 Squadron](/wiki/121_Squadron,_Republic_of_Singapore_Air_Force) (121 SQN) - 202 Squadron (202 SQN) - 203 Squadron (203 SQN) - 208 Squadron (208 SQN) - 508 Squadron (508 SQN) - 608 Squadron (608 SQN) - 708 Squadron (708 SQN) - 808 Squadron (808 SQN) [Chong Pang Camp](/wiki/Chong_Pang_Camp)[Yishun](/wiki/Yishun) - HQ Participation Command (HQ PC) - HQ 9 Air Engineering and Logistics Group (HQ 9 AELG) - HQ Air Defence Group (HQ ADG) - Motor Transport Company (DAG MTC) - 3 Divisional Air Defence Artillery (3 DA BN) - 6 Divisional Air Defence Artillery (6 DA BN) - 9 Divisional Air Defence Artillery (9 DA BN) - 18 Divisional Air Defence Artillery (18 DA BN) - 105 Squadron (105 SQN) - 165 Squadron (165 SQN) - 809 Squadron (809 SQN) - 819 Squadron (819 SQN) - 1 Medical Squadron (1 MS) Murai Camp[Western Water Catchment](/wiki/Western_Water_Catchment) - 119 Squadron (119 SQN) - 128 Squadron (128 SQN) [Paya Lebar Air Base](/wiki/Paya_Lebar_Air_Base)[Paya Lebar](/wiki/Paya_Lebar) - HQ Air Power Generation Command (HQ APGC) - 113 Squadron (113 SQN) - 122 Squadron (122 SQN) - [142 Squadron](/wiki/142_Squadron,_Republic_of_Singapore_Air_Force) (142 SQN) - [149 Squadron](/wiki/149_Squadron,_Republic_of_Singapore_Air_Force) (149 SQN) - 207 Squadron (207 SQN) - 507 Squadron (507 SQN) - 607 Squadron (607 SQN) - 707 Squadron (707 SQN) - 807 Squadron (807 SQN) - 817 Squadron (817 SQN) [Sembawang Air Base](/wiki/Sembawang_Air_Base)[Yishun](/wiki/Yishun) - [120 Squadron](/wiki/120_Squadron,_Republic_of_Singapore_Air_Force) (120 SQN) - 123 Squadron (123 SQN) - [125 Squadron](/wiki/125_Squadron,_Republic_of_Singapore_Air_Force) (125 SQN) - [126 Squadron](/wiki/126_Squadron,_Republic_of_Singapore_Air_Force) (126 SQN) - [127 Squadron](/wiki/127_Squadron,_Republic_of_Singapore_Air_Force) (127 SQN) - 206 Squadron (206 SQN) - 506 Squadron (506 SQN) - 606 Squadron (606 SQN) - 706 Squadron (706 SQN) - 806 Squadron (806 SQN) - 816 Squadron (816 SQN) [Seletar Airport](/wiki/Seletar_Airport)[Seletar](/wiki/Seletar) - 124 Squadron (124 SQN) [Tengah Air Base](/wiki/Tengah_Air_Base)[Tengah](/wiki/Tengah) - HQ Unmanned Aerial Vehicle Command (HQ UC) - HQ 1 Air Engineering and Logistics Group (HQ 1 AELG) - [111 Squadron](/wiki/111_Squadron,_Republic_of_Singapore_Air_Force) (111 SQN) - [140 Squadron](/wiki/140_Squadron,_Republic_of_Singapore_Air_Force) (140 SQN) - [143 Squadron](/wiki/143_Squadron,_Republic_of_Singapore_Air_Force) (143 SQN) - [145 Squadron](/wiki/145_Squadron,_Republic_of_Singapore_Air_Force) (145 SQN) - 205 Squadron (205 SQN) - 505 Squadron (505 SQN) - 605 Squadron (605 SQN) - 705 Squadron (705 SQN) - 805 Squadron (805 SQN) - 815 Squadron (815 SQN) - [RSAF Black Knights](/wiki/RSAF_Black_Knights) Bukit Gombak Camp[Bukit Batok](/wiki/Bukit_Batok) - HQ Air Defence and Operations Command (HQ ADOC) Lim Chu Kang Camp 2[Western Water Catchment](/wiki/Western_Water_Catchment) - 160 Squadron (160 SQN) - 163 Squadron (163 SQN) Choa Chu Kang Camp[Western Water Catchment](/wiki/Western_Water_Catchment) - 201 Squadron (201 SQN) ## Others ### RSAF Black Knights First formed in 1973 at Tengah Air Base, the **Black Knights** is RSAF's official aerobatic team and has been performing on an ad hoc basis since its inception, with volunteer pilots drawn from various front line squadrons within the RSAF. The [aerobatics](/wiki/Aerobatics) team has performed on events including the [Singapore Airshow](/wiki/Singapore_Airshow) 2014. ### RSAF Museum The RSAF maintains the Air Force Museum, which was first located at Changi Air Base before it was relocated to a purpose-built building currently situated at 400 Airport Road, Singapore 534234 adjacent to Paya Lebar Air Base. The museum is open to the public and showcases the air force's history and capabilities. Exhibits include the [Northrop Grumman E-2 Hawkeye](/wiki/Northrop_Grumman_E-2_Hawkeye) and numerous A-4SU Super Skyhawk.[*citation needed*] ### Tertiary institutions The Republic of Singapore Air Force has loaned several aircraft, and aircraft parts to the tertiary institutions in Singapore, including [Institute of Technical Education](/wiki/Institute_of_Technical_Education), [Ngee Ann Polytechnic](/wiki/Ngee_Ann_Polytechnic), [Singapore Polytechnic](/wiki/Singapore_Polytechnic), [Nanyang Polytechnic](/wiki/Nanyang_Polytechnic) and [Nanyang Technological University](/wiki/Nanyang_Technological_University) since 2005. Aircraft includes the A-4SU Super Skyhawk.[*citation needed*] ## Past symbols This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(November 2021)* *(Learn how and when to remove this message)* ### Roundel ### Ensign - [List of Republic of Singapore Air Force squadrons](/wiki/List_of_Republic_of_Singapore_Air_Force_squadrons) - [Singapore Wing, Malayan Auxiliary Air Force](/wiki/Singapore_Wing,_Malayan_Auxiliary_Air_Force) CitationsBibliography - About the FlightGlobal Group | AirSpace Announcement - Official website - Journal of the Singapore Armed Forces Archived 6 July 2008 at the [Wayback Machine](/wiki/Wayback_Machine) – Contains scholarly articles on military issues, including those pertaining to the SAF's transformation into a 3rd Generation Fighting Force - Ranks and Paramilitary Ranks of Singapore, accessed 23 October 2006. ### Video clips - \"Teamwork in action\" – A late 1970s RSAF documentary on [YouTube](/wiki/YouTube_video_(identifier)), accessed 24 May 2011. - RSAF 40th Anniversary Video – First Generation on [YouTube](/wiki/YouTube_video_(identifier)), accessed 24 January 2009. - RSAF 40th Anniversary Video – Second Generation on [YouTube](/wiki/YouTube_video_(identifier)), accessed 24 January 2009. - RSAF 40th Anniversary Video – Third Generation on [YouTube](/wiki/YouTube_video_(identifier)), accessed 24 January 2009. - RSAF's newly delivered F-15SG arrives at Mountain Home AFB on [YouTube](/wiki/YouTube_video_(identifier)), accessed 12 May 2009.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:39:54.102067",
  "title": "Republic of Singapore Air Force",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Operation_Blue_Angel"
}