{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:47:45.959748"
  },
  "content": "Post-secondary academic institution in SingaporeThis article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(March 2024)* *(Learn how and when to remove this message)*‹ The template *Infobox university* is being considered for merging. › **Republic Polytechnic** (**RP**) is a post-secondary education institution and [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the purview of the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) in [Singapore](/wiki/Singapore). Established in 2002, RP is renowned for its [sports science](/wiki/Sports_science) programs. It is also the first and only [polytechnic](/wiki/Polytechnic_(Singapore)) in Singapore to use the [problem-based learning](/wiki/Problem-based_learning) (PBL) [pedagogy](/wiki/Pedagogy) for all of its programs. Under the [problem-based learning](/wiki/Problem-based_learning) (PBL) [pedagogy](/wiki/Pedagogy), RP students will typically receive a problem statement from their lecturers at the start of each day before exploring the solutions to the problem in a group of three to five, and presenting the final solution to the class—where students will receive feedback from their lecturers and classmates. RP's alumni include seven-time [Paralympic](/wiki/Paralympic_Games) gold medalist [Yip Pin Xiu](/wiki/Yip_Pin_Xiu), [2021 BWF World Championships](/wiki/2021_BWF_World_Championships_%E2%80%93_Men%27s_singles) gold medalist [Loh Kean Yew](/wiki/Loh_Kean_Yew), sprinter [Shanti Pereira](/wiki/Shanti_Pereira), and [Benjamin Kheng](/wiki/Benjamin_Kheng) of [The Sam Willows](/wiki/The_Sam_Willows). ## History Republic Polytechnic was established in July 2002. First located at the former Ministry of Education headquarters at [Tanglin](/wiki/Tanglin), the polytechnic was established as a statutory board a month later. [Low Teck Seng](/wiki/Low_Teck_Seng) became the founding principal of Republic Polytechnic. The polytechnic admitted its pioneer batch of students in July 2003 across three schools, Applied Science, Engineering and Information and Communications (now Infocomm). In 2005, the polytechnic opened two new schools, Technology for the Arts and Sports, Health and Leisure. Construction of the new campus in Woodlands was completed in stages. The Republic Polytechnic Centre was opened in November 2005 by [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) who was the [Minister for Education](/wiki/Ministry_of_Education_(Singapore)#Ministers). In March 2006, the polytechnic officially moved to its Woodlands campus and was declared officially open by [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) the [Prime Minister](/wiki/Prime_Minister_of_Singapore) in July 2007. In March 2008, the polytechnic opened a fifth school, the School of Hospitality, to support the growing hospitality sector. In 2012, the polytechnic renamed the Centre for Professional Development as the Academy for Continuing Education @ RP and launched its first part-time diploma. That same year witnessed the launch of the Centre for Enterprise and Communication (later renamed as the School of Management and Communication in 2016) and an aerospace training facility, The Aerospace Hub. The Centre of Innovation for Supply Chain Management (COI-SCM) was launched in 2013 and this was followed by an Aquaculture Centre in 2014. In 2016, the Republic Polytechnic Industry Centre was launched to deepen industry collaboration and support upskilling for individuals, housing a suite of laboratories and experiential learning facilities under one roof. The polytechnic opened the Republic Polytechnic Academy for Continuing Education @ Paya Lebar (RP ACE @ Paya Lebar) in November 2018 to bring its Continuing Education and Training (CET) courses closer to the public. and launched Singapore's first-ever SkillsFuture Work-Study Programme where students worked full-time with participating companies and took classes towards obtaining a part-time diploma. 2019 saw the polytechnic opening an agriculture technology laboratory that features [urban farming](/wiki/Urban_agriculture) facilities and the launch of a part-time Diploma in Applied Science (Urban Agricultural Technology). Two experiential training facilities in [transport](/wiki/Transport) and [cybersecurity](/wiki/Computer_security) were opened in the same year in partnership with the [Land Transport Authority](/wiki/Land_Transport_Authority), and RSA and Ensign InfoSecurity respectively. At the start of 2020, Republic Polytechnic partnered [ST Logistics](/wiki/ST_Engineering) to launch the first healthcare supply chain lab in an institute of higher learning. At the beginning of 2021, Republic Polytechnic announced the launch of two new full-time diploma programmes, the Diploma in Sustainable Built Environment and the Diploma in Environmental & Marine Science. In August 2021, the polytechnic launched a new facility and initiative, the Entrepreneurial Partnership & Innovation Community (epic), an ecosystem to foster a spirit of entrepreneurship among its students. Republic Polytechnic marked its 20th anniversary in 2022 and also launched the Xperiential Learning Centre in Jan 2022, the largest inclusive outdoor adventure learning facility. The new facility is a first of its kind in Singapore featuring inclusive facilities catered to users of varying abilities, including the young, the elderly and [persons with disabilities](/wiki/Disability). In March 2023, Yeo Li Pheow retired as the polytechnic's Principal & CEO after helming the institution since 2008. Following his retirement, Jeanne Liew was appointed as the new Principal & CEO by the board of governors. In October 2024, Republic Polytechnic revamped its curriculum and introduced the \"Becoming Greater Me\" framework, for students joining the polytechnic from Academic Year 2025. This framework is designed to help students discover their purpose by aligning their passions with both their academic and life pursuits. Anchored in the discovery of purpose, the new framework provides more opportunities for specialised learning, community engagement, and personal development. The polytechnic also implemented the \"Designing Your Life\" (DYL) concept, developed by Stanford University professors Bill Burnett and Dave Evans. This five-year student journey aims to empower students to pursue their life and career goals with intention and clarity. The revamped curriculum also offers versatility by allowing students to design and pursue their own learning pathways. Students can enrol in a broad-based diploma across all academic schools and select their major and minor subjects in their second year. Minor programmes are available to all students under the new curriculum. Additionally, students have the opportunity to obtain industry-recognised certifications, participate in a one-year internship, or pursue a certificate mapped to a specialist diploma. Republic Polytechnic is also the first polytechnic to make service learning a mandatory requirement for graduation. ## Organisation Diplomas awarded by Republic Polytechnic are recognised at both local and overseas universities. As of 2024, RP has 7 academic schools which offer 35 full-time diplomas: - School of Applied Science (SAS) - School of Engineering (SEG) - School of Hospitality (SOH) - School of Infocomm (SOI) - School of Business (SBZ) - School of Sports and Health (SSH) - School of Technology for Arts, Media and Design (STA) Additionally, the Academy for Continuing Education (RP ACE) offers several part-time and specialist diplomas, work-study programmes, and workshops. RP's Industry Immersion Programme (IIP) is an internship programme designed to give students a first-hand experience of the working environment and let them apply the knowledge they have gained from the classroom. Each year, final-year students are placed on internship with over 1,800 industry partners. The duration ranges from 10 to 14 weeks and is an integral part of the diploma programme. Some students have also pursued their internships overseas during their final-year of study at RP - which include Australia, China, Indonesia, Myanmar, the United States and New Zealand. RP's Continuing Education and Training (CET) is a learning arm for upskilling and lifelong learning. In line with Singapore's SkillsFuture movement, these part-time programmes - short courses and certificates offered by the Academy for Continuing Education (ACE@RP) - allow learners to stay relevant in the current knowledge-based global economy. They include: - Part-time Diploma Programmes - Specialist Diploma Programmes - SkillsFuture Earn & Learn Programmes - Short courses/Workshops - National Silver Academy Courses - Modular Courses In January 2019, the polytechnic launched the Diploma in Applied Science in Urban Agricultural Technology, the first full-qualification diploma course in agricultural technology in Singapore. The aim of the programme is to train the next generation of high-tech farmers so that the country can produce more of its own food. ## Campus On 31 July 2007, RP's Woodlands campus was officially opened by Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong). The campus was designed by Japanese architect, [Fumihiko Maki](/wiki/Fumihiko_Maki), and DP Architects. Completed in 2006, the new campus is able to cater 13,000 students. It is conceived as a campus with a central nucleus which contains 11 learning Pods (8–9 storeys high) which are unified by 2 elliptical decks of common facilities, namely *The Lawn* and *The Agora*. Also known as a *Paperless Campus*, RP's Woodlands campus is backed by [IT](/wiki/Information_technology)-supported network for both academic and administrative functions. Features such as [fritted](/wiki/Frit) glasses, flooring made from recycled [nylon](/wiki/Nylon) and [tyres](/wiki/Tire_Recycling), and sunshade louvres were integrated in the building design. Instead of the conventional air-conditioning system, the campus is equipped with tanks containing chilled water, which are recharged at night using low tariff electricity. This significantly reduces overall electric consumption. In 2008, RP earned the [ASEAN](/wiki/ASEAN) Best Practices for Energy Efficient Buildings Competition under the New and Existing Buildings category. RP was also honoured with the President's Design Award in 2009. The campus was also the first to win the First-ever Singapore Green Mark Plantinum award for its [eco friendly](/wiki/Environmentally_friendly) design. ## Facilities - Republic Polytechnic Industry Centre (RPIC) – The RPIC is a six-storey building that houses laboratories and learning facilities to support research, innovation and enterprise across a range of industries that include food manufacturing, hospitality, advance manufacturing and logistics, among others. - The Republic Cultural Centre (TRCC) – Designed by Maki & Associates, TRCC has three main performing arts venues: a) 1,000-seat Theatre, b) 300-seat Studio and, c) 120-seat Lab. In addition to these performing spaces, TRCC also houses rooms and studios for practice, rehearsal and recordings that support curriculum, student development. - Career Centre – As part of Education and Career Guidance (ECG) efforts, the RP Career Centre, which commenced operations in October 2015, provides career advisory services. - Library – The 2100-seater library has 9,400 square metres (101,000 sq ft) of space. It is currently managed by Library & Archives Solutions Pte Ltd, a wholly owned company of the [National Library Board](/wiki/National_Library_Board). - Xperiential Learning Centre, an indoor high elements facility ## Industry collaborations Republic Polytechnic collaborates with industry partners to establish and maintain close industrial linkages. Some examples include: - In June 2018, RP signed a Memorandum of Understanding (MOU) with [Ubisoft](/wiki/Ubisoft), a leading French game creator and distributor. Selected students from the Diploma in Sonic Arts and Diploma in Game Design programmes will be involved in the production of Foley effects and sound design for selected Ubisoft game releases. - In March 2018, RP signed a memorandum of understanding (MOU) with the [Football Association of Singapore](/wiki/Football_Association_of_Singapore) (FAS) to forge an alliance to provide opportunities to educate and engage youth on sports science, and jointly establish the RP-FAS Centre of Excellence (COE) - On 4 November 2016, RP signed three Memoranda of Understanding (MoU) with key MICE partners in a three-year collaboration providing industry-relevant learning experiences for 600 students from the School of Hospitality. Two new MOUs were signed with SingEx Holdings Pte Ltd (SingEx) and Koelnmesse Pte Ltd, and a MoU was renewed with Singapore Association of Convention and Exhibition Organisers and Suppliers (SACEOS) - The RP-Hexagon Manufacturing Intelligence (HMI) Joint Laboratory was launched on 29 June 2016. Students studying for the Diploma in Industrial & Operations Management (DIOM) from the School of Engineering at RP are able to enhance their capabilities and skills in the field of engineering through this new lab - On 9 June 2016, RP's new customer experience laboratories were launched. The facility will cater to around 1,000 students, mainly from the School of Hospitality's Diploma in Customer Experience Management with Business (DCXB). An inaugural collaboration between RP and partners [ASICS](/wiki/ASICS), Cumulus Nimbus, ZA and Ma Cherie, the facility includes a retail lab stocked with lifestyle products. It also includes a contact centre that trains students in responding to customer queries, and a customer relationship management lab where students can interact with different consumer market segments - In May 2016, RP's School of Infocomm and Samsung launched a new Android training and development laboratory to equip its infocomm students with the skills to develop Android software applications. The RP-Samsung Mobile Lab is a first among the institutes of higher learning in Singapore - In September 2016, RP's School of Applied Science inked a Memorandum of Understanding (MOU) with Rolls-Royce, allowing students from the Diploma in Materials Science opportunities to work on aircraft component failure inspection and non-destructive testing R&D projects with the company. Rolls-Royce will also lend its aerospace and technological expertise to co-develop and enhance RP's curriculum in the areas of advanced materials and composites - In December 2015, RP's School of Management and Communication jointly launched the Youth Livelihood Programme (YLP) with World Vision Singapore. Students from the Diploma in Social Enterprise Management (renamed Diploma in Business & Social Enterprise)(renamed again to Diploma in Business) will partner with youth counterparts from Cambodia to exchange entrepreneurial and business skills for sustainable livelihood. Through the collaboration, RP students are allowed the opportunity to apply classroom concepts in social entrepreneurship and business to real communities ## Notable alumni ### Entertainment - [Ian Fang](/wiki/Ian_Fang), Chinese actor - [Jill Lim](/wiki/Jill_Lim), radio presenter - [Benjamin Kheng](/wiki/Benjamin_Kheng), Singaporean singer - [Tosh Zhang](/wiki/Tosh_Zhang), Singaporean actor ### Media - Elizabeth Neo, [CNA](/wiki/CNA_(TV_network)) news presenter ### Sports - [Yip Pin Xiu](/wiki/Yip_Pin_Xiu), Singaporean swimmer and five-time [Paralympics](/wiki/Paralympics) gold medallist - [Loh Kean Yew](/wiki/Loh_Kean_Yew), Singaporean badminton player - [Shanti Pereira](/wiki/Shanti_Pereira), Singaporean track and field athlete - [Gabriel Quak](/wiki/Gabriel_Quak), Singaporean footballer - [Valen Low](/wiki/Valen_Low), Singaporean armwrestler - [Ikhsan Fandi](/wiki/Ikhsan_Fandi), Singaporean footballer - [Dante Chen](/wiki/Dante_Chen), Singaporean professional wrestler\n",
  "language": "en",
  "processed_at": "2026-01-12T11:47:45.959272",
  "title": "Republic Polytechnic",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Republic_Polytechnic"
}