{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:47:50.291665"
  },
  "content": "Financial reserves of Singapore The **reserves of the Government of Singapore** are the investment assets of the Singaporean state, including those of [Ministry of Finance](/wiki/Ministry_of_Finance_(Singapore)) and the [Statutory Boards](/wiki/Statutory_boards_of_the_Singapore_Government), the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore), [GIC Private Limited](/wiki/GIC_(Singaporean_sovereign_wealth_fund)) (GIC), and [Temasek Holdings](/wiki/Temasek_(company)). In [constitutional](/wiki/Constitution_of_Singapore) terms, the Past Reserves as a legal term refers to such reserves as existed before the sitting government came into office (the most recent handover being [23 May 2025](/wiki/Second_Lawrence_Wong_Cabinet)). The [president's discretion](/wiki/Powers_of_the_president_of_Singapore) to withhold access to the Past Reserves is intended as a \"[second key](/wiki/Check_and_balance)\" to ensure [financial stability](/wiki/Financial_stability) and restrain waste of the reserves. As of 2023, the total reserves are conservatively estimated at [S$](/wiki/Singapore_dollar)2.5 trillion (2024) ([US$](/wiki/USD)1.87 trillion), based on publicly available data from GIC,[a] Temasek,[b] MAS,[c] and CPF,[d] among others. Many analysts believe that the reserves are substantially larger than publicly acknowledged. The [Ministry of Finance](/wiki/Ministry_of_Finance_(Singapore)) keeps the full details of the reserves private so as to prevent [currency speculation](/wiki/Currency_speculation) attacks on the [Singapore dollar](/wiki/Singapore_dollar). ## Structure and composition The Government and each of the fifth schedule entities manage a portfolio of reserves under their charge for the benefit of the Government. These entities are divided into two parts: 1) [Statutory boards](/wiki/Statutory_boards_of_the_Singapore_Government) such as the [Central Provident Fund](/wiki/Central_Provident_Fund) and [Housing and Development Board](/wiki/Housing_and_Development_Board), which are structured by statute. 2) [State-owned](/wiki/State-owned_enterprise) but legally ordinary (governed by the Companies Act) companies, principally [GIC](/wiki/GIC_(sovereign_wealth_fund)) and [Temasek](/wiki/Temasek_(company)). State-owned land is a visible example of a component of the Past Reserves. When the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) purchases state land for the purpose of building flats, the price is paid into Past Reserves. Further, [Central Provident Fund](/wiki/Central_Provident_Fund) (CPF) money is used by the CPF Board to invest, as exclusive purchaser, in Special Singapore Government Securities (SSGS), with payments made into Past Reserves. **Current Key Statutory Boards**: [Central Provident Fund Board](/wiki/Central_Provident_Fund) (CPF)[Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB)[Jurong Town Corporation](/wiki/JTC_Corporation) (JTC)[Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS) **Past Key Statutory Boards**: [Board of Commissioners of Currency, Singapore](/wiki/Board_of_Commissioners_of_Currency,_Singapore)[Post Office Savings Bank of Singapore](/wiki/POSB_Bank) (POSB) **Current Government companies**: [GIC Private Limited](/wiki/GIC_(Singaporean_sovereign_wealth_fund))[Temasek Holdings (Private) Limited](/wiki/Temasek_Holdings) **Past Government companies**: MND Holdings (Private) LimitedSingapore Technologies Holdings Pte. Ltd. ## Previous drawings on past Reserves On 9 March 2009, [President](/wiki/President_of_Singapore) [S. R. Nathan](/wiki/S._R._Nathan) assented to the Supplementary Supply (FY 2008) Act 2009 and the Supply Act 2009 after passage in the [11th Parliament](/wiki/11th_Parliament_of_Singapore) and following its introduction by Minister for Finance [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam). The Acts respectively provided for a drawing on the Past Reserves of a sum not exceeding S$1.125 billion and S$3.763 billion (S$4.888 billion in total) to alleviate the adverse economic effects during the [Great Recession](/wiki/Great_Recession). On 9 April 2020, President [Halimah Yacob](/wiki/Halimah_Yacob) assented to the Revised Supplementary Supply (FY 2020) Act 2020, also known as the \"Resilience\" and \"Solidarity\" Budgets, after passage in the [13th Parliament](/wiki/13th_Parliament_of_Singapore) and following its introduction by Minister for Finance [Heng Swee Keat](/wiki/Heng_Swee_Keat). The Act provided for a drawing on the Past Reserves of a sum not exceeding S$20,999,600,000 to alleviate the adverse economic effects caused by the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore). On 16 June 2020, President Halimah Yacob assented to the Second Supplementary Supply (FY 2020) Act 2020, also known as the \"Fortitude\" Budget, after passage in the [13th Parliament](/wiki/13th_Parliament_of_Singapore) and following its introduction by Minister for Finance [Heng Swee Keat](/wiki/Heng_Swee_Keat). The Act provided for a drawing on the Past Reserves of a sum not exceeding S$28,312,615,600 (S$49,312,215,600 in total after including the \"Resilience\" and \"Solidarity\" Budgets) to alleviate the adverse economic effects caused by the [2020-21 Singapore circuit breaker measures](/wiki/2020-21_Singapore_circuit_breaker_measures) during the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore). On 16 March 2021, President Halimah Yacob assented to the Supply Act 2021 after passage in the [14th Parliament](/wiki/14th_Parliament_of_Singapore) and following its introduction by Minister for Finance [Heng Swee Keat](/wiki/Heng_Swee_Keat). The Act provided for a drawing on the Past Reserves of a sum not exceeding S$11,010,000,000 to alleviate the continuing adverse economic effects caused by the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore). On 23 March 2022, President Halimah Yacob assented to the Supply Act 2022 after passage in the [14th Parliament](/wiki/14th_Parliament_of_Singapore) and following its introduction by Minister for Finance [Lawrence Wong](/wiki/Lawrence_Wong). The Act provided for a drawing on the Past Reserves of a sum not exceeding S$6,000,000,000 to alleviate the continuing adverse economic effects caused by the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore). ## Controversies ### 1993 audit dispute Soon after his [election in 1993](/wiki/1993_Singaporean_presidential_election), [President](/wiki/President_of_Singapore) [Ong Teng Cheong](/wiki/Ong_Teng_Cheong) came into a dispute with the government over information about the reserves. The Accountant-General said that it would take 56 man-years to produce a full value of the immovable assets owned by the Government. The President discussed this with the Accountant-General and the [Auditor-General](/wiki/Auditor_General_of_Singapore) and both conceded that the Government could practically make a list of all its property; this took three months to produce. However, the first list was not complete and it took a total of three years to produce a complete assessment. In an interview with *[Asiaweek](/wiki/Asiaweek)* six months after stepping down from the presidency, [Ong Teng Cheong](/wiki/Ong_Teng_Cheong) indicated that he had asked for the audit on the principle that as president, he was bound to protect the reserves; to do so, he needed to know what, exactly, he was protecting.[*citation needed*] ### 1998 Central Provident Fund budget In November 1996, the [Central Provident Fund](/wiki/Central_Provident_Fund)'s (CPF) budget for the upcoming [fiscal year](/wiki/Fiscal_year) 1997 was submitted to President Ong for routine approval. It contained a declaration by the CPF's Chairman and General Manager that this budget was not likely to draw on the Past Reserves of the CPF. The following month, the Council of Presidential Advisers (CPA) found that the budget showed a capital expenditure of S$27 million, which exceeded the operating surplus by S$4 million. This excess would require funding from the CPF's reserves in the form of accumulated surplus (that is, [cash reserves](/wiki/Reserve_(accounting)) in the general sense). However, after the forthcoming [1997 general election](/wiki/1997_Singaporean_general_election), all of the accumulated surpluses to date would become protected Past Reserves. Therefore, the CPA sought clarification from the Chairman and General Manager on the basis of their declaration \"knowing full well that there will be a General Election soon\". The General Manager, Lim Han Soon, explained that the CPF's accounts were drafted on an accrual basis where capital expenditure is depreciated over the useful life of the asset, rather than in one lump sum in the year of expenditure. The operating surplus of S$23 million had already charged an annual depreciation of S$11 million against the projected income for 1997. Therefore, no charge on the Past Reserves would have actually occurred, whatever the electoral situation.[*citation needed*] In a letter to [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Goh Chok Tong](/wiki/Goh_Chok_Tong) dated 16 December, the President wrote that he would approve CPF's budget but with a gazette notification that the budget would likely draw on the Past Reserves following the \"changeover of Government\". The Prime Minister replied the next day with a repeat of the General Manager's explanation and a request that the President hold back the gazetting of his opinion. The Prime Minister also suggested that since there seemed to be a difference in the interpretation of the budget, \"we should get the Accountant-General or the Auditor-General to state whether or not there would be a drawdown on reserves following the changeover of Government.\" The President replied on 20 December with an agreement to hold back the gazetting of his opinion and his intention to withhold approval of the budget until the issue has been resolved. In reply to the Prime Minister's suggestion of seeking the views of the Accountant-General or the Auditor-General, the President wrote that \"My duty does not include clarifying with the professional bodies the principles and interpretation. That duty lies with the Government.\" The President then explained his reservations about accrual accounting by writing that \"My concern here is that this approach (i.e. accrual accounting) will allow a profligate Government to hide its lavish spending under the guise of capital expenditures. In the final analysis, it is the Government which would have to recommend whether this is a principle that should guide my actions. And in the absence of clearly enunciated and mutually agreed principles and procedures for dealing with such matters, I would rather err on the side of stringency. If the principles had been settled earlier, this uncertainty about what is or is not a draw would not have arisen.\" The Government subsequently and explicitly reaffirmed \"that statutory boards and Government companies should continue to prepare their accounts and budgets on an accrual basis.\" - that is, the existing accounting system would remain in use. After the [1997 Singaporean general election](/wiki/1997_Singaporean_general_election), the Prime Minister wrote to the President on 27 January 1997, seeking his agreement to accrual accounting while explaining the safeguards in place. The President replied on 30 January that he had approved the CPF's budget for 1997 and agreed to the principle of accrual accounting but he still maintained that \"the concern that a profligate government could hide its lavish spending under the guise of capital expenditure was not fully addressed.\" ### 1998 Sale of POSB to DBS In 1998, President Ong found out, through the newspapers, that the Government intended to privatise [Post Office Savings Bank](/wiki/POSB_Bank) and accept an offer by [DBS Bank](/wiki/DBS_Bank) to acquire POSB and its subsidiaries. POSB was a Key Statutory Board whose Past Reserves came within the President's protection. The President complained to the Government that the offer was procedurally improper insofar as he was not informed. Still, the sale proceeded with the removal of POSB from the fifth schedule of the [Constitution](/wiki/Constitution_of_the_Republic_of_Singapore) and the removal of the requirement for a Minister to seek the President's concurrence when revoking the appointments of the Directors and the Chairman of the Board. The undertakings and employees of POSB were then transferred to DBS and the Post Office Savings Bank of Singapore Act, which would have become [spent](/wiki/Spent_enactment) at the sale, was repealed. ## Notes - President of the Republic of Singapore - Council of Presidential Advisers - Cabinet of Singapore Portals: - Singapore - Capitalism - Economics\n",
  "language": "en",
  "processed_at": "2026-01-12T11:47:50.291280",
  "title": "Reserves of the Government of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Reserves_of_the_Government_of_Singapore"
}