{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:47:51.999974"
  },
  "content": "Integrated resort on Sentosa Island, Sentosa **Resorts World Sentosa** ([abbreviation](/wiki/Abbreviation): **RWS**) is an [integrated resort](/wiki/Integrated_resort) on the island of [Sentosa](/wiki/Sentosa), which is located off the southern coast of [Singapore](/wiki/Singapore). The key attractions within RWS include one of Singapore's two casinos, [Universal Studios Singapore](/wiki/Universal_Studios_Singapore) theme park (which is the second Universal Studios theme park in Asia after [Universal Studios Japan](/wiki/Universal_Studios_Japan) and the first in Southeast Asia) the [Adventure Cove Waterpark](/wiki/Adventure_Cove_Waterpark), as well as the [Singapore Oceanarium](/wiki/Singapore_Oceanarium), which is the world's second largest [oceanarium](/wiki/Oceanarium). First conceived in 2006, the S$6.59 billion (US$5.03 billion) resort was developed by [Genting Singapore](/wiki/Genting_Singapore), and construction began in 2007. It was the [third most expensive building](/wiki/List_of_most_expensive_buildings_in_the_world) ever constructed when it was completed in 2010. The resort occupies approximately 50 hectares (120 acres) of land and directly employs up to 15,000 people. The [soft launch](/wiki/Soft_launch) of the first four hotels took place on 20 January 2010, with the FestiveWalk shopping mall following on 1 February. The casino began operations on 14 February 2010 on the first day of the [Chinese New Year](/wiki/Chinese_New_Year). [The Maritime Experiential Museum](/wiki/The_Maritime_Experiential_Museum) opened on 15 October 2011 and the last attraction opened on 22 November 2012, known as The Marine Life Park. The grand opening of the entire integrated resort was held on 7 December 2012, which was officiated by the country's [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) together with [Genting Group](/wiki/Genting_Group) Chairman [Lim Kok Thay](/wiki/Tan_Sri_Lim_Kok_Thay). Resorts World Sentosa is also capable of holding large-scale exhibitions, and was host to the [2024 World Chess Championship](/wiki/World_Chess_Championship_2024). ## History Resorts World SentosaAttractions - [Universal Studios Singapore](/wiki/Universal_Studios_Singapore) - [Adventure Cove Waterpark](/wiki/Adventure_Cove_Waterpark) - [Singapore Oceanarium](/wiki/Singapore_Oceanarium) - [The Maritime Experiential Museum](/wiki/The_Maritime_Experiential_Museum) - Dolphin Island - Festive Walk Hotels - Crockfords Tower - Equarius Hotel - Festive Hotel - Hard Rock Hotel - Hotel Michael - Beach Villas - Genting Hotel Jurong - v - t - e ### Construction Construction of Resorts World Sentosa Singapore began on 16 April 2007 on the demolished plot of [Imbiah Lookout](/wiki/Imbiah_Lookout). It opened after 34 months of construction on 20 January 2010. Festive Hotel opened on 7 January 2010. Hotel Michael opened on 13 January 2010. Crockfords Tower and [Hard Rock Hotel](/wiki/Hard_Rock_Cafe) Singapore opened on 20 January 2010, followed by FestiveWalk on 31 January 2010. Resorts World Sentosa Casino opened on 14 February 2010. Resorts World Sentosa's grand opening was on 7 December 2012. ### Opening Universal Studios Singapore was opened for a sneak peek week in view of the Chinese New Year Celebrations, from 5 pm to 9 pm every night between 14 and 21 February 2010. The whole park was opened but none of the rides was operational. Visitors had to pay SGD10 to get into the park. Park tickets for the week were sold out in 2 days. The park had its soft opening period from 18 March 2010 to 26 October 2010. ### COVID-19 As a result of the global [COVID-19 pandemic](/wiki/COVID-19_pandemic), RWS had to temporarily lay off a significant amount of its workforce. In 2024, the Singapore government renewed RWS' casino license for two years, instead of the usual three, from 2025 to 2027 due to poor tourism performance. Genting Singapore said the poor performance was hampered by the COVID-19 pandemic as the evaluation period coincided with the pandemic period. ## Resort layout The resort was designed primarily by the [Driehaus Prize](/wiki/Driehaus_Architecture_Prize) winner and [New Classical](/wiki/New_Classical_architecture) architect [Michael Graves](/wiki/Michael_Graves). The six hotels offer a total of 1,840 rooms for accommodation. Each hotel is designed with a different theme, catering to both leisure and business visitors. The resort is split into the west, central and east zones. ### Central zone #### Hotels Four hotels are located in the central zone. - **Crockfords Tower**, formerly planned to be named Maxims Tower, is an 11-storey all-suite hotel overlooking the [Singapore harbour](/wiki/Port_of_Singapore) and the [Southern Islands](/wiki/Southern_Islands). The resort's casino is located beneath the tower. The hotel was topped-out on 27 February 2009 and opened on 20 January 2010. Together with Hotel Michael, it sits on the site of the former [Sentosa Musical Fountain](/wiki/Sentosa_Musical_Fountain). The hotel also features Crockfords Premier, a casino club with private rooms for High Roller located on the 10th floor. - **Hotel Michael** is an 11-story hotel named after Michael Graves. Hotel Michael topped-out on 15 July 2009 and was opened on 13 January 2010. Together with Crockfords Tower, it sits on the site of the former [Sentosa Musical Fountain](/wiki/Sentosa_Musical_Fountain). - **Hotel Ora**, formerly known as Festive Hotel, is a family-oriented hotel next to Crockfords Tower and Festive Walk. It was the first hotel in Resorts World Sentosa to open on 7 January 2010. Beneath the hotel is Festive Grand, a 1,600 seat plenary hall which will host Resorts World Sentosa's resident musical Voyage de la Vie. - **The Laurus,** Singapore's first The luxury Collection-branded resort is opened in October 2025. An all-suite resort, it replaced the former [**Hard Rock Hotel**](/wiki/Hard_Rock_Cafe). The [Royal Albatross](/wiki/Royal_Albatross_(ship)) is berthed at the Historical Ships Harbour, beside the Singapore Oceanarium (formerly S.E.A. Aquarium) and the Adventure Cove Waterpark. #### Casino Resorts World Sentosa casino is located beneath Crockfords Tower that has an acreage of 15,000 sq.m. In May 2011, the Casino Regulatory Authority fined Resorts World Sentosa for two violations related to reimbursements and two other violations related to surveillance practices. The total fine was S$530,000 (US$425,000). ### West zone #### Hotels - **Equarius Hotel**, close to the [Adventure Cove Waterpark](/wiki/Adventure_Cove_Waterpark). - **Beach Villas**, a collection of 22 villas floating on a lagoon. It opened on 16 February 2012. #### Marine Life Park [Singapore Oceanarium](/wiki/Singapore_Oceanarium) (formerly S.E.A. Aquarium), the world's second largest oceanarium, and [Adventure Cove Waterpark](/wiki/Adventure_Cove_Waterpark) (formerly Equarius Water Park) first opened its doors on 22 November 2012. #### The Maritime Experiential Museum [The Maritime Experiential Museum](/wiki/The_Maritime_Experiential_Museum) was opened on 15 October 2011 that features more than 400 artifacts and replicas with a 360-degree Multi-sensory Typhoon Theatre. It displays the history of ancient maritime trade: visitors have the opportunity to immerse themselves in the history of the maritime Silk Route from the 15th to 19th century. The museum consists of more than 10 interactive points as well as an opportunity to board the authentic harbor ships from Asia docked outside the museum. Also, it will become the permanent home of the [Jewel of Muscat](/wiki/Jewel_of_Muscat), a gift from the Oman Government. It was closed along with the Crane Dance on 2 March 2020 as part of plans to expand the S.E.A. Aquarium. #### Royal Albatross The [Royal Albatross](/wiki/Royal_Albatross_(ship)) is berthed at the Historical Ships Harbour, beside the Aquarium and the Adventure Cove Waterpark. The ship is available twice every weekend. Its route goes through the beaches of Sentosa to the outskirts of Marina Bay, around the edge of the [Southern Islands](/wiki/Southern_Islands) and back to Sentosa. ### East zone #### Universal Studios Singapore [Universal Studios Singapore](/wiki/Universal_Studios_Singapore) is Southeast Asia's first [Universal Studios](/wiki/Universal_Destinations_%26_Experiences) theme park and the second in all of Asia. It opened its doors on 18 March 2010. It features 24 attractions and is divided into seven zones – including Sci-Fi City, Ancient Egypt, New York, The Lost World, Far Far Away, Minion Land and Hollywood. ## Transportation ### Sentosa Express Like most places in Sentosa, Resort World is accessible by the Sentosa Express. ### Boardwalk Resort World is also accessible by the Boardwalk, which currently leads to the East Carpark due to renovations. ### Bus Shuttle services RWS8 and the Sentosa Bus A serve the resort. Public Bus Service 123 also serves the resort, and upon entering Sentosa stops at WEAVE and goes as far as Beach Station (on the Sentosa Express), before exiting Sentosa with no intermediate stops. Discontinued services include the NR1, NR6, 188R, and 963R bus services. ### Car The carpark at Resort World is accessible via Sentosa Gateway. ## Events It was the venue for the [2024 World Chess Championship](/wiki/2024_World_Chess_Championship) with [Ding Liren](/wiki/Ding_Liren) defending the title against [Gukesh Dommaraju](/wiki/Gukesh_Dommaraju). Gukesh won the championship in 14 games, and at age 18 became the youngest competitor to hold the title. - [Adventure Cove Waterpark](/wiki/Adventure_Cove_Waterpark) - [Royal Albatross](/wiki/Royal_Albatross_(ship)) - [List of integrated resorts](/wiki/List_of_integrated_resorts) ## Notes - Official website Portal: - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:47:51.999588",
  "title": "Resorts World Sentosa",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Resorts_World_Sentosa"
}