{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:47:56.281214"
  },
  "content": "Revere Bell in Singapore The **Revere Bell** is a historic bell in the collection of the [National Museum of Singapore](/wiki/National_Museum_of_Singapore). It was cast by the [Revere Copper Company](/wiki/Revere_Copper_Company) in [Massachusetts](/wiki/Massachusetts), as part of a series of [Revere bells](/wiki/Revere_bells) manufactured by the company. The bell was given to [St. Andrew's Church](/wiki/St_Andrew%27s_Cathedral,_Singapore) in 1843 by Mrs. Maria Revere Balestier, the daughter of [Paul Revere](/wiki/Paul_Revere) and wife of the first American Consul to Singapore, [Joseph Balestier](/wiki/Joseph_Balestier). It is the only Revere bell outside the United States, and represents the long relationship between Singapore and the United States. The bell is 81 centimetres (32 in) in height and 89 centimetres (35 in) in diameter with a clapper underneath. ## History The bell was given to [St. Andrew's Church](/wiki/St_Andrew%27s_Cathedral,_Singapore) in 1843 by Maria Revere Balestier, the daughter of [Paul Revere](/wiki/Paul_Revere) and wife of the first [American](/wiki/United_States) [Consul](/wiki/Consul) to Singapore, [Joseph Balestier](/wiki/Joseph_Balestier), on the condition that the bell would be used to sound a [curfew](/wiki/Curfew) for five minutes at 8:00 pm every night. Back then, it was unsafe during night, with warnings sounded to remind sailers to return to their ships and for residents to be vigilant. The curfew bell rang until 1855 when the church was demolished, and was resumed when the second church (which became [St. Andrew's Cathedral](/wiki/St_Andrew%27s_Cathedral,_Singapore) later) was constructed in its place in 1861 until it was permanently discontinued in 1874. The bell remained in the church until 6 February 1889, where it was replaced by a new peal of bells presented from the family of Captain J. S. H. Fraser and subsequently put into a [Public Works Department](/wiki/Public_Works_Department_(Singapore)) storage in Kandang Kerbau. In 1911, it was installed in [St. George's Garrison Church](/wiki/Saint_George%27s_Church,_Singapore) in Tanglin Barracks. However, after it became irreparably cracked it was moved to a [Royal Engineers](/wiki/Royal_Engineers) storeyard. The Raffles Museum, now the [National Museum of Singapore](/wiki/National_Museum_of_Singapore), learned of the bell in September 1937, and took custody of it after the Anglican Archdeacon of Singapore, [Graham White](/wiki/Graham_White_(priest)), donated it to the museum. Since then the Revere Bell has been displayed the National Museum, apart from a period between January 1997 and May 2006 when the bell was loaned to the United States Embassy in Singapore while the museum was being renovated. During that time it was showcased behind velvet ropes in the foyer of the Embassy. The bell, now in the museum's Singapore History Gallery, has been called a symbol of the friendship between the peoples of Singapore and the United States. - [Balestier Road](/wiki/Balestier_Road) - [Revere bells](/wiki/Revere_bells) ### Cited works - Liu, Gretchen (1996). *In granite and chunam : the national monuments of Singapore*. Singapore: Landmark Books and Preservation of Monuments Board. [ISBN](/wiki/ISBN_(identifier)) 9789813065031. - Hooi, Christian (1976). *The Revere Bell and the Balestiers*. National Museum. - Lee, Edwin (1990). *Historic buildings of Singapore*. Preservation of Monuments Board. - \"How a Revere bell came to Singapore\". *[The Straits Times](/wiki/The_Straits_Times)*. 5 April 1983. p. 8. - \"Notes of the day – St Andrew's bell\". *The Straits Times*. 15 April 1937. p. 10. - Infopedia article\n",
  "language": "en",
  "processed_at": "2026-01-12T11:47:56.280840",
  "title": "Revere Bell (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Revere_Bell_(Singapore)"
}