{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:47:54.461039"
  },
  "content": "* *[Singapore](/wiki/Singapore)** issued **[revenue stamps](/wiki/Revenue_stamps)** from 1948 to 1999. There were various types of fiscal stamps for different taxes. ## Revenue From the nineteenth century Singapore used revenues of the [Straits Settlements](/wiki/Straits_Settlements). In 1948, the first revenue stamps exclusively for use in Singapore were issued. Three values were issued - $25, $50 and $100 - and the stamps portrayed [King George VI](/wiki/King_George_VI). The $25 and $100 were reprinted in 1951 and 1953 respectively using a different perforation. In 1954, these three values were reissued with the portrait of [Queen Elizabeth II](/wiki/Queen_Elizabeth_II) following her father's death. These were then reissued about ten years later with a new watermark. Following Singapore's [separation from Malaysia](/wiki/Singapore_in_Malaysia#Separation) in 1965, revenue stamps were issued a year later showing the [coat of arms](/wiki/Coat_of_arms_of_Singapore). Seven values were issued, ranging from 5c to $5. Between 1969 and 1982 various high-value designs also showing the coat of arms were issued. There are various settings when it comes to perforation, watermark, paper and size, but the basic set consists of the following values: - $25 red and green - $100 red and orange - $500 red and violet - $2000 red and brown - $10000 red and dark blue - $50000 red and black Apart from these, various other low value sets were also issued. In 1985 six values from 10c to $5 were issued in a horizontal format inscribed REVENUE SINGAPORE. These were replaced around 1990 with a set of four values inscribed STAMP DUTY INLAND REVENUE SINGAPORE. The last set of low values as well as the high values were withdrawn by the [IRAS](/wiki/Inland_Revenue_Authority_of_Singapore) in 1999, as from that year e-stamps were used. As an effort to raise money, 2500 sets of revenue stamps were sold to collectors by the Authority in 2012.[*citation needed*] ## Other types ### Entertainments Duty Singapore issued several stamps to pay the tax on theatre and cinema tickets. The first series was issued from 1955 to 1965 and they bore the symbol of the Straits Settlements. Various surcharges on these were issued until the 1970s. Two other types showing the new coat of arms were issued in 1971 and 1976 as well. ### Television or Radio Licence Various stamps were issued to pay for television or radio licence in Singapore. In the late 1960s and the 1970s, stamps inscribed for either radio or television licence were used accordingly. By the 1980s, radio licence stamps were no longer used and various stamps inscribed SINGAPORE COLOUR TELEVISION LICENCE FEE were issued. ### Trade Development Board Following the creation of the [Singapore Trade Development Board](/wiki/International_Enterprise_Singapore) in 1983, two stamps denominated $2 or $10 were issued to pay fees and taxes by the Board. ### Passenger Service Charge The [Civil Aviation Authority of Singapore](/wiki/Civil_Aviation_Authority_of_Singapore) issued several labels to pay for the passenger service charge. Around 1983 a plain label was issued to pay the international passenger service charge of $12. Until 1993, other labels denominated $5, $12 or $15 were used. From 1994 onwards, $15 labels also included 44c [GST](/wiki/Goods_and_Services_Tax_(Singapore)). - [Inland Revenue Authority of Singapore](/wiki/Inland_Revenue_Authority_of_Singapore) - [Postage stamps and postal history of Singapore](/wiki/Postage_stamps_and_postal_history_of_Singapore) - [Revenue stamps of Malaysia](/wiki/Revenue_stamps_of_Malaysia)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:47:54.460760",
  "title": "Revenue stamps of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Revenue_stamps_of_Singapore"
}