{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:48:00.200688"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Rex Cinemas Mackenzie\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2023)* *(Learn how and when to remove this message)* **Rex Cinemas Mackenzie**, formerly **Rex Cinemas** and **Rex Theatre**, is an [Art Deco](/wiki/Art_Deco) style cinema building in Singapore. the cinema was adjacent to Ellison building along Mackenzie Road. The cinema was bounded by major road, [Bukit Timah Road](/wiki/Bukit_Timah_Road) and secondary roads Mackenzie and Selegie Road. ## History Built on the former site of the Singapore Boxing Stadium which was closed and demolished in 1946, the theatre opened in 1964. It started out as a cinema, a concert venue, then an ice skating rink, into a church, a [disco](/wiki/Disco) and back to being a cinema again. The theatre hall was different from the other cinemas in Singapore in terms of its layout organisation. The front and back stalls seats of the cinema hall sloped downwards to meet each other. This gives movie watchers seated in the front to have a better view of the screen without straining their necks. The first film screened in Rex Theatre was an English film, *[The Jungle Book](/wiki/The_Jungle_Book_(1967_film))*. In 1967, [Shaw Organisation](/wiki/Shaw_Organisation) took over the cinema. As its peak popularity in 1976, Rex Theatre attracted the largest crowd when they screened *[Earthquake](/wiki/Earthquake_(1974_film))* which came with new [sensurround](/wiki/Sensurround) sound effects that sent simulated vibrations around the cinema seats, depicting a real earthquake. Due to the rise of home video and videotape piracy, the cinema closed in 1983 with *[Jaws 3-D](/wiki/Jaws_3-D)* being the last film shown at Rex. In 1985, Rex Theatre was converted into a performance house with famous singers from [Taiwan](/wiki/Taiwan) and Hong Kong. They held their concert there and attracted a lot of people. In 1989, the theatre was converted into an [ice rink](/wiki/Ice_rink), Fuji Ice Palace. It ceased operations in 1993. Foo Chow Methodist Church step in and took over Rex Theatre in 1999 for a year to hold worship services. It functioned as a temporary church as the original church along 90 Race Course Road was undergoing reconstruction and upgrading when it was discovered to be unsafe for operation due to tunnelling works for an [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) line. A year later, the church then moved back to its own premises. In 2000, it was reopened as a disco known as *TJ Live House @ The Rex*. In 2007, Rex Theatre was left abandoned after its previous tenant, Indian nightclub Amaran, closed down. In 2009, Narayanasamy Muthu, with his son, Senthil Kumar, who managed jewellery chain, Kamala Jewellers, and his Malaysian business partner, Murugan Soppurayan invested more than $3 million to renovate Rex cinemas. It has three cinema halls with the main hall having 700 seats with the capacity reduced to 570 seats over the years and two smaller halls with 82 seats each. The cinemas mostly shows Tamil and Hindi movies while also showing Malay films. In August 2017, the premises was acquired by [Carnival Cinemas](/wiki/Carnival_Cinemas) and renamed as Rex Cinemas Mackenzie. The cinema ceased operation in July 2018.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:48:00.200295",
  "title": "Rex Cinemas Mackenzie",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Rex_Cinemas_Mackenzie"
}