{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:48:03.962924"
  },
  "content": "2023 Singapore political scandal In May 2023, at the direction of [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), the [Corrupt Practices Investigation Bureau](/wiki/Corrupt_Practices_Investigation_Bureau) (CPIB) of [Singapore](/wiki/Singapore) began an investigation of ministers [K. Shanmugam](/wiki/K._Shanmugam) and [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan) of the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) and their rentals of state-owned [bungalows](/wiki/Bungalows) at 26 and 31 Ridout Road respectively. An independent review led by [Senior Minister](/wiki/Senior_Minister_of_Singapore) [Teo Chee Hean](/wiki/Teo_Chee_Hean) was launched a week later. The CPIB concluded that there was \"no evidence to suggest any abuse of position by the ministers for personal gain\", whereas Teo found that there was \"no abuse of power or conflict of interest resulting in the ministers gaining any unfair advantage or privilege\". Following the release of both reports in June, Lee remarked that both Shanmugam and Balakrishnan \"retain my full confidence\". ## Original claims of wrongdoing Early assertions of wrongdoing against both [Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) and [Law](/wiki/Ministry_of_Law_(Singapore)) [K. Shanmugam](/wiki/K._Shanmugam) and [Minister for Foreign Affairs](/wiki/Ministry_of_Foreign_Affairs_(Singapore)) [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan) came in a blog post first published on 6 May 2023 by [Reform Party](/wiki/Reform_Party_(Singapore)) secretary-general [Kenneth Jeyaretnam](/wiki/Kenneth_Jeyaretnam). Jeyaretnam questioned how Shanmugam and Balakrishnan could \"afford to pay the market rent for ... two of Singapore's most prime residential properties in Ridout Road.\" Located just outside [Holland Road](/wiki/Holland_Road,_Singapore) of the affluent [Bukit Timah](/wiki/Bukit_Timah) area, Ridout Road is a part of Ridout Park, one of some 39 [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority)-designated \"Good Class Bungalow Areas\" in the country. 26 Ridout Road was previous occupied by [Rajan Pillai](/wiki/Rajan_Pillai), a businessman from Kerala known as the *Biscuit Baron*. Jeyaretnam also called for the [Singapore Land Authority](/wiki/Singapore_Land_Authority) (SLA)―an agency led by Shanmugam alongside Second Minister for Law [Edwin Tong](/wiki/Edwin_Tong)―to \"shed some light on the auction process\". In response, the SLA stated in a press release dated 12 May 2023 that \"(t)he rentals of SLA properties at No 26 and No 31 Ridout Road were performed in full compliance with the relevant SLA procedures.\" Jeyaretnam later added that he had heard \"rumours\" about the SLA's transactions with interior design company [Livspace](/wiki/Livspace), whose chief executive officer was Shanmugam's son. His remarks were echoed by former opposition politician [Charles Yeo](/wiki/Charles_Yeo). ## Investigation On 23 May 2023, [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) announced that he had already \"asked for reports from the relevant agencies setting out the facts\" on 17 May and that [Senior Minister](/wiki/Senior_Minister_of_Singapore) [Teo Chee Hean](/wiki/Teo_Chee_Hean) would also be \"(reviewing) the matter\". The CPIB concluded that there was \"no evidence to suggest any abuse of position by the ministers for personal gain\". According to its report, both the state-owned bungalows at 26 and 31 Ridout Road had \"For Lease\" signs outside their gates. The 9,350-square-metre (100,600 sq ft) residence at 26 Ridout Road and the 9,157.36-square-metre (98,569.0 sq ft) residence at 31 Ridout Road had been vacant since December 2013 and July 2013 respectively. Shanmugam―who had been living in a bungalow in Astrid Hill―first approached the then-deputy secretary of the Ministry of Law to send him a list of available rental properties at Ridout Road, before deciding to recuse himself from all discussions regarding said properties. In June 2018, Shanmugam was awarded a three-year [lease](/wiki/Lease) for 26 Ridout Road with a monthly rent of [S$](/wiki/Singapore_dollar)26,500. The lease was renewed for another three years in 2021, with the rental amount remaining the same. The SLA paid for S$515,400 worth of \"essential repair works\", whereas Shanmugam paid more than S$400,000 for his own renovation works, including S$61,400 for a car porch. Concerned that the overgrowth on the land next to the property would pose a \"public health risk\", Shanmugam volunteered to clear it at his own cost. However, the SLA ruled that the adjacent land would have to be included into Shanmugam's tenancy in order for him to do so. Consequently, the land size of the property was revised to 23,164-square-metre (249,340 sq ft). The clearance cost S$172,000, which was initially paid for by the SLA and later recovered through Shanmugam's rent. Shanmugam also made annual payments of S$25,000 to maintain the adjacent land. On the other hand, Balakrishnan first rented 31 Ridout Road in October 2019 for S$19,000 a month, which was revised to S$20,000 in 2022, when his tenancy was renewed for another two years. Balakrishnan also spent over S$200,000 on renovation works. In his independent review, Teo found that there was \"no abuse of power or conflict of interest resulting in the ministers gaining any unfair advantage or privilege\". Among other things, he noted that Shanmugam's identity as the prospective tenant of 26 Ridout Road had not been disclosed to the SLA during their negotiations, while Balakrishnan's monthly rent was \"comparable to other properties of 'average' condition at that time.\" A parliamentary sitting was convened on 3 July 2023, during which [Members of Parliament](/wiki/Parliament_of_Singapore) (MPs) debated the findings of both the CPIB and Teo for almost six hours. Shanmugam declared that \"(m)y residents judge me by my heart and my commitment to serve, not by how much I earn and where I live.\" Balakrishnan stressed that he had been \"scrupulously careful to ensure that everything was above board.\" ## Reactions As the investigation of the rentals was underway, Shanmugam stated that he had \"nothing to hide\", while Balakrishnan remarked that he looked forward to the publication of \"all relevant facts and findings before we have a full debate in Parliament.\" Balakrishnan later called his interview with the CPIB \"most uncomfortable, invasive, intrusive (and) thorough\". Livspace described the allegations concerning Shanmugam's son as \"completely false and baseless\", whereas Shanmugam himself called them \"utterly false and defamatory\". At the 3 July parliamentary sitting, Prime Minister Lee said that both Shanmugam and Balakrishnan \"retain my full confidence\", and added that \"(t)his government has not, and will never, tolerate any compromise or departure from the stringent standards of honesty, integrity and incorruptibility that Singaporeans expect of us.\" Senior Minister Teo remarked, \"That the Prime Minister did not hesitate to call the CPIB in to investigate two senior ministers is a signal how seriously we take such matters of incorruptibility, and its absolute value in our system.\" ### Opposition [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)) of the [Workers' Party](/wiki/Workers%27_Party_(Singapore)) (WP) said that \"I don't believe anybody is making an allegation that ... somebody is corrupt in the system\", but argued that \"it is quite incongruous, in the eyes of many, for a minister to be asking a civil servant details which pertain to information for his personal use.\" Fellow WP MP [Sylvia Lim](/wiki/Sylvia_Lim) contended that \"the Law Minister should not have entered into this transaction with the SLA, which is an agency under his charge, or at the very least, it was imprudent of him to do so.\" ## Subsequent events Shanmugam and Balakrishnan have continued to reside at the properties at Ridout Road. Some earthworks were observed to have been carried out at 26 Ridout Road since May 2024, continuing into 2025, although it is not clear if the requisite approvals were obtained for these earthworks and how these were founded.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:48:03.962401",
  "title": "Ridout Road rentals",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ridout_Road_rentals"
}