{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:48:14.049164"
  },
  "content": "2021 axe murder in Singapore On 19 July 2021, a thirteen-year old [Secondary One](/wiki/Secondary_education_in_Singapore) male student named **Ethan Hun Zhe Kai** ([Chinese](/wiki/Simplified_Chinese_characters): 韩喆凯; [pinyin](/wiki/Pinyin): *Hán Zhékǎi*) was struck to death with a combat fire fighting axe at [River Valley High School](/wiki/River_Valley_High_School,_Singapore) in [Boon Lay](/wiki/Boon_Lay), Singapore, in an incident which was reportedly unprecedented in the [history of Singapore](/wiki/History_of_Singapore). The killer was a sixteen-year-old Secondary Four male student, who was arrested for Ethan's murder shortly afterwards. The boy was initially charged with murdering Ethan; his charge was eventually reduced to manslaughter on the grounds of diminished responsibility, and he was thus sentenced to jail for 16 years on 1 December 2023. ## Attack and aftermath On July 14, 2021, the perpetrator took the axe and a knife to school in a badminton racquet bag, which he hid under a sink in the toilet, but failed to follow through with his plan. He tried again on July 19, 2021, where the attack occurred between 11:16 a.m. and 11:44 a.m. [local time](/wiki/Singapore_Standard_Time) at a fourth floor toilet in River Valley High School. A group of students encountered the attacker—a sixteen-year-old Secondary Four student—outside the toilet at 11:35 a.m. with a combat fire fighting axe. When the attacker asked them to call the police as he wanted the police to shoot him dead, the students retreated to their classroom and instated a [lockdown drill](/wiki/Lockdown_drill#Schools). The attacker then went to a classroom to make the same request, upon which the second group also instated a lockdown. Both groups alerted their teachers. A teacher confronted the attacker and requested that the fire fighting axe be placed on the floor. The attacker complied with the instruction and was escorted to a meeting room. The victim—a thirteen-year-old, [Secondary One](/wiki/Secondary_education_in_Singapore) male student—was then found dead inside the toilet, having suffered multiple slash wounds allegedly caused by the axe. The victim, who was originally not named due to a gag order, was later identified as Ethan Hun Zhe Kai as the gag order was lifted by the High Court at his parents’ request. Hun's attacker was subsequently arrested by the [Singapore Police Force](/wiki/Singapore_Police_Force). The entire school was placed into lockdown until around 3:30 p.m. As the following day was [Hari Raya Haji](/wiki/Eid_al-Adha), a [public holiday](/wiki/Public_holidays_in_Singapore), students returned to the school on 21 July. In the days following the attack, counselling was provided for nearly 540 students and teachers, while personnel from the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) took over some classes. ## Perpetrator According to a statement released by the Singapore Police Force several hours after the incident, preliminary investigations revealed that Hun and his killer are not known to each other.\" It was also revealed that the perpetrator had previously attempted suicide twice two years before in 2019 and had been remanded in the [Institute of Mental Health](/wiki/Institute_of_Mental_Health_(Singapore)). He is alleged to have procured the axe used in the attack online. According to Strait Times, he bought a tomahawk axe from a store on March 6, bought a Cold Steel Trench Hawk axe measuring 50 cm by 22 cm and a sharpener from a second store on March 17, and bought a Morakniv bushcraft stainless steel knife measuring 23.5 cm by 4 cm from a third store in April that year. According to [Channel 8 News](/wiki/Channel_8_News), the boy had simply wanted to attack the first person to enter the toilet, and Hun became the first and only victim of the boy before his arrest. The Secondary Four student, who cannot be named due to Singaporean law on account of his age, was charged with murder on 20 July and remanded at the Complex Medical Centre within [Changi Prison](/wiki/Changi_Prison) for psychiatric evaluation. As a minor, he is protected by the Children and Young Persons Act and cannot be [sentenced to death](/wiki/Capital_punishment_in_Singapore) if found guilty of the murder of Hun, but he would be sentenced to [life imprisonment](/wiki/Life_imprisonment_in_Singapore) instead. Criminal lawyer Peter Fernando was assigned to defend the boy in his trial. On 10 August, a fresh court order was issued to extend the suspect's period of psychiatric remand by another two weeks. By then, Fernando had been replaced by Diana Ngiam and Sunil Sudheesan. The boy was allowed a phone call with his family three days later. He was further remanded on 24 August 2021 for seven days, even though he had completed his psychiatric evaluations. On 31 August, his case was adjourned to 19 October. No date for his trial was scheduled at present. It was also revealed the suspect had been allowed to meet his family, and that he would be transferred to Changi Prison. On 30 December 2022, it was reported that the boy remained in remand pending trial, and under the arrangements made between the prison authorities and the boy's lawyer Sunil Sudheesan, the teenager had taken his [O-levels](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) as a private candidate while behind bars in November 2022. His case was expected to be heard on 25 January 2023. On 24 February 2023, as the student (who turned 18 in January) was suffering from clinical depression at the time of the incident, the murder charge against him was reduced to culpable homicide not amounting to murder, an offence which was punishable by life imprisonment or up to twenty years in prison, in addition to caning. ## Trial The perpetrator of the school attack, who stood trial before the [High Court](/wiki/High_Court_of_Singapore), pleaded guilty to the reduced charge of culpable homicide not amounting to murder on 1 December 2023, with the prosecution seeking a sentence of 12 to 16 years' imprisonment, while the defense sought a sentence of five years' imprisonment. The parents of Ethan Hun, Hun Yew Kwong and Sng Hui Ching, requested for the gag order to be lifted as they wanted their son to be remembered by his name. The defence did not object to their request, and the High Court judge granted their request. Hun's parents also reportedly wrote to the trial judge that they had forgiven their son's killer. On the same date, Justice Hoo Sheau Peng sentenced the killer to 16 years in prison. Justice Hoo stated that the crime itself carried a \"chilling degree\" of premeditation, cold logic and planning, and it was \"without precedent\" that a murder took place within a school environment where a student should feel safe inside, and she stated that regardless of the severity of the perpetrator's psychiatric condition, depression cannot become a \"licence to kill or harm others\". Ruling that the killer should be held \"highly culpable\" for the vicious killing of Hun, she agreed with the prosecution to sentence the convict to 16 years behind bars, which was the highest proposed sentence submitted by the prosecution. The jail term was backdated to the date of the convict's arrest on 19 July 2021. ## Appeal On 1 July 2024, the River Valley High School killer, who was then 19, filed an appeal to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) against his jail term, seeking to reduce the sentence to between eight and ten years' imprisonment. Defense lawyer Sunil Sudheesan argued that his client's mental problems and the mitigating factors of the case should warrant him a jail term lower than the 16 years imposed by the High Court, although the prosecution urged the appellate court to uphold the 16-year jail term as the perpetrator still bore significant responsibility despite his psychiatric condition, since he himself did not seek help earlier to address his condition and had consumed the contents of graphic violence that aggravated his tendency to violence. On 23 October 2024, the offender's appeal was dismissed and his 16-year jail term was upheld by the Court of Appeal. ## Responses According to local newspaper *[The Straits Times](/wiki/The_Straits_Times)*, the attack was unprecedented in the history of Singapore. Both Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) and Minister for Education [Chan Chun Sing](/wiki/Chan_Chun_Sing) wrote on [Facebook](/wiki/Facebook) that they were \"shocked\", while the Ministry of Education and River Valley High School said that they were \"deeply saddened\" by the incident. President [Halimah Yacob](/wiki/Halimah_Yacob) opined that \"parents, schools and our society are ill-equipped to deal with this situation.\" Minister for Law and Home Affairs [K. Shanmugam](/wiki/K._Shanmugam) said that it was \"difficult to even describe the true extent of their (the victim's parents') grief\". Several other [Cabinet](/wiki/Cabinet_of_Singapore) members and local religious leaders also publicly commented on the attack. The attack sparked concerns over mental [health in Singapore](/wiki/Health_in_Singapore). Member of Parliament [Patrick Tay](/wiki/Patrick_Tay) questioned the decision to return students to school a day after the attack. Minister for Education Chan Chun Sing defended his decision and replied that the ministry had decided that it was better for the students to grieve together than alone at home. Students were allowed to stay home if they chose. In a Ministerial Statement, Minister for Education Chan announced on 27 July the removal of Common Last Topics from the GCE N, O and A-Levels, and some topics from the final year examinations \"to help ease stress\". Measures were also put in place, including having all teachers equipped with enhanced mental health literacy, boosting the number of teacher-counsellors from 700 in 2021 to more than 1,000 several years later, recruiting more school counsellors or redeploying teachers to these roles, resuming CCAs at the secondary and pre-university level due to vaccinations, and dedicating more time to check on students' well-being. Measures to strengthen schools' security will be undertaken without eroding trust in the community. A [buddy system](/wiki/Buddy_system) was later proposed to be implemented in schools. - [2021 in Singapore](/wiki/2021_in_Singapore) - [List of major crimes in Singapore](/wiki/List_of_major_crimes_in_Singapore) - [Murder of Yap Shing Xuen](/wiki/Murder_of_Yap_Shing_Xuen), in Malaysia Portals: - Law - Schools - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:48:14.048856",
  "title": "River Valley High School attack",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/River_Valley_High_School_attack"
}