{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:48:09.939368"
  },
  "content": "Planning Area in Central, Singapore **River Valley** is a [planning area](/wiki/Planning_Areas_of_Singapore) located within the [Central Area](/wiki/Central_Area,_Singapore) of the [Central Region](/wiki/Central_Region,_Singapore) of [Singapore](/wiki/Singapore). The planning area shares boundaries with [Orchard](/wiki/Orchard,_Singapore) in the north, [Museum](/wiki/Museum_Planning_Area) in the east, [Tanglin](/wiki/Tanglin) in the west, and [Singapore River](/wiki/Singapore_River) in the south. River Valley consists of five subzones: Institution Hill, Leonie Hill, One Tree Hill, Oxley and Paterson. ## Etymology In the 1840s, there were two River Valley roads that ran on either side of the Singapore River. The Singapore River was seen as a [valley](/wiki/Valley) between [Fort Canning Hill](/wiki/Fort_Canning_Hill), to the north side of the river, and [Pearl's Hill](/wiki/Pearl%27s_Hill), to the south side of the river. The roads on either [bank](/wiki/Bank_(geography)) of the Singapore River were named River Valley Road — the current River Valley Road and Havelock Road. Both these River Valley roads were present in [John Turnbull Thomson](/wiki/John_Turnbull_Thomson)'s 1844 map. ## History Adjoining the area around the Singapore River and on high ground, River Valley naturally attracted wealthy [Europeans](/wiki/Europe) and [Chinese](/wiki/China) [merchants](/wiki/Merchant) who wanted to move away from the crowded town centre and began building their homes in the countryside up river in the 1830s. One of the first residents to move into the River Valley district was Dr [Thomas Oxley](/wiki/Thomas_Oxley_(British_surgeon)), the new [colony](/wiki/Colony)'s [surgeon](/wiki/Surgeon). In 1827, he bought land here from the [East India Company](/wiki/British_East_India_Company) and established Killiney Estate as a [nutmeg](/wiki/Nutmeg) [plantation](/wiki/Plantation). He had Killiney House built as his residence, named after the [hill and village](/wiki/Killiney) near his [Dublin](/wiki/Dublin) birthplace. The road nearby was named Oxley Road after the surgeon. When the plantation closed, he sold the land in several lots. River Valley Road was once part of Dr Oxley's estate before being divided up in the 1850s. Killiney House was a grand [villa](/wiki/Villa) built on land behind the eventual site of the [Chesed-El Synagogue](/wiki/Chesed-El_Synagogue). This house was subsequently bought by [Manasseh Meyer](/wiki/Manasseh_Meyer) who renamed it Belle Vue and lived in it with his family. It was demolished in 1982. The [Pavilion](/wiki/Pavilion,_Singapore) was another villa built by Thomas Oxley on his estate. When [Raffles House](/wiki/Raffles_House) was demolished to make way for a fort at [Fort Canning](/wiki/Fort_Canning_Hill) in 1859, Government House was moved to the Pavilion. The Pavilion was also the residence of Catchick Moses, the founder of the [*Straits Times*](/wiki/The_Straits_Times), the local newspaper. This house was bought by Manasseh Meyer in 1918. River Valley was especially popular with the [Straits Chinese](/wiki/Peranakan) who also built villas in the area. Among the wealthy who had homes here was [Tan Jiak Kim](/wiki/Tan_Jiak_Kim), the grandson of merchant [Tan Kim Seng](/wiki/Tan_Kim_Seng), who built himself a [mansion](/wiki/Mansion) in the 1860s and named it Panglima Prang. He also paid for the construction of the road that came to be named after him — [Kim Seng Road](/wiki/Kim_Seng_Road). Another wealthy merchant who lived in the area was [Lee Cheng Yan](/wiki/Lee_Cheng_Yan), a [Malacca](/wiki/Malacca)-born Chinese merchant whose mansion built in the 1870s was named Magenta Cottage. The road Cheng Yan Place is named after him. Most of the big mansions along River Valley have since been demolished. The one surviving villa is the traditional Chinese house built by a wealthy merchant, [Tan Yeok Nee](/wiki/Tan_Yeok_Nee), in 1885. This house, [House of Tan Yeok Nee](/wiki/House_of_Tan_Yeok_Nee), is now a [national monument](/wiki/National_Monuments_of_Singapore). There is another interesting landmark along River Valley Road known as Nanyang Sacred Union ([Chinese](/wiki/Chinese_language): 南洋圣教总会), which was established in 1914, is the first [Confucian](/wiki/Confucianism) Association in Singapore. *Kal alei*, meaning \"[stone crusher](/wiki/Rock_crusher)\", is the name given by the [Tamils](/wiki/Tamil_people) to River Valley Road, from the steam crusher which was once kept at the corner of Tank Road and River Valley Road. The Chinese have two other interpretations — *ong ke sua kha* in [Hokkien](/wiki/Min_Nan), meaning \"foot of Fort Canning Hill\", or *leng thau che*, meaning \"dragon's head well\" or \"the fountain by the side of the ice works\". The latter interpretation could refer to the spring on the hill and the [waterfall](/wiki/Waterfall) from it. The ice works belonged to [Hoo Ah Kay](/wiki/Hoo_Ah_Kay) (c. 1816–1881), which were demolished in 1981. ## Education Elementary education in the area is provided by the River Valley Primary School. ## Transportation Nearby MRT stations includes Great World MRT ([Thomson–East Coast Line](/wiki/Thomson%E2%80%93East_Coast_Line)) and Fort Canning MRT ([Downtown Line](/wiki/Downtown_Line)). ## Housing Residential buildings include mostly private condominiums, with some serviced apartments, landed property and HDB flats. ## In media - Victor R Savage, Brenda S A Yeoh (2003), *Toponymics - A Study of Singapore Street Names*, Eastern Universities Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-205-1 - Lee Geok Boi (2002), *The Religious Monuments of Singapore*, Landmark Books, [ISBN](/wiki/ISBN_(identifier)) 981-3065-62-1\n",
  "language": "en",
  "processed_at": "2026-01-12T11:48:09.939081",
  "title": "River Valley, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/River_Valley,_Singapore"
}