{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:48:16.221643"
  },
  "content": "Place in Sengkang Planning Area, Singapore **Rivervale** is a neighbourhood of [Sengkang New Town](/wiki/Sengkang_New_Town) located between [Sungei Serangoon](/wiki/Sungei_Serangoon) and [Compassvale](/wiki/Compassvale). The block numbers of the public apartment blocks in Rivervale begin with the number '1' (1xx). Rivervale was the first neighbourhood of Sengkang New Town to be built, and many of the existing housing estates in Rivervale were completed by the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) as early as 1997. ## Educational institutions ### Primary schools - North Spring Primary School - Rivervale Primary School ### Secondary schools - [CHIJ Saint Joseph's Convent](/wiki/CHIJ_Saint_Joseph%27s_Convent) - [North Vista Secondary School](/wiki/North_Vista_Secondary_School) ## Places of worship ### Chinese temples - Chong Ghee Temple (崇义庙) - Kampong Tengah Thian Hou Keng (半港天后宫) - Chong Hua Tong Tou Teck Hwee Temple ### Church - St Anne's Church ### Indian temple - Arulmigu Velmurugan Gnanamuneeswarar Temple ## Commerce - **Rivervale Plaza** Rivervale Plaza ([Chinese](/wiki/Simplified_Chinese): 鲤河大厦) was the first shopping mall in Sengkang New Town. It opened in mid 1999. - **Rivervale Mall** Rivervale Mall ([Chinese](/wiki/Simplified_Chinese_characters): 河滨坊) is the first private mixed development in Sengkang New Town and opened on 21 April 2001, with about 85,000 square feet (7,900 m2) of retail space. The development has a modern architectural design. ## Other facilities - **Rivervale Community Club** The Rivervale Community Centre was official opened on 20 June 2004. Its original site was at the foot of Block 193 Rivervale Drive, it had served the residents for many years at the location before being relocated to its current site with its own building behind Rivervale Plaza. The new building, which had its groundbreaking ceremony on 16 September 2018, is constructed with Mass Engineered Timber (MET); a first for such buildings in Singapore. The community club was completed and opened on 15 September 2021. It will have much more and bigger communal facilities as compared to its previous location, a childcare centre and a rooftop garden. ## Public transport The Rivervale neighbourhood is linked to [Sengkang Bus Interchange](/wiki/Sengkang_Bus_Interchange) and [Sengkang MRT/LRT station](/wiki/Sengkang_MRT/LRT_station) at the town centre via bus services originating from the [Sengkang Bus Interchange](/wiki/Sengkang_Bus_Interchange) and other parts of the island. The east loop of the [Sengkang LRT line](/wiki/Sengkang_LRT_line) also serves the area at the [Rumbia](/wiki/Rumbia_LRT_station), [Bakau](/wiki/Bakau_LRT_station) and [Kangkar](/wiki/Kangkar_LRT_station) stations. Bus services that call at a pair of bus stops located along the [TPE](/wiki/Tampines_Expressway)-Punggol Road Interchange also serves residents living in the vicinity, at the Sengkang-Punggol boundary. ## Gallery ### Transport infrastructure ### Educational institutions ### Housing estates\n",
  "language": "en",
  "processed_at": "2026-01-12T11:48:16.221263",
  "title": "Rivervale, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Rivervale,_Singapore"
}