{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:48:26.035979"
  },
  "content": "Port in Singapore **Robertson Quay** is a [wharf](/wiki/Wharf) near the source of the [Singapore River](/wiki/Singapore_River). It is the largest and most upstream of the three wharfs (the other two being [Boat Quay](/wiki/Boat_Quay) and [Clarke Quay](/wiki/Clarke_Quay)) on the river and is named after a municipal counsellor Dr J Murray Robertson. The area now houses a number of residential condominiums, the Kim Seng Park and a strip of restaurants, eateries, cafes and bars. ## History The upper reaches of the Singapore River were originally mud flats and swamps. As the population and commerce of Singapore increased, the area was reclaimed in the mid nineteenth century. In the 19th Century the swamps were reclaimed and warehouses and boatyards were constructed in the 1880s in both European and Chinese styles. Children would jump into the waters to cool down in the afternoons. The Quay is named after the municipal counsellor Dr J Murray Robertson. In 1977, then Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) called for a large $170 million initiative, lasting a decade, to clean up the Singapore River. This involved clearing away the rubbish as well as [dredging](/wiki/Dredging) the river. The [lighterage industry](/wiki/Lightering) eventually relocated to [Pasir Panjang](/wiki/Pasir_Panjang). In the 1990s, the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) rezoned the area for new development of residential, hotel, and commercial use. The area is now popular among joggers as well as families and offers a number of parks, restaurants, cafes and bars, as well as offers for arts and culture. On 16 May 2020, during the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore), Robertson Quay was the site of a significant breach of rules designed to curb the spread of COVID-19 by numerous parties. On 2 June 2020, seven people were charged for breaching rules. They were ultimately fined between S$8,000 and S$9,000 each, and six of them had their work passes revoked, permanently debarring them from working in Singapore in the future. On 16 June, two British citizens who were also permanent residents of Singapore were charged in relation to the same gathering. ## Geography Robertson Quay occupies 51 hectares of the [Singapore River](/wiki/Singapore_River) planning area. It starts roughly midway, or about 1.5 km from the river mouth, and terminates at the river source near the [Kim Seng Bridge](/wiki/Kim_Seng_Bridge). ## Gallery ## Notes 1°17′25″N 103°50′23″E﻿ / ﻿1.29028°N 103.83972°E﻿ / 1.29028; 103.83972\n",
  "language": "en",
  "processed_at": "2026-01-12T11:48:26.035619",
  "title": "Robertson Quay",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Robertson_Quay"
}