{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:48:23.997716"
  },
  "content": "English Church of England clergyman who initiated the founding of Penang Free School **Robert Sparke Hutchings** (11 April 1781 – 20 April 1827) was an [English](/wiki/England) clergyman who initiated the founding in 1816 of [Penang Free School](/wiki/Penang_Free_School), one of the oldest English-medium schools in [Southeast Asia](/wiki/Southeast_Asia),[a] in [Penang](/wiki/Penang) in present-day [Malaysia](/wiki/Malaysia). He was also involved with the founding of the [Raffles Institution](/wiki/Raffles_Institution), the oldest school in [Singapore](/wiki/Singapore), in 1823 and revised the first complete Bible translation in [Malay](/wiki/Malay_language). ## Education and Dittisham rectorate Robert Sparke Hutchings was born in the village of [Dittisham](/wiki/Dittisham) in [Devon](/wiki/Devon), the sixth and youngest child of John Hutchings (c. 1732 – 1802) of [Paignton](/wiki/Paignton), [rector](/wiki/Rector_(ecclesiastical)) of St. George's Church in Dittisham, and Sarah Sparke (c. 1734 – 1788) of [Dartmouth](/wiki/Dartmouth,_Devon). Robert matriculated at [St Edmund Hall, Oxford](/wiki/St_Edmund_Hall,_Oxford) in 1798 at the age of 17, obtaining a [BA](/wiki/Bachelor_of_Arts) in 1802 and an [MA](/wiki/Master_of_Arts) in 1808. He was ordained [deacon](/wiki/Deacon) of Dittisham parish in 1803 and became its rector in 1805.[b] He had a new rectory house built that still stands today, as well as overseeing the construction of the first road for carriages going from Dartmouth to Dittisham. At the Dittisham rectory, Hutchings had the care of the children of his brother-in-law [George Caunter](/wiki/George_Caunter), a Navy man who had gone to Prince of Wales Island (Penang) in 1795 and was its Acting Superintendent in the closing years of the eighteenth century. Caunter's wife Harriett Georgina Hutchings died in labour in Penang in 1798, and their two children born there were sent to England and joined three older siblings who had been born in Dittisham. One of the children to whom Robert Hutchings was guardian, the later clergyman and writer [John Hobart Caunter](/wiki/John_Hobart_Caunter), would describe his uncle as having \"a heart perfection scarce could mend\" and as being the source of \"most of what I know\".[c] In 1808 Hutchings became [domestic chaplain](/wiki/Chaplain#Domestic) to Clementina Drummond, the [Dowager Baroness Perth](/wiki/James_Drummond,_1st_Baron_Perth); in 1811 he was appointed domestic chaplain to [Thomas Reynolds-Moreton, Baron Ducie of Tortworth](/wiki/Thomas_Reynolds-Moreton,_1st_Earl_of_Ducie). ## Efforts towards a school in Penang In 1814, apparently due to financial difficulties, Hutchings gave up his rectorship at Dittisham and travelled to [Bengal](/wiki/Bengal_Presidency) to take up a chaplaincy there. The [East India Company](/wiki/East_India_Company)'s Board of Directors informed the Penang government that they had appointed Hutchings to succeed Penang's first resident Anglican chaplain, Atwill Lake. Hutchings arrived in Penang on 22 August 1814. There was no Anglican church on the island yet, and services were held in the Court House of [George Town](/wiki/George_Town,_Penang), the main settlement. Soon after his arrival, Hutchings petitioned the government for cups for the wine, a salver for the bread and a plate for the alms, items necessary for the administration of the sacrament. As chaplain, he also occupied himself with the care and maintenance of the [Old Protestant or Northam Road Cemetery](/wiki/Old_Protestant_Cemetery,_George_Town). To a council meeting under governor [William Petrie](/wiki/William_Petrie) on 6 January 1816, Hutchings presented an \"Address to the Public in behalf of a School, to be established in Prince of Wales Island\". He argued: *\"It is an uncontroverted truth, that the happiness of society results from the good conduct of the majority, and this good conduct results from early habits, or Education\"*. He proposed the establishment of a school open to all children regardless of class or race, and supporting those children whose parents could not afford the nominal fees. The school was to be open to children aged 4 to 13 inclusive, with boarding at the school's expense provided for pupils living far away. It was to be run on liberal principles, teaching the reading and writing of English, arithmetic and a range of crafts such as carpentry and bookbinding. Great care was to be taken \"that the prejudices of Parents averse to the Christian Religion, be not by any means violated\". The \"Children of Malay Parents who are not desirous that they should learn English\" were to be \"instructed by a Malay Teacher to read and write their own Language\", and analogous provisions were to be made for \"Children of Chuliah and Hindustanee Parents\". The \"first object of the Institution\" was \"to provide for the education of such Children, as would be otherwise bred up in Idleness and consequent Vice, and without any means of obtaining Instruction either in useful Learning or in any Manual Employment, and to implant in them the early habits of Industry, Order, and Good Conduct.\" The proposal was approved and a committee was appointed, chaired by Hutchings, to see the project to fruition. The first iteration of [Penang Free School](/wiki/Penang_Free_School), housed temporarily at a private residence in Love Lane, George Town, was opened for 25 boys on 21 October 1816. A year later, the school committee reported that 49 boys and 11 girls were enrolled. ## Bible translation work and family In November 1816 Hutchings, ill with fever, left for [Calcutta](/wiki/Kolkata) on four months' sick leave. Having recovered, he became involved in Bible translation work on behalf of the [Calcutta Auxiliary Bible Society](/wiki/Bible_Society_of_India) (a chapter of the [British and Foreign Bible Society](/wiki/British_and_Foreign_Bible_Society)) in the town of [Barrackpore](/wiki/Barrackpore) near Calcutta. In an exchange of services, the local chaplain, Joseph Rawlings Henderson, arrived in Penang in the final days of 1816. Hutchings was requested to correct Dutch theologian Melchior Leydekker's 1733 [Malay](/wiki/Malay_language) translation of the New Testament, a translation that had been criticised for its heavy use of Arabic and Persian loanwords. Hutchings and a colleague, J. McGinnis, identified over 10,000 words that were not in [William Marsden](/wiki/William_Marsden_(orientalist))'s *Grammar and Dictionary of the Malay Language*. The Bible Society printed the revised High Malay translation of the New Testament in [Serampore](/wiki/Serampore) in 1817. In August 1817 the substitute chaplain in Penang, believing Hutchings to be ready to return, went back to Calcutta. However, the Bible Society was impressed with Hutchings' ability in translating scripture into Malay in the Arabic-derived [Jawi alphabet](/wiki/Jawi_alphabet) and requested an extension of the exchange of services for a further two years, so Hutchings could also translate and supervise the printing of the Old Testament. The Society wrote: *\"we could not obtain suitable Assistants, so as to commence the Printing of the Malay Version in the Arabic Character, until the arrival of the Revd Mr Hutchings (on Sick Certificate) from Penang. We can scarcely speak in too high terms of the indefatigable zeal and attention shewn by that Gentleman among many interruptions from Sickness, in the revision of the new Testament\"*. In the end, Hutchings did not return to Penang until March 1820 and Henderson resumed his substitution there in the meantime. In Barrackpore, Hutchings married Elvira Phipps (1791 – 1875) on 15 May 1818. Their daughter Sarah was born in Barrackpore on 29 January 1819, while their daughter Eliza Sophia died in infancy and was buried on 7 February 1820. A revision of Leydekker's translation of the Old Testament in High Malay appeared in 1821. There is no indication that Hutchings' revised translation was widely distributed except in Penang, and it was not reprinted. However, it was only the beginning of extensive efforts to improve the Bible in Malay and to distribute it more widely. Hutchings, now with his wife and their daughter, returned to Penang in March 1820. Noting the onset of symptoms that led to serious illness before, he requested sick leave again in May. Notwithstanding his poor health, he joined government employee [Robert Ibbetson](/wiki/Robert_Ibbetson) on a visit to the eastern states of [Sumatra](/wiki/Sumatra) to encourage trade agreements. Hutchings brought \"Testaments and Religious Tracts in the Malayan language\", but the mission was ended a mere three months later as Ibbetson fell severely ill. They arrived back in Penang in September 1820. Six children were born to Hutchings and his wife in Penang: Robert Sparke on 18 December 1820, Elvira on 17 November 1821, Julia on 30 December 1822, Georgina on 21 January 1824 (died 1825), Margaret on 26 November 1824 and Constantine on 3 December 1825 (died 1826). ## The Raffles Institution and work on behalf of Penang Free School Alongside Robert Ibbetson and government administrator William Armstrong Clubley, Hutchings sat on the committee of [St. George's Church](/wiki/St._George%27s_Church,_Penang) in George Town. This church had been built while Hutchings was on secondment to Barrackpore. As the chaplain, he advocated for repairs and improvements to the church, and a suggestion of his was carried out that the portico be adapted to allow carriages to draw up underneath. He continued to suffer poor health and, fearing for his life, left for China in July 1822, having drawn up his will in which he bequeathed his possessions to his wife. On his way back he stopped in [Singapore](/wiki/Singapore), where in late January 1823 he attended a meeting with founder of Singapore Sir [Stamford Raffles](/wiki/Stamford_Raffles) and the missionary [Robert Morrison](/wiki/Robert_Morrison_(missionary)). At this meeting it was decided to create the Singapore Institution, subsequently named the [Raffles Institution](/wiki/Raffles_Institution). Founded on 5 June of that year, this was the oldest school in Singapore. Hutchings spoke at a meeting held at Raffles' house on 1 April 1823, at which Raffles detailed the plan for the school. Hutchings was appointed a trustee of the Singapore Institution, as well as president and trustee of the Malayan College, to the funding of which he contributed. The Malayan College was the Institution's department for teaching [Siamese](/wiki/Thai_language) and Malay as well as other subjects in those languages. The rules drawn up for the College stated that the president \"may or may not be resident at the College, but whether present or absent, he is to be considered as the head of the Institution\"; his duty was \"to promote the general welfare of the College, and when present to act as chairman of the council.\" On 29 April Hutchings returned to Penang, where services in St. George's Church were resumed. In June 1823 Hutchings began establishing spice plantations and building a home, Mount Elvira, on one of the higher mountains of Penang in the district of Ayer Etam. In 1824 he inspected three new boys' schools and one girls' school in [Province Wellesley](/wiki/Province_Wellesley) and examined their students. He also sat on the school committee that in January 1924, as every year, reported on the state of the Free School or \"Pinang School\". In the *Prince of Wales Island Gazette* he called on subscribers to the school to make their contributions if they had not yet done so, as well as appealing for additional subscribers. ## Final years and death In February 1824, Hutchings was among those appointed to a committee for superintending the construction of a cenotaph to the memory of [Francis Light](/wiki/Francis_Light), the founder and first superintendent of the British settlement on the island. The [Francis Light Memorial](/wiki/Francis_Light_Memorial), probably completed in the second half of 1824, is located in the grounds of St. George's Church. For reasons that are unclear, Hutchings was opposed later that year to the installation of a memorial tablet in the church to the late senior member of council John Macalister. This caused some controversy, and a commemorative plaque was not placed until several months after Hutchings' death. In May 1825 Hutchings petitioned the government for an allowance for house rent, stating that his salary was insufficient to meet his health expenses and the education of his family. In August 1825 he again went to China on sick leave, returning towards the end of the year and resuming his activity as secretary of the school committee. In this period Penang Free School contended with friction between Catholics and Protestants. In January 1827 Hutchings sold his house on North Beach and moved to Mount Elvira. It was at his hilltop estate that he succumbed to malarial fever on 20 April 1827, aged 45. His remains were brought to St. George's Church and buried in the Old Protestant Cemetery the following evening, attended by a large assembly of all classes of the community. Hutchings had held the chaplaincy of Penang until his death. In October 1827 Robert Abercrombie Denton, who had come over from [Madras](/wiki/Chennai), was appointed the new chaplain. Following Hutchings' death, his wife and children moved to England. Prior to this, Elvira Hutchings had submitted a petition to the government, explaining her dire financial situation. She was granted a pension two years later, to commence from the date of her husband's decease. In 1829 she married James Carey, Esq. in [Cape Town](/wiki/Cape_Town); they had four children. Robert and Elvira's son Robert Sparke Hutchings (1820–1910) studied at Oxford and was [perpetual curate](/wiki/Perpetual_curate) of [Monkton Wyld](/wiki/Wootton_Fitzpaine), [vicar](/wiki/Vicar) of [Pitton](/wiki/Pitton) and [Alderbury](/wiki/Alderbury), and [prebendary](/wiki/Prebendary) of [Salisbury](/wiki/Salisbury). ## Legacy In its tribute to Hutchings following his death, the *Prince of Wales Island Gazette* wrote: *\"Of the value and importance attached to his professional labours, the best proof was afforded by the regular attendance of the community at public worship\"*. The paper praised his efforts *\"in behalf of our native population, by founding our public school; and afterwards, in promoting and securing its prosperity, by his unwearied application to the closely watching of its progress and perfecting all its minute and complicated details.\"* The *Gazette* further noted *\"his ardour and assiduity in the study of the Malayan language, with the great and meritorious object of improving the vernacular translation of the scriptures\"*, as well as *\"the active part which he so kindly took in the management of our presidency library\"*. In his history of early Penang, Marcus Langdon observes: *\"Reverend Robert Sparke Hutchings' legacy to Penang was undoubtedly the Free School, which was conceived, organised and tirelessly promoted by him while he was present on the island. However, as we have seen, he should not be credited with the same for St George's Church. That project [...] was well advanced in planning prior to his arrival and constructed entirely during his absence. Hutchings may well have been consulted over early design issues, but the extent of his involvement recorded in the government records is limited to initial advice on where to place the church - his choice being subsequently overturned.\"* Langdon also calls Hutchings the Free School's *\"founding father and staunchest advocate\"*. A row of stained-glass windows in the North Aisle of St. George's Church in Dittisham displays the Hutchings' family crest and bears the dedication: \"To God and the Church in memory of John Hutchings and Robt Sparke Hutchings formerly Rectors of this Parish\". At the sesquicentenary of Penang Free School in 1966, an inscription was added to Hutchings' tomb honouring him as the school's founder. On \"Founder's Day\" (21 October), prefects and teachers from Penang Free School, as well as representatives from Hutchings Primary School and Hutchings Secondary School, annually hold a memorial service at the tomb. In 2016, to mark the bicentenary of the school's founding, more than thirty \"Old Frees\" or alumni travelled through nineteen countries in six 4×4 vehicles in a \"PFS Penang-Dittisham(UK) Drive\". In Dittisham they attended a thanksgiving service at St. George's Church. Also in that year, the Old Frees Association installed a plaque to the memory of Robert Sparke Hutchings at the foot of his tomb. ## Notes ### Works cited - Langdon, Marcus (2015). *Penang: the fourth presidency of India, 1805-1830*. Penang, Malaysia: Areca Books. [ISBN](/wiki/ISBN_(identifier)) 978-967-5719-07-3. [OCLC](/wiki/OCLC_(identifier)) 853505014.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:48:23.997348",
  "title": "Robert Sparke Hutchings",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Robert_Sparke_Hutchings"
}