{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:48:28.243010"
  },
  "content": "Singaporean retail company **Robinsons Department Stores Online Pte Ltd** (formerly known as **Robinsons & Co. Pte Ltd**) is an online [retail](/wiki/Retail) company based in Singapore. The company owned Robinsons [department stores](/wiki/Department_store) in Singapore and Malaysia, which closed in 2021. It also operated the largest department store in the Middle East at the [Dubai Festival City](/wiki/Dubai_Festival_City) before its closure in 2021. Robinsons Singapore was a member of the [International Association of Department Stores](/wiki/International_Association_of_Department_Stores) from 1997 to 2012. Robinsons Department Stores Online Pte Ltd is currently part of the [Australia](/wiki/Australia)-based wholesale supplier Canningvale Australia. ## History ### Sale to Al-Futtaim Group In April 2008, the [Al Futtaim Group](/wiki/Al_Futtaim_Group) bought 88% of the shares of Robinsons & Co. at S$7.20 per share. Under the new owners, the chain tried to go upmarket, opening a 20,800 square feet concept store at [The Shoppes at Marina Bay Sands](/wiki/Marina_Bay_Sands) in September 2011. It was not successful, however, and closed just two years later in May 2013, with Mr Kraatz saying that the space was insufficient as \"customers expect a full-fledged department store which sells everything when they step into Robinsons\". In June 2013, the store opened its first suburban branch with four floors of retail space at nearly 85,000 square feet, at [Jem](/wiki/Jem,_Singapore) in Jurong East and in November 2013, the Centrepoint flagship store closed when the lease expired. It moved to its current location in the Heeren, with an even bigger space of 186,000 sq ft spread over six floors of retail space. In 2016, Robinsons & Co launched its first [e-commerce](/wiki/E-commerce) website alongside the Autumn Winter 2016 Campaign and shut down its final [John Little](/wiki/John_Little_(department_store)) store in Singapore. In 2017, Robinsons expands to Middle East, by opening a three-level store at [Dubai Festival City](/wiki/Dubai_Festival_City) in Dubai, United Arab Emirates. In 2018, a three-level store at [Kingdom Centre](/wiki/Kingdom_Centre) in Riyadh, Saudi Arabia, was opened. ### Closure of physical stores Robinsons exited Singapore and Malaysia in 2020 due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic). In August that year, Robinsons announced the closure of its Jurong East Mall outlet, followed by their main outlets at *The Heeren* and [Raffles City](/wiki/Raffles_City_Singapore) on 30 October, ending its 162-year history and joining the list of closures in the city-state, such as [Topshop](/wiki/Topshop), Hotwind and [Esprit Holdings](/wiki/Esprit_Holdings). The store had been put under a creditors' voluntary winding-up; affected staff were either redeployed to other stores within the Al-Futtaim Group or offered reemployment assistance. Robinsons also shuttered its two stores in Malaysia at the [KLCC](/wiki/Kuala_Lumpur_City_Centre) and [Mid Valley City](/wiki/Mid_Valley_City), both in [Kuala Lumpur](/wiki/Kuala_Lumpur), in November and December 2020, ending its near-century presence in Malaysia from 1928 to 2020. The former store space in Mid Valley City has since been replaced by a pop-up [Isetan](/wiki/Isetan) store. Robinsons The Heeren was closed on 16 December 2020, and the Marks & Spencer Raffles City outlet was closed on 31 December 2020 as the lease was under Robinsons. The Raffles City outlet closed on 9 January 2021 with all stocks sold. The brand however lived on in [Dubai](/wiki/Dubai), [United Arab Emirates](/wiki/United_Arab_Emirates), with an outlet at [Dubai Festival City](/wiki/Dubai_Festival_City) mall before its closure on 28 March 2021. ### Reopening On 10 June 2021, Robinsons announced its return as an online store, Robinsons Online, following its acquisition by wholesale supplier Canningvale Australia. Jordan Prainito, the former managing director of Canningvale Australia joined Robinsons as its Managing Director to bring the learnings from Canningvale's digital transformation into Robinsons. On 24 June 2021, Robinsons online shopping website went live. - Robinsons\n",
  "language": "en",
  "processed_at": "2026-01-12T11:48:28.242582",
  "title": "Robinsons Department Stores Online",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Robinsons_Department_Stores_Online"
}