{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:48:32.727289"
  },
  "content": "Singaporean nano- and biophysicist **Roderick Y. H. Lim** is a Singaporean [nano](/wiki/Nanophysics)- and [biophysicist](/wiki/Biophysicist) at the [Biozentrum](/wiki/Biozentrum_University_of_Basel) of the [University of Basel](/wiki/University_of_Basel), [Switzerland](/wiki/Switzerland). ## Life Lim studied [physics](/wiki/Physics) at the [University of North Carolina at Chapel Hill](/wiki/University_of_North_Carolina_at_Chapel_Hill). In 2003 he obtained his PhD from the [National University of Singapore](/wiki/National_University_of_Singapore) for research carried out at the Institute of Materials Research and Engineering. This was followed by postdoctoral work at the M.E. Mueller Institute for Structural Biology at the Biozentrum until 2008. In 2009, he was appointed Argovia Professor for [nanobiology](/wiki/Nanobiology) at the Biozentrum and the [Swiss Nanoscience Institute](/wiki/Swiss_Nanoscience_Institute), where he received tenure in early 2014. ## Work Lim is interested in nucleocytoplasmic transport regulation, its impact on cellular function, and how this phenomenon can be leveraged towards bio-inspired applications. He studies how [karyopherin](/wiki/Karyopherin) receptors facilitate this highly rapid and selective process through [nuclear pore](/wiki/Nuclear_pore) complexes (NPCs). Lim combines biophysical, nanotechnological, and cellular approaches to unravel the emergent physical principles that underlie biological function and then verify the results in [biomimetic](/wiki/Biomimetic) systems. His key contributions include a karyopherin-centric model of the NPC and the discovery of two-dimensional transport control in artificial systems. Of late, he has gravitated towards [mechanobiology](/wiki/Mechanobiology), in particular [cell](/wiki/Cell_(biology)) motility and cancer progression. Lim is a co-inventor of ARTIDIS (\"Automated and Reliable Tissue Diagnostics\"), an [atomic force microscope](/wiki/Atomic_force_microscope)-based innovation for cancer diagnosis. ## Awards and honors - 2008 Pierre-Gilles de Gennes Prize - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:48:32.726892",
  "title": "Roderick Lim",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Roderick_Lim"
}