{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:48:34.532683"
  },
  "content": "Singaporean musician (1954–2005)This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Roger Kool\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2022)* *(Learn how and when to remove this message)* **Roger Kiew**, who goes by his celebrity moniker **Roger Kool** was a [Singaporean](/wiki/Singapore) [DJ](/wiki/DJ) who was well-known uniquely for being the first local blind celebrity. He was also remembered for his signature bells ringing sounds and the catchy *Here's Roger Kool!* at the start of his radio shows in the 1980s. ## Biography Born to a poor family in 1954, Kiew became [blind](/wiki/Blindness) due to eye cancer when he was five years old. He first joined the cable radio station [Rediffusion](/wiki/Rediffusion) and as a result of his unique presentations he grew to become a popular DJ in the 1970s and 1980s, especially with the [Burger King](/wiki/Burger_King)-sponsored radio show *Saturday Spin* that he hosted from 1984 to 1986. Despite having millions of fans across Singapore through his syndicate radio shows (one of which was his famous \"Dial-A-Joke\" programme), it did not stop there; the numbers grew with his start of sponsored radio shows for [Coca-Cola](/wiki/Coca-Cola), [Kodak](/wiki/Kodak), Swensen's, [Isetan](/wiki/Isetan), Sembawang Music Centre, Stamford Tires, as well as numerous college, polytechnic, and club appearances. Having met monumental stars such as Cliff Richard, Helen Reddy, Dionne Warwick, Stevie Wonder, Toni Braxton, and many more, he gained respect from critics everywhere despite his physical disabilities. He moved to Sri Lanka for a year, accepting a job there, and then continued on to work at NTUC Radio Heart 91.3 during the 1990s. In 1998 he then started his own CD series, \"Better English with Roger Kool\", which has helped aid children in primary schools throughout Singapore learn how to speak better English. With that came a Multiplication CD, a CD aimed towards aiding kids to memorize their multiplication tables with catchy songs. In July 1999, Roger and his wife Lynette held lunchtime roadshows twice a week at the [National University of Singapore](/wiki/National_University_of_Singapore), [Temasek Polytechnic](/wiki/Temasek_Polytechnic) and the [Singapore Polytechnic](/wiki/Singapore_Polytechnic) for the entire month. Kool died of [bone cancer](/wiki/Bone_cancer) on 31 October 2005 in Vancouver, Canada leaving behind his wife, Lynette Loon, and two sons, Jay and Neil. This Singaporean biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:48:34.532425",
  "title": "Roger Kool",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Roger_Kool"
}