{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:48:36.316526"
  },
  "content": "Southeast Asian fruit and vegetable dishThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Rojak\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2025)* *(Learn how and when to remove this message)* **Rojak**[a] or **rujak** ([Javanese](/wiki/Javanese_language): ꦫꦸꦗꦏ꧀) is a salad dish of [Javanese](/wiki/Javanese_cuisine) origin, commonly found in Indonesia, Malaysia, and Singapore. The most popular variant in all three countries is composed of a mixture of sliced fruit and vegetables and served with a spicy [palm sugar](/wiki/Palm_sugar) dressing. There is a variety of preparations, especially in [cuisine](/wiki/Indonesian_cuisine), and rujak is widely available throughout the country. The most common variant is primarily composed of fruits and vegetables, and its sweet and tangy dressing is often made with [shrimp paste](/wiki/Shrimp_paste). Some recipes may contain seafood or meat components, especially in Malaysia and Singapore, where a notable variant shows influence from [Indian Muslim cuisine](/wiki/Mamak_stall). ## Etymology According to the Dutch missionary [Petrus Josephus Zoetmulder](/wiki/Petrus_Josephus_Zoetmulder), the word *rujak* (ꦫꦸꦗꦏ꧀) comes from [Old Javanese](/wiki/Old_Javanese) *anrujak* or *rinujak*, which mean \"to chop into little pieces\". Alternatively, its origin may be the word *rurujak*, meaning a mixture of chopped unripe fruit, as attested in the ancient Taji Inscriptions (901 CE) from the era of the [Mataram kingdom](/wiki/Mataram_kingdom) in Central Java. The dish was later introduced to other regions and neighboring countries by the Javanese diaspora as well as by Indian migrants from Java. In Malaysia and Singapore, it is spelled \"rojak\". ## Cultural significance In Indonesia, particularly among the [Javanese](/wiki/Javanese_people), the sweet, spicy, and sour tastes of rujak are popular among pregnant women; this craving for unripe [mango](/wiki/Mango) and other sour-tasting fruits is known as *ngidham* or *nyidham* in Javanese. In Javanese culture, rujak is an essential part of the traditional [prenatal](/wiki/Prenatal) ceremony called *[naloni mitoni](/wiki/Naloni_mitoni)* or *tujuh bulanan* (literally: \"seventh month\") and is meant to wish the mother-to-be a safe, smooth, and successful [labour](/wiki/Childbirth). The recipe for this ceremony is similar to typical fruit rujak, with the exceptions that the fruits are roughly shredded instead of thinly sliced, and that *jeruk bali* ([pomelo](/wiki/Pomelo)/pink [grapefruit](/wiki/Grapefruit)) is an essential ingredient. Javanese people believe that if the rujak tastes sweet, the child will be a girl, and if it is spicy, it will be a boy. *Mangarabar*, or rujak-making, is a special event for the [Batak](/wiki/Batak_(Indonesia)) and [Mandailing](/wiki/Mandailing) people of Tapanuli, [North Sumatra](/wiki/North_Sumatra), following a harvest, with entire villages getting involved. In Malaysia and Singapore, \"rojak\" is also used as a colloquial expression for an eclectic mix, in particular as a word describing the multiethnic character of the two societies. ## Indonesian rujak ### *Rujak buah* (fruit rujak) In Indonesia, *rujak buah* is also known as *rujak manis* (sweet rujak). The typical Indonesian fruit rujak consists of slices of assorted tropical fruits, such as [water apple](/wiki/Water_apple), [pineapple](/wiki/Pineapple), unripe [mango](/wiki/Mango), [jícama](/wiki/J%C3%ADcama), [cucumber](/wiki/Cucumber), *[kedondong](/wiki/Spondias_dulcis)*, and [sweet potato](/wiki/Sweet_potato). Sometimes, variants of green apple, [bilimbi](/wiki/Bilimbi), and [pomelo](/wiki/Pomelo) are added. The sweet and spicy rujak dressing is made of water, [palm sugar](/wiki/Palm_sugar), [tamarind](/wiki/Tamarind), crushed peanuts, [shrimp paste](/wiki/Shrimp_paste) (known locally as *[petis](/wiki/Petis)*), salt, and [bird's eye chili](/wiki/Bird%27s_eye_chili). The fruits are cut into bite-sized pieces, and the dressing is poured on top. An addition of *[sambal](/wiki/Sambal) garam* powder (a mixture of salt and ground red chilli) is offered on the side for a saltier flavor. Javanese people call this version of rujak *lotis*. ### *Rujak Bagan* *Rujak bagan* is a typical dish of [Bagansiapiapi](/wiki/Bagansiapiapi), Riau, locally known as *lolia*. It consists of pineapple, prawn [fritters](/wiki/Fritters), cucumber, and [bean sprouts](/wiki/Bean_sprouts). ### *Rujak bakso* *Rujak bakso*, or *bakso rujak*, is a fusion dish between rujak and *[bakso](/wiki/Bakso)*. In [Malang](/wiki/Malang), the dish is made using a mixture of noodles, [water spinach](/wiki/Ipomoea_aquatica), *[menjes](/wiki/Tempeh#Tempe_menjes_kacang)*, [tofu](/wiki/Tofu), and meatballs, sprinkled with seasoning made from peanuts, chilies, and *petis*, and doused with *bakso* soup. In [East Jakarta](/wiki/East_Jakarta), *bakso rujak* is made with cucumber, mango, *[kedondong](/wiki/Spondias_dulcis)*, jícama, guava, papaya, pineapple, and [starfruit](/wiki/Starfruit). The fruits are cut into pieces and doused in *bakso* and rujak sauce. ### *Rujak belut* In [Brebes](/wiki/Brebes_Regency), a version of rujak called *rujak belut* is common, consisting of fried [eel](/wiki/Eel) smeared with sambal and served with fresh chopped [shallot](/wiki/Shallot) and tomato. ### *Rujak bulung* *Rujak bulung* is a traditional dish from Bali containing [seaweed](/wiki/Edible_seaweed) mixed with [fish sauce](/wiki/Fish_sauce), grated coconut, grated [galangal](/wiki/Galangal), and seasoning made from salt, sugar, chili peppers, and shrimp paste. ### *Rujak cingur* *Cingur* (pronounced \"ching-ur\") literally means \"mouth\" in [Javanese](/wiki/Javanese_language).[*citation needed*] This variant of rujak originates from [Surabaya](/wiki/Surabaya) and has a meaty taste, as it contains slices of cooked [buffalo](/wiki/Water_Buffalo) or cow lips, jícama, unripe mango, pineapple, cucumber, *[kangkung](/wiki/Ipomoea_aquatica)* (water spinach), *[lontong](/wiki/Lontong)* rice cake, tofu, and [tempeh](/wiki/Tempeh), all served in a black *petis* sauce, and crushed peanuts. It is topped with a sprinkle of fried shallots and [krupuk](/wiki/Krupuk) prawn crackers. ### *Rujak corek* This version of rujak is made from a hollowed-out cucumber filled with a *petis* sauce. ### *Rujak cuka* *Rujak cuka* literally means \"vinegar rujak\". It is a speciality of [Sundanese cuisine](/wiki/Sundanese_cuisine) of West Java, noted for its sourness. It is made of shredded fruits such as pineapple and unripe mango, and vegetables such as jícama, cabbage, bean sprouts, and cucumber. It is similar to *[asinan](/wiki/Asinan)*, due to its sour and spicy dressing, since both dishes contain vinegar, palm sugar, and chilli. ### *Rujak ebi* *Rujak ebi* is a fruit rujak containing *ebi* ([dried shrimp](/wiki/Dried_shrimp)) and [emping](/wiki/Emping) crackers. It is a delicacy of [Singkawang](/wiki/Singkawang), West Kalimantan. ### *Rujak es krim* A specialty dessert from [Yogyakarta](/wiki/Yogyakarta), this dish consists of fruit rujak and coconut ice cream, served with sambal. ### *Rujak gamel* *Rujak gamel* is a specialty rujak of Gamel village in [Cirebon Regency](/wiki/Cirebon_Regency), West Java. It consists of noodles, boiled water spinach, cabbage, tofu, fritter, [eggplant](/wiki/Eggplant), and wet *krupuk*. ### *Rujak gobet* *Rujak gobet* is usually served on special occasions such as the *telonan* or *tingkepan* celebrations of pregnant women. Various types of fruits, such as jícama, pineapple, starfruit, and guava are included, but especially young [jackfruit](/wiki/Jackfruit), locally known as *babal*. ### *Rujak juhi* *Juhi* means [salted](/wiki/Salted_squid) [cuttlefish](/wiki/Cuttlefish) in Indonesian.[*citation needed*] This variety of rujak contains fried tofu, fried boiled potatoes, fried shredded salted cuttlefish, cucumber, noodles, lettuce, cabbage, peanut sauce, vinegar, chilli, and fried garlic. It originates from the [Chinese community](/wiki/Chinese_Indonesian) in Batavia (now [Jakarta](/wiki/Jakarta)). ### *Rujak kambang* *Rujak kambang* consists of [rice vermicelli](/wiki/Rice_vermicelli), cucumber, unripe mango, unripe papaya, as well as other fruit, seasoned with a thin sauce consisting of fish broth and *petis* as well as salt and vinegar. ### *Rujak kangkung* *Rujak kangkung* is made from water spinach, sweet spicy sambal, and krupuk. It is a delicacy from [Kuningan](/wiki/Kuningan_Regency), West Java. ### *Rujak kembang katis* *Rujak kembang katis*, or *rujak bunga pepaya*, originates from [Bangka Island](/wiki/Bangka_Island). It consists of [cassava](/wiki/Cassava) leaves and papaya flowers as well as other vegetables, together with peanut sauce. ### *Rujak kuah pindang* *Rujak kuah pindang* is a popular street food in [Bali](/wiki/Bali), where instead of the normal dressing, the fruits are soaked in a spiced fish broth, which consists of [terasi](/wiki/Terasi) shrimp paste, salt, bird's eye chilli, red chilli, and [pindang](/wiki/Pindang) fish broth. ### *Rujak kucur* Commonly found in [Cirebon](/wiki/Cirebon), West Java, this dish, whose name means \"to pour\", is made with peanut sauce and spicy sour sauce. It includes water spinach, cucumber, bean sprouts, [asparagus beans](/wiki/Asparagus_bean), cabbage, different types of noodles, [bitter melon](/wiki/Bitter_melon), and papaya leaves. ### *Rujak mie* *Rujak mie* is a dish from [Palembang](/wiki/Palembang), consisting of noodles, tofu, slices of *[pempek](/wiki/Pempek)*, cucumber, lettuce, and sweet spicy broth. ### *Rujak Natsepa* Taken from the name of the beach where the dish is sold, in [Ambon, Maluku](/wiki/Ambon,_Maluku), this rujak is made with various fruits and vegetables, including rose apples, mangos, pineapples, starfruit, cucumbers, and sweet potatoes, as well as [nutmeg](/wiki/Nutmeg) and [tomi-tomi](/wiki/Flacourtia_inermis). The topping sauce is made with coarsely ground fried peanuts and palm sugar. ### *Rujak pengantin* *Pengantin* means \"bride-and-groom pair\" in Indonesian. This variant of rujak contains slices of boiled eggs, potatoes, fried tofu, pineapple, carrot, bean sprouts, pickles, chilli, lettuce, cabbage, cucumber, emping crackers, roasted peanuts, peanut sauce, and vinegar. ### *Rujak petis* Another variant from Surabaya[*citation needed*] and [Ponorogo Regency](/wiki/Ponorogo_Regency), *rujak petis* contains slices of jícama, unripe mango, cucumber, water spinach, *kedondong*, tofu, and [soybean](/wiki/Soybean) sprouts, all served in a black *petis* sauce, fried shallots, salt, palm sugar, unripe banana, and crushed peanuts. ### *Rujak selingkuh* *Rujak selingkuh*, which originates in [Sumenep](/wiki/Sumenep_Regency), Madura, contains a mix of fruits with peanut sauce and [soto soup](/wiki/Soto_(food)), to which are added vegetables, rice vermicelli, and *lontong*. ### *Rujak serut* Literally meaning \"shaved rujak\", *rujak serut* consists of similar ingredients as standard *rujak buah*, with the difference being that the fruits are not cut into bite-sized pieces but shredded into a roughly grated consistency. ### *Rujak Shanghai* This version of rujak was created by Indonesia's Chinese community in [Kota Tua Jakarta](/wiki/Kota_Tua_Jakarta). It contains seafood, boiled sliced octopus, [jellyfish](/wiki/Jellyfish_as_food), and water spinach, and is served with thick red [sweet and sour](/wiki/Sweet_and_sour) sauce, mixed with pineapple juice and toasted crushed peanuts. Chilli sauce and pickled jícama are often served as condiments. ### *Rujak siwil* A rujak dish from [Madura](/wiki/Madura), *siwil* is made from wheat flour, [tapioca flour](/wiki/Tapioca_flour), garlic, and spices. Generally, *siwil* dough will be put into long plastic tubes and boiled first. It can additionally be fried with flour or simply cut and served with rujak seasoning made of a fish *petis* sauce. ### *Rujak soto* A dish from [Banyuwangi](/wiki/Banyuwangi), East Java, this is a blend of beef soto and *rujak cingur*, in which the vegetables (water spinach and bean sprouts) are served with *lontong* in a *petis* sauce poured over soto soup. ### *Rujak tahu* *Rujak tahu* is a variant of rujak that contains tofu and was created in [Majalengka Regency](/wiki/Majalengka_Regency) in the 1970s. The sauce combines vinegar, sambal, and sweet soy sauce. ### *Rujak teplak* In [Tegal Regency](/wiki/Tegal_Regency), *rujak teplak* is a common variety of rujak consisting of vegetables such as water spinach, cabbage, bean sprouts, [asparagus beans](/wiki/Asparagus_bean), papaya leaves, cassava leaves, and banana blossoms, smeared with spicy sauce made from chilli, peanuts, and cassava. The dish is served with a noodle cracker called *kerupuk mie*. ### *Rujak terasi* This version of rujak is from [Lombok](/wiki/Lombok) and consists of slices of fruits such as mango, june plum, pineapple, and papaya, mixed with sambal containing roasted shrimp paste. ### *Rujak tolet* Also from Surabaya, *rujak tolet* includes fried tofu, fried garlic, and optionally, beef tendons. The sauce is *petis*-based, mixed with palm sugar, slices of raw bird's eye chilli, and sweet soy sauce. ### *Rujak tumbuk* (*rujak bēbēk*) This is another variant of Indonesian fruit rujak, from West Java. The ingredients are almost the same, except that they are ground or mashed together (*tumbuk* or *bēbēk* in Indonesian) in a wooden [mortar](/wiki/Mortar_and_pestle). The fruits include green [plantain](/wiki/Musa_balbisiana), raw [red yam](/wiki/Dioscorea_alata), jícama, apple, *kedondong*, and unripe mango. The dressing is not poured on the fruit but mixed in. Traditionally, *rujak tumbuk* was served on banana leaf plates called *pincuk*, though nowadays, it is more often served in plastic cups.[*citation needed*] ### *Rujak u' groeh* A delicacy from [Aceh](/wiki/Aceh) province, this rujak consists of very young and tender coconut meat, young (green) papaya, bird's eye chili, sugar, palm sugar, ice, salt, and a dash of lime. ## Malaysian and Singaporean rojak ### *Rojak buah* This section **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources in this section. Unsourced material may be challenged and removed. *Find sources:* \"Rojak\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2025)* *(Learn how and when to remove this message)* In Malaysia and Singapore, fruit rojak typically consists of cucumber, pineapple, jícama, bean sprouts, *taupok* (puffy, deep-fried tofu) and cut-up [youtiao](/wiki/Youtiao) (Chinese-style fritters). The dressing is made of water, shrimp paste, sugar, chilli, and lime juice. Ingredients vary among vendors, with some adding [tamarind](/wiki/Tamarind) or black bean paste to the mix. The ingredients are cut into bite-sized portions and tossed in a bowl with the dressing, and topped with crushed peanuts and a dash of ground or sliced [torch ginger](/wiki/Etlingera_elatior). A popular variant found in [Penang](/wiki/Penang), Malaysia, is **rojak Penang**, which adds water apple, [guava](/wiki/Guava), squid fritters, and honey to the mixture, and emphasizes the use of tart fruits such as unripe mangoes and green apples, while bean sprouts and fried tofu puffs are usually omitted. The dressing tends to be very thick, with an almost [toffee](/wiki/Toffee)-like consistency. ### *Rojak India* In Malaysia, *mamak rojak* (also known as Indian rojak, or *[pasembur](/wiki/Pasembur)*) is associated with [mamak stalls](/wiki/Mamak_stall), which are [Malaysian Indian](/wiki/Malaysian_Indian) Muslim food stalls. The dish contains fried dough fritters, tofu, boiled potatoes, prawn fritters, hard-boiled eggs, bean sprouts, cuttlefish, and cucumber, mixed with a sweet, thick, spicy peanut sauce. In the northwestern states of [Peninsular Malaysia](/wiki/Peninsular_Malaysia), such as Penang, and [Kedah](/wiki/Kedah), it is always called *pasembur*, while in [Kuala Lumpur](/wiki/Kuala_Lumpur), it is called *rojak mamak*.[*citation needed*] In Singapore, Indian rojak consists of an assortment of potatoes, hard-boiled eggs, tofu, and prawn fritters, often colorfully dyed. Customers typically select their favorite items from a display, after which they are heated up in a [wok](/wiki/Wok), chopped up, and served with a sweet and spicy peanut and chilli sauce on the side for dipping. ### *Rojak bandung* A Singaporean dish known as *rojak bandung* contains cuttlefish, water spinach, cucumber, tofu, peanuts, chilli, and sauce. Rojak bandung has no relation to the Indonesian city of [Bandung](/wiki/Bandung); in the Malay language, the term *bandung* means \"pairs\". ### *Rojak sotong* *Rojak sotong* contains cuttlefish or squid, with peanut sauce. ## Dishes with rojak seasoning ### Indonesia - *[Ayam bumbu rujak](/wiki/Ayam_bumbu_rujak)* – a chicken dish with *rujak* seasoning that includes chili and brown sugar - *Cireng bumbu rujak* – a deep-fried tapioca snack served with *rujak* seasoning sauce. - [List of fruit dishes](/wiki/List_of_fruit_dishes) - [List of salads](/wiki/List_of_salads) - [Mamuang nampla wan](/wiki/Mamuang_nampla_wan) – Thai snack - [Pecel](/wiki/Pecel) – Indonesian vegetable dish - [Bahasa Rojak](/wiki/Bahasa_Rojak) – Pidgin language of Malaysia ## Notes Media related to Rojak at Wikimedia Commons Portals: - Food - Indonesia - Malaysia - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:48:36.316043",
  "title": "Rojak",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Rojak"
}