{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:48:40.023410"
  },
  "content": "Singaporean funeral director **Roland Tay** ([Chinese](/wiki/Chinese_language): 郑海船; [pinyin](/wiki/Pinyin): *Zhèng Hǎichuán*; born 1947) is an [undertaker](/wiki/Undertaker) in [Singapore](/wiki/Singapore). He is known for helping the poor and families of murder victims by providing [pro-bono](/wiki/Pro-bono) funeral arrangements. Memorial services conducted by Tay include [Huang Na](/wiki/Murder_of_Huang_Na), [Liu Hong Mei](/wiki/Kallang_River_body_parts_murder), and [Ah Meng](/wiki/Ah_Meng), a Singapore tourism icon. ## Early life Born in 1947 as the fourth of 10 children to a hawker in a coffee shop along Lavender Street, Tay began his working life as a coffee boy at his family's coffee shop. He helped the family's coffee shop business by serving coffee and tea to customers in Singapore Casket and learned about the funeral trade. When his parents died in 1973 from [stomach cancer](/wiki/Stomach_cancer), 6 months apart from each another, Tay inherited the coffee shop before renting it out to start a transport business for students and factory workers. But it wasn't until in 1984 when he converted the coffee shop into Casket Palace, which was subsequently bought over by Singapore Casket. ## Career In the subsequent years, Tay started several funeral companies. Following the now defunct Casket Palace, he founded Casket Fairprice in 1993 which was subsequently managed by his two children from his first marriage. He later founded Tong Aik Undertaker, Hindu Casket and Direct Funeral Services. Tong Aik Undertaker is in charge of operating the [Singapore Police Force](/wiki/Singapore_Police_Force)'s police hearse, and also has operated as Direct Funeral Services since 2000. In 2004, Tay with Direct Funeral Services conducted the pro-bono funeral of [Huang Na](/wiki/Murder_of_Huang_Na), an eight-year-old girl who was murdered brutally in [Pasir Panjang](/wiki/Pasir_Panjang), Singapore. This was followed by another pro-bono funeral in 2005 of 22-year-old Chinese national [Liu Hong Mei](/wiki/Kallang_River_body_parts_murder), who was murdered and chopped into seven parts before being dumped in the [Kallang River](/wiki/Kallang_River). The process of sewing the body parts back together took Roland Tay and his embalmers 7 hours. He also oversaw the funeral of Li Hong Yan, a 24-year-old village girl from [Heilongjiang](/wiki/Heilongjiang) who drowned at [Sentosa](/wiki/Sentosa). Tay reportedly collected around three hundred identity cards of deceased persons whom were without family, and for whom he conducted pro bono funeral services. One of Tay's more memorable cases is the pro bono funeral he provided for the primate tourism icon [Ah Meng](/wiki/Ah_Meng) of Singapore. In 2013, Tay brought his daughter Jenny Tay into the business, who subsequently helped him rebrand the undertaking firm as a managing director after quitting her job at a marketing firm. Her husband Darren Cheng also closed down his counselling business and joined her in the company as an executive director. Thanks to their efforts, the business saw its annual revenue tripled from SG$2 million to SG$7 million in the subsequent years, and alongside their main funeral services, Direct Funeral Services now offers additional services like grief counselling, funeral pre-planning, living funerals, and via their charitable subsidiary Direct Life Foundation, opened volunteering opportunities to the public and their employees for both the underprivileged and the elderly. To this day, Tay continues managing pro-bono cases and alongside Jenny and Cheng, attend wakes under their company and Direct Life Foundation volunteering events. ## Personal life Tay married his first wife in his early 20s and together they had a son and a daughter who both manage Casket Fairprice. At some point, the marriage ended with a divorce. His second marriage, which also ended with a divorce in 2001, bore him another 2 daughters, including Jenny Tay who now manages Direct Funeral Services. Later, Tay married his third wife Sally Ho. However, both Tay and Ho filed and finalized their divorce in June 2013 before being embroiled into a court battle over their properties. According to the court papers, the cumulated properties were estimated to be a total of about $20 million. In 2019, the court ruled that Tay receive 60% of the matrimonial assets while Ho received 40%. The verdict also saw Ho being required to hand over her interests in the Direct Funeral business to Tay, hence effectively ending her membership with the company. Ho eventually moved on to set up her own funeral company, Dignity Funeral, together with her son from her first marriage, Jeffery Tay. ## Notable pro bono cases DateCaseDetails9 Nov 2004[Huang Na](/wiki/Murder_of_Huang_Na)8 year old girl brutally murdered by Took Leng How, who was [executed](/wiki/Capital_punishment_in_Singapore) in 2006.12 July 2005Liu Hong Mei[Kallang Body Parts Murder](/wiki/Kallang_River_body_parts_murder) victim. Her boyfriend Leong Siew Chor was found guilty of killing her and [executed](/wiki/Capital_punishment_in_Singapore) in 2007.31 Oct 2005Maung Saw OoMyanmar national who hanged himself when faced with deportation3 Dec 2005[Nguyen Tuong Van](/wiki/Van_Tuong_Nguyen)Vietnamese-Australian youth [executed](/wiki/Capital_punishment_in_Singapore) for drug trafficking27 Mar 2006Pham Thi Truc LincVietnamese hostess who died climbing out of Toa Payoh FlatOct 2006Tan Jee SuanMan who ran into MRT27 May 2007Yuan Fu DiChinese national who died from a hit-and-run26 Oct 2007[Pan Hui](/wiki/2007_Marsiling_flat_murder)15-year-old girl killed by her stepfather (who spent ten years in jail for manslaughter) in 2007.16 November 2007Siu Chun TaoConstruction worker who fell to his death10 February 2008[Ah Meng](/wiki/Ah_Meng)Death of Singapore tourism mascot, Ah Meng18 September 2008[Yang Jie](/wiki/Yang_Jie_(murder_victim))A 36-year-old [peidu mama](/wiki/Peidu_mama) and one of the three deceased victims of the [Yishun murders](/wiki/Yishun_murders) case. Her daughter, then 15 years old, survived the murders. The killer, Wang Zhijian, was [sentenced to death](/wiki/Capital_punishment_in_Singapore) in 2012 for the murder of Yang Jie and the other two victims.1 July 2009Huang Rui JingUnemployed man had no money to mourn for sister24 March 2010Li Hong YanKaraoke hostess from [China](/wiki/China) drowned at Sentosa13 May 2011AlaminBangladeshi worker who died while trapped in a container1 Feb 2015Ken OngMurdered his wife Karen Koh before turning the same knife on himself at their Yuan Ching Road home22 March 2016[Zhang Huaxiang](/wiki/Zhang_Huaxiang)A Chinese nurse strangled to death by her boyfriend Boh Soon Ho. Boh was arrested and sentenced to life imprisonment.30 June 2016Wee Yok TaiAn octogenarian bachelor who lived alone in a 1-room flat. In 2015, Wee approached and befriended Tay to preplan his services, fearing his lonely death like his prior neighbours.28 January 2017Choong Pei Shan and her daughter Teo Zi NingVictims of the 2017 [Woodlands double murders](/wiki/Woodlands_double_murders). Choong's husband Teo Ghim Heng was [sentenced to death](/wiki/Capital_punishment_in_Singapore) for murdering both of them, as well as killing his unborn son.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:48:40.022948",
  "title": "Roland Tay",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Roland_Tay"
}