{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:48:42.250615"
  },
  "content": "TV series or program ***Romance de Amour*** 1加1等于3 is a Chinese drama serial in [Singapore](/wiki/Singapore) aired in 2003. It has 30 episodes. The title is based on the French \"romance d'amour\" meaning a ballad or song of love. Jacelyn Tay sings the theme song of the show. The show stars [Li Nanxing](/wiki/Li_Nanxing), [Aileen Tan](/wiki/Aileen_Tan), [Jacelyn Tay](/wiki/Jacelyn_Tay), Pan Lingling, [Lin Meijiao](/wiki/Lin_Meijiao), [Rayson Tan](/wiki/Rayson_Tan), Huang Shinan, [Patricia Mok](/wiki/Patricia_Mok) and Zhang Wei. ## Story *Romance de Amour* is set against a beauty centre operated by three good friends ([Aileen Tan](/wiki/Aileen_Tan), [Jacelyn Tay](/wiki/Jacelyn_Tay) and [Pan Lingling](/wiki/Pan_Lingling)). Viewers will get to see how these three good friends get embroiled in various relationship problems and how each reacts to it. [Aileen Tan](/wiki/Aileen_Tan) plays Kang Li, a beautiful and elegant lady who is successful in her career; however her love life is a mess. She has been involved with a mature, caring and successful man, Huang Weide ([Li Nanxing](/wiki/Li_Nanxing)) for seven years. They also have a daughter aged seven together. However, Weide is married to Xu Fangning ([Lin Meijiao](/wiki/Lin_Meijiao)) whose family is powerful and rich. Realizing that Weide will not divorce his wife, Kang Li decides to end the affair for good and starts seeing Zheng Xuelun ([Qi Yuwu](/wiki/Qi_Yuwu)). Just when the turmoil surrounding the love triangle finally subsides, Kang Li is diagnosed with cancer, already in its terminal stages. Upon hearing that, Weide gives up everything to stay by Kang Li's side, much to his wife's discontentment. Unable to bear the thought of losing her husband to a dying woman, Fangning plots her revenge. The other lead in this drama is Qinghui ([Jacelyn Tay](/wiki/Jacelyn_Tay)), a capable, attractive woman with good business acumen. However, where affairs of the heart are concerned, she has her reservations about men and like Kang Li, she is secretly in love with another man (Huang Weide). On the other hand, Huishi ([Pan Lingling](/wiki/Pan_Lingling)) is the 'family and husband come first' type of woman. She is blessed with 2 children (a girl and a boy) and a caring and loving husband, Qipeng ([Rayson Tan](/wiki/Rayson_Tan)). On a night of drunken merrymaking during a business trip, Qipeng ends up sleeping with Qinghui. Later Huishi finds out about this and all hell breaks loose in her marriage with Qipeng. One fighting for her life, one fighting to keep her family together and one ends up betraying her friend. How will it turn out for the three friends who were once happily running their beauty centre? ## Accolades YearCeremonyAwardNomineesResultRef2003[Star Awards](/wiki/Star_Awards_2003)[Young Talent Award](/wiki/Star_Awards_for_Young_Talent)Fraser Tiong 张家奇Nominated[Best Actress](/wiki/Star_Awards_for_Best_Actress)[Aileen Tan](/wiki/Aileen_Tan) 陳麗貞Nominated[Jacelyn Tay](/wiki/Jacelyn_Tay) 郑秀珍Nominated[Best Supporting Actress](/wiki/Star_Awards_for_Best_Supporting_Actress)[Lin Meijiao](/wiki/Lin_Meijiao) 林梅娇Nominated[Best Drama Serial](/wiki/Star_Awards_for_Best_Drama_Serial)—N/aNominated - Romance de Amour Official Website This Singaporean television-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:48:42.250170",
  "title": "Romance de Amour",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Romance_de_Amour"
}