{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:48:44.235145"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Ronin\" band – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2008)* *(Learn how and when to remove this message)* **Ronin** was a [rock](/wiki/Rock_music) band based in [Singapore](/wiki/Singapore). They were known for their live performances and being one of the few popular bands in the hard/classic rock genre from Singapore. Before their entry to the mainstream market, the band launched a self-released [EP](/wiki/Extended_play) which included five songs, and later released an [LP](/wiki/LP_album) which was hugely successful[*citation needed*]. Their debut album *Do or Die* received rave reviews[*citation needed*] by local press, and is one of the top selling English-language albums in Singapore of all time[*citation needed*]. In 2006, the band collaborated with local [Mediacorp](/wiki/Mediacorp) artiste [Fiona Xie](/wiki/Fiona_Xie) in a love song duet, entitled \"Love Will Shine on Through\". The song was recorded to raise funds for a cancer project, with a book and a CD recorded together. One of their songs, \"One More Moment\", was covered by Singaporean artiste [Ho Yeow Sun](/wiki/Ho_Yeow_Sun). The band enjoyed a number one hit on local radio station 98.7, *Black Maria* in the Singapore charts, the song *Crazy Son* reached third. Ronin has also written the theme song and title soundtrack 'Memories' for the film *[Singapore Dreaming](/wiki/Singapore_Dreaming)*. In June 2007, lead singer Levan Wee performed with the band for the last time, due to a combination of personal issues, as well as differences in musical direction. The band continued for a short while after, but has been inactive as of 2008. ## Members - Sean Cheng: guitar - Simon Lee: guitar - Derryn Wong: bass - Bang Ong: drums Previous members - Levan Wee: vocals (left in 2007) All five members and ex-member of Ronin were students from [Victoria School](/wiki/Victoria_School). The band members have cameo appearances in the movie *Anna & Anna*, starring Karena Lam. They appear as the backing band of the film's lead actor, Tender Huang. ## Discography - *The EP* – a five-song EP which was self-released in January 2004. It was recorded at Snakeweed Studios, produced by Leonard Soosay and Ronin, and mastered at 301 Studios in Sydney. - *Do or Die* – a full-length album released in August 2005 and distributed by [Universal Music](/wiki/Universal_Music_Group). Recorded at Snakeweed Studios and produced by Leonard Soosay and Ronin. - garageband.com – Ronin profile This article on an Asian band or other musical ensemble is a stub. You can help Wikipedia by expanding it. - v - t - e This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:48:44.234883",
  "title": "Ronin (band)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ronin_(band)"
}