{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:48:49.456787"
  },
  "content": "Cannabis activist from New Zealand **Rose Renton** is a [Singapore](/wiki/Singapore)-born New Zealand [cannabis activist](/wiki/Cannabis_activist), known for her work advocating for [medicinal cannabis](/wiki/Medical_cannabis). Renton has campaigned for medicinal cannabis law reform and the right to grow plants, coordinating a petition which was presented to Parliament in 2016. She has also worked as a [green fairy](/wiki/Green_fairy_(cannabis)) providing her own home-made medicinal cannabis to patients prior to legalisation, a subject of numerous documentaries and media interviews. Renton became a high-profile figure in cannabis law reform in 2015 when her late son, Alex Renton, became the first person in New Zealand to be legally treated with medicinal cannabis oil under a special exemption by then Associate Health Minister [Peter Dunne](/wiki/Peter_Dunne). Renton was a prominent advocate of medicinal cannabis in the 2010s, and was transparent about her operation growing cannabis and supplying cannabis-based products to [New Zealanders](/wiki/New_Zealanders) with medical conditions, despite the illegality of it at the time. After her work was widely reported in New Zealand media, her activities were deemed in violation of the [Misuse of Drugs Act 1975](/wiki/Misuse_of_Drugs_Act_1975) by authorities. In October 2017, Renton faced 14 years in prison after being charged with cultivating high [cannabidiol](/wiki/Cannabidiol) cannabis plants, processing cannabis products and possessing cannabis for supply. She was subsequently discharged without conviction on all charges after a judge deemed her motivations \"altruistic.\" ## Personal life Renton was born to New Zealand parents in [Singapore](/wiki/Singapore), and left to New Zealand when she was two years old. Renton lives in [Nelson](/wiki/Nelson,_New_Zealand), New Zealand, and has seven children. She separated from her partner in 2018. Renton's work has seen her exposed to numerous legal issues. Despite this, she has stated she is grateful to the court system and police for acknowledging the \"altruistic nature of my healing work.\" For much of her career as an activist, she has been represented by [Sue Grey](/wiki/Sue_Grey_(lawyer)), a lawyer who has advocated for other cannabis activists. Renton runs a website *BYROSE*, runs a remedies course on Teachable, and maintains an online presence. In 2021, she started a private invite-only website to sell medicinal products. Renton has also run a consultancy service on traditional [Feng Shui](/wiki/Feng_shui), having studied it in 1996 under the guidance of Joseph Yu. ## Activism Renton's activism has included petitions and campaigns, various media appearances, and the use of social media. She has advocated for the right for people to grow their own cannabis as an alternative to commercial [pharmaceuticals](/wiki/Pharmaceutical_industry). She has criticised the high cost of products like [Sativex](/wiki/Sativex) and advocates for local production of cannabis medicines and remedies. Renton voted in favour of the Cannabis Legalisation and Control Bill in the [2020 New Zealand cannabis referendum](/wiki/2020_New_Zealand_cannabis_referendum), citing her concerns about the safety and quality of available cannabis. ### Alex Renton campaign In 2015, Renton's 19-year-old son, Alex, was locked in an [induced coma](/wiki/Induced_coma) in [Wellington Hospital](/wiki/Wellington_Hospital,_New_Zealand) after an acute prolonged [epileptic seizure](/wiki/Seizure). He had developed [encephalitis](/wiki/Encephalitis) and was suffering from [refractory status epilepticus](/wiki/Refractory_status_epilepticus). There was no legal framework to support the official use of cannabis-based medicines at the time. Renton and her family campaigned for her son to be able to access a cannabis treatment. [Peter Dunne](/wiki/Peter_Dunne), who was then the Associate Health Minister, approved the use of medical cannabis, allowing for a prescription of Elixinol, a [cannabis oil](/wiki/Cannabis_oil). Renton later admitted to secretly giving her son a cannabis oil product prior to receiving official approval, unwilling to wait for a special exemption which took 66 days. Alex Renton had reportedly opened his eyes and started moving after receiving cannabis oil, but remained unconscious. He died on 1 July 2015 from his condition, three weeks after receiving his first legal dose; 43 other medications had also been given to him. More than 200 people attended his memorial celebration. ### Law reform petition Following the death of her son, Renton became a prominent campaigner for medical cannabis to be urgently made available to New Zealanders. In March 2016, Renton started a petition advocating for safe, affordable access to medicinal cannabis, and began holding rallies and protests to drum up support. The petition collected around 17,500 signatures, and was conducted both in-person and online. Renton presented the petition at the [New Zealand Parliament](/wiki/New_Zealand_Parliament_Buildings) to [Labour](/wiki/New_Zealand_Labour_Party) and [Green](/wiki/Green_Party_of_Aotearoa_New_Zealand) politicians in October 2016. The petition was considered significant to the momentum of medicinal cannabis reform. ### Green fairy and cannabis supply Renton identified herself as a [green fairy](/wiki/Green_fairy_(cannabis)), providing illegal medicinal cannabis products to patients with medical conditions. Renton is open about her work, describing her home-made process in various media interviews, and has discussed the pressure of supplying sick and vulnerable patients in need while risking criminal prosecution. Consequently, her work drew attention from authorities, who deemed it in violation of the [Misuse of Drugs Act 1975](/wiki/Misuse_of_Drugs_Act_1975). In October 2017, Renton faced 14 years in prison after being charged with cultivating high [cannabidiol](/wiki/Cannabidiol) cannabis plants, processing cannabis products and possessing cannabis for supply. She was discharged without conviction on three charges in November 2018 after a judge ruled her motivations were \"altruistic.\" She was cleared of cannabis cultivation charges in 2019, a judge ruling that the consequences would be \"out of proportion\" to the offense and would prevent her from obtaining a cannabis license under the introduced legal framework. In late 2019, Renton stated she would retire from being a \"national green fairy,\" and would be focusing on her family. ### Environmental activism Renton protested poison drops in 2017 after witnessing an aerial [brodifacoum](/wiki/Brodifacoum) drop in the [Brook Waimārama Sanctuary](/wiki/Brook_Waim%C4%81rama_Sanctuary). Renton and her then husband reportedly confronted then local MP [Nick Smith](/wiki/Nick_Smith_(New_Zealand_politician)), and spread rat poison around him and on his suit in an act of protest. Police used a search warrant to access Renton's home and recover a cellphone which contained a video of the incident. Renton and her husband were found guilty of offensive behaviour and fined. Renton stated she did not regret the incident for bringing attention to the issue. ## Awards and media In 2019, Renton was among 14 recipients of the *Kiwibank Local Hero Medal* for her work in Nelson supporting the sick and vulnerable. However, in 2020, [Kiwibank](/wiki/Kiwibank) dropped her as a client and closed her bank accounts. The incident was condemned by some, including Green MP [Chlöe Swarbrick](/wiki/Chl%C3%B6e_Swarbrick), who said it highlighted an \"unjust system.\" Renton was the inaugural winner of the [NORML NZ](/wiki/NORML_New_Zealand) *Medicinal Cannabis Breakthrough Award 2016* for her petitioning and campaigning in medicinal cannabis law reform. In 2015, Renton appeared in the documentary series *Druglawed* by Arik Reiss. She was in attendance at the screening in 2015. In 2019, Renton appeared in the documentary *On Weed* by [Patrick Gower](/wiki/Patrick_Gower). In 2020, she appeared in a video feature on [The Spinoff](/wiki/The_Spinoff), discussing her work as a green fairy with comedian [Michèle A’Court](/wiki/Mich%C3%A8le_A%27Court). - [Cannabis in New Zealand](/wiki/Cannabis_in_New_Zealand)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:48:49.456388",
  "title": "Rose Renton",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Rose_Renton"
}