{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:48:56.739073"
  },
  "content": "Southeast Asian pancake **Roti jala**, **roti kirai** or **roti renjis** ([English](/wiki/English_language): **net bread** or **lace pancake**; [Jawi](/wiki/Jawi_alphabet): روتي جالا‎) is a popular [Malay](/wiki/Malay_cuisine), [Minangkabau](/wiki/Padang_cuisine), and [Acehnese](/wiki/Acehnese_cuisine) tea time snack served with curry dishes which can be found in [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia) and [Singapore](/wiki/Singapore). This is a very traditional Malay dish that is usually homemade and served at events such as weddings and festivals. It is usually eaten in sets of three to four pieces with curries, especially [chicken curry](/wiki/Chicken_curry), as a substitute to rice. ## Etymology *\"Roti jala\"*, comes from the combination of terms *\"[roti](/wiki/Roti)\"*, which means *\"the Indian flat bread\"*, and the Indian [sanskrit](/wiki/Sanskrit)-origin word *\"jala\"*, which means *\"the net\"* or *\"web\"*. Thus, the term *\"roti jala\"* means the *\"net roti\"* or *\"web roti\"*. ## History Not much is known about the history of roti jala, but it is believed that it [first came from modern-day India](/wiki/Appam). Roti jala has historical roots that are closely related to the [influence of Indian](/wiki/Indian_cuisine#Diaspora_and_fusion_cuisines) and Middle Eastern culture that entered the [Malay Archipelago](/wiki/Malay_Archipelago) through maritime trade routes in the 13th to 17th centuries. Roti jala is one of the results of cultural acculturation that emerged from interactions with these foreign traders. The name \"roti jala\" comes from its shape which resembles a net or fishing net, a symbol that is relevant to the lives of coastal communities. Roti Jala has a long history in Southeast Asia, dating back to the early 15th century. It was first introduced by the Malay community, who used to make it for special occasions like weddings, festivals, and other celebrations. Roti Jala was also a popular dish among the royal courts, where it was served to the sultans and their guests. Over time, Roti Jala became a staple food in Malaysia and Indonesia, and it is now a common dish that is sold in many restaurants and food stalls across the region. The Malays, being originally fishermen and living by the sea, found inspiration for the snack from the nets they used for fishing, thus the name. It is also called *roti renjis*, which means \"Rinsed Bread\", because of the original way it was made, which was by hand, in which the ingredient would be 'rinsed' onto the pan to be cooked. *roti kirai* is another name in which 'kirai' refers to the circular motion of the hand when pouring the ingredient from a condensed milk can with tiny holes poked through it. *Jalara dosa* originated from *roti jala*. ## Preparation The ingredients consist mainly of flour, eggs, milk (dairy or coconut), and a pinch of [turmeric](/wiki/Turmeric). They are combined with water to form a runny batter, then drizzled onto a hot pan in a circular motion. A specialized utensil is often used, resembling a cup with multiple outlets beneath, which aids the creation of the \"net-like\" effect. ### Comparison with string hoppers While both foods consist of string-like batter, *roti jala* is made with wheat flour while [string hoppers](/wiki/String_hoppers) are made with rice flour. *Roti jala* is made flat in a single layer (then folded or rolled up after cooking, as desired), while string hoppers are made into a small pile. *Roti jala* is essentially pan-fried, while string hoppers are steamed. - Food portal - Indonesia portal - Malaysia portal - Singapore portal - [Appam](/wiki/Appam), similar south Indian dish - [Kue laba-laba](/wiki/Kue_cubit), similar Indonesian dish - [Pek nga](/wiki/Pek_nga), Malaysian pancake - [Roti](/wiki/Roti), various types of Indian breads - [Malay cuisine](/wiki/Malay_cuisine) - [Minangkabau cuisine](/wiki/Minangkabau_cuisine) - [Indonesian cuisine](/wiki/Indonesian_cuisine) - [Indian cuisine](/wiki/Indian_cuisine) - \"Roti jala and curry in 7th Century Arabia?\". [Free Malaysia Today](/wiki/Free_Malaysia_Today). 2015-03-04. Archived from the original on 2016-03-04. Retrieved 2015-06-16.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:48:56.738719",
  "title": "Roti jala",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Roti_jala"
}