{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:48:58.473105"
  },
  "content": "Fried baguette sandwich with egg and filling **Roti John** (lit. 'John bread') is an omelette sandwich that is a popular street food dish in [Southeast Asia](/wiki/Southeast_Asia). It originated in Singapore in the 1960s and consists of a bread loaf, similar to a French [baguette](/wiki/Baguette), halved and cooked on a griddle with beaten egg and onions combined with a protein such as minced lamb, sardines or chicken. ## Origin *[Roti](/wiki/Roti)* comes from an Indian term for a round flatbread, used more generically to describe a bread sandwich of any shape. The origin of \"John\" within the name of the dish has not been definitively proven, but may derive from British use of John as a generic male first name, especially used to address someone whose first name is unknown, difficult to remember or difficult to pronounce, thus a name that may have been used by [British Armed Forces](/wiki/British_Armed_Forces) personnel to address native vendors in [British Malaya](/wiki/British_Malaya) or vice versa. Oral sources have claimed that the dish and name originated with a [Malay](/wiki/Malay_Singaporeans) cook who lived in Singapore during the early 1970s. In 1976 a stall in the [Taman Serasi](/wiki/Tanglin) hawker centre began serving the dish, after obtaining the recipe from another hawker. The stall's popularity led its version to became widely associated with the dish. It moved to [Serangoon Garden](/wiki/Serangoon_Garden) Market in 2001. - Food portal - Singapore portal - Indonesia portal - Malaysia portal - [Malay cuisine](/wiki/Malay_cuisine) - [List of sandwiches](/wiki/List_of_sandwiches) - [Chopped cheese](/wiki/Chopped_cheese) - [Denver sandwich](/wiki/Denver_sandwich) - [Egg in a basket](/wiki/Egg_in_a_basket) - [Mitraillette](/wiki/Mitraillette) - [Sloppy joe](/wiki/Sloppy_joe) - [St. Paul sandwich](/wiki/St._Paul_sandwich)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:48:58.472710",
  "title": "Roti john",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Roti_john"
}