{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:46:33.622877"
  },
  "content": "Hong Kong private equity firm **RRJ Capital** (RRJ) is a [private equity](/wiki/Private_equity) firm based in [Singapore](/wiki/Singapore). It is one of the largest private equity firms based in [Asia](/wiki/Asia). ## Background RRJ was founded in March 2011 by [Richard Ong](/wiki/Richard_Ong) who is currently chairman and CEO. Ong was previously Co-head of Asia [investment banking](/wiki/Investment_banking) at [Goldman Sachs](/wiki/Goldman_Sachs) and co-founder of [Hopu Investment Management](/wiki/Hopu_Investment_Management). The name \"RRJ\" is named after his three children. His brother, Charles Ong joined RRJ in 2012 and is currently co-CEO and co-chairman. Previously, Charles was the chief strategist of Singaporean sovereign wealth fund [Temasek Holdings](/wiki/Temasek_Holdings). From 2019, RRJ halted investing in China due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic) which led to lockdowns in the country that disrupted the economy. It moved its focus to Southeast Asia, the US and India. RRJ resumed investing in China in OCtober 2024 when it bought $150 Million worth of Luye Pharma Group bonds. In December 2023, it was reported that RRJ would be aiming to raise $2 billion for its first [private credit](/wiki/Private_credit) fund. ## Transactions In 2014, RRJ was the only non-Chinese direct investor in the acquisition of 30% of Chinese oil company, [Sinopec](/wiki/Sinopec). In May 2014, RRJ and [Temasek Holdings](/wiki/Temasek_Holdings) invested $1.8 Billion in the [NN Group](/wiki/NN_Group) before its [initial public offering](/wiki/Initial_public_offering). In November 2014, RRJ and Temasek Holdings purchased $1 billion of [convertible notes](/wiki/Convertible_bond) issued by Houston-based [Cheniere Energy](/wiki/Cheniere_Energy) Inc. In July 2018, RRJ Capita invested around $1.3 billion in companies owned by [HNA Group](/wiki/HNA_Group). By then RRJ had a minority stake in insurance company [FWD Group](/wiki/FWD_Group), which was reportedly laying the groundwork for an IPO in 2018. In April 2019, RRJ completed the acquisition of all outstanding shares in [Gategroup](/wiki/Gategroup) from HNA Group. As a result, RRJ became the sole shareholder and Temasek was invested in Gategroup through a mandatory exchangeable bond. In September 2019, Temasek converted the mandatory exchangeable bond to acquire 50% stake in Gategroup, making Temasek and RRJ co-shareholders. In March 2021, RRJ invested €450 million in [Vodafone](/wiki/Vodafone)'s Vantage Towers as part of its initial public offering. In March 2025, RRJ led a consortium to invest $600 million in [VistaJet](/wiki/VistaJet). - [Hopu Investment Management](/wiki/Hopu_Investment_Management) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:46:33.622506",
  "title": "RRJ Capital",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/RRJ_Capital"
}