{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:49:05.373038"
  },
  "content": "Singapore-based concert organiser and promoter**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)* **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(March 2016)* *(Learn how and when to remove this message)*The topic of this article **may not meet Wikipedia's notability guidelines for companies and organizations**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Running Into The Sun\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2016)* *(Learn how and when to remove this message)*This article needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(August 2019)* *(Learn how and when to remove this message)* **Running Into The Sun** is a Singapore-based concert organiser and [concert promoter](/wiki/Concert_promoter) founded in 2009. Owned by [Fly Entertainment](/wiki/Fly_Entertainment), the company was established after a suggestion by Beatrice Chia-Richmond, who managed Fly at that time. ## Overview The company is best known for bringing the [K-Pop](/wiki/K-pop) wave to Southeast Asia, introducing acts such as [Super Junior](/wiki/Super_junior)'s [Super Show 3](/wiki/Super_Show_3) to Singapore and Malaysia in January and February 2011, [Shinee World Tour](/wiki/Shinee_World_(concert)) in September 2011 and [Girl's Generation Tour](/wiki/Girls_Generation_Tour) in December 2011. Running Into The Sun also brought in [Faye Wong](/wiki/Faye_Wong)'s 2011 Comeback Tour to Singapore and Malaysia in October 2011 after a seven-year hiatus. The concert made headlines as tickets were priced as one of the most expensive ever in the two cities. Besides bringing in international acts, Running Into The Sun is also known for its original productions. The first Retrolicious festival was held in 2010 at Singapore's historical [Fort Canning Park](/wiki/Fort_Canning_Park), in an outdoor music festival with artistes including [Debbie Gibson](/wiki/Debbie_Gibson), [Johnny Hates Jazz](/wiki/Johnny_Hates_Jazz), and [Rick Astley](/wiki/Rick_Astley). Retrolicious returned in 2011 again at Fort Canning Park, with [Belinda Carlisle](/wiki/Belinda_Carlisle), [Bananarama](/wiki/Bananarama) and [The Human League](/wiki/The_Human_League).[*citation needed*] The company is headed by Creative Director Beatrice Chia-Richmond, who was also the Creative Director of Singapore's National Day Parade 2011 and a well-known figure in the entertainment, theatre, and arts industry in Singapore. Running Into The Sun was named by *[The Straits Times](/wiki/The_Straits_Times)* as the top entertainment company in Singapore in the annual Straits Times Life! Power List 2011, beating other well-established and older companies when the company was barely three years old. The title was given as Running Into The Sun \"scored more high profile acts and media buzz than many older companies\".[*citation needed*] Running Into The Sun's headquarters is in Singapore, with offices in Singapore and Malaysia.[*citation needed*] ## Past projects - [Swing Out Sister](/wiki/Swing_Out_Sister) The Breakout Concert, 16 December 2009 - The Vlee Conference, 1–12 September 2010 - Singtel-Samsung Super Junior Showcase - LG [Lee Min-ho](/wiki/Lee_Min-ho) Showcase - [Youth Olympic Games](/wiki/Youth_Olympic_Games) Celebrations at Marina Bay with [Beast](/wiki/Beast_(South_Korean_band)) and [4Minute](/wiki/4Minute) - Retrolicious 2010, 9 October 2010 - Super Show 3 in Singapore, 29 January 2011–1 February 2011 - Super Show 3 in Malaysia, March 2011 - Retrolicious 2011 - Shinee World Tour in Singapore, 10 September 2011 - Faye Wong Concert 2011 in Singapore, 29 October 2011 - Faye Wong Concert 2011 in Malaysia - 2011 Girls' Generation Tour in Singapore, 9–10 December 2011 - Super Junior World Tour Super Show 4, February 2012 - BIGBANG Alive Galaxy World Tour in Malaysia, 27 October 2012 - SMTOWN Live World Tour III in Singapore, 23 November 2012 - 2NE1 New Evolution Global Tour in Singapore, 1 December 2012 - Shinee World II in Singapore, 8 December 2012 ## Awards and accolades - Nominated \"Concert of the Year 2010\" for Retrolicious 2010 by I-S Magazine.[*citation needed*] - Named first out of the Top 10 Entertainment Companies in Singapore at the annual Straits Times Life! Power List by The Straits Times on 21 December 2011.[*citation needed*]\n",
  "language": "en",
  "processed_at": "2026-01-12T11:49:05.372638",
  "title": "Running Into The Sun",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Running_Into_The_Sun"
}