{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:49:16.583626"
  },
  "content": "The **S.U.R.E. (Source, Understand, Research, Evaluate) Campaign** is an [information literacy](/wiki/Information_literacy) awareness campaign initiated by the [National Library Board](/wiki/National_Library_Board) (NLB) of Singapore. In Singapore, the NLB drives the information literacy awareness for the nation. On 23 October 2013, the S.U.R.E. Campaign was launched to the nation to promote the importance of information searching and discernment. ## History ### Background In 2008, Singapore's broadsheet newspaper, [The Straits Times](/wiki/The_Straits_Times), surveyed a group of 35 local students (aged 13–19 years) about a rare species of octopus in the Pacific Northwest that lived in trees. 97% of the students believed that the hoax was real with half believing the fake \"expert\" opinions posted on the hoax website. The rest were taken in by the factual writing style and the use of a pseudo-scientific name for the \"tree octopus\" in Latin. In 2009, The Straits Times reported that the number of [plagiarism](/wiki/Plagiarism) cases in schools were \"one case per year per school\" for secondary and higher-level institutions. The article stated that \"with children now turning to the Web for help with school projects, plagiarism may soon become a problem at primary level\". In 2010, a National Information Literacy Survey for Singapore Schools was conducted by the Wee Kim Wee School of Communication and Information at the [Nanyang Technological University of Singapore](/wiki/Nanyang_Technological_University) indicates an overall score of only 38.7% across all info-literacy competencies. Involving more than 3,000 secondary school students, the survey found that skills that were lacking in particular were the aptitude to compare and assess information from different sources, and making responsible citations of information sources. ### Campaign The NLB's National Information Literacy Programme (NILP) began in 2011 and aims to nurture a nation of discerning users of information. At the initial phases of the NILP, the NLB conducted a broad-based information literacy programme outreaching to entire cohorts of Primary 3, Primary 5 and Secondary 1 children to give them a strong foundation in finding, evaluating, interpreting and using information intelligently and responsibly. The Programme brought students through cumulative levels of information literacy skills (Basic, Intermediate to Advanced) that is current and meets the real-life challenges of a changing information environment. On 23 October 2013, the NLB's National Information Literacy Programme launched the S.U.R.E. Campaign in order to bring information literacy awareness to the general public. ## Aims The S.U.R.E. Campaign aims to make information literacy more accessible to the man on the street by distilling key information literacy concepts into a simple tagline: **Source, Understand, Research, Evaluate (S.U.R.E.)**. The **target audiences** of the S.U.R.E. Campaign are as follows: **Students** An enrichment programme, known as S.U.R.E. club was launched in school. Students earn rewards and points based on Ministry of Education's Co-Curricular Activities framework after completing information literacy-related projects and tasks. **Parents & Teachers** Training and self-directed content – such as coursewares and handbooks – for teachers and parents respectively are put in place to help them impart information literacy skills to their students and children. **General Public** Self-directed content such as online quizzes and engagement via [social media](/wiki/Social_media) channels. ## Logo The S.U.R.E. logo is in the shape of a blue cloud with the acronym s.u.r.e. in the middle. The logo is symbolic of being able to cut through information clutter. The image of a cloud is a visual representation of information haze, while the acronym, s.u.r.e., in the middle represents 'cut-through'. The colour blue is represents clarity and each letter of the acronym is explained below the cloud: Source, Understand, Research, Evaluate. ## Initiatives & Programmes **S.U.R.E. Media Launch** The S.U.R.E. Media Launch was held on 23 October 2013. Major media coverage includes [The Straits Times](/wiki/The_Straits_Times), [Lianhe Zaobao](/wiki/Lianhe_Zaobao), [Berita Harian](/wiki/Berita_Harian), [Today](/wiki/Today_(Singapore_newspaper)) and MyPaper. The media reported that the NLB's S.U.R.E. programme will promote information literacy as an easy-to-remember, four-step technique to look at information through fun messages. The programme also received coverage on [MediaCorp Radio](/wiki/MediaCorp_Radio) 93.8LIVE, Capital 95.8, Warna 94.2 and Oli 96.8. The reports also mentioned that, in conjunction with S.U.R.E., [Mr Kiasu](/wiki/Mr_Kiasu) will be making a comeback in December. The S.U.R.E. method has been used in school enrichment clubs since May this year, and has been incorporated in the upcoming Secondary School History and Geography syllabus. **S.U.R.E. Day - Public Symposium** The S.U.R.E. Day Public Symposium was held on 14 November 2013. Members of the public were invited to an evening of sharing of the application of information literacy in various fields. The Public Symposium included a keynote speech by acclaimed author and Neuroscientist, Dr Carl Schoonover, as well as a discussion panel featuring Dr. Schoonover, [Channel News Asia](/wiki/Channel_News_Asia) Producer and Presenter Mr. Steven Chia, and decorated Singaporean Director [Mr. Anthony Chen](/wiki/Anthony_Chen). The panelists shared about their application of information literacy in the context of their respective work and answered question from the members of the audience. **Mr Kiasu Book Launch** The Mr Kiasu Book Launch took place on 15 December 2013. After a decade of absence, renowned local comic artist, Mr. [Johnny Lau](/wiki/Johnny_Lau) launched his new limited edition comic book, released in partnership with the S.U.R.E. campaign. The first 200 participants receives a free copy of the limited edition comic book signed by Mr. Lau. **Information Literacy Workshop for Teachers** The Information Literacy Workshop for Teachers are done upon request from the schools. The session conducted by the National Library Board shares with teachers, ways on how information literacy skills can be incorporated into the school curriculum. In particular, the workshop highlights the S.U.R.E. ways and framework of doing research and a wide variety of NLB resources to help students in their project work. **S.U.R.E. Club for Students** The S.U.R.E. Club for Students was launched on 16 May 2013 in support of the S.U.R.E. Campaign. The S.U.R.E. Club programme is administered by teachers through Resource Packs developed by the NLB. These Resource Packs contain necessary information such as activity guides and templates for teachers to administer the programme to their students. S.U.R.E. Club also organises Information Literacy Workshops to equip members with the skills to complete their activities in the Resource Packs, as well as organise nationwide competitions to allow students to showcase the application of information literacy skills. Some examples of these include: 1) S.U.R.E. Club Information Literacy Workshop The workshops are held regularly throughout the academic year to introduce all S.U.R.E. Club members to Information literacy via the S.U.R.E. framework. Students are taught information literacy via a series of activities and videos related to information literacy. 2) S.U.R.E. Club Library Advocacy Book Display competition The S.U.R.E. Club organised the Library Advocacy Book Display competition in conjunction with the Information Literacy and Reference Services [IFLA](/wiki/International_Federation_of_Library_Associations_and_Institutions) Pre- Satellite Conference in August 2013. Schools were invited to set up a book display that illustrated information literacy concepts and the students' application of information literacy. In the final round, the top 3 winners were invited to set up their book display at a \"Students' Corner\" at IFLA IL satellite's poster session. ## Media Coverage The table below records a list of media coverage of the S.U.R.E. Campaign since its Media Launch on 23 October 2013: S/NCHANNELDATECONTENT SUMMARYMEDIA SOURCE1Online23 October 2013The Straits Times Online reported that the National Library Board (NLB) has launched the S.U.R.E. initiative to help the public better manage the information overload and distinguish reliable sources from non-reliable ones.Straits Times Online2Radio23 October 2013Mediacorp Radio Warna 94.2FM reported that with plenty of information available on the internet, mobile phones and social media, one should be able to intelligently process all this information to avoid confusion. To help the public, especially students, to research and evaluate information, the National Library Board (NLB) launched the S.U.R.E. programme to help people obtain and understand the correct information.Mediacorp Radio Warna 94.2FM Listen here[*permanent dead link*].3Radio23 October 2013Mediacorp Radio 93.8FM LIVE News reported that the National Library Board (NLB) has launched S.U.RE., a four-step campaign to teach the public to become more literate when consuming information. S.U.R.E. stands for Source, Research, Research and Evaluate.Mediacorp Radio 93.8FM LIVE News Listen here[*permanent dead link*].4Print & Online24 October 2013The Straits Times reported that Mr Kiasu is part of S.U.R.E., the NLB campaign launched on Wednesday on information literacy. The NLB has partnered Johnny Lau to create a comic book – \"Everything Also Want To Be S.U.R.E.\" . S.U.R.E. is a method which stands for Source, Understand, Research and Evaluate.The Straits Times, Pg B7 AsiaOne News5Print24 October 2013Berita Harian reported that the National Library Board (NLB) has launched an initiative to help the public better understand and evaluate information and distinguish trustworthy sources from non-trustworthy ones. The S.U.R.E campaign introduces four easy steps: Source, Understand, Research and Evaluate.Berita Harian, Pg 26Print24 October 2013Zaobao reported the launch of \"SURE\", a national information literacy programme by the NLB. The goal of SURE is to raise awareness for information literacy and make fact-checking a natural habit among the public.LianHe Zaobao, Pg 137Print & Online24 October 2013My Paper reported the National Library Board's launch of the SURE (Source, Understand, Research, Evaluate) initiative.My Paper, News, Pg A7 AsiaOne News Omy.sg8Print24 October 2013My Paper carried an abridged version of Zaobao's coverage of the SURE launch. In the digital age facing a deluge of information, any information can be passed on rapidly, and understanding how to verify and evaluate information is a skill. Yesterday, the National Library Board launched the S.U.R.E. (Source, Understand, Research, Evaluate) initiative, aimed at promoting information literacy – the ability to effectively locate, evaluate and use information – among the public.MyPaper, Local News, Pg B29Print & Online24 October 2013TODAY reported that Singapore's iconic comic character Mr Kiasu is returning as creator Johnny Lau launching a new comic book on 15 Dec, in conjunction with the S.U.R.E. campaign, which revolves around four simple steps: Source, Understand, Research and Evaluate.TODAY, pg 2510Radio14 November 2013Mediacorp Radio Capital 95.8FM interviewed the National Library Board(NLB). They shared on what information literacy is, its importance, and how SURE is an easy-to-remember way to practice it in our everyday lives.Mediacorp Radio Capital 95.8FM Listen here[*permanent dead link*]. ## S.U.R.E. 2.0 NLB has since upgraded its S.U.R.E programme to become S.U.R.E. 2.0 – S.U.R.E for School; S.U.R.E. for Work; and S.U.R.E. for Life – to cater to the different needs and segments of the population. - Official Website Archived 31 August 2014 - S.U.R.E. Facebook Page\n",
  "language": "en",
  "processed_at": "2026-01-12T11:49:16.583213",
  "title": "S.U.R.E. Campaign",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/S.U.R.E._Campaign"
}