{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:49:20.282327"
  },
  "content": "Tri-country graduate business programThis article includes a list of references, related reading, or external links, **but its sources remain unclear because it lacks inline citations**. Please help improve this article by introducing more precise citations. *(September 2024)* *(Learn how and when to remove this message)*‹ The template *Infobox university* is being considered for merging. › **S³ Asia MBA** (also written as **S3 Asia MBA** or simply **Asia MBA**) is a selective dual degree, tri-city, tri-university global MBA program. Students enrolled in this program study one semester each at three business schools - School of Management of [Fudan University](/wiki/Fudan_University), [Korea University Business School](/wiki/Korea_University_Business_School) of [Korea University](/wiki/Korea_University) and [NUS Business School](/wiki/NUS_Business_School) of [National University of Singapore](/wiki/National_University_of_Singapore). The name of the program, **S³**, is derived from the first letter of the three cities where the business schools are located: [Shanghai](/wiki/Shanghai), [Seoul](/wiki/Seoul) and [Singapore](/wiki/Singapore). It is claimed that presently, the program is the only one of its type in the world. ## Background The program was formally launched on the 28 February, 2008 at Korea University Business School. However, the idea had originally germinated when officials from the three universities met at a centennial celebration of the three universities. The tri-university colloquium between Fudan, KU and NUS first began in 2005. The universities founded the S³ University Alliance (S³UA) and sealed it with the Seoul Declaration for Collaboration at the Tri-University Colloquium in Seoul on 19 May, 2006. ## Overview The program consists of three semesters conducted across three leading Asian business schools: School of Management, Fudan University, Shanghai, China; Korea University Business School, Korea University, Seoul, South Korea; and NUS Business School, National University of Singapore, Singapore. The three business schools are, respectively, #89, #86 and #36 on the 2013 list of world's top 100 business schools by the Financial Times. ### Fudan University (1st Semester - September to December) The program starts at School of Management, Fudan University (Shanghai) with a mandatory three-day orientation program. The orientation is a collaborative exercise which teaches team spirit, knowledge sharing, strategic decision making and cultural values to the participants. Upon the completion of the orientation program, students are awarded a certificate. The first semester curriculum is articulate and provides an understanding of the major management sciences subjects. **First semester courses (listed alphabetically):** Asian Business Insights I (Field Trip); Basic Chinese (non-credit, optional); Business in China; Data, Models, and Decisions (DMD); [Financial Accounting](/wiki/Financial_accounting) (FA); Managerial Communication (MC); [Managerial Economics](/wiki/Managerial_economics) (ME); Organizational Behavior (OB); Politics (mandatory for Chinese nationals). In addition, there is an optional, certificate course on banking named \"Citi-Fudan University Banking Course\", delivered by senior executives of Citi. The Business in China course is divided into four equal parts, with each part delivered by a different professor. Each part focuses on a different dimension of doing business inside China. #### Accommodation Foreign students may get a room booked in Fudan's International Student Dormitory or in the Tonghe International Student Village, which is a private dormitory with hotel-like services. A majority of foreign students prefer staying at Tonghe. ### Korea University (2nd Semester - February to June) The second semester starts during peak winter at Seoul. After the initial registration and an orientation trip, students are given a break of about a week to explore the city and to settle down. This semester is divided into two modules (sub-semesters) with Asian Business Insights II (Field Trip) sandwiched between the two modules. The primary teaching method used during this semester for all courses is the **[case method](/wiki/Case_method)**. In addition to the regular classes, there are some special guest lectures held jointly with the Global MBA class of KUBS. **Second semester courses (listed alphabetically):** Asian Business Insights II (Field Trip); Basic Korean or [Business English](/wiki/Business_English) (non-credit, optional); Business Ethics in Asian Companies; Business in Korea and Japan; Corporate Finance; Management Information Systems (MIS); Managerial Accounting; Marketing Management; Operations and Process Management (OPM). ### National University of Singapore (3rd Semester - August to December) The third semester at NUS Business School starts with several activities - a multi-day Orientation and a two-day team-building session at [Outward Bound Singapore](/wiki/Outward_Bound_Singapore), as well as the NUS Orientation Graduation Dinner. In this semester students are able to select elective courses, allowing them to specialize (although both degrees given under S³ Asia MBA are General Management degrees). In addition to the core courses, students can typically choose three electives (although it is also possible to choose four electives). It is at NUS Business School that the S³ Asia MBA class mingles with the NUS MBA cohort, exchange students from foreign schools, and also the part-time MBA students. In addition, students can also take up cross-faculty courses, allowing them to, for example, work with engineering students. **Third semester courses (listed alphabetically):** Advanced Business English (mandatory for Fudan students and optional for KU/NUS students); Asia Pacific Business; Asian Business Insights III (Field Trip); Corporate Strategy; Elective 1; Elective 2; Elective 3 (it is possible to choose four electives by taking up two half-modules). ## Double Degree and a Certificate Upon the successful completion of the program, students are awarded two MBA degrees: a degree from a student's \"home university\" and a degree from a second university of choice. Candidates are awarded S³ Asia MBA program certificate signed by the three deans from FDSM, KUBS and NUS Business School. For students with their home university as FDSM and KUBS, GMAT is a requirement if a student seeks NUS for his/her second degree. For students with KUBS or NUS as the home university, a second degree from Fudan requires defending a thesis (in the 4th semester at Fudan). For FDSM or NUS students, there is no special requirement to have a second degree from KUBS. - [Fudan University](/wiki/Fudan_University) - [Korea University](/wiki/Korea_University) - [Korea University Business School](/wiki/Korea_University_Business_School) - [National University of Singapore](/wiki/National_University_of_Singapore) - [NUS Business School](/wiki/NUS_Business_School) - S³ Asia MBA (Official) - S³ Asia MBA section on NUS Business School website - AACSB International - S³ Asia MBA Program - A photo album of S³ Asia MBA on Facebook - PDF brochure of S³ Asia MBA by NUS - PDF brochure of S³ Asia MBA by KUBS - PDF brochure of S³ Asia MBA by Fudan - FAQ about S³ Asia MBA at KUBS website - S³ Asia MBA Blog (Official) - S³ Asia MBA page on FDSM website - School of Management, Fudan University profile on the Financial Times - Korea University Business School profile on the Financial Times - NUS Business School profile on the Financial Times - Comparison of KUBS Global MBA and S³ Asia MBA - School of Management, Fudan University - Korea University Business School - NUS Business School - Featured Write-up: Daynia Lan, S³ Asia MBA Double Degree Student, March 2011\n",
  "language": "en",
  "processed_at": "2026-01-12T11:49:20.281902",
  "title": "S3 Asia MBA",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/S3_Asia_MBA"
}