{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:50:01.543981"
  },
  "content": "Traditional meal of Kerala, India ***Sadya*** or **oonu** ([Malayalam](/wiki/Malayalam_language): സദ്യ), also spelt ***sadhya***, is a meal of [Kerala](/wiki/Kerala) origin and of importance to all Malayalis, consisting of a variety of traditional vegetarian dishes usually served on a [banana](/wiki/Banana) leaf as lunch. Sadya is typically served as a traditional feast for [Onam](/wiki/Onam) and [Vishu](/wiki/Vishu), along with other special occasions such as birthdays, weddings and temple festivals. ## Etymology The Malayalam word *sadya* (സദ്യ) derives from [Sanskrit](/wiki/Sanskrit) *ságdhi-* (सग्धि), referring to a communal feast. ## Overview A typical sadya can have about 24–28 dishes served as a single course.In some cases, where it is much larger, it can include over 64 items, such as the sadya for Aranmula Vallamkali ([Valla-sadya](/wiki/Valla_Sadhya)). During a traditional sadya meal, people are seated [cross-legged](/wiki/Cross-legged) on mats. Food is eaten with the right hand, without cutlery. The fingers are cupped to form a [ladle](/wiki/Ladle_(spoon)). The main dish is plain boiled [rice](/wiki/Rice), served along with other curries/*koottaan* (കൂട്ടാന്‍) which include [parippu](/wiki/Parippu), [sambar](/wiki/Sambar_(dish)), [rasam](/wiki/Rasam_(dish)), pulisseri and others like [kaalan](/wiki/Kaalan), [avial](/wiki/Avial), [thoran](/wiki/Thoran), [olan](/wiki/Olan_(dish)), [pachadi](/wiki/Pachadi), [kichadi](/wiki/Kichadi), [koottukari](/wiki/Koottukari), erissery, [mango pickle](/wiki/Mango_pickle), [injipuli](/wiki/Injipuli), [mezhukkupuratti](/wiki/Mezhukkupuratti), [naranga achaar (lime pickle)](/wiki/Lime_pickle), as well as [papadam](/wiki/Papadam), [plantain chips](/wiki/Plantain_chips), sharkara upperi, [banana](/wiki/Banana), plain [curd](/wiki/Curd) and [buttermilk](/wiki/Buttermilk). The buttermilk is typically served near the end of the meal. The traditional dessert called [payasam](/wiki/Payasam) served at the end of the meal is of many kinds and usually three or more are served. Some of the varieties are Paalada pradhaman, [Ada pradhaman](/wiki/Ada_pradhaman), Parippu pradhaman, Chakka pradhaman, Gothampu payasam, Paal payasam, etc. The multiple curries are all made with different vegetables and have their own flavor. The variety of curries is to symbolize prosperity and well-being. The dishes are served in different spots on the banana leaf. For example, the pickles are served on the top left corner and the banana in the bottom left corner, which helps the waiters to easily identify and decide on offering additional servings. The most common ingredients in all the dishes are coconut as it is abundant in Kerala. Coconut milk is used in some dishes, and coconut oil is used for frying. There are regional variations in the sadya menu, influenced by local customs and ingredient availability. Although the custom is to use traditional and seasonal vegetables indigenous to Kerala or the Southwest Coast of India, it has become common practice to include vegetables such as carrots, pineapples, and beans in the dishes. Traditionally, dishes in a sadya do not contain onion or garlic. The meal may be followed by chewing of *vettila murukkaan*, [betel leaf](/wiki/Betel_leaf) with lime and arecanut. This helps with the digestion of the meal and cleanses the palate. ## Variations - [Trivandrum Sadhya](/wiki/Trivandrum_Sadhya) - [Valla Sadhya](/wiki/Valla_Sadhya) ## Preparations The sadya is usually served for lunch, although a lighter version is served for dinner as well. Preparations begin the night before, and the dishes are prepared before ten o'clock in the morning on the day of the celebration. Nowadays, sadya is often served on tables, as people no longer find it convenient to sit on the floor. Sourcing of items/ingredients for a sadya is an elaborate and careful process to ensure quality. The lighting of the fire to prepare the sadya is done after a prayer to Agni, and the first serving is offered on a banana leaf in front of a lighted [nilavilakku](/wiki/Nilavilakku) as an offering to [Ganapati](/wiki/Ganesha). In a sadya, the meals are served on a [banana leaf](/wiki/Banana_leaf). The leaf is folded and closed once the meal is finished. In some instances, closing the leaf toward you communicates satisfaction with the meal, while folding it away from oneself signifies that the meal can be improved. However, the direction the leaf is folded in can have different meanings in various parts of Kerala. The Central Travancore-style sadya is known to be the most disciplined and tradition-bound. There is usually an order followed in serving the dishes, starting from the chips and pickles first. However, different styles and approaches to making and serving the dishes are adopted in various parts of Kerala depending on local preferences. [Aranmula Valla-sadya](/wiki/Valla_Sadhya) is the most celebrated sadya with over 64 items served traditionally. ## Typical ingredients The items include: - Rice: It is the main item in a sadya. It is usually Kerala red rice (semi-polished parboiled brown) which is used for the sadya, but [Kerala matta](/wiki/Matta_rice) rice is sometimes used. - [Parippu](/wiki/Parippu): A thick curry [lentil](/wiki/Lentil) dish. - [Sambar](/wiki/Sambar_(dish)): A thick gravy made of [lentils](/wiki/Lentils), [tamarind](/wiki/Tamarind), vegetables like [drumsticks](/wiki/Moringa_oleifera), [tomato](/wiki/Tomato), yam etc., and flavoured with [asafoetida](/wiki/Asafoetida). - [Rasam](/wiki/Rasam_(dish)): A watery dish made of tamarind, tomatoes, and spices like [black pepper](/wiki/Black_pepper), [asafoetida](/wiki/Asafoetida), [coriander](/wiki/Coriander), [chili pepper](/wiki/Chili_pepper), etc. It is very spicy in taste and aids in digestion. However, in some regions Rasam is not counted as part of a sadya. - [Avial](/wiki/Avial): A dense mixture of various vegetables and coconut, it is seasoned with [curry leaves](/wiki/Curry_Tree) and coconut oil. - [Kaalan](/wiki/Kaalan): Made of [curd](/wiki/Curd), coconut, and any one vegetable like \"nendran\" plantain or a tuber-like [yam](/wiki/Yam_(vegetable)). It is very thick and more sour, and typically can last for a longer period owing to the lower water content. - [Olan](/wiki/Olan_(dish)): A light dish, prepared of [white gourd](/wiki/White_gourd) or black peas, coconut milk, and [ginger](/wiki/Ginger) seasoned with [coconut](/wiki/Coconut) oil. - [Koottukari](/wiki/Koottukari): Vegetables like banana or yam cooked with [chickpeas](/wiki/Chickpea), coconut and black pepper. - Erissery: A thick curry made from pumpkin, [black-eyed peas](/wiki/Black-eyed_pea) and coconut. - [Pachadi](/wiki/Pachadi): Sour curry made of curd and usually [cucumber](/wiki/Cucumber) or sliced ash gourd cooked in coconut ground with mustard seeds and seasoned with sautéed mustard seeds and curry leaves. - Sweet [Pachadi](/wiki/Pachadi#In_Kerala_and_Tamil_Nadu): A sweet form of Pachadi, made with pineapple, pumpkin or grapes in curd. The gravy masala comprises coconut ground with cumin seeds and green chillies. - Pulisseri: A sour, yellow-coloured thin curry made with slightly soured [yogurt](/wiki/Yogurt) and cucumber. A sweet variant called Mampazha-pulissheri replaces cucumber with a combination of ripe mangoes and [jaggery](/wiki/Jaggery). - [Injipuli](/wiki/Injipuli): A sweet pickle made of ginger, tamarind, green chilies, and jaggery, also called Puli-inji. - [Thoran](/wiki/Thoran): A dish of [sautéed](/wiki/Saut%C3%A9ed) vegetables such as [peas](/wiki/Pea), [green beans](/wiki/Green_bean), raw [jackfruit](/wiki/Jackfruit), carrots, or [cabbage](/wiki/Cabbage) (usually) with grated coconut. - [Mezhukkupuratti](/wiki/Mezhukkupuratti): A style of preparation for a vegetarian dish where the vegetable is stir-fried with spices. Chopped onions or shallots may also be used. - [Achaar](/wiki/Achaar): Spicy [pickles](/wiki/Pickling) of raw [mango](/wiki/Mango) ([Mango pickle](/wiki/Mango_pickle)), [lemon](/wiki/Lemon), [lime](/wiki/Lime_(fruit)), ([Narangakari](/wiki/Lime_pickle)) etc. - [Pappadam](/wiki/Pappadam): Made with lentil flour, it is paired with rice and can be eaten as an appetizer. - [Sharkara upperi](/wiki/Banana_chip#India): [Banana chips](/wiki/Banana_chip) with jaggery. - [Kaaya Varuthathu](/wiki/Banana_chip#India): Banana chips. - [Banana](/wiki/Banana): A ripe banana is often served with the sadya to be eaten with the dessert, Payasam. - [Chammanthi podi](/wiki/Chammanthi_podi): coconut powder served as a dry condiment or chutney. - [Sambharam](/wiki/Buttermilk), also referred to as moru: A drink made from salted buttermilk with green chilli, ginger, and curry leaves, it is drunk to improve digestion and is typically served near the end of the meal. - Kadumanga: Sliced mango pickle. Usually served as the third condiment of the sadya. These side dishes are followed by desserts like Pradhaman and Payasams. ## Pradhaman *Pradhaman* is a sweet dish in the form of a thick liquid; similar to [payasam](/wiki/Payasam), but with more variety in terms of ingredients and more elaborately made. It is made with white [sugar](/wiki/Sugar) or jaggery to which coconut milk is added. The main difference between a pradhaman and a payasam is that the former uses coconut milk, while the liquid versions of payasam use cow's milk. - [Palada pradhaman](/wiki/Ada_pradhaman#Palada_pradhaman) is made of flakes of cooked rice, milk, and sugar. - Pazha pradhaman is made of cooked \"nendra\" plantain or banana in jaggery and coconut milk. - Gothambu pradhaman is made of broken [wheat](/wiki/Wheat). - Parippu pradhaman is made of [green gram](/wiki/Mung_bean). - [Chakka prathaman](/wiki/Chakka_prathaman) is made of jackfruit. - [Ada pradhaman](/wiki/Ada_pradhaman) is made of rice-ada (Rice flakes). - Kadala pradhaman is made from black gram. - Food portal - India portal - [Cuisine of Kerala](/wiki/Cuisine_of_Kerala) - [Kamayan](/wiki/Kamayan) (a similar meal from the Philippines) - [Onam sadya](/wiki/Onam#Onam_Sadya) - [Trivandrum Sadhya](/wiki/Trivandrum_Sadhya) - [Trivandrum Boli](/wiki/Trivandrum_Boli) - [South Indian cuisine](/wiki/South_Indian_cuisine) - [Thali](/wiki/Thali) - Media related to Sadya at Wikimedia Commons\n",
  "language": "en",
  "processed_at": "2026-01-12T11:50:01.543612",
  "title": "Sadya",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sadya"
}