{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:49:23.449740"
  },
  "content": "Military unit The **Singapore Armed Forces Volunteer Corps** (**SAFVC**) is a uniformed volunteer [auxiliary](/wiki/Auxiliaries) branch of the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces). It was established on 13 October 2014 to allow first generation [permanent residents](/wiki/Permanent_residency_in_Singapore) and [naturalised citizens](/wiki/Naturalised_citizen), all of whom would otherwise not be subject to [an obligation to serve national service](/wiki/National_service_in_Singapore), to contribute their part towards Singapore's defence. It also aims to strengthen support for national service by understanding the duties of national servicemen. It is distinct from SAF Volunteers or the ROVERS (Reservist On Voluntary Extended Reserve Service) schemes that consist of former NSmen or regulars who continue to serve beyond the statutory age. The SAFVC Headquarters is based at Maju Camp in [Clementi](/wiki/Clementi,_Singapore), where all basic volunteer training are also conducted. ## History ### Background of military volunteerism The [Singapore Volunteer Rifle Corps](/wiki/Singapore_Volunteer_Corps), a private organisation, was formed after the 1854 Hokkien-Teochew riots that occurred between the respective Chinese secret societies from 5 to 17 May that year. The conflict caused widespread unrest and loss of life on the island, and was severe enough for the police to require the support of the military, some marines, [special constables](/wiki/Special_constable), [sepoys](/wiki/Sepoy) and even convicts to restore order. More than 500 people were killed and 300 houses burned down. Its numbers eventually dwindled to a small half-company, and the corps was disbanded in December 1887. In February 1888, the corps was revived as the Singapore Volunteer Artillery Corps (SVA). It was the first unit in the British Empire, regular or auxiliary, to field the Maxim Gun. The guns arrived in 1889 and were funded by donations from the [Sultan of Johor](/wiki/Sultan_of_Johor), members of the various communities in Singapore and prominent businessmen. In 1901, the SVA was renamed the [Singapore Volunteer Corps](/wiki/Singapore_Volunteer_Corps) (SVC), due to its diverse sub-units. It comprised artillery, infantry, engineers and rifle sections. During [World War I](/wiki/World_War_I), the SVC helped to quell the [Sepoy Mutiny of 1915](/wiki/Singapore_in_the_Straits_Settlements#Singapore_Mutiny_1915), which resulted in the deaths of 11 volunteers. In 1922, the SVC was amalgamated with the Penang and Province Wellesley Volunteer Corps, Malacca Volunteer Corps, and Labuan Volunteer Defence Detachment to form the [Straits Settlements Volunteer Force](/wiki/Straits_Settlements_Volunteer_Force) (SSVF). In 1928, the SSVF infantry was re-organised into 4 battalions. The 1st and 2nd battalions consisted of members of the Singapore Volunteer Corps (1,250 men). Besides the infantry, the rest of the SSVF consisted of the Singapore Royal Artillery (SRA), Singapore Royal Engineers, Singapore Armoured Car Company and 3 ambulance units. The Corps was involved in the defence of Singapore during the Second World War. As international tensions heightened during the 1930s, an increasing number of men of the various nationalities in the Settlements — predominantly European, Malay, Chinese, Indian and Eurasian — joined the SSVF. It included naval, air force, special operations, irregular units, and home guard units. On 25 December 1941, Lieutenant Colonel John Dalley created [Dalforce](/wiki/Dalforce), also known as the Singapore Overseas Chinese Anti-Japanese Volunteer Army as an irregular forces/guerrilla unit within the SSVF during World War II. Its members were recruited among the ethnic Chinese people of Singapore, and their ferocious fighting earned them the nickname Dalley's Desperadoes. By the time the Japanese invaded, Dalforce numbered 4,000 resistance fighters. The SSVF — including four infantry battalions — took part in the [Battle of Singapore](/wiki/Battle_of_Singapore) in 1942, and most of its members were captured on 15 February 1942 when their positions were overrun. The end of the Japanese Occupation saw the SVC being revived in 1949. In 1954, the SSVF was disbanded and the Singapore Volunteer Force was absorbed into the Singapore Military Forces (SMF) formed the year before. The SVF assisted in defence during the [Malayan Emergency](/wiki/Malayan_Emergency), and, at the height of the [Indonesian Confrontation](/wiki/Indonesian_Confrontation), was deployed to protect vital installations in Singapore and southern [Johor](/wiki/Johor) against saboteurs. In 1961, SMF was renamed the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF), and in 1963 the Forces at large were integrated into the [Malaysian Armed Forces](/wiki/Malaysian_Armed_Forces) until 1965, when Singapore became independent, and the volunteers were affiliated to the [Rejimen Askar Wataniah](/wiki/Rejimen_Askar_Wataniah). With the passing of the People's Defence Force Act in 1965, the SVF became a component of the People's Defence Force (PDF) and its units were absorbed into the SAF as full-time National Service operational battalions to supplement the regular army. A volunteer force was considered as the fastest way for the nation to build up a credible defence force before the conscription-based national service was introduced in March 1967. Many volunteer officers were also transferred to the regular army. The volunteers continued to play a role in national security, which included the training of part-time National Servicemen when National Service was introduced in 1967, whilst the PDF also reduced the need to raise and maintain a large army on a permanent basis. With the introduction of compulsory full-time [national service](/wiki/National_service), growth of NS and the SAF, the number of volunteers declined and dwindled, and the last volunteer battalion, 101st PDF Battalion, held its final parade in 1984 and was disbanded in March 1984. The reservists branch of the PDF, however, continued to exist and was split into 1 PDF Command and 2 PDF Command on 1 April 1985. On 6 December 2004, 1 PDF Command was drawn down and its units transferred to the Combined Arms Division to enhance its operational capability. On the other hand, the capability of 2 PDF was enhanced over the years. Today, it plays a key role in protecting key installations and in coordinating military resources to assist other agencies during civil emergencies. By 1967, as national service was being introduced, the first [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) had, in fact, wanted women to serve NS like their male counterparts. He once said, \"I was keen to have our women do national service [as Israeli women did](/wiki/Women_in_the_Israel_Defense_Forces), because that would reinforce the people’s will to defend themselves. But [Goh Keng Swee](/wiki/Goh_Keng_Swee) did not want his then new ministry to carry this extra burden. As the other ministers in Defco (Defence Council) were also not anxious to draft our women, I did not press my point.\" To make up for that the PDF had a women's component, all volunteers. ### Formation of the SAFVC The initial target for its first cohort of volunteers was 150. However, its first cohort saw more than a thousand applicants, and the inaugural 2015 cohort consisted of 226 volunteers. Among the female volunteers, a notable number of them are of young age, some also pursuing [tertiary education](/wiki/Tertiary_education). Across all three intakes of the pioneering batch, slightly more than half (51 per cent) are Singapore citizens, while PRs make up the rest. Four in 10 are women and those aged between 30 and 40 make up a slight majority. One in three are aged below 30, and one in 10 volunteers are above 40. As of 2020, it's reported that the SAFVC has 900 soldiers. ## Logo The SAFVC logo pays homage to the 160-year history of volunteer military service in Singapore. It incorporates elements from the original SVC coat of arms, such as the circular shield, banner and laurel which together with the lion, portray power and courage. Its statant posture with its head facing forward and tail curved over its back, symbolises steadfastness and vigilance. The outline of Singapore above the lion symbolises the country as a proud and independent state that relies on her people for defence. The gold of the logo, being the colour of the brass ammunition, signifies the martial nature of the SAFVC. This, together with the deep blue background, symbolises the common foundation of the SAFVC and the SAF. ## Selection and training ### Requirements The following are stipulated requirements: - Men and women who are first-generation permanent residents or new citizens - Between the ages of 18 and 45 years old - With no National Service liability - Physically and medically fit and active ### Selection The selection process involves an interview by SAF panel members followed by medical examination. The SAFVC interviews applicants and conducts background checks to assess their suitability and security clearance. Due to it being in its infancy stage and also the issue of national security being a concern, acceptance is stringent. ### Training The SAFVC volunteers (SV) will undergo a two-week basic military induction course to be educated on basic military skills and values which is part of a four phase progressive training program in the SAFVC. Each phase is designed to develop the SVs, maintain their competencies, and deploy them in meaningful roles throughout their service. The following phases include: - **Experience Phase (3 Years)** SVs will complete their Basic Training (consisting of a continuous 2-week stay in camp or modular on weekends for 10 weeks), Qualification Training (one week), and where applicable, Advanced Training (one week). The Basic Training encompass aerobic and strength training, marching/foot drills, regimental discipline, technical handling of the [SAR 21](/wiki/SAR_21), Individual Marksmanship Training (IMT), live firing / Basic Trainfire Package (BTP), first aid training (CPR and AED), Individual Field Craft (IFC), Urban Ops (UO) / Close Quarter Battle (CQB), route march, Standard Obstacle Course (SOC), Battle Inoculation Course (BIC), Individual Physical Proficiency Familiarisation. After completion of training, SVs will be adequately prepared for their various roles and will be deployed to perform basic tasks under the close supervision of experienced commanders. This will build basic job proficiencies. New enlistees begin as SV (Trainees), and will be promoted to SV1 as well as being issued a dark blue beret just like other combat support units upon completion of their Qualification Training together. Subsequent promotions are dependent on years of service, as well as conduct and performance. - **Perform Phase (3 Years)** SVs may be deployed to perform more challenging roles, with less supervision. Currency and skills training will keep SVs engaged, as well as improve their skills. - **Lead Phase (4 Years)** Leadership modules will be introduced to equip selected SVs with the skills to take on leadership roles within SAFVC. - **Mentor Phase** Senior SVs, with more than 10 years of experience, may take up mentor or trainer roles within the SAFVC. ## Roles and service The following vocations are available in the SAFVC as of 2021: - Security - Auxiliary Security Trooper - Naval Operations - Bridge Watchkeeper, Deck Operator (Seamanship) - C4 Command, Control Communications & Computers - C4 Expert - Engineering - Airbase Civil Engineer, Naval Safety Engineer, Naval Combat/Platform Engineer - Information - Infomedia Staff - Legal - Legal Specialist Staff - Maritime Trainers - Merchant Ship Engineering Trainer, Merchant Ship Operations Trainer - Medical Trainers - Doctors, Dentist, Medical Technologists, Nurse, Radiographer - Psychology - Defence Psychologist Roles, such as those in engineering, medicine or law, require prior work experience, while others like the AST, InfoMedia Staff and Bridge Watchkeeper are open to all. 67 per cent, of the volunteers in the first intake will be trained as security troopers, guarding key installations across Singapore alongside active servicemen and reservists. The rest will serve in specialised roles. Volunteers serving as information and media staff make up the second-largest group (13 per cent), while a handful of volunteers will become medical trainers, maritime trainers, defence psychologists, bridge watchkeepers and deck operators. A small group, or 2 per cent, will serve as experts of command, control, communications and computers (C4). As of July 2018, SAFVC has offered more roles and services are on offer. Volunteers are typically called up to serve up to fourteen days per annum, alongside servicemen and women from the Army, Navy and Air Force, donning the SAFVC formation patch on their respective green, grey or blue uniforms. ## Ranks A distinctive rank structure was created for the SAFVC Volunteers (SVs) since their voluntary contribution are distinct from those mandatory of regulars and national servicemen. It is also to discretise them from SAF Volunteers, former NSmen who continue to service past the statutory age. The SAFVC ranks comprise five tiers, enumerated by winged chevrons. [Volunteer ranks](/wiki/Singapore_Armed_Forces_ranks) of the SAF Volunteer Corps - v - t - e InsigniaRankSAFVC Volunteer (Trainee)SAFVC Volunteer 1SAFVC Volunteer 2SAFVC Volunteer 3SAFVC Volunteer 4AbbreviationSV (Trainee)SV1SV2SV3SV4 ## Notable members - [Janil Puthucheary](/wiki/Janil_Puthucheary) - [Singapore Volunteer Corps](/wiki/Singapore_Volunteer_Corps) - [Dalforce](/wiki/Dalforce) - [Volunteer Special Constabulary](/wiki/Volunteer_Special_Constabulary) - [Civil Defence Auxiliary Unit](/wiki/Civil_Defence_Auxiliary_Unit)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:49:23.449180",
  "title": "SAF Volunteer Corps",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/SAF_Volunteer_Corps"
}