{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:50:05.821353"
  },
  "content": "Subzone of Western Water Catchment in Singapore **SAFTI** (\"[**S**ingapore **A**rmed **F**orces](/wiki/Singapore_Armed_Forces) **T**raining **I**nstitute\") is a subzone of the [Western Water Catchment](/wiki/Western_Water_Catchment) [planning area](/wiki/Planning_Areas_of_Singapore) of Singapore. It is home to the [Pasir Laba Camp](/wiki/Pasir_Laba_Camp). It is also the training ground and a live-firing area for [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) known as SAFTI Live Firing Area which is west of Pasir Laba Camp. It is bounded west of [Upper Jurong Road](/wiki/Upper_Jurong_Road), which is the only part of [Western Water Catchment](/wiki/Western_Water_Catchment) to name it Pasir Laba. So far, no developments are announced currently, unless Pasir Laba Green and SAFTI West new residential developments will be built. ## Pasir Laba Road **Pasir Laba Road** is a short stretch from Upper Jurong Road and terminating at Tengah Pumping Station via the SAFTI live firing ranges, Pasir Laba Camp and Multi-Mission Range Complex. Part of the Pasir Laba Road was broken up and renamed to Wrexham Avenue which has restricted access for the Matador and M210 Ranges. It is accessible via TRMC Gate B. To get in, visitors must exchange passes at Gate B before going to visitors' carpark at Pasir Laba Camp. Only servicemen and authorised persons are allowed to proceed 400 metres beyond the junction of Pasir Laba Camp to travel to Wrexham Avenue and Wrexham Road; strictly no unauthorised photography or filming is allowed. In addition, Wrexham Avenue will also intersect with Wrexham Road at the junction near to Pasir Laba Battery. Visitors are also prohibited from entering via TRMC Gate A next to [Singapore Rail Test Centre](/wiki/Singapore_Rail_Test_Centre), signboards telling people that it is a live firing area and no unauthorised photography/filming is allowed. ## Hilltops There are some hills in Pasir Laba. They are Peng Kang Hill, FOFO Hill, Bunker Hill and Elephant Hill. ## Accessibility It is accessible by route 182/182M from [Joo Koon Bus Interchange](/wiki/Joo_Koon_Bus_Interchange). ## Politics Prior to 1997 general elections, it is under the Jurong constituency. From 1997 to 2001, it is bounded by [Bukit Timah GRC](/wiki/Bukit_Timah_Group_Representation_Constituency) (Jurong) and [Hong Kah GRC](/wiki/Hong_Kah_Group_Representation_Constituency) (Nanyang). From 2001 to 2011, it is bounded by [West Coast GRC](/wiki/West_Coast_GRC) (Pioneer) and [Hong Kah GRC](/wiki/Hong_Kah_GRC) (Nanyang), then from 2011 to 2020, it surrounds the boundaries of [Chua Chu Kang GRC](/wiki/Chua_Chu_Kang_GRC) (Nanyang) and [West Coast GRC](/wiki/West_Coast_GRC) (Ayer Rajah). Since 2020 general elections, it is fully under [West Coast GRC](/wiki/West_Coast_GRC) (Nanyang and Ayer Rajah), the MPs are under Ang Wei Neng and Foo Mee Har. This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:50:05.821079",
  "title": "Safti",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Safti"
}