{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:50:15.387209"
  },
  "content": "Roman Catholic church in SingaporeChurch in Singapore , Singapore **Saint Joseph's Church** ([Chinese](/wiki/Chinese_language): 聖若瑟堂) is a [Roman Catholic](/wiki/Roman_Catholic) [church](/wiki/Church_(building)) in Singapore. It is located along [Victoria Street](/wiki/Victoria_Street,_Singapore) in the [Rochor](/wiki/Rochor) Planning Area, within the [Central Area](/wiki/Central_Area,_Singapore) of Singapore's [central business district](/wiki/Central_business_district). The church was constructed from 1906 to 1912 with its [foundation stone](/wiki/Foundation_stone) laid in 1904. The building was built in the [Neo-Manueline](/wiki/Neo-Manueline) Portuguese late-[Gothic](/wiki/Gothic_Architecture) style by the Portuguese [Mission](/wiki/Mission_(Christian)). Saint Joseph's Church is noted for its Portuguese-inspired religious traditions, such as the annual [Good Friday](/wiki/Good_Friday) celebrations. The church is a rectoral church of devotion and not a parish church, hence, the church does not have specific territorial boundaries. Mass in the Latin [Extraordinary Form](/wiki/Tridentine_Mass) is celebrated here every Sunday at 2 pm. ## History The history of Saint Joseph's Church and that of its predecessor, the Church of São José, both built on the same site, is linked with the Portuguese Mission. When Father Francisco da Silva Pinto e Maia of [Porto](/wiki/Porto), head of the Portuguese Mission died in 1850, he left his money and some land for the building of a small church. Part of that money came from the Portuguese Missions in China, whose procuration house was [St Joseph's Seminary](/wiki/St._Joseph%27s_Seminary_and_Church) in [Macau](/wiki/Macau). Under the system of [padroado](/wiki/Padroado), his funds were augmented by a gift from the [King of Portugal](/wiki/King_of_Portugal). The church, which was called São José (in English: Saint Joseph), was built by the [priest](/wiki/Priest) who succeeded him, the Rev. Vincente de Santa Catarina, from 1851 to 1853, to mainly serve the Portuguese and [Eurasian](/wiki/Eurasian) Catholics in Singapore. Situated in the church compound and attached to the mission was Saint Anthony's Boys' and Girls' School. It was first opened by Father José Pedro Santa Ana da Cunha in 1879 as Saint Anna's School in a small house along [Middle Road](/wiki/Middle_Road,_Singapore). The school moved into the church compound in 1886 and changed its name. In 1893, separate boys' and girls' schools were formed. In 1886, the Portuguese [Archbishop of Goa](/wiki/Archbishop_of_Goa) transferred the jurisdiction over the Portuguese Missions in Singapore and [Malacca](/wiki/Malacca) to the Portuguese [Bishop of Macau](/wiki/Bishop_of_Macau). Because of the steady growth of the congregation, the Church of São José was demolished in 1906 and a new church was built on the same site, by the notable firm [Swan & MacLaren](/wiki/Swan_%26_MacLaren). The new and larger church, i.e. the present Saint Joseph's Church, was completed in 1912 and blessed by the then Bishop of Macau, João Paulino de Azevedo e Castro, who was the impetus behind this project. New buildings were added to the church in 1938, 1954 and 1956. In March 1947, the church published its first parish magazine, *Rally*, in English that sought to rally parishioners to the Catholic Young Men's Association, promote the [Catholic faith](/wiki/Catholic_faith) and provide information on pastoral activities, recreation and sports. In 1948, *Rally* became a mission publication and served as an official organ of the Portuguese Mission in Malacca and Singapore until it ceased publication in 1990. On 1 July 1981, an agreement signed between [Gregory Yong](/wiki/Gregory_Yong), the [Archbishop of Singapore](/wiki/Archbishop_of_Singapore), and [Arquimínio Rodrigues da Costa](/wiki/Arquim%C3%ADnio_Rodrigues_da_Costa), the Bishop of Macau, for the transfer of the Parish of St Joseph to the ordinary jurisdiction of the Archbishop of Singapore became effective. With this, the dual ecclesiastical jurisdiction ceased to exist in Singapore and the whole island of Singapore was brought under the single jurisdiction of the [Roman Catholic Archdiocese of Singapore](/wiki/Roman_Catholic_Archdiocese_of_Singapore). Saint Joseph's church ceased to be a parish church and became a church of devotion. The entire congregation of parishioners was incorporated into the Archdiocese of Singapore. To maintain the Portuguese character of the church, the Bishop of Macau continued to post priests to the church until 31 December 1999, when the rector of the church, Father Benito de Sousa, ended his term. The Bishop of Macau decided to stop sending missionaries to the church, making Father Benito de Sousa the last link between the church and the Portuguese Mission. Saint Joseph's Church was [gazetted](/wiki/Gazette) a [national monument](/wiki/National_Monuments_of_Singapore) on 14 January 2005. From 4 September to 12 November 2006, the church was one of the exhibition venues for the [Singapore Biennale](/wiki/Singapore_Biennale), Singapore's inaugural international biennale of contemporary art. In 2007, during the repainting of the church, painters discovered the original ornamental plasterwork from the 1900s underneath the paint. By August 2017, the church raised $25 million, inclusive $1.953 million from the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore))'s National Monuments Fund to restore the church's main building and [Parochial House](/wiki/Parochial_House_of_St_Joseph%27s_Church), a conserved building, and started restoration work. On 30 June 2022, the 110th anniversary of the church's consecration, the church was reopened. ## Architecture and interior design Saint Joseph's Church was built to accommodate 1,500 worshippers, in a [Gothic Revival style](/wiki/Gothic_Revival) with a [portico](/wiki/Portico) supported by four [columns](/wiki/Column) and decorated by large marble statues of [Saint Joseph](/wiki/Saint_Joseph), [Saint John of God](/wiki/Saint_John_of_God) and [Saint John de Brito](/wiki/Saint_John_de_Brito). There are also an outdoor shrine to [Our Lady of Fatima](/wiki/Our_Lady_of_Fatima) and [azulejos](/wiki/Azulejo) (Portuguese decorated tiles) on the walls of the church depicting the apparitions of Our Lady of Fatima. The tiles were added in 1950 to commemorate the visit of the *International Pilgrim of Fátima.* It had a low square [tower](/wiki/Tower) and [bell](/wiki/Church_bell) [turret](/wiki/Turret_(architecture)). The plan of the church was laid in the form of a [Latin cross](/wiki/Latin_cross). The interior is a single large space roofed by a wooden barrel-vault instead of a gothic-style ceiling. Neither the nave nor the transepts have aisles. It is currently painted in beige, with grey details, like the exterior. The west front has three towers: a central [octagonal](/wiki/Octagon) tower capped by a [dome](/wiki/Dome) flanked by two smaller towers. The main [altar](/wiki/Altar) of the church is dedicated to Saint Joseph and the other altars are dedicated to [Our Lady of Lourdes](/wiki/Our_Lady_of_Lourdes), Our Lady of Fatima, the sacred Heart of Jesus and [Saint Anthony of Padua](/wiki/Saint_Anthony_of_Padua). There is a host of saints in the form of statues standing in canopied niches and stained glass windows in the church. The church was once home to a [pipe organ](/wiki/Pipe_organ), built in 1888 by [Forster and Andrews](/wiki/Forster_and_Andrews), but it has since been dismantled. It now houses two Allen digital pipe organs – a three-manual in the nave and a four-manual in the organ gallery. The four-manual organ is currently Singapore's largest digital pipe organ. ## Clergy - Rector: Fr. Joe Lopez - Vice Rector: Fr. Damien Lim ## Portuguese religious traditions Saint Joseph's Church and its congregation continues to practice many Portuguese-inspired religious traditions, such as the [Holy Week](/wiki/Holy_Week) commemoration with the re-enactment of the passion and death of [Christ](/wiki/Christ) on [Good Friday](/wiki/Good_Friday). Traditional Portuguese devotions, such as the devotions to [Our Lady of Fatima](/wiki/Our_Lady_of_Fatima) (on the 13th day of each month), to Saint Joseph, to [Saint Jude Thaddeus](/wiki/Saint_Jude_Thaddeus), to the [Sacred Heart of Jesus](/wiki/Sacred_Heart_of_Jesus) and to [Saint Anthony of Padua](/wiki/Saint_Anthony_of_Padua) (the patron saint of Portugal) are also practiced and maintained alive. A traditional Latin Mass is also celebrated on Sundays.[*citation needed*] ## Gallery - [Archdiocese of Singapore](/wiki/Archdiocese_of_Singapore) - [Roman Catholicism in Singapore](/wiki/Roman_Catholicism_in_Singapore) - National Heritage Board (2002), *Singapore's 100 Historic Places*, Archipelago Press, [ISBN](/wiki/ISBN_(identifier)) 981-4068-23-3 - Norman Edwards, Peter Keys (1996), *Singapore – A Guide to Buildings, Streets, Places*, Times Books International, [ISBN](/wiki/ISBN_(identifier)) 9971-65-231-5 - Preservation of Monuments Board, *Know Our Monuments* - Singapore Catholic Church Directory - Uniquely Singapore website - Infopedia\n",
  "language": "en",
  "processed_at": "2026-01-12T11:50:15.386799",
  "title": "Saint Joseph's Church, Victoria Street",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Saint_Joseph%27s_Church,_Victoria_Street"
}