{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:50:19.143775"
  },
  "content": "Singapore-based street gang**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Salakau\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2010)* *(Learn how and when to remove this message)*This article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(June 2010)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Criminal organization **Salakau**, also rendered as \"**Sah Lak Kau**\" and meaning \"three six nine\" in [Hokkien](/wiki/Singaporean_Hokkien), is a [secret society](/wiki/Secret_societies_in_Singapore) and gang based in [Singapore](/wiki/Singapore). The numbers 3, 6 and 9 add up to 18, which was the name of an older gang named after the [Eighteen Arhats](/wiki/Eighteen_Arhats).[*citation needed*] As one of the oldest and most prominent gangs in the country, they are known to take part in many illicit activities such as [drug trafficking](/wiki/Illegal_drug_trade), [extortion](/wiki/Extortion), [prostitution](/wiki/Prostitution) and [white-collar crime](/wiki/White-collar_crime) — and many of their members have been in and out of prison for violent attacks and rioting. They have a Hokkien gang chant usually accompanied by techno beats, particularly the song \"[Million Tears](/wiki/Million_Tears_(Groove_Coverage_song))\". It was reproduced in the 2003 Singaporean film *(/wiki/15_(film))*, albeit with direct references to the gang edited out. ## History From the early 1970s until the late 1980s, Salakau attacked rival gangs and started many turf wars.[*citation needed*] Salakau recruited many Malay and Indian members after relaxing the Chinese-only rule. In the 1970s, more Malays were reported to be joining after being introduced to gang members during tea dances in discos. This was because Malay gangs were smaller and less structured due to demographic changes in Singapore. Salakau also made profits from drug trafficking, extortion, prostitution, white-collar crime and legitimate businesses. Attacks on rival gangs such as Sakongsa, [Omega](/wiki/Omega_(prison_gang)) and 18 Sio Yi Ho were somewhat of a routine occurrence. The [Singapore Police Force](/wiki/Singapore_Police_Force) cracked down on gang activity in the early 1980s and gang wars came to a screeching halt as many of the leaders were jailed. In the 1990s, some teenage gangs claimed affiliation to Salakau to be \"cool\" but did not engage in activities as violent as those engaged in by the real gang. In 1993, there were at least nine teenage gangs calling themselves Salakau. However, in the late 1990s and early 2000s, Salakau gained strength as many of the jailed leaders were released, and several of the members had succeeded in scaring off many rival gangs from territories. Gang attacks once again became common and rioting cases shot up. Cases of murder involving gang attacks and riots were steadily increasing. The Secret Societies Branch, a specialised unit under the Singapore Police Force, dedicated most of its resources to halt the gang violence and managed stopping a considerable number of members. Gradually, gang violence receded and many gang members were put in prison. ## Law enforcement Salakau predominantly holds the territories as mentioned, but gang activity has slowed down considerably due to the [Singapore Police Force](/wiki/Singapore_Police_Force) having a better understanding of the gang networks and sufficient resources. The Secret Societies Branch has made efforts to control secret societies in recent years[*citation needed*] by regularly conducting surprise raids or checks on nightspots, and public places known to be gang territories to deter any potential offenders.[*citation needed*] Under Singapore criminal law, a person found guilty of being a member of an unlawful society may be face a S$5,000 fine or up to five years imprisonment, or both. Sentences are usually doubled or even tripled for anyone with significant leadership and authority in any unlawful society in Singapore.[*citation needed*] ## Incidents ### Murder of Sulaiman bin Hashim On 31 May 2001, after celebrating the 18th birthday of one of their members, eight Malay members of Salakau aged between 18 and 21, decided to launch a surprise attack on a rival gang around [Boat Quay](/wiki/Boat_Quay). The gang later spotted three Malay teenagers walking along Boat Quay and presumed they were from a rival gang. The eight Salakau members, led by 21-year-old Norhisham bin Mohamad Dahlan (born 18 May 1980), attacked the three teenagers, leading to the death of one of them: 17-year-old Sulaiman bin Hashim, who had been stabbed 13 times. The other two victims were Muhammad Shariff bin Abdul Samat and Mohammed Imran bin Mohammed Ali, both 17 years old at the time. All the three victims were not gangsters but members of a football team. Between May 2001 and June 2002, the police arrested six of the eight gangsters, including their leader Norhisham. Initially charged with murder, the six of them eventually had their charges reduced to rioting, voluntarily causing grievous hurt, and culpable homicide not amounting to murder. Five of them were sentenced to imprisonment between 3 and 10 years, as well as between 6 and 16 [strokes of the cane](/wiki/Caning_in_Singapore) each; the sixth gangster, Muhamad Hasik bin Sahar, was sentenced to life imprisonment and 16 strokes of the cane. The remaining two gangsters – Muhammad Syamsul Ariffin bin Brahim and Sharulhawzi bin Ramly - had fled Singapore and are still on the run. ### 2010 Downtown East slashing On 30 October 2010, 19-year-old polytechnic student Darren Ng Wei Jie was fatally injured in a gang fight with Salakau members at Downtown East after a staring incident between one of his friends and a gang member. He was stabbed 28 times and died in hospital five hours after the incident. He was pronounced dead at the hospital after being brought there. 12 youths between the ages of 10 and 18 were subsequently arrested for their involvement in the attack. Five of them – between the ages of 16 and 20 – who were identified to be the main attackers were initially charged with murder, but had their charges reduced to culpable homicide not amounting to murder, and were sentenced to imprisonment of between 8 and 12 years, and between 10 and 12 strokes of the cane each. Seven others between the ages of 17 and 21 were charged with rioting and sentenced to imprisonment of between 3 years 3 months and 6 years, and between 3 and 6 strokes of the cane each. ### Bukit Panjang incident On 8 November 2010, seven youths were repeatedly slashed by a group of [parang](/wiki/Parang_(knife))-wielding men in [Bukit Panjang](/wiki/Bukit_Panjang), in what appeared to be gang-related attacks. The victims, aged between 14 and 20, were attacked in two separate incidents. The victim of the first incident, a 20-year-old assistant technician, was slashed in the back and legs. The victims of the second incident were a group of 20 youths who were surrounded by the attackers. In both instances, the assailants first asked their victims whether they were from a gang called \"Pak Hai Tong\". The victims were slashed when they denied association with the group. The gang members shouted \"Salakau\" before fleeing the scene. The attacker left then-15-year-old Brandon Lim Qian Da hospitalised with a severed tongue while six from the second attack received outpatient treatment for their injuries. ### Drug-smuggling by drone In 2020, two Salakau members were arrested by Malaysian police for smuggling illegal drugs from Singapore to [Johor Bahru](/wiki/Johor_Bahru) by drone. The arrested person are Boy Setan and his girlfriend. Another two people were arrested on a follow-up operation on next day for involving in the drug smuggling activities. - [Secret societies in Singapore](/wiki/Secret_societies_in_Singapore) - [Secret society](/wiki/Secret_society)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:50:19.143520",
  "title": "Salakau",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Salakau"
}