{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:50:21.199222"
  },
  "content": "Hospital in Rochor Singapore **Salmon's Maternity Home** is a former private [maternity hospital](/wiki/Maternity_hospital) on Prinsep Street in [Rochor, Singapore](/wiki/Rochor). Opened by Dr. S. R. Salmon in 1950, it was the first such hospital in Singapore. It closed in the 1980s, after which the building served as the private residence of Salmon's daughter, Dr. Yvonne M. Salmon. ## Description The building was designed in the [Art Deco](/wiki/Art_Deco) style, with rounded-edge balconies and glass windows framed with metal. The building was painted in white and brown, while its front entrance features twin doors that were both painted yellow. \"Distinctive\" porthole windows can be found on the balconies. Melody Zaccheus of *[The Straits Times](/wiki/The_Straits_Times)* wrote that in January 2015 its \"nondescript white exterior gives no hint of the treasure trove of history and heritage within\", and that it \"remains trapped in the pre-independence days of the 1950s.\" By then, the basins with which newborns were washed, beds, and bassinets \"still stand in their original positions\". The former hospital's 30 wards, as well as a delivery room, had been \"left intact for more than half a century\". ## History The maternity hospital, operated by prominent gynaecologist Dr. S. R. Salmon, was opened in April 1950. It had a dispensary, a consulting room, several operation rooms, a [diathermy](/wiki/Diathermy) room, an X-ray room and a garage with a capacity of two ambulances. The hospital had 24 beds, with the first and third floors of the four-storey building being divided into two separate wards, each with four beds. There were also servants' quarters, accommodation for nurses and the hospital's offices. It was the \"first of its kind\" in Singapore. According to Roots, published by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)), \"thousands\" of babies were delivered at the hospital, which \"played a pivotal role in raising awareness of the importance of ante-natal and post-natal care\". The hospital closed in the 1980s, after which it was used by Salmon's daughter, gynaecologist Yvonne M. Salmon, the hospital's owner at its closure, as a private residence. In 2004, the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) approached her, seeking to gazette the building for conservation. However, she was reportedly \"not supportive\" of conserving the building. In January 2015, conservation architect Lim Huck Chin wrote that the former hospital \"could also be the last of its kind in the developed world.\" Zaccheus wrote that its \"rarity and the risk of redevelopment have prompted heritage experts to issue an urgent appeal to its reclusive aged owner for access to document its facilities, old journals, medical contributions and architecture.\" In 2017, Ramesh William of [Channel NewsAsia](/wiki/Channel_NewsAsia) wrote that the building, which is \"squat, without signage and looking slightly worse for wear\", stands \"somewhat forlornly\", and that its \"quiet exterior exudes the sort of understated charm that all Art Deco structures are wont to do\". Yvonne Salmon lived in the building until her death on 28 October 2020. The memorial service was held there on 2 November. 1°18′06″N 103°51′06″E﻿ / ﻿1.30167°N 103.85156°E﻿ / 1.30167; 103.85156\n",
  "language": "en",
  "processed_at": "2026-01-12T11:50:21.198807",
  "title": "Salmon's Maternity Home",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Salmon%27s_Maternity_Home"
}