{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:50:24.131806"
  },
  "content": "Southeast Asian spicy relish or sauce **Sambal** (Indonesian and Malay pronunciation: [ˈsambal]) is a category of [chilli](/wiki/Chili_pepper)-based [sauces](/wiki/Sauce) or [pastes](/wiki/Chili_sauce_and_paste) originating in [maritime Southeast Asia](/wiki/Maritime_Southeast_Asia), particularly within the cuisines of [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), [Timor-Leste](/wiki/Timor-Leste), [Brunei](/wiki/Brunei), [Singapore](/wiki/Singapore), [southern Thailand](/wiki/Southern_Thailand) and [southern Philippines](/wiki/Southern_Philippines). Owing to historical connections and migration, *sambal* is also found in [South Africa](/wiki/South_Africa), [Suriname](/wiki/Suriname) and the [Netherlands](/wiki/Netherlands), while in [Sri Lanka](/wiki/Sri_Lanka) a local adaptation is known as *sambol*. In [English](/wiki/English_language), it is commonly described as an \"Indonesian condiment\". Traditionally, *sambal* is prepared by [grinding](/wiki/Grind) or pounding fresh or [dried](/wiki/Food_drying) chillies with aromatics such as shallots, garlic, galangal and ginger, often combined with [shrimp paste](/wiki/Shrimp_paste) and seasoned with salt, sugar and acidic ingredients like lime juice or tamarind. *Sambal* may be served raw or cooked and can function as a condiment, a flavouring base or a standalone [side dish](/wiki/Side_dish). The history of *sambal* is closely linked to the development of [spice use](/wiki/Spice_trade) in the region. Before the arrival of chilli peppers from the [Americas](/wiki/Americas) in the 16th century, local communities prepared [pungent](/wiki/Pungency) [relishes](/wiki/Relish) using indigenous and [Old World](/wiki/Old_World) ingredients such as long pepper, ginger, galangal and andaliman. Chilli peppers, introduced through [Portuguese](/wiki/Portuguese_maritime_exploration) and [Spanish trade networks](/wiki/Manila_galleon), were rapidly adopted for their flavour, adaptability to tropical climates and compatibility with established cooking methods, soon replacing long pepper in most dishes. By the 18th century, chilli-based *sambals* were recorded across the [Indonesian archipelago](/wiki/Indonesian_archipelago) and the [Malay Peninsula](/wiki/Malay_Peninsula), with each community developing variations shaped by local ingredients and culinary traditions. Today, *sambal* exists in a wide range of regional forms across [Southeast Asia](/wiki/Southeast_Asia) and in other parts of the world. While chilli remains the central ingredient, the addition of items such as fermented [durian](/wiki/Durian), torch ginger stems, coconut or sweet soy sauce produces distinctive variations linked to local ingredients and culinary traditions. Across Indonesia, Malaysia, Brunei, Singapore, southern Thailand and Sri Lanka, numerous [varieties of *sambal*](/wiki/Varieties_of_sambal) have developed, reflecting both regional diversity and shared historical influences. ## History ### Indigenous and early hot spices of Southeast Asia Before the introduction of chilli peppers (*[Capsicum](/wiki/Capsicum)* spp.) from the [Americas](/wiki/Americas) in the 16th and 17th centuries, the peoples of maritime Southeast Asia prepared spicy [relishes](/wiki/Relish) using indigenous and [Old World](/wiki/Old_World) [pungent](/wiki/Pungency) ingredients. Among the most prominent were long pepper (*[Piper retrofractum](/wiki/Piper_retrofractum)* and *[Piper longum](/wiki/Long_pepper)*), ginger (*[Zingiber officinale](/wiki/Ginger)*), galangal (*[Alpinia galanga](/wiki/Alpinia_galanga)*) and in certain regions, andaliman (*[Zanthoxylum acanthopodium](/wiki/Zanthoxylum_acanthopodium)*), a local variety of [Sichuan pepper](/wiki/Sichuan_pepper). The exact emergence of sambal remains uncertain, as historical records do not provide clear evidence of its earliest development or geographic origin. The widespread practice of *giling*, meaning the pounding, crushing or grinding of ingredients with a [mortar and pestle](/wiki/Mortar_and_pestle), is shared across many [Austronesian](/wiki/Austronesian_peoples) and [Southeast Asian](/wiki/Southeast_Asia) cultures. The word *giling* itself, meaning \"to grind\" or \"to crush,\" is derived from [Proto-Austronesian roots](/wiki/Austronesian_languages) referring to the action of rolling, turning or crushing. In [Java](/wiki/Java), *cabay* (Javanese long pepper, *[Piper retrofractum](/wiki/Piper_retrofractum)*) was the principal hot spice, recorded in inscriptions and literature from at least the 10th century CE during the [Mataram Kingdom](/wiki/Mataram_kingdom). [Black pepper](/wiki/Black_pepper), introduced from [India](/wiki/India) by the 12th century, expanded the repertoire of pungent flavours. In [North Sumatra](/wiki/North_Sumatra), the [Batak people](/wiki/Batak) used [andaliman](/wiki/Andaliman) as a defining seasoning in dishes such as *arsik* fish, often combined with ginger and torch ginger buds. In [Maluku](/wiki/Maluku_Islands) and the [Banda Islands](/wiki/Banda_Islands), long pepper, ginger and galangal were blended with cloves and nutmeg in stews and preserved foods prior to the widespread adoption of chilli peppers. Across the [Malay Peninsula](/wiki/Malay_Peninsula), parts of [Sumatra](/wiki/Sumatra) and coastal [Borneo](/wiki/Borneo), historical Malay sources record the use of [long pepper](/wiki/Long_pepper) (*lada panjang*) with ginger, galangal and black pepper in spice pastes. [Tomé Pires](/wiki/Tom%C3%A9_Pires), a [Portuguese](/wiki/Portuguese_people) [physician](/wiki/Physician) in [Malacca](/wiki/Portuguese_Malacca) between 1512 and 1514, noted that [betel nut](/wiki/Areca_nut) was chewed in the region for its warming properties. Similar culinary traditions were recorded in mainland Southeast Asia, where long pepper featured in early [Thai](/wiki/Thai_curry) and [Khmer curry pastes](/wiki/Kroeung) alongside ginger, galangal, lemongrass and wild pepper leaves ([Piper sarmentosum](/wiki/Piper_sarmentosum)). In the [pre-Hispanic Philippines](/wiki/History_of_the_Philippines_(900%E2%80%931565)), ginger was the principal source of pungency in broths such as *[tinola](/wiki/Tinola)*, with long pepper (*laya-laya*) likely introduced via trade from the Indonesian islands. In [Vietnam](/wiki/Vietnam) and the former [Champa territories](/wiki/Champa), long pepper was known through maritime exchange and used mainly in medicinal preparations together with ginger and galangal. Across the region, these spices were valued both for their flavour and for perceived health benefits, including aiding digestion and protecting against illness. ### Introduction of chili peppers to Southeast Asia In the 16th century, [chilli peppers](/wiki/Chili_pepper), native to the Americas, were introduced to the Southeast Asian archipelago primarily through [Portuguese](/wiki/Portuguese_maritime_exploration) and [Spanish maritime trade routes](/wiki/Manila_galleon). The [Portuguese](/wiki/Portuguese_Empire), after their arrival in [Goa](/wiki/Portuguese_India), India, in 1498, brought chilli peppers to their colonies and trading posts, including [Malacca](/wiki/Portuguese_Malacca) in the [Malay Peninsula](/wiki/Malay_Peninsula) in 1511, facilitating their spread throughout the [Malay Archipelago](/wiki/Malay_Archipelago). Spanish traders likewise introduced chilli peppers to the Philippines by the mid-16th century. The [capture of Malacca](/wiki/Capture_of_Malacca_(1511)) by the [Portuguese](/wiki/Portuguese_people) under [Afonso de Albuquerque](/wiki/Afonso_de_Albuquerque) in 1511 gave them control of a key [maritime trading hub](/wiki/Entrep%C3%B4t), enabling them to influence the spice trade and culinary practices across Southeast Asia. The introduction of chilli peppers complemented, and in many cases supplanted, traditional spices, becoming a defining element in [regional cooking](/wiki/List_of_Asian_cuisines) from the 16th century onward. Portuguese and Spanish traders connected key ports along maritime routes through India, Malacca, the [Moluccas](/wiki/Maluku_Islands) and coastal Java, enabling the diffusion of chilli peppers across Southeast Asia. Initially, they supplemented or replaced native spices such as long pepper, black pepper, ginger and galangal, becoming increasingly important in local cuisines. Their adaptability to [tropical climates](/wiki/Tropical_climate) and compatibility with local tastes led to rapid adoption, gradually replacing long pepper in everyday cooking, although the latter remained in use in certain ceremonial and medicinal contexts. Chillies gained popularity for both economic and practical reasons. They allowed smaller amounts of costlier ingredients, such as meat or seafood, to be eaten with larger portions of [rice](/wiki/Rice), the region's [staple food](/wiki/Staple_food). Their strong flavour also helped mask the taste of less fresh or [fermented foods](/wiki/Fermentation_in_food_processing) common in the humid tropical climate. Despite an initial sensitivity to capsaicin, many Southeast Asian populations developed a cultural preference for the pungency of chillies, a taste reinforced by the pleasurable [endorphin](/wiki/Endorphins) response associated with their consumption. By the late 16th and early 17th centuries, chillies had become fully integrated into the culinary landscape of the Southeast Asian archipelago. Fresh small chillies were commonly served whole or sliced alongside rice, [noodles](/wiki/Noodle) and [side dishes](/wiki/Side_dish). In some cuisines, they were combined with other ingredients, for example ground peanuts in Thai [som tam](/wiki/Som_tam), while chilli-based sauces and pastes incorporated local seasonings such as shrimp paste, garlic, shallots, lime juice, palm sugar and soy sauce, creating complex, layered flavours. This widespread adoption of chilli peppers laid the foundation for the development of distinctive regional condiments, including the sambals of Indonesia and Malaysia, Thailand's [nam prik](/wiki/Nam_phrik) and Vietnam's tương ớt tỏi (chilli–garlic sauce). ### Emergence of *sambal* The introduction of chilli peppers into the archipelago quickly influenced existing spice-based condiments. Long before their arrival, communities across maritime Southeast Asia used [stone mortars](/wiki/Mortar_and_pestle) and pestles to pound long pepper, ginger, aromatic roots and other spices into [coarse pastes](/wiki/Paste_(food)). Chilli peppers were readily incorporated into these established methods alongside aromatics such as shallots, garlic, galangal and [shrimp paste](/wiki/Shrimp_paste), creating the intense, layered flavours that came to characterise *sambal* and its many variants. Colonial-era accounts describe chilli-based condiments served with rice, fish and vegetable dishes. By the 18th century, *sambal* had become a staple among diverse ethnic groups in the archipelago, including the [Javanese](/wiki/Javanese_people), [Minangkabau](/wiki/Minangkabau_people), [Sundanese](/wiki/Sundanese_people), [Malay](/wiki/Malays_(ethnic_group)), [Peranakans](/wiki/Peranakan_Chinese) and [Balinese](/wiki/Balinese_people), with numerous other communities developing their own local variations. These adaptations, shaped by available ingredients and cultural influences, laid the foundation for the wide variety of sambal found today. Beyond its role as a condiment, *sambal* was prepared in both raw and cooked forms, used as a [side dish](/wiki/Side_dish), flavouring base or cooking ingredient and adapted for everyday meals as well as festive occasions. Its versatility and compatibility with major dietary restrictions allowed it to cross cultural and religious boundaries, contributing to its status as a unifying element of Southeast Asian food culture. ## Culinary profile ### Preparation and availability Traditional *sambals* are freshly made using traditional tools, such as a stone [pestle and mortar](/wiki/Pestle_and_mortar). Sambal can be served raw or cooked. There are two main categories of *sambals*, *sambal masak* (cooked) and *sambal mentah* (raw). Cooked *sambal* undergoes a cooking process resulting in a distinct flavour and aroma, while raw *sambal* is mixed with additional ingredients and usually consumed immediately. *Sambal masak* or cooked *sambals* are more prevalent in the western part of the Southeast Asian archipelago, including western Indonesia, Malaysia, Singapore and Brunei, whereas *sambal mentah* or *raw sambals* are more common in eastern Indonesia. The chilli pepper, garlic, [shallot](/wiki/Shallot) and tomato are often freshly ground using a mortar, while the *terasi* or *belacan* (shrimp paste) is fried or burned first to kill its pungent smell and release its aroma. *Sambal* might be prepared in bulk, as it can be easily stored in a well-sealed glass jar in the refrigerator for a week to be served with meals as a condiment. However, some households and restaurants insist on making freshly prepared *sambal* just a few moments prior to consuming to ensure its freshness and flavour; this is known as *sambal dadak* (lit. 'impromptu sambal' or 'freshly made sambal'). Nevertheless, in most *[warung](/wiki/Warung)* and restaurants, most *sambal* is prepared daily in bulk and offered as a hot and Today some brands of prepared, pre-packed, instant or ready-to-use *sambal* are available in [warung](/wiki/Warung), traditional markets, supermarkets and convenience stores. Most are bottled *sambal*, with a few brands available in plastic or aluminium [sachet](/wiki/Sachet) packaging. Compared to traditional *sambals*, bottled instant *sambals* often have a finer texture, more homogeneous content and thicker consistency, like [tomato ketchup](/wiki/Tomato_ketchup), due to the machine-driven manufacturing process. Traditionally made *sambals* ground in a pestle and mortar usually have a coarse texture and consistency. Several brands produce bottled *sambals* such as [Heinz ABC](/wiki/ABC_(food)) *sambal terasi* and several variants of *sambal* [Indofood](/wiki/Indofood). In the Netherlands a range of pre-packed sambals in glass or plastic jars is readily available from several brands (national and store brands) from almost all supermarkets and [tokos](/wiki/Toko_(shop)). ### Varieties of chili The most common kinds of chili peppers used in *sambal* are: - [Cayenne pepper](/wiki/Cayenne_pepper): a shiny, red and elongated pepper. - [Adyuma](/wiki/Adyuma), also known as [habanero](/wiki/Habanero): a very hot, yellow and block-shaped pepper. - [Madame Jeanette](/wiki/Madame_Jeanette): a very hot, fruity yellow–light green, elongated, irregularly shaped pepper. Typical for [Surinamese cuisine](/wiki/Surinamese_cuisine). - [Bird's eye chili](/wiki/Bird%27s_eye_chili): a very spicy, green–red, elongated pepper approximately 10 millimetres (0.39 in) wide and 50 mm (2.0 in) long. ## Regional variations ### Indonesia In Indonesia, sambal is a ubiquitous condiment with significant [regional diversity](/wiki/Varieties_of_sambal). Across the archipelago, there are reported to be between 212 and 300 distinct varieties, ranging in intensity from mild to extremely hot. *Sambal* is typically made by [grinding](/wiki/Grind) or blending chilli peppers with various secondary ingredients such as garlic, shallots, tomatoes, [shrimp paste](/wiki/Shrimp_paste) (*terasi*) and lime juice. Preparation methods and flavour profiles vary according to local culinary traditions, available ingredients and cultural preferences. Certain varieties are closely associated with specific regions or ethnic groups. Examples include *sambal andaliman* from the [Batak people](/wiki/Batak) of [North Sumatra](/wiki/North_Sumatra), which incorporates *[Zanthoxylum acanthopodium](/wiki/Zanthoxylum_acanthopodium)* (andaliman pepper); *sambal balado* from the [Minangkabau](/wiki/Minangkabau_people) of [West Sumatra](/wiki/West_Sumatra), a [sautéed](/wiki/Saut%C3%A9ing) chilli and tomato mixture often combined with eggs, eggplant or seafood; and *sambal matah* from Bali, a raw *sambal* made with shallots, lemongrass and bird's eye chilli. Some *sambals* feature distinctive local ingredients, such as *sambal durian* (*sambal [tempoyak](/wiki/Tempoyak)*), which uses fermented durian and is found in [Sumatra](/wiki/Sumatra) and parts of [Kalimantan](/wiki/Kalimantan); *sambal bongkot* from [Bali](/wiki/Bali), made with the stems of *[Etlingera elatior](/wiki/Etlingera_elatior)* (torch ginger); *sambal gami* from [Bontang](/wiki/Bontang) in [East Kalimantan](/wiki/East_Kalimantan), cooked with various [shellfish](/wiki/Shellfish); and *sambal terung asam* from Kalimantan, prepared with the sour *[Solanum ferox](/wiki/Solanum_lasiocarpum)*. [Fruit](/wiki/Fruit)-based *sambals* also occur, including *sambal buah* from [Palembang](/wiki/Palembang), made with *[Mangifera kemanga](/wiki/Mangifera_caesia)* (kemang mango) and [pineapple](/wiki/Pineapple); *sambal belimbing wuluh* with sour *[bilimbi](/wiki/Averrhoa_bilimbi)*; and *sambal pencit* from [Central Java](/wiki/Central_Java), which incorporates shredded unripe [mango](/wiki/Mango). Some recipes emphasise simplicity, such as sambal uyah-lombok, made only from raw chilli and salt, or *sambal ulek*, a plain raw chilli paste that can serve as a base for other preparations. Regional *sambals* often accompany specific dishes or are integral to local foodways. For example, *sambal [colo-colo](/wiki/Colo-colo_(condiment))* from [Ambon](/wiki/Ambon,_Maluku) is commonly paired with [grilled fish](/wiki/Ikan_bakar), *sambal luat* from [East Nusa Tenggara](/wiki/East_Nusa_Tenggara) is served with se'i [smoked meat](/wiki/Smoked_meat), and *sambal pecak* is a Betawi condiment for fried fish or chicken. The [Betawi](/wiki/Betawi_people) version is more soupy and using ginger in the *sambal*. Variants such as *sambal tuktuk* from the Batak incorporate andaliman and [dried fish](/wiki/Dried_fish), while *sambal taliwang* from [Lombok](/wiki/Lombok) uses locally grown naga [jolokia](/wiki/Ghost_pepper) peppers. ### Malaysia, Brunei, Singapore and Thailand In Malaysia, Brunei, southern Thailand and Singapore, *sambal* is a common accompaniment to rice and [noodle dishes](/wiki/Noodle). While chilli and [shrimp paste](/wiki/Shrimp_paste) (belacan) form the base of many recipes, variations arise from differences in ingredient combinations, preparation methods and intended pairings. One of the most well-known varieties is *sambal belacan*, made by pounding fresh chillies with toasted belacan in a stone mortar, seasoned with sugar and lime juice. Traditionally, limau kesturi ([calamansi](/wiki/Calamansi)) is used, though regular lime is a common substitute outside Southeast Asia. Optional ingredients include [tomatoes](/wiki/Tomato) or sweet–sour fruits such as unripe [mango](/wiki/Mango). The *sambal* is eaten with raw vegetables or ulam, often as part of a rice meal. A [Malaysian Chinese](/wiki/Malaysian_Chinese_cuisine) variation involves frying the belacan with chilli before serving. *Sambal* jeruk is prepared from green or red chillies with [kaffir lime](/wiki/Kaffir_lime), or with [vinegar](/wiki/Vinegar) and sugar in place of lime and is typically served as a condiment with [nasi goreng](/wiki/Nasi_goreng) or noodle dishes. *Sambal tempoyak*, found in [Pahang](/wiki/Pahang), [Perak](/wiki/Perak) and parts of [Brunei](/wiki/Brunei), incorporates fermented [durian](/wiki/Durian) ([tempoyak](/wiki/Tempoyak)) and may be served raw or cooked. In the raw form, pounded chillies are mixed with dried anchovies and eaten with tempoyak; in the cooked version, the mixture is stir-fried with shallots, lemongrass, turmeric leaf, anchovies and sometimes [petai](/wiki/Parkia_speciosa) or tapioca shoots. *Sambal hitam Pahang* is another regional variety that incorporates [belimbing](/wiki/Averrhoa_bilimbi) to add a sour note. Other varieties include *sambal kicap*, a blend of sweet [soy sauce](/wiki/Soy_sauce), shallots, garlic and bird's eye chilli used as a dipping sauce for fried foods or as a condiment for soups; *Sambal tumis*, a stir-fried *sambal* made from dried and fresh chillies, belacan and gula Melaka, is a traditional accompaniment to [nasi lemak](/wiki/Nasi_lemak), typically served with fried anchovies, peanuts, cucumber and boiled egg. ### The Philippines In the [southern Philippines](/wiki/Southern_Philippines), particularly among the [Tausug](/wiki/Taus%C5%ABg_people) and other [Moro communities](/wiki/Moro_people) of the [Sulu Archipelago](/wiki/Sulu_Archipelago) and [Mindanao](/wiki/Mindanao), *sambal* refers to a spicy condiment or appetiser distinct from, but related to, the chilli-based *sambals* of neighbouring Malaysia and Indonesia. It is commonly served as a [starter](/wiki/Starter_food), accompanied by sliced cucumber, chopped radish or green mango and is intended to stimulate the appetite before the main meal. Typical ingredients include shallots, ginger, onions, chillies, peppercorns and other aromatics, which are pounded or blended to produce a piquant mixture. In the Philippines, the term is also used for a sweet and spicy broth, known as *sambal* soup, served with [satti](/wiki/Satay), a breakfast dish of skewered grilled meat and rice balls. ### Sri Lanka In [Sri Lanka](/wiki/Sri_Lanka), *sambol* is believed to have been introduced during the colonial era, derived from the chilli-based *sambal* of the [Dutch East Indies](/wiki/Dutch_East_Indies). The term is said to have acquired its distinctive \"o\" when adopted into [local usage](/wiki/Languages_of_Sri_Lanka). Once introduced, the preparation was adapted to incorporate locally abundant ingredients such as chillies, grated coconut, lime juice and vegetables like nelum ala ([lotus stem](/wiki/Nelumbo_nucifera)) and dambala ([winged bean](/wiki/Winged_bean)). Traditionally, the ingredients are combined using a wooden grinding device called a mirisgala, producing a spicy side dish that is typically consumed uncooked. Sri Lankan *sambols* differ from those of Southeast Asia in that they are generally prepared from fresh, uncooked ingredients. Commonly, fresh chillies, shallots, coconut and garlic are ground with a mortar and pestle, then mixed with a souring agent such as lime or lemon juice. The result resembles condiments such as [Mexican](/wiki/Mexican_cuisine) [salsa](/wiki/Salsa_(food)) or [Laotian](/wiki/Lao_cuisine) [jaew](/wiki/Jeow_bong). Variations are often served as accompaniments to rice, bread or other staple foods. A notable type is *seeni sambol* (also spelled *sini sambol* or *seeni sambal*), a hot–sweet preparation made from onions, crumbled [Maldives fish](/wiki/Maldives_fish) and spices. Its name derives from the [Sinhala](/wiki/Sinhala_language) word for \"sugar.\" *Pol sambol* (*thengkai sambal* in [Tamil](/wiki/Tamil_language)) is made from scraped coconut, onion, green and red chillies and lime juice, sometimes with the addition of Maldives fish or [tomato](/wiki/Tomato) in place of lime. Lunumiris, literally \"salt chilli,\" is a paste of red chilli and sea salt, often enriched into katta *sambal* with onions, Maldives fish and lime juice. Other varieties include vaalai *kai sambal*, made from boiled and mashed unripe [plantain](/wiki/Cooking_banana), scraped coconut, chopped green chillies, onion, salt and lime juice. Among [Jaffna](/wiki/Jaffna) [Tamils](/wiki/Sri_Lankan_Tamils), a preparation called campal is produced, bearing similarities to a [chutney](/wiki/Chutney). ### The Netherlands *Sambal* is a common spicy condiment in [Dutch cuisine](/wiki/Dutch_cuisine), introduced from Indonesia, a former [Dutch colony](/wiki/Dutch_colonial_empire). It is widely available in [supermarkets](/wiki/Supermarket) and Asian specialty stores ([tokos](/wiki/Toko_(shop))), with popular brands including Conimex and Koningsvogel. Common varieties sold in the Netherlands include *sambal oelek*, a simple chili paste and *sambal badjak*, a sweet, cooked *sambal* often prepared with onions. In the [Netherlands](/wiki/Netherlands), *sambal* is used as a condiment for [Dutch-Indonesian](/wiki/Indo_people) fusion dishes such as [rijsttafel](/wiki/Rijsttafel), nasi, bami and is also added to snacks and sandwiches. Among the available types, *sambal oelek* remains the most popular, though other ready-to-use jarred variants are also common. ### South Africa *Sambal* is a known condiment in [South Africa](/wiki/South_Africa), particularly within [Cape Malay cuisine](/wiki/Cape_Malays), which reflects the influence of [Indonesian](/wiki/Native_Indonesians) and [Malaysian ancestors](/wiki/Bumiputera_(Malaysia)) brought to the region during the [colonial era](/wiki/Dutch_Cape_Colony). South African *sambals* are typically chili-based and often include ingredients such as chilies, garlic and shallots, sometimes combined with local flavorings. They are used to add spice and zest to dishes and have been adapted to local tastes, with variations including cucumber *sambal*. Through historical migration and cultural blending, *sambal* has become an integrated element of [South African cuisine](/wiki/South_African_cuisine) while retaining its characteristic chili-based profile. ### Suriname *Sambal* is a commonly used condiment in [Surinamese cuisine](/wiki/Culture_of_Suriname), particularly among the [Javanese-Surinamese community](/wiki/Javanese_Surinamese), who brought their culinary traditions during the colonial era. It is typically served with rice, meats and [tempeh](/wiki/Tempeh), varieties include *sambal* prepared with chicken hearts, gizzards or liver, as well as tempeh *sambal*, often spiced with the locally grown [Madam Jeanette chili pepper](/wiki/Madame_Jeanette) for added heat. Distinctive Surinamese versions incorporate local ingredients, such as *Surinam cherry sambal* and *peanut sambal* (*pinda sambal*), which blend indigenous produce with Indonesia-inspired preparation methods. *Sambal* in Suriname is commonly made at home for freshness but is also widely available in markets and restaurants. ## *Sambal* as an ingredient in dishes Beyond its role as a condiment, *sambal* is frequently used as a [cooking ingredient](/wiki/Cooking_ingredient), forming the base of many dishes that incorporate large amounts of chilli peppers. In Indonesia, preparations beginning with the term *sambal goreng* (\"fried sambal\") refer to stir-fried *sambal* combined with a main ingredient. Common examples include potatoes (*sambal goreng kentang*), liver (*sambal goreng hati*), beef or buffalo skin crackers (*sambal goreng krecek*), anchovies (*sambal goreng teri*) and [tempeh](/wiki/Tempeh) (*sambal goreng kering tempe*). In [Minangkabau cuisine](/wiki/Padang_cuisine), dishes prefixed with [balado](/wiki/Balado_(food)), meaning \"with chilli pepper,\" similarly indicate the incorporation of *sambal* into the recipe, as in udang balado (prawns with *sambal*). *Sambal* is also served alongside fresh vegetables, as in the [Sundanese *sambal lalab*](/wiki/Sundanese_cuisine), or paired with seafood such as squid or cuttlefish (*sambal cumi* or *sambal sotong*), dried prawns (*sambal udang kering*) and eel (*sambal belut*). Other variations include mushroom-based *sambal jamur*, fish preparations like *sambal ikan*, which may be cooked into a moist curry-like form or reduced to dry floss (*serunding ikan*) and the [Javanese](/wiki/Javanese_cuisine) *sambal wader*, made from yellow rasbora and *sambal terasi*, believed to have been served since the [Majapahit era](/wiki/Majapahit). In [Malaysia](/wiki/Malaysian_cuisine), [Singapore](/wiki/Singaporean_cuisine) and [Brunei](/wiki/Brunei), *sambal* features in popular dishes such as grilled stingray (*Pari bakar*), where [barbecued](/wiki/Barbecue) [stingray](/wiki/Stingray) is served with sambal paste and serunding daging, a slow-cooked beef *sambal* with a floss-like texture. *Ayam masak sambal* is often served at *kenduri kahwin* (wedding feasts), highlighting its place in celebratory meals. - Food portal - Indonesia portal - Malaysia portal - Singapore portal - Sri Lanka portal - [Balado](/wiki/Balado_(food)), Minang-style *sambal goreng* - [Hot sauce](/wiki/Hot_sauce), also known as chili sauce or pepper sauce - *[Nam phrik](/wiki/Nam_phrik)*, the Thai equivalent of sambal - [Salsa (sauce)](/wiki/Salsa_(sauce)) - [Indonesian cuisine](/wiki/Indonesian_cuisine) - [Malaysian cuisine](/wiki/Malaysian_cuisine) - [Singaporean cuisine](/wiki/Singaporean_cuisine) - [Peranakan cuisine](/wiki/Peranakan_cuisine) - [Filipino cuisine](/wiki/Filipino_cuisine) - [Varieties of sambal](/wiki/Varieties_of_sambal) - Sambal\n",
  "language": "en",
  "processed_at": "2026-01-12T11:50:24.131399",
  "title": "Sambal",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sambal"
}