{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:50:26.101249"
  },
  "content": "Seafood dishThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Sambal stingray\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2015)* *(Learn how and when to remove this message)* **Sambal pari**, also known in English as **stingray sambal or spicy banana leaf stingray** and by the Malay name **ikan pari bakar** (barbecued stingray fish), is a Malaysian/Singaporean seafood dish. Prepared by barbecuing [stingray](/wiki/Stingray), it is served with [sambal](/wiki/Sambal) paste atop. Sambal pari can be easily purchased at hawker centers in both Malaysia and Singapore. ## History Stingray was previously deemed as not popular and was cheap to purchase; given the enhancement of its taste, the value of stingray in markets has since risen. Originating from Malaysia, the dish is now also popular among Singaporeans. Its Malay name is ikan bakar, which literally means ‘barbecued fish’. ## Ingredients The sambal paste served with the stingray is made up of spices (sometimes including [belachan](/wiki/Belachan)), Indian walnuts, and [shallots](/wiki/Shallots). Other ingredients may include garlic, sugar, Chinese parsley, or raw [peanuts](/wiki/Peanut). The paste is then spread on top of stingray fins, preferably fresh ones. In addition, female ones are preferred to male ones. White fish is in some instances used as an alternative, usually when stingray cannot be found. Flavor enhancers include white pepper or salt. Other recipes involve small amounts of brandy and olive oil. The dish is commonly accompanied with lime or lemon. ## Preparation Usually wrapped in [banana leaves](/wiki/Banana_leaf) for ten minutes to cook, the fins of the stingray are first chopped to smaller bits. It also can be wrapped in ginger leaves or aluminium foil. Sambal stingray is charcoal-grilled. - Food portal - [Malaysian cuisine](/wiki/Malaysian_cuisine) - [Cuisine of Singapore](/wiki/Cuisine_of_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:50:26.100826",
  "title": "Sambal stingray",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sambal_stingray"
}