{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:50:28.105034"
  },
  "content": "Deep-fried pastry snack A **samosa** (/səˈmoʊsə/) (listen) is a fried [South Asian](/wiki/South_Asian) [pastry](/wiki/Pastry) with a savory filling that mostly consists of [vegetables](/wiki/Vegetables) like spiced [potatoes](/wiki/Potatoes), [onions](/wiki/Onion), and [peas](/wiki/Peas), but can also include [meat](/wiki/Meat), [fish](/wiki/Fish_as_food), or [cheese](/wiki/Cheese). Its name originates from the [Middle Persian](/wiki/Middle_Persian) word *sambosag* (سنبوسگ) (meaning 'triangular pastry'). It is made in different shapes, including triangular, cone, or crescent, depending on the region. Samosas are often accompanied by [chutney](/wiki/Chutney), and have origins in [medieval](/wiki/Medieval) times or earlier. Sweet versions are also made. Samosas are a popular [entrée](/wiki/Entr%C3%A9e), [appetizer](/wiki/Appetizer), or [snack](/wiki/Snack) in the cuisines of [South Asia](/wiki/South_Asian_cuisine), [Southeast Asia](/wiki/Southeast_Asia), [West Asia](/wiki/West_Asia), [Central Asia](/wiki/Central_Asian_cuisine), [Portugal](/wiki/Portugal), [East Africa](/wiki/East_African_cuisine), [West Africa](/wiki/West_African_cuisine) and their [South Asian diasporas](/wiki/South_Asian_diaspora). ## Etymology The English word *samosa* derives from the [Hindustani](/wiki/Hindustani_language) word *samosa* ([Urdu](/wiki/Urdu_language): سموسہ, [Hindi](/wiki/Hindi_language): समोसा), traceable to the Middle Persian word *sambōsag* (سنبوسگ) 'triangular pastry'. Similar pastries are called *sambusak* in [Arabic](/wiki/Arabic) from [Persian](/wiki/Persian_language); medieval Arabic recipe books sometimes spell it *sambusaj*, which are all borrowed from Persian *sanbosag*. ## History The South Asian samosa is believed to be derived from a medieval precursor from [the Middle East](/wiki/The_Middle_East) that was [baked](/wiki/Baked) and not [deep fried](/wiki/Deep_fried). The earliest mention of a samosa precursor was by [Abbasid](/wiki/Abbasid_Caliphate)-era poet [Ishaq al-Mawsili](/wiki/Ishaq_al-Mawsili), praising the *sanbusaj*. Recipes are found in 10th–13th-century Arab cookery books, under the names *sanbusak*, *sanbusaq*, and *sanbusaj*, all deriving from the Persian word *sanbosag*. In [Iran](/wiki/Iran), the dish was popular until the 16th century, but by the 20th century its popularity was restricted to certain provinces (such as the *sambusas* of Larestan). [Abolfazl Beyhaqi](/wiki/Abolfazl_Beyhaqi) (995–1077), an [Iranian](/wiki/Iranian_peoples) historian, mentioned it in his history, *[Tarikh-e Beyhaghi](/wiki/Tarikh-e_Beyhaghi)*. The Central Asian *[samsa](/wiki/Samsa_(food))* was introduced to the Indian subcontinent in the 13th or 14th century by chefs from the Middle East and Central Asia who cooked in the royal kitchens for the rulers of the [Delhi Sultanate](/wiki/Delhi_Sultanate). [Amir Khusro](/wiki/Amir_Khusro) (1253–1325), a scholar and the royal poet of the Delhi Sultanate, wrote around 1300 CE that the princes and nobles enjoyed the \"samosa prepared from meat, [ghee](/wiki/Ghee), onion, and so on\". [Ibn Battuta](/wiki/Ibn_Battuta), a 14th-century traveler and explorer, describes a meal at the court of [Muhammad bin Tughluq](/wiki/Muhammad_bin_Tughluq), where the *samushak* or *sambusak*, a small pie stuffed with minced meat, almonds, pistachios, walnuts and spices, was served before the third course of *[pulao](/wiki/Pilaf)*. *[Nimatnama-i-Nasiruddin-Shahi](/wiki/Nimatnama-i-Nasiruddin-Shahi)*, a [medieval Indian](/wiki/Medieval_India) cookbook started for [Ghiyath Shah](/wiki/Ghiyath_Shah), the ruler of the [Malwa Sultanate](/wiki/Malwa_Sultanate) in central India, mentions the art of making samosa. The *[Ain-i-Akbari](/wiki/Ain-i-Akbari)*, a 16th-century [Mughal](/wiki/Mughal_Empire) document, mentions the recipe for [qottab](/wiki/Qottab), which it says, \"the people of [Hindustan](/wiki/Hindustan) call *sanbúsah*\". The samosa gained its popularity due to its savory flavor and convenience. The pocket-sized food item was a readily available [snack](/wiki/Snack) for workers and travelers across Central and South Asia. ## Regional varieties This section **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources in this section. Unsourced material may be challenged and removed. *(February 2025)* *(Learn how and when to remove this message)* ### India The samosa is prepared with an [all-purpose flour](/wiki/All-purpose_flour) (locally known as [maida](/wiki/Maida_(flour))) and stuffed with a filling, often a mixture of diced and cooked or mashed boiled potatoes, onions, green peas, lentils, ginger, spices and green chillies. A samosa can be either vegetarian or non-vegetarian, depending on the filling. The entire pastry is deep-fried in vegetable oil or (rarely) [ghee](/wiki/Ghee) until it achieves a golden-brown colour. It is served hot, often with fresh green chutneys, such as mint or [coriander chutney](/wiki/Coriander), or [tamarind](/wiki/Tamarind) chutney. It can also be prepared in a sweet form. Samosas are often served as a tea-time snack, or as a *[chaat](/wiki/Chaat)* (a type of street food), along with the traditional accompaniments of either a chickpea or a white pea preparation, drizzled with yogurt, tamarind chutney and green chutney, and garnished with chopped onions, coriander, and *[chaat masala](/wiki/Chaat_masala)*. In the Indian states of [Assam](/wiki/Assam), [Odisha](/wiki/Odisha), [West Bengal](/wiki/West_Bengal), [Bihar](/wiki/Bihar) and [Jharkhand](/wiki/Jharkhand), *singara*s (সিঙ্গারা) or *shingra*s (চিংৰা) (the East Indian version of samosas) are popular snacks found almost everywhere. They are a bit smaller than in other parts of India, with a filling consisting chiefly of cooked diced potato, peanuts, and sometimes raisins. *Shingra*s are wrapped in a thin sheet of dough (made of all-purpose flour) and fried. Good *shingra*s are distinguished by flaky textures akin to that of a savory pie crust. Singaras may be eaten as a tea-time snack. They can also be prepared in a sweet form. Bengali singaras tend to be triangular, filled with potato, peas, onions, diced almonds, or other vegetables, and are more heavily fried and crunchier than other singaras or their samosa cousins. Singara filled with cauliflower mixture is a popular variation. Non-vegetarian varieties of singaras are mutton singaras and fish singaras. There are also sweet versions, such as coconut singara, as well as others filled with *[khoya](/wiki/Khoya)* and dipped in sugar syrup that are known as Mishti Shingara. In the city of [Hyderabad](/wiki/Hyderabad,_India), a smaller version of samosa with a thicker pastry crust and minced meat filling, referred to as *[lukhmi](/wiki/Lukhmi)*, is consumed, as is another variation with an onion filling. Crispy samosas filled with a spicy onion filling are also popular in the city and known as Irani/onion samosas. They were popularised by [Irani cafes](/wiki/Irani_cafes) in the city and are also popularly sold in train stations and bus stands. In the states of [Andhra Pradesh](/wiki/Andhra_Pradesh), [Karnataka](/wiki/Karnataka), [Kerala](/wiki/Kerala), and [Tamil Nadu](/wiki/Tamil_Nadu), samosas are slightly different, being folded differently, more like Portuguese *chamuças*, with a different style of pastry. The filling also differs, typically featuring mashed potatoes with spices, fried onions, peas, carrots, cabbage, curry leaves, and green chilis, and is mostly eaten without chutney. Samosas in [South India](/wiki/South_India) are made in different sizes, whose fillings are influenced by local food habits, and may include meat. ### Bangladesh Both flat-shaped (triangular) and full-shaped (tetrahedron/triangular pyramid) samosas are popular snacks in [Bangladesh](/wiki/Bangladesh). A [Bengali](/wiki/Bengali_language) version of the full-shaped samosa is called a সিঙাড়া (*shingara*) and is normally smaller than the standard variety. The *shingara* is usually filled with pieced potatoes, vegetables, nuts, etc. However, *shingaras* filled with beef liver are very popular in some parts of the country. The flat-shaped samosa is called a *somosa* or *somucha*, and is usually filled with onions and minced meat. ### Nepal Samosas are called *singadas* in the eastern part of [Nepal](/wiki/Nepal); the rest of the country calls it samosa. In Nepal, samosa was introduced to by the Indian merchants and communities who migrated to Nepal, such as the [Marwari people](/wiki/Marwari_people), and it quickly became a very popular snack. Instead of chuntey as popular in the neighbouring countries, samosa is often served and consumed with a chickpea or green pea curried soup. Vendors sell the dish in various markets and restaurants. ### Pakistan Samosas of various types are available throughout [Pakistan](/wiki/Pakistan). In general, most samosa varieties sold in the southern [Sindh](/wiki/Sindh) province and in the eastern [Punjab](/wiki/Punjab_(Pakistan)), especially the city of [Lahore](/wiki/Lahore), are spicier and mostly contain vegetable or potato-based fillings. However, the samosas sold in the west and north of the country mostly contain minced meat-based fillings and are comparatively less spicy. The meat samosa contains minced meat (lamb, beef, or chicken) and is popular as a snack food in Pakistan. In Pakistan, the samosas of [Karachi](/wiki/Karachi) are famous for their spicy flavour, whereas samosas from [Faisalabad](/wiki/Faisalabad) are noted for being unusually large.[*citation needed*] Another distinct variety of samosa, available in Karachi, is called *kaghazi samosa* ([Urdu](/wiki/Urdu_language): کاغذی سموسہ; \"paper samosa\" in English) due to its thin and crispy covering, which resembles a [wonton](/wiki/Wonton) or [spring roll](/wiki/Spring_roll) wrapper. Another variant, popular in Punjab, consists of samosas with side dishes of mashed spiced chickpeas, onions, and coriander leaf salad, as well as various chutneys to top the samosas. Sweet samosas are also sold in the cities of Pakistan including Peshawar; these sweet samosas contain no filling and are dipped in thick sugar syrup. Another Pakistani snack food, popular in Punjab, is known as *samosa chaat*. This is a combination of a crumbled samosa, along with spiced chickpeas ([channa chaat](/wiki/Chaat)), yogurt, and chutneys. Alternatively, the samosa can be eaten on its own with chutney on the side. In Pakistan, samosas are a staple [iftar](/wiki/Iftar) food for many Pakistani families during the month of [Ramzan](/wiki/Ramadan). ### Maldives The types and varieties of samosa made in [Maldivian cuisine](/wiki/Maldivian_cuisine) are known as *bajiyaa*. They are filled with a mixture including fish like [tuna](/wiki/Tuna) and onions. ## Similar snacks This section **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources in this section. Unsourced material may be challenged and removed. *(February 2025)* *(Learn how and when to remove this message)* Similar snacks and variants of samosas are found in many other countries. They are derived either from the South Asian *somasa* or are derived from the medieval precursor that originated in the Middle East. ### Central Asia The *samsa* is a savoury pastry in Central Asian cuisines, consisting of a bun stuffed with meat and sometimes vegetables. ### Southeast Asia #### Myanmar (Burma) Samosas are called *samuza* (စမူဆာ) in [Burmese](/wiki/Burmese_language), and are an extremely popular street snack in [Burma](/wiki/Burma). Samosas are also used in a traditional [Burmese salad](/wiki/Burmese_salads) called *[samuza thoke](/wiki/Chaat)* (စမူဆာသုပ်‌; lit. 'samosa salad'), a salad of cut samosa pieces with onions, cabbage, fresh mint, light potato and chickpea curry broth, masala, chili powder, salt and lime. #### Indonesia In [Indonesia](/wiki/Indonesia), samosas are locally known as *samosa*, filled with potato, cheese, curry, rousong or noodles as adapted to local taste. They are usually served as a snack with [sambal](/wiki/Sambal). *Samosa* is similar to Indonesian *[pastel](/wiki/Pastel_(food)#Indonesia)*, *[panada](/wiki/Empanada#Indonesia)* and *[epok-epok](/wiki/Curry_puff#Indonesia)*. ### Africa #### East Africa Samosas are a key part of East African food often seen in [Somalia](/wiki/Somalia), [Tanzania](/wiki/Tanzania), [Kenya](/wiki/Kenya), [Uganda](/wiki/Uganda), [Burundi](/wiki/Burundi), [Eritrea](/wiki/Eritrea), [Ethiopia](/wiki/Ethiopia), and [Rwanda](/wiki/Rwanda).[*citation needed*] Samosas, locally called samoussas, are a popular snack on [Réunion](/wiki/R%C3%A9union) and [Mauritius](/wiki/Mauritius) as both islands have faced large waves of labor immigration from the Indian subcontinent. The samosas there are generally smaller and filled with chicken, cheese, crabs or potatoes. Varieties include chocolate and banana or pizza. #### South Africa Called *samoosas* in South Africa, they tend to be smaller than Indian variants, and form part of [South African Indian](/wiki/Indian_South_Africans) and [Cape Malay](/wiki/Cape_Malays) cuisine.[*citation needed*] Samosa dough is also used for a flatbread called farmaas puri, which consists of rolled-up sheets of dough stacked with minced meat, which are cut into thin circles and deep fried. Originating in South Africa, farmaas puri spread to [Gujarati](/wiki/Gujarati_people) communities in India and Pakistan, where it is popular during Ramadan. #### West Africa Samosas also exist in West African countries such as [Ghana](/wiki/Ghana) and [Nigeria](/wiki/Nigeria), where they are a common [street food](/wiki/Street_food). In Nigeria, it is usually served in parties along with chicken or beef, puff puff, spring rolls and plantains and are called small chops. ### Middle East #### Arab countries Sambousek ([Arabic](/wiki/Arabic_language): سمبوسك) are usually filled with either meat, onion, pine nuts, [za’atar](/wiki/Origanum_syriacum), [spinach dock](/wiki/Spinach_Dock), or cheese. *Sambousek* is most popular during Ramadan. #### Iran Sambuseh ([Persian](/wiki/Persian_language): سمبوسه) can often be found in the southern regions of [Iran](/wiki/Iran) and rarely in other areas. However, traditionally it used to be made in the form of [qottab](/wiki/Qottab) filled with ground nuts (usually, walnuts), sugar, fragrant herbs or spices, and likewise fried in oil. It is used as a confectionary and quite commonly. When meat is used, it is no longer called qottab. This is all that remains of the old \"sanbusag\" in its ancient homeland. Nowadays, Iranian Sambuseh is often made with a [sausage](/wiki/Sausage) and [pizza cheese](/wiki/Pizza_cheese) based filling; however, a vegetable-based variety also exists. #### Israel Sambusak ([Hebrew](/wiki/Hebrew_language): סמבוסק) comes in several distinct forms, as sambusak has been influenced differently by Sephardic and Mizrahi cuisine. Sephardi sambusak is generally thicker, baked, and stuffed with either cheese or beef and coated with sesame or nigella seeds. Mizrahi sambusak is generally thinner, larger, fried, and stuffed with curry-spiced chickpea and onion, and is usually not coated with seeds. ### Portuguese-speaking regions In [Goa](/wiki/Goa) (India), [Portugal](/wiki/Portugal), and [Angola](/wiki/Angola), samosas are known as *chamuças*. They are usually filled with chicken, beef, pork, lamb or vegetables, and generally served quite hot. Samosas are an integral part of [Goan](/wiki/Goan_cuisine) and [Portuguese cuisine](/wiki/Portuguese_cuisine), where they are a common snack. ### English-speaking regions Samosas are popular in the [United Kingdom](/wiki/United_Kingdom) and the English-speaking Commonwealth including [Canada](/wiki/Canada), and in the [United States](/wiki/United_States). They may be called *samboosa* or *sambusac*, but in South Africa, they are often called *samoosa*. Frozen samosas are increasingly available. Variations using [filo](/wiki/Filo), or flour [tortillas](/wiki/Tortilla) are sometimes found. ## Al-Shabaab's samosa ban [Al-Shabaab](/wiki/Al-Shabaab_(militant_group)), the extremist group controlling parts of [Somalia](/wiki/Somalia), banned samosas in 2011 over concerns about the possible use of rotten meat in the filling. - Food portal - Asia portal - [Aloo pie](/wiki/Aloo_pie) – Trinidadian fast food dish - [Bourekas](/wiki/Bourekas) – Filled pastry in Sephardic Jewish cuisine - [Buuz](/wiki/Buuz) – Type of Mongolian steamed meat dumpling - [Chebureki](/wiki/Chebureki) – Crimean Tatar deep-fried turnover - [Cornish pasty](/wiki/Cornish_pasty) – Cornish pastry filled with meat or vegetablesPages displaying short descriptions of redirect targets - [Curry puff](/wiki/Curry_puff) – Pastry with curry filling - [Fatayer](/wiki/Fatayer) – Arab and Levantine stuffed pie - [Kibbeh](/wiki/Kibbeh) – Arab and Levantine dish of ground meat and bulgur - [Jiaozi](/wiki/Jiaozi) – Chinese dumplings - [List of snack foods from the Indian subcontinent](/wiki/List_of_snack_foods_from_the_Indian_subcontinent) - [List of stuffed dishes](/wiki/List_of_stuffed_dishes) – Foods prepared with fillings and stuffings - [Mandu](/wiki/Mandu_(food)) – Korean dumplings - [Momo](/wiki/Momo_(food)) – Dumpling in Tibetan and Nepali cuisine - [Turnover](/wiki/Turnover_(food)) – Pastry with a filling on a single piece of dough which has been folded over and sealed - [Uchpuchmak](/wiki/Uchpuchmak) – Tatar and Bashkir national dishPages displaying short descriptions of redirect targets - [Vada pav](/wiki/Vada_pav) – Indian fast food item Portals: - Food - Asia **Samosa** at Wikipedia's sister projects: - **Definitions** from Wiktionary - **Media** from Commons - **Quotations** from Wikiquote - **Texts** from Wikisource - **Recipes** from Wikibooks - **Data** from Wikidata\n",
  "language": "en",
  "processed_at": "2026-01-12T11:50:28.104618",
  "title": "Samosa",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Samosa"
}