{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:50:31.879663"
  },
  "content": "Chinese immigrantsThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Samsui women\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2022)* *(Learn how and when to remove this message)* The **Samsui women** (三水妇女; 三水婦女; *Sān shuǐ fùnǚ*; 'Sanshui Women'), best known for their **Red Headscarf** (红头巾; 紅頭巾; *hóng tóu jīn*; 'red headscarf'), were a group of Chinese female immigrants who came to [Malaya](/wiki/British_Malaya) (including [Singapore](/wiki/Singapore_in_the_Straits_Settlements)) between the 1920s and 1940s in search of construction and industrial jobs. These women were mostly from the [Sanshui District](/wiki/Sanshui_District) of modern-day [Guangdong](/wiki/Guangdong), a province in southern [China](/wiki/China). Other areas of origin include [Shunde](/wiki/Shunde) and [Dongguan](/wiki/Dongguan), [Fujian province](/wiki/Fujian) and [Chao'an](/wiki/Chao%27an,_Chaozhou), although labourers from these regions were relatively few in number. Their hard work contributed to the development of the [Straits Settlements](/wiki/Straits_Settlements), both as colonies and later as the new nations of [Singapore](/wiki/Singapore) and [Malaysia](/wiki/Malaysia). Samsui women did manual labour similar to [coolies](/wiki/Coolie) but were considered to be more independent. ## Background information [China](/wiki/Republic_of_China_(1912-1949)) faced the problem of overpopulation in the 19th century and 20th century. Between 1650 and 1800 during the [Qing](/wiki/Qing_dynasty) era, China's population nearly doubled. However, there were insufficient farmlands to support the rapid population growth. Southeastern provinces of China such as Fujian and Guangdong were especially affected. Many of them lived in mountainous regions where there were limited land for growing crops. As a result, many Chinese in Southern China suffered from starvation. In Singapore, more workers were needed to load and unload goods, repair ships, clear jungles for settlements, construct roads and buildings, and provide service for the workers, hence, many immigrants came to Singapore because of the job opportunities, higher wages, and better living conditions. ## Clothing ### Headdress In Chinese, these women are referred to as *Hong Tou Jin* (红头巾; 紅頭巾; *hóng tóu jīn*), which means \"red [bandana](/wiki/Kerchief)\", because of the red cloths they wrapped around their heads, a trademark feature. The cloths kept their hair clean while they worked, as dust and debris could otherwise dirty their hair, and they washed their hair only once a month. The headdress was a square piece of cloth starched stiff and folded into a square-shaped hat. The colour red was used because it caught attention easily, thus reducing the chances of accidents at the construction sites. Besides its shading properties, the headdress was useful in storing items such as cigarettes, matches and money. A blue version of the headgear was typically worn by women from Sun Yap, China, but also by others during a period of mourning, after which they reverted to their original red headgear. ### Blouse/samfoo They usually dressed in dark-blue or black *samfu* (also spelt *samfoo*), which consisted of a set of blouse and trousers. The dark colours ensured that the clothes would not stain easily. The footwear they typically wore were pieces of rubber cut out from used tyres, which they made into sandals by adding straps. ## Jobs Coming to Singapore as cheap labourers between the 1920s and 1940s, the Samsui women worked mainly in the construction industry and other industries that required hard labour. They also worked as [domestic servants](/wiki/Domestic_servant). Samsui women were the traditional source of manpower supply in the construction industry, in order to support their families in their homelands. Samsui women typically commenced their work at 8 am, undertaking physically strenuous tasks such as digging soil and transporting earth, debris, and construction materials using buckets suspended from shoulder poles. Following a brief lunch break, they occasionally collected wood for cooking fuel before concluding their workday around 5 pm or 6 pm. Once their work was done, they returned home to prepare dinner. During the evenings, they engaged in friendly conversations with fellow Samsui women along the five-foot-way corridors outside the shophouses where they resided. Additionally, many of them enjoyed unwinding by smoking cigarettes before retiring for the night. Samsui women earned 50 to 60 cents per day. This was barely enough for their food and rental, and they still had to return the money borrowed from the agency to come to find work in Singapore. As a result, they gave up the prospect of marriage and children, living very simply to save money to support their families, whom they might never see again after they left home. A majority of women would work for about a year to pay off their debts. They often shared accommodation and ate simple food, such as cooked rice, some [bean cheese](/wiki/Bean_cheese) and a bit of pickled or fresh vegetables. Samsui women dug soil and carried earth, debris and building materials in buckets hung from shoulder poles. Despite the long working hours, they only had short lunch breaks, during which they had to gather wood to bring home as fuel for cooking. Their contributions to housing construction and as well as labour at hawker centres have been invaluable to Singapore's early development. ## Social interactions Upon arriving in Singapore, Samsui women would make their way to the [Chinatown](/wiki/Chinatown,_Singapore) neighbourhood located between South Bridge Road and New Bridge Road, where many of their fellow *samsui* migrants stayed. They lived in rooms above shophouses that lined streets such as Upper Chin Chew, Upper Nankin and Eu Tong Sen. A room was further subdivided into cubicles, with at least four women sharing one single room. Rent in the 1930s to 1940s ranged from 80 cents to $1.20 a month. Samsui women also remained in touch with their relatives back home in China, communicating with them frequently through letters. As Samsui women hailed mostly from the poorer parts of China, they were mostly [illiterate](/wiki/Illiterate), and hired professional letter writers to write the letters for them. ## Current status Organisations exist to raise awareness of these women's achievements and contributions to Singapore's development, and their current state. Some of these organisations also strive to provide free travel for the women back to China to visit their relatives before they die. One such organisation was the Sam Sui Wui Kun that took care of the needs of Samsui women. In 2007, a Samsui woman Mdm Loke (陆带好) received commendation from 3rd [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) in the 2007 [Singapore National Day parade](/wiki/Singapore_National_Day_parade) and went on to appear in the 2007 NDP video. On 11 September 2013, she [died](/wiki/Suicide_by_jumping_from_height) at [Bukit Merah](/wiki/Bukit_Merah) at the age of 95. As of 2014, there were only two remaining Samsui women, Mdm Ng Moey Chye (吴妹仔), who was born in Singapore to mainland Chinese parents and Mdm Woo Yun Sum (胡润心). During the 2018 Singapore National Day Parade, a short film depicted the real-life stories of five Singaporeans, including Mdm Woo herself. On 8 May 2020, Woo Yun Sum died at the age of 90. ## Portrayal in media The travails of the Samsui women were portrayed in *[Samsui Women](/wiki/Samsui_Women_(TV_series))*, a Singaporean television drama series produced by [Singapore Broadcasting Corporation](/wiki/Singapore_Broadcasting_Corporation) in 1986, which has widely been considered as one of the best dramas Singapore has produced over the years. There was also a theatrical play by The Finger Players, called *Samsui Women: One Brick at a Time*, held at the [Esplanade – Theatres on the Bay](/wiki/Esplanade_%E2%80%93_Theatres_on_the_Bay). Another depiction of the Samsui women were portrayed in the 2023 Chinese television drama *Sisterhood* produced by [China Central Television](/wiki/China_Central_Television) and streamed on [iQIYI](/wiki/IQIYI) network, which depicted the story about two young women who travelled from the Sanshui District to Nanyang to become among the Samsui women. ### Controversial mural of Samsui woman smoking In April 2024, a mural of portraying a Samsui woman taking a [smoke break](/wiki/Break_(work)#Smoking_breaks) and holding cigarette was painted on an external wall of a conserved shophouse in Chinatown by Singapore-based American artist, Sean Dunston. In May 2024, [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA), the national authority regulating the use of conserved shophouses, ordered to have the cigarette erased as it was \"not aligned with Singapore’s [anti-smoking policy stance](/wiki/Smoking_in_Singapore)\". URA stated that an operating permit renewal applied by the landlord may be denied if the request was not compiled. Additionally, they had received anonymous feedback stating that the depiction was \"offensive\" that the character depicted \"looks more like a prostitute\". Public reaction to the news was supportive of the depiction, with some stating that the depiction could be considered historically accurate. URA further deliberated after the public outcry, and eventually allowed the mural to remain as it is, while fining the landlord for not following procedures before painting the mural.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:50:31.879273",
  "title": "Samsui women",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Samsui_women"
}