{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:50:34.516087"
  },
  "content": "Singaporean biomedical scientist **Samuel Ken-En Gan** (born 1981) is an ethnic Chinese Singaporean multi-disciplinary [biomedical](/wiki/Biomedicine) scientist, psychologist, writer, Christian [apologist](/wiki/Apologist), and educator. He is currently a professor at Wenzhou-Kean University and an adjunct associate professor & Advisor Mentor for James Cook University, Singapore, as well as associate senior lecturer in a few teaching institutions in Singapore. During his time as Senior [Principal Investigator](/wiki/Principal_investigator) of the Antibody and Product Development (APD) Lab within the Agency of Science, Technology and Research ([A*STAR](/wiki/A*STAR)) between September 2011 to April 2022, he founded a startup for scientific phone apps, consultancy, research and educational kits in 2017, which also housed the first and only specialized journal \"Scientific Phone Apps and Mobile Devices\" on mobile apps and IoT devices transferred from SpringerNature. Gan also set up a new open-access student journal \"APD Trove\" in 2017 and serves as founding Editor-in-Chief for both journals. Apart from the two journals he founded, he also served as associate editor for Frontiers in Immunology, Frontiers in Virology, and guest editor for the 'Methods and protocols' journal by MDPI and Frontiers in Psychology. ## Education Samuel Ken-En Gan graduated from [Temasek Polytechnic](/wiki/Temasek_Polytechnic) with a Diploma in [Biotechnology](/wiki/Biotechnology). He attained his BSc (Hons) in [Molecular Cell Biology](/wiki/Molecular_Cell_Biology) from [University College London](/wiki/University_College_London) before embarking on his Masters in [Structural Biology](/wiki/Structural_Biology) from [Birkbeck College](/wiki/Birkbeck_College) and Ph.D. in [Allergy](/wiki/Allergy) from [King's College London](/wiki/King%27s_College_London) simultaneously with his BSc (Hons) in [Psychology](/wiki/Psychology) from [Open University](/wiki/Open_University), Graduate Certificate in Academic Practice and the Associate of King's College, both from King's College London. Gan is also trained in translation & interpretation, theology, business admin, and commercial law & tech transfer. He is a member of the Higher Education Academy UK, the [British Psychological Society](/wiki/British_Psychological_Society), Biochemical Society UK, Allergy & Clinical Immunology Society Singapore, and the [New York Academy of Sciences](/wiki/New_York_Academy_of_Sciences). ## Research Samuel Ken-En Gan performs and publishes research articles in many disciplines. He currently has over 90 publications that includes scientific research articles and books spanning over antibody engineering, viral mutations, psychology (including music psychology), theology, apologetics, scientific phone apps, and science-fiction. He is most well-known publicly for being one of the pioneers of scientific phone apps, in particularly, DNAApp, which received significant worldwide coverage and started the work of scientific phone apps, including founding the journal with SpringerNature. Gan also has research in psychology, particularly in the context of Singapore. His most noted work in this discipline is the 'P2P' theory on how music can moderate anxiety and affect learning. Combining psychology and apps, his lab now has research in psychological game apps to validate and study psychological parameters via smartphone game apps. In biomedical sciences, Gan's research publications are focused on holistic protein engineering, particularly in the rational drug design of antibody therapeutics. In the area of viruses, his work focusses on understanding protein-protein interactions in HIV drug targets, and how new interventions can be designed. ## Contributions Gan plays a significant role in mentoring and coaching polytechnic students across multiple disciplines in Singapore to publish in international journals and develop products. For his effort, he was featured on a report by [Temasek Polytechnic](/wiki/Temasek_Polytechnic) to the [Parliament of Singapore](/wiki/Parliament_of_Singapore) and on a number of news articles. According to his lab social media page, more than 170 interns and tertiary students have been trained since 2013, along with the development of courses with institutions of learning in Singapore. ## Awards and recognition In 2006, Gan was featured as one of the 100 most talented Singaporeans below the age of 25 and one of 200 selected international students globally for the 7th China Synergy Programme for Outstanding Youths 第七届海外杰青会. Gan was listed as one of fifty skilled talented alumni from polytechnic/ITE in Singapore in the SG50 Book \"A Nation of Skilled Talents\", selected as one of the \"world's most promising researchers\" in the Interstellar Initiative by the New York Academy of Sciences and the Japan Agency for Medical Research and Development, as well as one of the 30 world class innovators in the book \"Innovation Through Fusion\" by Dr CJ Meadows. In late 2020, Gan's team won Bronze in the inaugural Merck Lab Connectivity Challenge internationally for their work on scientific phone apps and prototype devices. In Feb 2022, Gan was named winner of the \"Science and Sustainability\" category in the UK Alumni Awards 2021-22 in Singapore.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:50:34.515591",
  "title": "Samuel Gan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Samuel_Gan"
}