{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:50:36.574650"
  },
  "content": "Middle Eastern Contemporary Art Gallery in Singapore **Sana Gallery** is a [contemporary art gallery](/wiki/Contemporary_art_gallery) in [Singapore](/wiki/Singapore) focused on Middle Eastern art. Sana Gallery was founded in 2012 by [Assaad W. Razzouk](/wiki/Assaad_W._Razzouk), the British-Lebanese clean energy and climate change entrepreneur. The gallery was officially opened on October 25, 2012, as the first Middle Eastern contemporary art gallery in South East Asia, with an exhibition of works by the Syrian artist Thaer Maarouf and the Syrian-Lebanese painter Semaan Khawam in a show entitled *Kisses of an Enemy*. Sana Gallery showcases \"I Read I Write,\" an exhibition by Palestinian photographer [Laura Boushnak](/wiki/Laura_Boushnak), from June 19 to July 28, 2013. The exhibition shows portraits of Arab women committed to becoming literate, each with a poignant story of how she came to read and write, are initially manipulated by superimposing written sentences in the subjects' own hand. Previous exhibitions included \"Carnaval of Darwiches\" (March 14-April 28, 2013) by Lebanese artist Raouf Rifai, \"Ordinary Lives\" (December 5, 2012 – January 27, 2013) by Lebanese-American photographer [Rania Matar](/wiki/Rania_Matar) who presented photographs of teenage girls in the intimacy of their bedrooms, some veiled and some not, in images that challenge stereotypes about Middle Eastern women. ## Projects Sana Gallery serves as a platform to showcase young Middle Eastern talent in [Singapore](/wiki/Singapore) to South East Asia, India and China. Sana Gallery's projects include exhibitions anchored around artists’ commissions, installations, artists’ talks and performances. The gallery also offers a temporary residence in Singapore for emerging artists to immerse themselves in the local and regional culture and benefit from the resources available to art and artists in Singapore and in South East Asia. - Official website - Al Hayat - Al Mustaqbal - *L'Orient-Le Jour* - *Bloomberg*\n",
  "language": "en",
  "processed_at": "2026-01-12T11:50:36.574279",
  "title": "Sana Gallery",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sana_Gallery"
}