{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:50:47.218310"
  },
  "content": "International fast food restaurant chain specializing in pizza **Sarpino's Pizzeria** is a Canadian [fast food restaurant](/wiki/Fast_food_restaurant) chain specializing in [pizza](/wiki/Pizza), with international operations headquartered in [Singapore](/wiki/Singapore) and U.S. operations headquartered in the [Chicago](/wiki/Chicago) suburb of [Lincolnshire, Illinois](/wiki/Lincolnshire,_Illinois). ## History The first Sarpino's pizza delivery store was opened by Gerry Koutougos in 2001 in [Victoria, British Columbia](/wiki/Victoria,_British_Columbia). The name has its origins in a vacation that founder Gerry Koutougos took to Italy in 1999, where he visited a restaurant that was operated by a woman named Sarpina. Sarpino's expanded to [Singapore](/wiki/Singapore) in 2002 and to the United States in January 2003 with the opening of a [Phoenix, Arizona](/wiki/Phoenix,_Arizona) location. Within a year after opening the first U.S. location, the chain had close to 20 American stores. During that first year, David Chatkin served as the original [franchisee](/wiki/Franchisee) for two stores in the Chicago area and partnered with Dmitry Shapiro, a software consultant that previously served as a business analyst with Sears and Kraft Foods. Shapiro found that Chatkin's operations were not profitable due to lack of marketing, standardized operations, cost controls, and training. As a result, Shapiro purchased the U.S. operations from Koutougos in 2005 and renamed it Sarpino's USA. He then went on to develop the areas that were lacking to provide the needed support to franchisees. By 2013, Sarpino's USA grew to 47 stores throughout six states. By the end of 2014 it had grown to 65 U.S. locations with a goal of 350 stores open within five years. Sarpino's is owned internationally (non-Canada/USA) by Greg Blakney and the headquarters is in Singapore. - [List of pizza chains](/wiki/List_of_pizza_chains) Portal: - Companies - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:50:47.217865",
  "title": "Sarpino's Pizzeria",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sarpino%27s_Pizzeria"
}