{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:50:47.851689"
  },
  "content": "Singaporean-born Australian cook **Sashikumar \"Sashi\" Cheliah** (born 10 June 1979) is a [Singaporean-born](/wiki/Singaporean_Australians) Australian chef of Indian descent who won the [tenth season](/wiki/MasterChef_Australia_(series_10)) of *[MasterChef Australia](/wiki/MasterChef_Australia)* in 2018. He established his culinary career by opening pop-up restaurants in Melbourne and Adelaide. In 2022, he expanded his ventures to [Chennai](/wiki/Chennai), India, and returned as a fan-favourite contestant for the show's fourteenth season, *[MasterChef Australia: Fans & Favourites](/wiki/MasterChef_Australia_(series_14))*, where he finished in 19th place. ## Background and personal life Cheliah was born and raised in [Singapore](/wiki/Singapore) where he attended [Swiss Cottage Secondary School](/wiki/Swiss_Cottage_Secondary_School) and [ITE College, Yishun](/wiki/ITE_College_Central). He is the eldest of seven children. For 12 years, Cheliah worked for the [Special Tactics and Rescue](/wiki/Special_Tactics_and_Rescue_(Singapore)) (STAR) unit of the [Singapore Police Force](/wiki/Singapore_Police_Force) (SPF), where he trained in tactics, rescue operations, counter terrorism, kidnappings and high-profile protection in the riot police. Cheliah is married to Rabicca Vijayan, who works as a nurse. They have two sons. The family moved to Adelaide in 2012. ## Culinary career Cheliah's interest in food began by watching his mother, who owned a café, and his aunties prepare family meals. His interest in cooking grew further after he moved to Australia. Cheliah was selected in the Top 24 to contest *MasterChef Australia* in 2018. He reached the finale on 31 July, which he won with a record 93 points out of 100. In 2022, Cheliah returned to compete on the show's [fourteenth season](/wiki/MasterChef_Australia_(series_14)), which featured a mix of returning contestants and new contenders. He finished in 19th place. Cheliah started a pop-up restaurant named Gaja by Sashi in the Melbourne CBD, serving Singaporean dishes. In November 2019, Cheliah opened his restaurant Gaja in his home town of Adelaide. - Sashi Cheliah on [Facebook](/wiki/Facebook_(identifier)) Portals: - Biography - Food - Singapore - Australia\n",
  "language": "en",
  "processed_at": "2026-01-12T11:50:47.851230",
  "title": "Sashi Cheliah",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sashi_Cheliah"
}