{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:50:50.489278"
  },
  "content": "Southeast Asian form of kebab **Satay**[a] or **sate** is a [Southeast Asian dish](/wiki/Southeast_Asia) consisting of small pieces of [seasoned](/wiki/Seasoning) meat, seafood or vegetables [skewered on sticks](/wiki/Skewer) and [grilled](/wiki/Grilling) over charcoal. It is typically served with a sauce, most commonly peanut-based and accompanied by rice cakes, cucumber or pickled vegetables. Common ingredients include chicken, beef, goat, pork and seafood, while regional and vegetarian variations are also found. The dish evolved through a blend of foreign and local [culinary influences](/wiki/Fusion_cuisine). [Middle Eastern](/wiki/Middle_East) [kebabs](/wiki/Kebab) introduced by Muslim traders, South Asian cooking techniques brought by [Tamil](/wiki/Tamils) and [Gujarati merchants](/wiki/Gujarati_people), and [Chinese practices](/wiki/Chinese_cuisine) such as bamboo skewering and bite-sized portions were adapted in the port cities of [Java](/wiki/Java), [Sumatra](/wiki/Sumatra) and the [Malay Peninsula](/wiki/Malay_Peninsula). Combined with the use of regional ingredients and spices including lemongrass, turmeric, galangal, and peanuts, these influences gave rise to a distinctly Southeast Asian style of grilled skewered meat. Satay is widely consumed across [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore), [Brunei](/wiki/Brunei), [Thailand](/wiki/Thailand) and the [southern Philippines](/wiki/Southern_Philippines), where it forms part of everyday meals, street food and festive occasions. Regional adaptations reflect local ingredients and cooking traditions, incorporating elements such as [sweet soy sauce](/wiki/Sweet_soy_sauce), coconut milk, turmeric and spice pastes, often served with [ketupat](/wiki/Ketupat), [lontong](/wiki/Lontong) or [pickled condiments](/wiki/Acar). The dish is prepared by hawkers, restaurants and home cooks alike, and has become a familiar feature of [night markets](/wiki/Pasar_malam) and public celebrations. Through [migration](/wiki/Human_migration) and [cultural exchange](/wiki/Cultural_diplomacy), satay has gained international recognition, with notable adaptations in the [Netherlands](/wiki/Netherlands), [Suriname](/wiki/Suriname), [South Africa](/wiki/South_Africa) and [Sri Lanka](/wiki/Sri_Lanka). It is regarded as a [national dish](/wiki/National_dish) in Indonesia and Malaysia and remains a prominent element of hawker and [street-food culture](/wiki/Street_food) in Singapore, Thailand and Brunei. The dish is also maintained within overseas communities such as the [Indo-Dutch](/wiki/Indo_people) in the Netherlands, the [Sri Lankan Malays](/wiki/Sri_Lankan_Malays) and the [Javanese Surinamese](/wiki/Javanese_Surinamese), where it continues to represent a link to their Southeast Asian culinary heritage. ## Etymology According to the [Oxford English Dictionary](/wiki/Oxford_English_Dictionary) and the [Collins English Dictionary](/wiki/Collins_English_Dictionary), the English word satay derives from the [Malay](/wiki/Malay_language) and [Indonesian](/wiki/Indonesian_language) word *satai*, also taken from *saté* or *sate* (ꦱꦠꦺ) in [Javanese](/wiki/Javanese_language), and is ultimately traced to the [Tamil word](/wiki/Tamil_language) *catai* (சதை), a regional variant of *tacai* meaning \"flesh\". The [Cambridge English Dictionary](/wiki/Cambridge_English_Dictionary) defines satay more generally as a Southeast Asian dish of small pieces of meat or fish cooked on skewers and typically served with a spicy [peanut sauce](/wiki/Peanut_sauce). Alternative explanations for the word’s origin include a possible derivation from the [Hokkien](/wiki/Hokkien) or [Min Nan phrase](/wiki/Southern_Min) *sa tae bak* (三疊肉), meaning \"three pieces of meat\". ## History ### Inspiration from foreign food traditions The culinary technique underlying satay is widely regarded as the result of multiple streams of [foreign influence](/wiki/Fusion_cuisine) that reached [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia) through long-distance [trade](/wiki/Trade) and [migration](/wiki/Human_migration). The skewered and grilled meat dishes of the Middle East, particularly [Turkish](/wiki/Turkish_people) and [Arab](/wiki/Arabs) kebabs, spread eastward along established [trade routes](/wiki/Trade_route). Muslim merchants introduced these practices to [South Asia](/wiki/South_Asia), where they were adapted into local culinary traditions. Tamil and Gujarati Muslim traders, who were active in the [Indian Ocean trading networks](/wiki/Indian_Ocean_trade), prepared seasoned and grilled meats that bore similarities to kebabs, and these foodways accompanied them when they established communities in Southeast Asian port cities. [Chinese migrants](/wiki/Overseas_Chinese) also contributed to the evolution of the dish. Their culinary techniques emphasised the use of [bamboo skewers](/wiki/Bamboo) and the preparation of meat in small, bite-sized portions suited to quick grilling over charcoal fires. These methods complemented South Asian and Middle Eastern influences, resulting in a hybrid style of preparation that was well suited to the demands of street vending and communal dining in the region. ### Emergence in Maritime Southeast Asia By the [early modern period](/wiki/Early_modern_period), the combined influences of Middle Eastern, South Asian and Chinese food traditions had taken root in the [Malay archipelago](/wiki/Malay_Archipelago) and surrounding regions. [Java](/wiki/Java), [Sumatra](/wiki/Sumatra) and the [Malay Peninsula](/wiki/Malay_Peninsula) were central nodes of [maritime trade](/wiki/Maritime_trade), attracting Muslim merchants from Gujarat, Tamil Nadu and the Arabian Peninsula, alongside large communities of Chinese migrants. In these [multicultural port towns](/wiki/Multiculturalism), local populations were exposed to diverse methods of [preparing](/wiki/Cooking) and seasoning meat. The introduction of satay, and other now-iconic dishes such as *[tongseng](/wiki/Tongseng)* and *[gulai](/wiki/Gulai) kambing* based on meats such as goat and lamb, coincided with an influx of [Indian](/wiki/Indian_Indonesian) and [Arab](/wiki/Arab_Indonesian) traders and immigrants starting in the 18th century. The Indonesian publication *[Koran Jakarta](/wiki/Koran_Jakarta)* claimed that *sate*, and ultimately satay, originated from Javanese term *sak beteng* which means one stick, and that the dish had existed as early as the 15th century. It was within this environment that satay began to take on a distinctive Southeast Asian identity. Local cooks adapted foreign grilling practices to available resources, using [bamboo skewers](/wiki/Skewer) and [coconut shell](/wiki/Coconut) charcoal, and incorporating regional spices such as [lemongrass](/wiki/Lemongrass), [turmeric](/wiki/Turmeric), [coriander](/wiki/Coriander) and [galangal](/wiki/Galangal). [Peanuts](/wiki/Peanut), introduced from the [Americas](/wiki/Americas) via the [Manila galleon trade](/wiki/Manila_galleon), provided the basis for the [peanut sauce](/wiki/Peanut_sauce) that became one of satay’s most recognisable accompaniments. The dish soon spread beyond port cities into inland regions, where it became embedded in the food cultures of [Javanese](/wiki/Javanese_cuisine), [Malay](/wiki/Malay_cuisine) and other ethnic groups. By the 19th century, satay was already being recorded by colonial observers as a popular street food and festival dish, reflecting its role as both a culinary innovation of global exchanges and a locally embedded [tradition](/wiki/Tradition). ### Regional diversification As satay spread throughout [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia), it underwent a process of [localisation](/wiki/Indigenization) that reflected the diverse cultural and ecological settings of the region. The basic technique of [grilling](/wiki/Grilling) skewered meat over [charcoal](/wiki/Charcoal) was retained, but local communities adapted the dish according to their own culinary traditions, preferred proteins and seasoning styles. In Indonesia, the dish developed into a wide variety of regional forms. In Java, chicken (*sate ayam*) and goat (*[sate kambing](/wiki/Sate_kambing)*) became popular, often marinated in [sweet soy sauce](/wiki/Sweet_soy_sauce) and served with [peanut sauce](/wiki/Peanut_sauce) or sliced [shallots](/wiki/Shallot), and the two famous ones are *sate Madura* and *sate Ponorogo* from [East Java](/wiki/East_Java). [Central Java](/wiki/Central_Java) and [Yogyakarta](/wiki/Yogyakarta) are also known for *sate klathak*, made from skewered mutton seasoned simply with salt and grilled over open charcoal. In [Bali](/wiki/Bali), *sate lilit* features minced meat mixed with grated coconut and spices, wrapped around bamboo sticks or lemongrass stalks. In Sumatra, [Minangkabau cooks](/wiki/Padang_cuisine) developed *sate Padang*, characterised by its thick, spicy [turmeric](/wiki/Turmeric)-based sauce, while [Aceh](/wiki/Aceh)'s *sate matang* offered their own variants satay with broth. Other distinctive Indonesian examples include *sate kelinci* ([rabbit](/wiki/Rabbit) satay) from mountainous regions, *sate kerang* ([cockle](/wiki/Cockle_(bivalve)) satay) from coastal areas and *sate buntel* (minced lamb wrapped in [caul](/wiki/Caul) fat) from [Surakarta](/wiki/Surakarta). Satay in Indonesia is also an inseparable part of religious ceremonies, one of them is on [Galungan](/wiki/Galungan) for Hindus in Bali, which dozens of typical satays are served, including *sate jepit*, *sate gunting*, *sate kuung* and so on. On the [Malay Peninsula](/wiki/Malay_Peninsula), [Malay communities](/wiki/Malays_(ethnic_group)) embraced satay as part of their food heritage. Common local variations included beef, chicken, and tripe, usually served with a peanut-based sauce, [ketupat](/wiki/Ketupat) (compressed rice cakes) and raw onions or cucumber. Other distinctive versions made use of meats such as rabbit, venison and even [porcupine](/wiki/Porcupine). On the east coast, lokching (also known as *sate ikan* or fish satay) forms an important element of local identity. In [Sabah](/wiki/Sabah), the arrival of [Cocos Malay](/wiki/Cocos_Malays) migrants contributed sate Cocos to the state’s culinary repertoire. In [Thailand](/wiki/Thailand), satay is believed to have been introduced through [Malay–Muslim communities](/wiki/Thai_Malays) in the [southern provinces](/wiki/Southern_Thailand), where it continues to be part of local food traditions. The dish subsequently spread northwards, including to [Bangkok](/wiki/Bangkok), where it was adapted with [Thai-style marinades](/wiki/Thai_cuisine) and condiments. Some sources suggest that its introduction to [central Thailand](/wiki/Central_Thailand) may also have occurred via Singapore. While chicken and beef are more typical in the Muslim-majority south, [pork](/wiki/Pork) satay became particularly widespread in mainstream Thai cuisine. It is now a common element of Thai street food, usually served with peanut sauce and pickled cucumber relish. In [Singapore](/wiki/Singapore), satay became a hallmark of [hawker culture](/wiki/Hawker_centre), shaped by Malay, Javanese and [Hainanese influences](/wiki/Hainan_cuisine), and was sold at venues such as the historic Satay Club. In the [southern Philippines](/wiki/Mindanao), [Muslim Filipino communities](/wiki/Bangsamoro) developed a related dish known as *satti*, thought to have been derived from satay and typically served with a spicy sauce and [rice cakes](/wiki/Rice_cake). Other Filipino skewered meat dishes, such as [inasal](/wiki/Chicken_inasal) or barbecue, show parallels with satay through the shared practice of charcoal grilling, though they developed distinctive seasonings shaped by local tastes. Satay thus became established in multiple food cultures across [Southeast Asia](/wiki/Southeast_Asia), with each region creating its own distinctive versions. Despite differences in choice of meat, marinades and condiments, the dish remained recognisable by its characteristic method of grilling skewered portions of meat over charcoal. ### Colonial-era dispersal and diaspora During the colonial era satay travelled beyond Maritime Southeast Asia through several overlapping channels: [indentured labour](/wiki/Indentured_servitude) recruitment, [penal](/wiki/Penal_colony) and military transfers, merchant networks and later migration of colonial-era administrators and their families. The movement was not a single event but a series of flows from the late 18th century through the first half of the 20th century that carried both people and culinary practices to new social and ecological settings. [Javanese labourers](/wiki/Javanese_people) introduced satay to [Suriname](/wiki/Suriname), where it became a hallmark of [Javanese-Surinamese cuisine](/wiki/Javanese_Surinamese) and later integrated into the broader national food culture. In the [Netherlands](/wiki/Netherlands), returning colonial officials, [Indo-Dutch families](/wiki/Indo_people) and post-war migrants brought the dish into domestic cooking and restaurant traditions, where sate became a central feature of the [rijsttafel](/wiki/Rijsttafel) and remains a popular staple of [Dutch cuisine](/wiki/Dutch_cuisine). In [South Africa](/wiki/South_Africa), Malay settlers at the Cape developed sosatie, a marinated and skewered meat dish influenced by satay, which became a distinctive part of [Cape Malay](/wiki/Cape_Malays) and broader [South African cooking](/wiki/South_African_cuisine). In [Sri Lanka](/wiki/Sri_Lanka), [Malay communities](/wiki/Sri_Lankan_Malays) who arrived through colonial-era military and administrative transfers preserved the dish within their own culinary traditions, where it is known as satay and served at communal and festive occasions. ### Modern globalisation During the colonial era, satay was documented by [Dutch](/wiki/Dutch_colonial_empire) and [British](/wiki/British_Empire) observers as a popular food across the [Indonesian archipelago](/wiki/Indonesian_archipelago) and the [Malay Peninsula](/wiki/Malay_Peninsula). By the 19th century, street vendors in Java, Malay Peninsula, Singapore and Siam were noted for selling skewered meats grilled over portable charcoal braziers. In [British Malaya](/wiki/British_Malaya), satay was commonly associated with Malay night markets, festive occasions, and roadside stalls, while in the [Dutch East Indies](/wiki/Dutch_East_Indies) it was reported as a widespread urban street food. In the decades that followed, satay became embedded in the culinary life of [multi-ethnic](/wiki/Multi-ethnic) [port cities](/wiki/Port). In Singapore, it was widely sold by hawkers and became a popular evening street food, later concentrated in venues such as the [Satay Club](/wiki/Satay_Club). In Malaysia, towns such as Kajang emerged as centres of satay production and consumption, while in Indonesia the dish remained closely tied to local markets and festive gatherings. From the mid-20th century onwards, satay gained wider recognition as migration and diaspora communities introduced it abroad. Indonesian, Malaysian, Singaporean and Thai emigrants established restaurants across Asia, Europe, Australia and North America, while adaptations in the Philippines reflected parallel culinary exchanges. International food festivals, cookbooks and diplomatic events further promoted satay as a signature Southeast Asian dish. Today, satay is regarded as a national dish in both Indonesia and Malaysia, while in Singapore it is closely tied to hawker culture. In 2011, it was listed by the [Ministry of Tourism and Creative Economy](/wiki/Ministry_of_Tourism_(Indonesia)) of Indonesia as one of the country’s national foods; in Malaysia, it is likewise recognised as a national heritage food by the Department of National Heritage; and in 2020, it was included in Singapore’s [UNESCO](/wiki/UNESCO_Intangible_Cultural_Heritage_Lists) inscription of hawker culture on the Representative List of the [Intangible Cultural Heritage of Humanity](/wiki/UNESCO_Intangible_Cultural_Heritage_Lists). These recognitions reflect satay’s dual role as a shared regional tradition and a marker of national heritage across Southeast Asia. ## Preparation Chicken is the most common meat used in satay, with other common choices including lamb, goat, mutton, beef, [venison](/wiki/Venison), and rabbit; seafood such as fish, [shrimp](/wiki/Shrimp_(food)), and [squid](/wiki/Squid_as_food); [offal](/wiki/Offal) such as [liver](/wiki/Liver_(food)), intestine, and [tripe](/wiki/Tripe), is also used. Most satay is made by cutting the meat into small thumb-size cubes, however, such recipes as Ponorogo use a single finger-like chicken fillet. The skewers used for chicken satay are traditionally made from *lidi*, a midrib of coconut fronds. Bamboo skewers might be used instead. For firmer meats, such as lamb, goat, and beef, a thicker bamboo skewer is used. The skewers are usually soaked in water before using to avoid burning during grilling. Each skewer usually holds three or four pieces of meat. A goat meat satay might insert a cube of fat between meat cubes. [Turmeric](/wiki/Turmeric) gives the dish its characteristic yellow colour. Another popular marinade is *[kecap manis](/wiki/Kecap_manis)* (sweet soy sauce) mixed with coconut oil or palm [margarine](/wiki/Margarine). The skewered meat is seasoned, marinated, and then grilled on [charcoal](/wiki/Charcoal) [embers](/wiki/Ember). Satay may be served with a [spicy](/wiki/Spice) [peanut sauce](/wiki/Peanut_sauce) dip, or peanut gravy, served with slices of *[lontong](/wiki/Lontong)* or *[ketupat](/wiki/Ketupat)* (rice cakes), garnished with a sprinkle of *[bawang goreng](/wiki/Bawang_goreng)* (crisp fried shallot), and accompanied by *[acar](/wiki/Acar)* (pickles) consisting of slivers of onions, carrots, and [cucumbers](/wiki/Cucumber) in vinegar, salt, and sugar solution. Mutton satay is usually served with kecap manis instead of peanut sauce. Pork satay can be served in a [pineapple](/wiki/Pineapple)-based satay sauce or cucumber [relish](/wiki/Relish). ## Variations and availability ### Indonesia Among the most widespread styles is chicken-based satay (*sate ayam*), which is found throughout the country and typically paired with peanut sauce and rice cakes such as [lontong](/wiki/Lontong) or [ketupat](/wiki/Ketupat) and also well-known as *sate Madura*, often characterised by sweet soy and peanut condiments also *sate Ponorogo*, prepared from thinly sliced marinated chicken, while [Central Java](/wiki/Central_Java)’s *sate Ambal* is distinctive for its [tempeh](/wiki/Tempeh)-based sauce. Other recognisable variants include *sate Banjar* from [South Kalimantan](/wiki/South_Kalimantan), *sate Blora* from Central Java, and more recently, [Jakarta](/wiki/Jakarta) popularised *sate taichan*, a minimalist style that omits peanuts and soy in favour of [sambal](/wiki/Sambal) and lime. Equally significant are beef and mutton preparations. [West Java](/wiki/West_Java)’s *sate maranggi* is flavoured with *kecombrang* ([torch ginger](/wiki/Torch_ginger)) buds, while *sate buntel* from [Solo](/wiki/Surakarta) wraps minced meat in fat before grilling. In [Lombok](/wiki/Lombok), strongly spiced dishes such as *sate rembiga* and *sate bulayak* are widely eaten, and in [Aceh](/wiki/Aceh) *sate matang* is served with broth or [peanut sauce](/wiki/Peanut_sauce). Goat satay (*sate kambing*) remains a common sight across Java, often seasoned only lightly and served with sweet soy sauce, shallots and tomato. Coastal and island communities contributed further variety through fish and shellfish. Examples include *sate bandeng* ([milkfish](/wiki/Milkfish)) from [Banten](/wiki/Banten), *sate tanjung* ([tuna](/wiki/Tuna) or [trevally](/wiki/Trevally)) from [Lombok](/wiki/Lombok), *sate kerang* (cockles) from [Medan](/wiki/Medan) and *sate udang* (shrimp). In [Bali](/wiki/Bali) and [Lombok](/wiki/Lombok), minced mixtures of meat or fish with grated coconut and spices are wrapped around lemongrass stalks to make *sate lilit* or *sate pusut*. Beyond seafood, regional adaptations also extend to other proteins: in [Kudus](/wiki/Kudus_Regency), water buffalo is used in *sate kerbau*, while pork satay (*sate babi*) is common in [Bali](/wiki/Bali), [North Sulawesi](/wiki/North_Sulawesi) and among [Chinese Indonesian communities](/wiki/Chinese_Indonesians). Rabbit, venison, and even horse meat are prepared in certain parts of [Java](/wiki/Java) and [Kalimantan](/wiki/Kalimantan). Less conventional forms highlight the versatility of satay. In [West Sumatra](/wiki/West_Sumatra), *sate Padang* combines meat or offal with a thick [turmeric](/wiki/Turmeric)-based sauce, while [South Sulawesi](/wiki/South_Sulawesi)’s *sate Makassar* is flavoured with a sour tamarind marinade. Across Java, skewers may feature tripe (*sate babat*), liver (*sate hati*), intestines (*sate usus*) or [udder](/wiki/Udder) (*sate susu*). More unusual versions include [turtle](/wiki/Turtle) (*sate bulus*), snake (*sate ular)* and sago caterpillars (*sate ulat sagu*) in [Papua](/wiki/West_Papua_(province)) and [Kalimantan](/wiki/Kalimantan). Vegetarian adaptations, such as *sate kere* ([tempeh](/wiki/Tempeh) satay) from Solo and *sate jamur* (mushroom satay), further demonstrate the adaptability of the dish within Indonesian food culture. #### Availability in Indonesia Indonesia has developed one of the widest ranges of satay varieties, influenced by local ingredients, cultural practices and regional tastes. While chicken, beef and goat are the most common, numerous versions using seafood, [offal](/wiki/Offal) and vegetarian ingredients are also found. Satay is prepared domestically, served in restaurants and sold by vendors in settings ranging from roadside [warung](/wiki/Warung) and temporary stalls to travelling hawkers and [online delivery services](/wiki/Online_food_ordering). Traditional selling methods include the *pikulan* ([shoulder pole](/wiki/Carrying_pole)), *sunggi* ([tray](/wiki/Tray) balanced on the head) and *gerobak* (wheeled cart) associated with [Madurese vendors](/wiki/Madura). - ***Pikulan***: In Indonesian, *pikulan* means carrying items by balancing a rod on one's shoulder. The most traditional way of selling satay was depicted in early photographs of Java in the late 19th century, showing the travelling satay vendor using this *pikulan* which resembles two small wooden cabinets carried with a rod made of either bamboo, wood, or rattan. - ***Sunggi***: In Javanese, *sunggi* means carrying things upon one's head using some kind of tray or platter. This practice is quite common in today's Bali and rural Java. The *sunggi* satay vendors—usually women—carry raw satays, lontongs, peanut sauce upon the wooden or wicker bamboo tray on their head, while carrying basket containing grill, charcoal, bamboo fan, sweet soy sauce bottle, and wooden small short chair called *dingklik*. The satay seller ladies may walk through residential areas or position their wares in busy areas (e.g. marketplace or [tourism area](/wiki/Tourist_attraction)), and grill the satay to their customer's order. - ***Gerobak***: In Indonesian, *gerobak* means wheeled cart. It is one of the common method of selling satay by travelling vendors. The Madura satay vendor cart usually has unique boat-like shape *gerobak* [food cart](/wiki/Food_cart). - ***Warung***: In Indonesian, *[warung](/wiki/Warung)* means modest shop, selling foods or other things. The most common satay *warung* usually are *warung tenda*, modest tarp-tent shop stationed in busy street side to await customers. - **Online satay**: In recent years with the advent of digital multi-service method that includes food delivery such as [GoFood](/wiki/Gojek) and [GrabFood](/wiki/Grab_(company)), satay is available by ordering online, and the food immediately delivered by [motorcycle taxi](/wiki/Motorcycle_taxi) called *ojek*. In addition to street vending, dedicated establishment chains such as Sate Khas Senayan, Sate Memeng, and Sate Kambing Pak Manto specialise in satay. ### Malaysia Known locally as sate in [Malay](/wiki/Malay_language) (pronounced similarly to the English \"satay\"), the dish is widely available throughout Malaysia, both in restaurants and from [hawkers](/wiki/Hawker_(trade)) in [food courts](/wiki/Food_court) and [pasar malam](/wiki/Pasar_malam) ([night markets](/wiki/Night_market)). Beef and chicken are the most common types, often served with [peanut sauce](/wiki/Peanut_sauce), compressed rice cakes ([ketupat](/wiki/Ketupat)), cucumber and onions. While sate is strongly associated with [Malay Muslim](/wiki/Malayness) food traditions, pork satay is also prepared in non-[halal](/wiki/Halal) Chinese establishments. [Kajang](/wiki/Kajang), a town in Selangor, has become particularly well known for its satay. The term *sate Kajang* refers to a style distinguished by larger chunks of meat and the accompaniment of peanut sauce with a side of fried chilli paste. Its popularity has led to the spread of Kajang-style satay across Malaysia. Stalls and restaurants in Kajang and beyond also offer a wide range of alternatives, including venison, rabbit, fish, gizzard, liver and other varieties. Other notable Malaysian adaptations include sate *[lok-lok](/wiki/Lok-lok)* from [Penang](/wiki/Penang) and *[sate celup](/wiki/Satay_celup)* from [Malacca](/wiki/Malacca), both of which represent [Malaysian Chinese fusions](/wiki/Malaysian_Chinese_cuisine) of satay with [hotpot](/wiki/Hot_pot) traditions. In these dishes, raw meats, seafood, vegetables, tofu, and offal are skewered on sticks and cooked by dipping them in boiling water, stock, or satay sauce. *Sate lok-lok* refers to skewers dipped in stock and eaten with sauce on the side, while *sate celup* describes skewers cooked directly in peanut sauce. These versions are usually sold by street vendors or in casual eateries, and are commonly non-halal. Distinctive regional traditions also exist. On the east coast of [Peninsular Malaysia](/wiki/Peninsular_Malaysia), especially in [Kelantan](/wiki/Kelantan), [Terengganu](/wiki/Terengganu) and coastal [Pahang](/wiki/Pahang), *lokching* (also known as *sate ikan* or fish satay) forms part of the local identity. In [Sabah](/wiki/Sabah), [Cocos Malay](/wiki/Cocos_Malays) migrants contributed their own style of *sate Cocos*, which has been incorporated into the state’s culinary repertoire. ### Singapore In Singapore, satay is prepared and sold by [Malay](/wiki/Malay_Singaporeans), [Chinese](/wiki/Chinese_Singaporeans) and Indian Muslim vendors. It is generally thought to have originated in [Java](/wiki/Java) and was introduced to the island by Muslim traders. By the 1940s, satay had become one of the most popular street foods in Singapore, often consumed at festive occasions. Traditionally sold from roadside stalls and pushcarts, concerns over hygiene and urban redevelopment in the 1950s led to the centralisation of vendors at [Beach Road](/wiki/Beach_Road,_Singapore), in a cluster later known as the \"Satay Club\". The stalls were relocated in the 1960s to Esplanade Park, where they became a fixture in tourist guides until their eventual removal in the late 1990s to make way for the Esplanade, Theatres on the Bay. The concept of satay dining established by the Satay Club, open air, communal and available primarily at night, remains influential in [Singapore’s food culture](/wiki/Culture_of_Singapore). While the name was transferred to [Clarke Quay](/wiki/Clarke_Quay) after the closure of the Esplanade site, other satay centres emerged, such as the stalls at [Lau Pa Sat](/wiki/Lau_Pa_Sat) and the establishment of \"Satay Street\" on [Boon Tat Street](/wiki/Boon_Tat_Street) in 1996, where hawkers serve satay after 7 pm when the road is closed to traffic. These venues are often seen as evoking the atmosphere of mid twentieth century street dining. Contemporary adaptations include Satay by the Bay, located at [Gardens by the Bay](/wiki/Gardens_by_the_Bay), which explicitly models itself on the old Satay Club. Singaporean satay is usually served with peanut sauce, but regional and cultural differences are reflected in its variations. [Malay satay](/wiki/Malay_cuisine) resembles [Javanese](/wiki/Javanese_cuisine) versions and is often marinated with [kecap manis](/wiki/Sweet_soy_sauce), while [Chinese Hainanese](/wiki/Hainan_people) satay is distinct for its use of [pineapple](/wiki/Pineapple) purée sauce and [five spice](/wiki/Five-spice_powder) seasoning. Common varieties include chicken (satay ayam), beef (satay lembu), mutton (satay kambing), as well as beef intestine (satay perut) and beef tripe (satay babat). Beyond street and hawker settings, satay has also been incorporated into national branding, with [Singapore Airlines](/wiki/Singapore_Airlines) serving satay as an appetiser in its [First](/wiki/First_class_travel) and [Business Class](/wiki/Business_class) cabins. ### Thailand Satay (Thai: สะเต๊ะ, RTGS: sate, pronounced [sā.téʔ]) is a [popular dish](/wiki/Thai_cuisine) in Thailand, where pork satay is particularly common alongside chicken and beef varieties. Thai versions are usually served with peanut sauce and achat (pickled cucumber relish), and other adaptations include hoi malaeng phu, made with [mussels](/wiki/Mussel), as well as vegetarian forms using [soy protein](/wiki/Soy_protein) or [tofu](/wiki/Tofu). Satay is widely available in Thai restaurants internationally. Due to the global prominence of Thai cuisine, it is frequently associated with Thailand abroad, and there is a common misconception that the dish originated there.In the [United States](/wiki/United_States), for instance, satay is often described as one of the most popular Thai dishes. The first satay restaurant in Thailand was established in front of the Chaloem Buri Theater near [Yaowarat](/wiki/Yaowarat_Road)’s [Chaloem Buri](/wiki/Chaloem_Buri) Intersection, before later relocating to [Rama IV Road](/wiki/Rama_IV_Road) near [Lumphini MRT](/wiki/Lumphini_MRT_station) station, where it has operated for more than 50 years. In [southern Thailand](/wiki/Southern_Thailand), particularly in [Pattani](/wiki/Pattani_province), [Yala](/wiki/Yala_province) and [Narathiwat](/wiki/Narathiwat_province), satay has developed under influence from the Malay Peninsula. In these [Muslim-majority areas](/wiki/Islam_in_Thailand), regional varieties are generally [halal](/wiki/Halal), with beef and chicken being the most commonly used meats, reflecting Malay culinary traditions. ### Philippines Satay proper is known as *satti* in the Southern Philippines ([Mindanao](/wiki/Mindanao)). It is common in the regions of [Zamboanga](/wiki/Zamboanga_(province)), [Sulu Archipelago](/wiki/Sulu_Archipelago) and [Tawi-Tawi](/wiki/Tawi-Tawi), which acquired satay from its proximity to [Malaysia](/wiki/Malaysia). *Satti* usually only has three small strips of roasted meat on a stick. *Satti* is usually made from chicken or beef among [Muslim Filipinos](/wiki/Muslim_Filipino), but it can also be made with pork or liver. It is particularly popular in [Tausug](/wiki/Tausug_people) cuisine and is commonly eaten as breakfast in restaurants which specialise in *satti*. It is typically served with *[ta'mu](/wiki/Pus%C3%B4)* (*pusô* in other Philippine languages) and a bowlful of warm peanut-based sauce. In the majority of the Philippines, a similar (but native) dish to satay usually made with pork or chicken is referred to as [inihaw](/wiki/Inihaw) or [inasal](/wiki/Inasal), or by the generic English name \"barbecue\" (usually shortened to \"BBQ\"). It is usually served glazed in a sweet-soy sauce marinade reminiscent of [yakitori](/wiki/Yakitori). Despite the native origins of inasal and inihaw, the English association of \"barbecue\" is the source of names for other popular street foods that are also served skewered, such as [banana cue](/wiki/Banana_cue) (\"banana\" + \"barbecue\") and [camote cue](/wiki/Camote_cue) (\"*[camote](/wiki/Camote)* (sweet potato) + barbecue\"). Offal-based versions of inihaw are also commonly sold in the Philippines as street food. The most popular are made from chicken or pork intestines known as *[isaw](/wiki/Isaw)*. Other variants use liver, [tripe](/wiki/Tripe), lungs, chicken heads and feet, [cubes of coagulated pork blood](/wiki/Pig_blood_curd), and pork ears, among others. [Annatto seeds](/wiki/Annatto_seeds) and [banana ketchup](/wiki/Banana_ketchup)-based sauces are also widely used which gives the meat a vibrant orange or red color. ### Netherlands Known as *saté* or *sateh*, it is fully adapted in [Dutch everyday cuisine](/wiki/Dutch_cuisine). Owing to their shared colonial history, satay is an Indonesian food that has become an integral part of Dutch cuisine. Pork and chicken satays are almost solely served with spicy peanut sauce and called *een sateetje*, and are readily available in snackbars and supermarkets. Versions with goat-meat (*sateh kambing*) and sweet soy sauce are available in Indonesian restaurants and take-aways. Pork or chicken satay in peanut sauce, with salad and French-fries, is popular in pubs or *eetcafés*. With Indonesian take-away meals like *nasi goreng speciaal*, the special part is often a couple of sate-sticks. Another favourite in Dutch snackbars is the *satékroket*, a [croquette](/wiki/Croquette) made with a peanut sauce and shredded meat [ragout](/wiki/Ragout). In addition, 'saté' sauce or peanut sauce has become one of the standard options as a condiment to accompany a portion of fries bought in a snackbar (besides [mayonnaise](/wiki/Mayonnaise), [ketchup](/wiki/Ketchup), [curry-ketchup](/wiki/Curry_ketchup), '[joppiesaus](/wiki/Joppiesaus)' or a combination). Fries with satay sauce is commonly known as *patatje pinda* ('fries peanut') and fries with satay sauce, mayonaise and chopped unions is called *patatje oorlog* ('fries war'). ### South Africa In South Africa, a well-known variation of *satay* is [sosatie](/wiki/Sosatie), a [Cape Malay dish](/wiki/Cape_Malays) consisting of marinated meat, traditionally lamb or mutton, skewered and grilled over a braai (barbecue). The name combines *sate* (skewered meat) with *saus* ([sauce](/wiki/Sauce)), reflecting its [Malay](/wiki/Malays_(ethnic_group)) [Indonesian](/wiki/Native_Indonesians) influence brought through Cape Malay cuisine. Unlike Southeast Asian satay, sosaties are typically marinated overnight in a mixture that may include onions, chillies, garlic, curry leaves and tamarind juice, and are often interspersed with ingredients such as dried apricots, peppers or onions, giving the dish a distinctive sweet savoury profile. ### Suriname Satay is also popular in Suriname, where it was introduced by [Javanese migrants](/wiki/Javanese_Surinamese) during the colonial period. Brought by contract workers from the [Dutch East Indies](/wiki/Dutch_East_Indies) in the late 19th and early 20th centuries, the dish became a part of [Surinamese cuisine](/wiki/Culture_of_Suriname) and is commonly known as sate. It is widely sold by street vendors and in restaurants, often served with peanut sauce, slices of white bread, lontong (rice cakes), or fried rice. Variants include chicken, beef, and goat satay, reflecting both [Javanese culinary traditions](/wiki/Javanese_cuisine) and local adaptations. Through the [Surinamese diaspora](/wiki/Surinamese_people), particularly in the Netherlands, satay has also become a familiar component of [Dutch-Indonesian](/wiki/Indo_people) cuisine. ### Sri Lanka In Sri Lanka, satay was introduced by [Malay communities](/wiki/Sri_Lankan_Malays) who migrated to the island during the [Dutch](/wiki/Dutch_Ceylon) and [British colonial periods](/wiki/British_Ceylon). Known locally as sate or satay, it is usually made with chicken or beef, marinated in spices such as turmeric, coriander, and garlic, and grilled over charcoal or open flames. It is commonly served with peanut sauce, sambal, or other condiments. Satay is an important part of Sri Lankan Malay culture, served at religious festivals, weddings, and other communal gatherings. Over time, it has also become popular in urban areas like [Colombo](/wiki/Colombo), appearing in street food stalls and restaurants and enjoyed by a wider audience beyond the Malay community. ### Fusion satay Traditionally, satay referred to any grilled skewered meats with various sauces; it is not necessarily served solely with peanut sauce. However, since the most popular variant of satay is chicken satay in peanut sauce (*Sate Madura* in Indonesia), in modern [fusion cuisine](/wiki/Fusion_cuisine) the term \"satay\" has shifted to satay style peanut sauce instead. For example, the fusion \"satay burger\" refers to [beef hamburger](/wiki/Hamburger) served with so-called \"satay sauce\", which is mainly a kind of sweet and spicy peanut sauce or often replaced with gloppy [peanut butter](/wiki/Peanut_butter). The Singapore [satay bee hoon](/wiki/Satay_bee_hoon) is actually rice vermicelli served in peanut sauce. The American-Thai fusion fish fillet in satay sauce also demonstrates the same trend. The fusion [French cuisine](/wiki/French_cuisine) *Cuisses de Grenouilles Poelees au Satay, Chou-fleur Croquant* is actually [frog legs](/wiki/Frog_legs) in peanut sauce. The [Indomie](/wiki/Indomie) [instant noodle](/wiki/Instant_noodle) is also available in satay flavour, which is only the addition of peanut sauce in its packet. In Hong Kong, satay sauce is usually served with [instant noodles](/wiki/Instant_noodles) and stir-fried beef. This dish is most often eaten for breakfast. ## In culture ### Indonesia Satay belongs to the informal ethnocultural symbols of Indonesia. Its appears on Indonesian postage stamps, in tourist brochures, information and advertising materials dedicated to this country, and is often played up by Indonesian participants in various cultural and entertainment events held abroad to create a national flavor. For example, the Indonesian model Aurra Kharisma performed in 2021 at the [Miss Grand International](/wiki/Miss_Grand_International) beauty pageant in a suit with satay images and a headdress decorated with several bundles of satay meat skewers. In some parts of Indonesia, certain types of satay are attributed with different symbolic meanings. Especially [Bali](/wiki/Bali) stands out: the popular on this island *[sate lilit](/wiki/Sate_lilit)*—minced sausages stuck on [lemongrass](/wiki/Lemongrass) stalks—is considered there a symbol of several virtues and benefits at once: male prowess, unity and prosperity. The Balinese attribute the embodiment of the weapons of various [Hindu deities](/wiki/Hindu_deities) and mythological heroes to other local types of satay. In [Bandung](/wiki/Bandung), the [West Java](/wiki/West_Java) Governor's office is popularly called [Gedung Sate](/wiki/Gedung_Sate) ([Indonesian](/wiki/Indonesian_language): *Satay building*) to refer the satay-like pinnacle on its roof. - Food portal - Indonesia portal - Malaysia portal - Singapore portal - Thailand portal - Philippines portal - [Brochette](/wiki/Skewer) – Thin metal or wood stick used to hold pieces of food together - [Satay building](/wiki/Gedung_Sate) – Public building in West Java, Indonesia - [List of chicken dishes](/wiki/List_of_chicken_dishes) - [Pinchitos](/wiki/Pinchitos) – Southern Spain skewered meat dish - [Shacha sauce](/wiki/Shacha_sauce), also known as Sate-sauce – Chinese condiment - [Yakitori](/wiki/Yakitori) – Japanese type of grilled chicken - Food portal ## Footnotes - Satay - Recording of an Indonesian sate seller in Jakarta - Indonesian chicken satay recipe - Indonesian pork satay recipe - Balinese chicken satay recipe - Malaysian chicken satay recipe - Singapore chicken satay recipe - Travel Gastronomy: Satti Ala Zambo - Thai chicken satay recipe\n",
  "language": "en",
  "processed_at": "2026-01-12T11:50:50.488751",
  "title": "Satay",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Satay"
}