{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:50:52.645052"
  },
  "content": "This article **may need to be rewritten** to comply with Wikipedia's quality standards. Relevant discussion may be found on the talk page. You can help. The talk page may contain suggestions. *(July 2025)*Three open-air hawker centres in Singapore since closed The **Satay Club** was the name of three open-air [hawker centres](/wiki/Hawker_centre) in Singapore, all of which are no longer operating as of 2005. The first Satay Club (c. 1940–1970) was located at Hoi How Road, near Beach Road; the second and third were located at the Esplanade (1970–1995) and Clarke Quay (1995–2005) respectively. Food sold at the Satay Club was predominantly [satay](/wiki/Satay). According to one source, Satay Club sold the \"best satay in the region [of [Southeast Asia](/wiki/Southeast_Asia)]\". ## History ### 1940–1970: Hoi How Road The first incarnation of the Satay Club was located alongside Hoi How Street, near Beach Road. It was flanked by two theatres, one of them being the Alhambra Cinema. ### 1970–1995: The Esplanade During its time at the Esplanade, it was described as a \"romantic spot for many courting couples\", as well as an \"iconic waterfront hawker haven\". Located opposite was the [Raffles Hotel](/wiki/Raffles_Hotel), and nearby were the [Singapore River](/wiki/Singapore_River) and [Queen Elizabeth Walk](/wiki/Queen_Elizabeth_Walk). Selling mostly [chicken](/wiki/Chicken) and [beef](/wiki/Beef) satay, the first stall there was Fatman Satay, reviewed as the top stall in general. ### 1995–2005: Clarke Quay The Clarke Quay Satay Club operated from 1995 to towards the end of 2005. Situated alongside the River Valley Road in Clarke Quay, it opened its stalls from 7 p.m. onwards, selling mostly [chicken](/wiki/Chicken) and [mutton](/wiki/Mutton) satay. ### 2013–present: Satay by the Bay Stylised after the Satay Club, Satay by the Bay was opened on January 15, 2013, at the [Gardens by the Bay](/wiki/Gardens_by_the_Bay) tourist attraction. It was described as \"reminiscent of the old Satay Club\". ## In Singaporean culture The Satay Club was so famous that one source goes on to claim that \"[e]very taxi driver [in Singapore] knows it\". It was featured on complimentary tourist brochures issued by the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board). It was common practice at the Satay Club in around 1986 to re-sell leftover sticks of satay. This was deemed to be \"unhygienic\" by Andrew Chua of the *[Straits Times](/wiki/Straits_Times)*. The name \"Satay Club\" is also informally applied to the streetside satay stalls south of [Lau Pa Sat](/wiki/Lau_Pa_Sat) market. - [Cuisine of Singapore](/wiki/Cuisine_of_Singapore) ## Bibliography - Kaan, Jaim (2012). *The Singapore Necklace: A Secret Love Across Two Cultures*. AuthorHouse. [ISBN](/wiki/ISBN_(identifier)) 9781468587760. - Augustin, Andreas (1988). *The Singapore treasury: secrets of the garden city*. Andreas Augustin. [ISBN](/wiki/ISBN_(identifier)) 9789810004927. - Singapore Infopedia page on Satay Club\n",
  "language": "en",
  "processed_at": "2026-01-12T11:50:52.644731",
  "title": "Satay Club",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Satay_Club"
}