{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:49:25.424278"
  },
  "content": "Singaporean airport service companyThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"SATS Ltd\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2025)* *(Learn how and when to remove this message)* **SATS Ltd.** (**SATS**), an [acronym](/wiki/Acronym) previously derived from **Singapore Airport Terminal Services**, is a [Singaporean](/wiki/Singapore) airport service company that handles the main [ground handling](/wiki/Aircraft_ground_handling) and in-flight catering service provider at its country's [Changi Airport](/wiki/Changi_Airport). SATS controls about 80% of Changi Airport's ground handling and catering business. SATS was first established in 1972 as a subsidiary of the national flag carrier [Singapore Airlines](/wiki/Singapore_Airlines). It was divested from the airline in September 2009 and was subsequently renamed to SATS in April 2010. While the company name is no longer an [acronym](/wiki/Acronym), the letters recall the company's heritage with its previous name. SATS provides gateway services that span air cargo handling, baggage and ramp handling, passenger services, aviation security, to cruise handling and cruise terminal management. SATS food services comprises airline catering, food distribution and logistics, institutional catering and linen and laundry services. SATS subsidiaries includes SATS Airport Services, SATS Catering, [SATS Security Services](/wiki/SATS_Security_Services), Aero Laundry & Linen Services, Aerolog Express, Country Foods Pte Ltd. and Singapore Food Industries. Listed on the [Singapore Exchange](/wiki/Singapore_Exchange) since May 2000, Singapore state-owned investment arm [Temasek Holdings](/wiki/Temasek_Holdings) is SATS' largest shareholder, holding a stake of 40%. As of 2023, SATS and its subsidiary [Worldwide Flight Services](/wiki/Worldwide_Flight_Services) (WFS) operates over 215 stations in 27 countries with operations in the Asia-Pacific, the Americas, Europe, the Middle East and Africa, including at its home base of [Changi Airport](/wiki/Changi_Airport). These cover trade routes responsible for more than 50% of global air cargo volume. ## History ### Origin The history of SATS can be traced back to the very beginning of commercial aviation in Singapore. In the early years, ground-handling services were provided by a department of Malayan Airways, which became [Malaysia-Singapore Airlines](/wiki/Malaysia-Singapore_Airlines) (MSA) in 1967. Five years later, MSA ceased operations and paved the way for two new entities — [Singapore Airlines](/wiki/Singapore_Airlines) (SIA) and [Malaysian Airline System](/wiki/Malaysian_Airline_System) (MAS). As SIA concentrated on its core business of running an airline, the establishment of SATS as a separate, yet wholly owned subsidiary company evolved naturally. On 15 December 1972, SATS was formally corporatised with 1,673 staff. By the end of the first year, staff numbers rose to 2,000 while gross revenue increased by 25 per cent. ### Early history In 1977, SATS opened an airfreight terminal at [Paya Lebar Airport](/wiki/Paya_Lebar_Airport) capable of handling 160,000 tonnes of cargo a year. In 1980, SATS made the move to Singapore's new Changi Airport after investing S$147 million in a new headquarters building, a new inflight catering centre, which at that time was the largest single-building inflight kitchen in the world, and two new airfreight terminals. By the mid-1980s, SATS was able to handle about 20,000 passengers a day at Changi Airport, a 60 per cent increase over the 12,700 passengers handled daily at Paya Lebar Airport in 1980. Cargo also registered double-digit growth rates. In 1985, SATS was restructured into four companies so that it could better manage demand for its services. Singapore Airport Terminal Services became the parent company and subsidiaries were formed out of the four operating divisions: Apron Services, Cargo Services, Passenger Services and Catering. In 1989, SATS added two new airfreight terminals and invested in new passenger handling equipment for Changi Airport's Terminal 2. This increased its passenger handling capacity to more than 20 million passengers a year. ### 1992–2009 In 1992, three companies within SATS — Apron, Cargo and Passenger Services — were merged to form a new company, SATS Airport Services (SAS). This consolidation was designed to improve co-ordination and communication, and strengthen the SATS Group's competitiveness. Over the next four years, an express courier centre, capable of handling 40,000 tonnes of cargo a year, was opened along with the S$215 million Airfreight Terminal 5, the S$172 million Inflight Catering Centre 2 and a S$40 million SATS Maintenance Centre. At the end of the 1999–2000 financial year, SATS owned and operated five airfreight terminals with a combined handling capacity of 1.3 million tonnes of cargo a year and two catering centres capable of producing 27 million meals a year. A second Express Courier Centre for partner [DHL Worldwide Express](/wiki/DHL_Worldwide_Express), costing S$30 million, was completed in December 2001. In the first quarter of 2001, a sixth airfreight terminal costing S$270 million with a handling capacity of 800,000 tonnes of cargo per annum commenced operations. 2003 saw the launch of SATS' web-based system, CargoNet, to further complement its cargo tracking service. It also upgraded the materials handling system in Airfreight Terminals 1 to 4 to improve cargo handling efficiency and equipment serviceability. In July 2005, SATS launched a range of new products and service upgrades.[*clarification needed*] On 2 January 2008, SATS sold the Express Courier Centre Two (ECC2) to DHL Express. #### 1st re-branding exercise SATS underwent a re-branding exercise in Apr 2007, adopting a completely new brand identity after bearing the SIA 'bird' logo for many decades. ### 2010–present In December 2010, SATS Ltd completed the acquisition of Japan Airlines International's entire stake of 50.7 per cent in TFK Corporation. The 7.8 billion yen (S$122 million) purchase, was fully satisfied in cash and funded through debt through its wholly owned subsidiary SATS Investments Pte Ltd (SIPL). Following the completion, SIPL now owns 504,195 shares in TFK and has voting rights of 53.8 per cent. On 25 October 2011, SATS announced that it will be selling Daniels Group to Hain Celestial Group. On 23 December 2011, the SATS-Creuers consortium (a joint venture between SATS Ltd. (SATS) and Creuers del Port de Barcelona S.A. (Creuers)) won the bid to manage the new [Marina Bay Cruise Centre Singapore](/wiki/Marina_Bay_Cruise_Centre_Singapore). SATS-Creuers beat out competition from the Singapore Cruise Centre (SCC), the incumbent cruise port operator in Singapore, which operates the existing facilities at HarbourFront and Jurong Port. #### 2nd re-branding exercise SATS used to be part of the [Singapore Airlines Group](/wiki/Singapore_Airlines) and was [divested](/wiki/Divestment) from SIA on 1 September 2009. On 8 January 2010, it unveiled a new uniform for its front-line staff at the Singapore Changi Airport. The uniform change is SATS' eleventh since 1973. The company also changed its name from \"Singapore Airport Terminal Services Limited to \"SATS Ltd\". on 30 July 2010. On 7 June 2011, SATS unveiled a new brand identity. The group was initially engaged in ground handling and airline catering in Singapore. It has since transformed itself into Asia's largest gateway services and aviation food services network and has operations at 60 locations in 14 countries.[*citation needed*] ### Acquisition of Worldwide Flight Services On 28 September 2022, SATS announced its acquisition of the world's largest air cargo handler Worldwide Flight Services (WFS) for $1.64 billion. **SATS and WFS launch visual identity in 2024** On 5 November 2024, SATS and its wholly owned subsidiary Worldwide Flight Services (WFS), known collectively as the SATS Group, unveiled a new unified global visual identity. ## Gateway Services SATS Gateway Services encompass Passenger Services, Ramp and Baggage Handling, Cargo Handling, Aviation Security, Aircraft Interior Cleaning and Cargo Delivery and Management. SATS runs ground handling and airline catering operations at nearly 44 airports across Asia Pacific and the Middle East. Besides its operations in Singapore, SATS has also established a network in Asia through joint ventures in Mainland China, Hong Kong, Macau, India, the Philippines, Indonesia, Taiwan, Vietnam and the Maldives. ### SATS Security Services SATS Security Services provides security services for aviation-related activities at the Singapore Changi Airport. ### SATS HK SATS acquired 100% of Menzies Aviation (Hong Kong) Ltd (MAHK) for approximately HK$18 million (approximately S$3.3 million) on 11 November 2008. Following the acquisition, it was renamed as SATS HK Limited on 7 April 2009. SATS HK is one of the four ground handling agents at the Hong Kong International Airport (HKIA). It is also one of the four licensed ramp handlers at HKIA. SATS HK provides passenger and ramp handling services including baggage handling, load control and flight operations to 11 airlines. Amongst its key customers are [American Airlines](/wiki/American_Airlines), [Asiana Airlines](/wiki/Asiana_Airlines), [Etihad Airways](/wiki/Etihad_Airways), and [Hong Kong Airlines](/wiki/Hong_Kong_Airlines). ### Asia-Pacific Star In March 2009, SATS launched a low-cost ground handling services under a new wholly owned subsidiary, Asia-Pacific Star. Together with the low-cost inflight catering unit, SATS serves the growing low-cost segment of the airline market. ### Affinity Membership The \"Affinity\" Membership, by Singapore Airport Terminal Services Ltd (SATS), offers passenger preferential check-in services at their specially designated \"Affinity\" check-in counters and the use of SATS Premier Club lounges available in all terminals of Singapore Changi Airport as well as the lifestyle \"Rainforest\" lounge in Terminal 1, regardless of the class of travel. Since 2015, the Rainforest lounge has been taken over by Plaza Premier Group's Plaza Premier Lounge.[*citation needed*] ### Coolport @ Changi On 18 August 2009, SATS announced its plans to launch Coolport @ Changi, Singapore's first on-airport perishables handling centre, in mid-2010. Costing approximately S$16 million to build, Coolport @ Changi will be the first dedicated on-airport facility in Singapore for handling terminal and transit perishables cargo within the Free Trade Zone. Located within SATS Airfreight Terminal 2, Coolport @ Changi will have an annual operating capacity of around 250,000 tonnes, with scope for expansion from the current 8,000 square metres to 14,000 square metres. Services include Warehousing and Distribution, Live Tanking, Inventory Management & Control, and Ripening facilities. ## Food SATS' \"Food solutions\" comprises in-flight catering, food logistics, industrial catering as well as chilled and frozen food manufacturing, and airline linen and laundry. ## Recognition SATS has been described as the third most-admired company in Singapore, in a poll conducted by [The Wall Street Journal](/wiki/The_Wall_Street_Journal) Asia in September 2008. SATS was also ranked second for the quality of its services and for corporate reputation, and placed fourth for innovation. Portals: - Aviation - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:49:25.423647",
  "title": "SATS Ltd",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/SATS_Ltd"
}