{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:49:27.703782"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"SATS Security Services\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2019)* *(Learn how and when to remove this message)* **SATS Security Services Pte Ltd** (SSS)[a] is a subsidiary of [SATS Ltd](/wiki/SATS_Ltd), providing security services for aviation-related activities at [Singapore Changi Airport](/wiki/Singapore_Changi_Airport). It provides armed [auxiliary police](/wiki/Auxiliary_police) officers for mainly airline clients as an [auxiliary police force](/wiki/Auxiliary_police) under the Police Force Act 2004. SATS also provides aviation security to airlines at Changi Airport in Singapore especially those managed by it parent ground handler SATS Ltd., although they also provide security to SATS-related facilities. ## History In 1965, SATS Security Services originally started as the Malayan Airways Security Department. Its existence back then was to meet the security and aviation needs of its aircraft and to a certain extent, the [Paya Lebar Airport](/wiki/Paya_Lebar_Air_Base). The MASD was restricted within the confines of Paya Lebar Airport and they do not have the powers of regular police officers. SATS competed with the Changi International Airport Services when it was established in 1990. When Malayan Airways was renamed to Malaysian [Singapore Airlines](/wiki/Singapore_Airlines) (MSA), its Security Department was renamed MSA Police in 1967. In 1972, Singapore Airlines (SIA) came into being, after parting ways with MSA becoming [Malaysia Airlines](/wiki/Malaysia_Airlines) System. MSA police was renamed SIA Auxiliary Police. A year later, SATS became a fully owned subsidiary of SIA and SIA Auxiliary Police became SATS Security Services, incorporating the former SIA Auxiliary Police Force in it. In October 2018, SATS announced that all of its officers working at Changi Airport will be deployed with body cameras. At the same time, it was also announced that a total of SGD$1m (US$730,000) would be invested to digitize Changi's security systems to improve its services due to manpower problems. During the COVID-19 pandemic in 2020, SATS officers were deployed for security duties at dormitories and Government Quarantine Facilities (GQF) involving migrant workers in Singapore and to serve Stay at Home notification letters. In December 2021, SATS established its Outriders motorbike unit. For FY 2021-2022, SATS was granted a license to operate a training academy, being the third auxiliary police company to do so. For FY 2022-2023, SATS was granted ISO 37001 Certification as part of ethic compliance. On May 13, 2024, SATS announced that a signup bonus for up to SGD$40,000 for applicants signing up to be a Auxiliary Police Officer (Armed) and Security Officer (Flexible). ## Deployments Some current deployments of armed SATS Security personnel include: - [Singapore Changi Airport](/wiki/Singapore_Changi_Airport) - [Resorts World Sentosa](/wiki/Resorts_World_Sentosa) - [Marina Bay Cruise Centre Singapore](/wiki/Marina_Bay_Cruise_Centre_Singapore) ## Company ### Manpower SATS Security had a manpower of 450 officers in 1989; SSS had 760 officers in 1999. By the 1999–2000 fiscal year, 805 officers are employed. As of 2018, 800 officers are employed. ### Training SATS Security personnel who are eligible for further studies, are allowed to study for a diploma/specialist diploma in Aviation Management through SkillsFuture Work-Study Programmes. SAT Security worked with Institute of Technical Education (ITE) to introduce a Work-Study Diploma programme, which would allow Auxiliary Police Officer (APO) trainees to get a diploma while getting related job experience. ## Uniforms This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(December 2019)* *(Learn how and when to remove this message)* Unlike Certis CISCO and AETOS auxiliary police, the uniform design of SATS Auxiliary Police closely resemble the [Singapore Police Force (SPF)](/wiki/Singapore_Police_Force); with the exception of the baby blue top and metallic cap and collar badges. This is done to distinguish differences from uniforms worn by officers from the SPF. ## Awards SSS received the Outstanding Achievement in Collaboration in Education & Training award from the Australian Business/Higher Education RoundTable alongside [Edith Cowan University](/wiki/Edith_Cowan_University) for developing a Security and Police Studies Diploma Programme and scholarship funds for it. ## Notes ### Bibliography - *Singapore Transportation Policy and Regulations Handbook - Strategic Information and Regulations*. Washington DC: International Business Publications. 2013. [ISBN](/wiki/ISBN_(identifier)) 978-1-4330-6815-7. - Khurana, K.C. (31 December 2009). *Aviation Management: Global Perspectives*. New Delhi, India: Global India Publications. [ISBN](/wiki/ISBN_(identifier)) 978-9380228396. - SATS Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:49:27.703513",
  "title": "SATS Security Services",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/SATS_Security_Services"
}