{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:49:29.681422"
  },
  "content": "Public transport operator in Singapore **SBS Transit Ltd** ([abbreviation](/wiki/Abbreviation): **SBS** or **SBST**) is a multi-modal [public transport](/wiki/Public_transport) operator in [Singapore](/wiki/Singapore) operating bus and rail services. With a majority of its shares owned by Singaporean multinational transport conglomerate [ComfortDelGro Corporation](/wiki/ComfortDelGro_Corporation) at 75%, it was formerly known as **Singapore Bus Services** before rebranding to SBS Transit on 1 November 2001. It is the largest public bus operator in Singapore, as well as one of the two major operators of Singapore's rail services along with [SMRT Corporation](/wiki/SMRT_Corporation). It has a fleet of 3,329 buses and operates 196 routes, as of 2024. ## History ### Singapore Bus Services (1973‍–‍2001) #### 1973‍–‍1978 Singapore Bus Services Limited was established on 1 July 1973 when the regional bus companies Amalgamated Bus Company, Associated Bus Services and United Bus Company (which were in turn results of amalgamations of privately run Chinese bus companies of the 1960s in 1971) agreed to merge their operations with each taking shareholdings of 53%, 19% and 28% respectively in the new company. The government-sanctioned merger was undertaken to improve service standards of the [bus transport](/wiki/Bus_transport_in_Singapore) system. SBS inherited many problems from its Chinese predecessors, including use of 14 non-standard bus models that frequently broke down, poor standards among the staff and inadequate infrastructure. Hence, the government seconded a Government Team of Officials to SBS in 1974 to overhaul the management and culture. Under the supervision of the GTO, SBS completely overhauled their bus fleet with new buses of usually the [Albion Viking](/wiki/Albion_Viking) or [Mercedes-Benz](/wiki/Mercedes-Benz) OF1413 makes and introduced a rigorous maintenance regime, improving the reliability of their buses greatly whereas a new disciplinary code was introduced, reducing complaints by half from 1979 to 1983. In 1977, SBS introduced into service its first [double-decker buses](/wiki/Double-decker_buses), the [Leyland Atlantean AN68](/wiki/Leyland_Atlantean#AN68) on route 86 between Tampines Way and [Shenton Way](/wiki/Shenton_Way). In light of dissatisfaction over bus services in the Jurong area and requests for improved coverage, SBS started a reorganisation of bus services across the country, starting with Jurong. This consisted of a network of internal services serving a town, with external services terminating at a point in the town, along with bus interchanges to serve as such termini. Additional depots were also constructed, which SBS claimed gave them more control over bus operations. #### 1978‍–‍2001 The company was replaced by the Singapore Bus Service (1978) Limited on 17 February 1978. In May 1978, the company implemented a rule that car owners are were not allowed to purchases any shares, resulting in more than 5,000 applicants being unsuccessful. The stock was oversubscribed by about 27 times, with [S$](/wiki/Singapore_dollar)375 million received for 14 million shares at [S$](/wiki/Singapore_dollar)1.00 each. The company was listed on the [Stock Exchange of Singapore](/wiki/Singapore_Exchange) (SES) on 26 June 1978. In 1992, SBS were reorganised under a new subsidiary SBS Bus Services Pte Ltd. On 12 November 1997, the original Singapore Bus Services (1978) Limited was renamed [DelGro Corporation](/wiki/ComfortDelGro), with SBS Bus Services Pte Ltd listed separately as Singapore Bus Services Limited on 10 December that year. SBS also operated taxis as SBS Taxis. SBS Taxis merged with Singapore Commuter and Singapore Airport Bus Services on 1 July 1995 to form CityCab, which remained part of DelGro Corporation. SBS also operated Airbus in the past from 1995 to 1997 and Premium Bus Services, Sentosa Services and Jurong Island Services called \"SBS Leisure\" in 1995 to 2003. SBS had transferred Sentosa and Jurong Island Services in 2003, and Premium Bus Services (555 and 556) in December 2003 to private bus operators. 555 was a bus service from Watten Estate to Spottiswoode Park and 556 was a bus service from Sunset Way to Shenton Way, but it was totally withdrawn on 31 October 2004. ### Route handovers YearBus PackageFromToReason1983Sembawang/Yishun/Woodlands**Singapore Bus Services****Trans-Island Bus Services**1995Bukit Panjang**Singapore Bus Services****Trans-Island Bus Services**Foster greater competition in the bus industry and to cushion the impact with the rationalisation of bus services caused by the opening of Woodlands MRT extension in 1996.Sengkang/Punggol1999Choa Chu Kang**Singapore Bus Services****Trans-Island Bus Services**The tender to operate the North East Line, Sengkang and Punggol LRT, and several bus services in the Sengkang and Punggol are awarded to SBS. In addition, bus tenders for Choa Chu Kang and Bukit Batok bus services are awarded to TIBS. This move is also to cushion the impact with the rationalisation of bus services caused by Bukit Panjang LRT in 1999, as well as to reduce congestion in depots (Bus 61, 67, 106 and 172).Sengkang/Punggol**Trans-Island Bus Services****Singapore Bus Services**2000Bukit Batok**Singapore Bus Services****Trans-Island Bus Services**2016Jurong East**SBS Transit****Tower Transit Singapore**Under the Bus Contracting Model from 2016 onwards.Pasir Ris/Punggol**SBS Transit****Go-Ahead Singapore**2018Yishun (selected)**SMRT Buses****SBS Transit**2024Boon Lay/Joo Koon/Tuas**SBS Transit****SMRT Buses**2026Tampines**SBS Transit****Go-Ahead Singapore** ### SBS Transit (2001–present) On 1 November 2001, Singapore Bus Services was rebranded as SBS Transit to reflect it becoming a multi-modal transport operator with the impending opening of the [Sengkang LRT line](/wiki/Sengkang_LRT_line) and [North East MRT line](/wiki/North_East_Line). On 29 March 2003, DelGro Corporation merged with Comfort Group to form [ComfortDelGro Corporation](/wiki/ComfortDelGro_Corporation). ComfortDelGro Corporation owns 75% of the shares in SBS Transit. On 18 January 2003, SBS Transit commenced operating the Sengkang LRT, followed by the North East MRT line on 20 June the same year. SBS Transit commenced operating the [Punggol LRT](/wiki/Punggol_LRT_line) on 29 January 2005, followed by the [Downtown MRT line](/wiki/Downtown_Line) on 22 December 2013. ## Bus ### Routes SBS Transit had operated the majority of routes in almost all towns of Singapore with the notable exception of [Tuas](/wiki/Tuas), Joo Koon, [Jurong West](/wiki/Jurong_West), [Jurong East](/wiki/Jurong_East), [Tengah](/wiki/Tengah,_Singapore), [Bukit Batok](/wiki/Bukit_Batok), [Choa Chu Kang](/wiki/Choa_Chu_Kang), [Bukit Panjang](/wiki/Bukit_Panjang), [Woodlands](/wiki/Woodlands,_Singapore), [Sembawang](/wiki/Sembawang), [Yishun](/wiki/Yishun), [Punggol](/wiki/Punggol) and [Pasir Ris](/wiki/Pasir_Ris), where most routes were under [SMRT Buses](/wiki/SMRT_Buses) (Woodlands Bus Package, Choa Chu Kang-Bukit Panjang Bus Package & Jurong West Bus Package), [Tower Transit](/wiki/Tower_Transit_Singapore) (Bulim Bus Package & Sembawang-Yishun Bus Package) and [Go-Ahead](/wiki/Go-Ahead_Singapore) (Loyang Bus Package). As of 2025, there are 222 wheelchair-accessible bus services that SBS Transit operates. SBS Transit later became the first local operator to win a tender under the BCM in April 2017, and began operating the Seletar Bus Package on 18 March 2018. It was announced in 2018 by LTA that SBS Transit had won the subsequent package, the Bukit Merah Bus Package. In 2023, it was announced that SBS Transit retained the Bukit Merah Bus Package for its second term, but lost the bid for Jurong West Bus Package, which was awarded to [SMRT Buses](/wiki/SMRT_Buses). In July 2024, it was announced that SBS Transit retained the Seletar Bus Package for its second term. In September 2025, it was announced that SBS Transit lost the bid for Tampines Bus Package, which was awarded to [Go-Ahead](/wiki/Go-Ahead_Singapore). New Express Feeder bus services 454 and 456 were launched. After service 454 was transferred to Go-Ahead Singapore, service 456 became the only Express Feeder service under SBS Transit. ### Vehicle fleet As of December 2019, SBS Transit operated more than 3,500 buses. SBS Transit operates a mix of single decker, double decker and articulated buses. **Single deckers** - [BYD GTK6127BEVB (BC12A04)](/wiki/BYD_B_series) (Zhuhai Guangtong) - [BYD K9](/wiki/BYD_K_series) ([Gemilang Coachworks](/wiki/Gemilang_Coachworks)) - Linkker LM312 ([Gemilang Coachworks](/wiki/Gemilang_Coachworks)) - [MAN NL323F](/wiki/MAN_NLxx3F) Lion's City (A22) ([Gemilang Coachworks](/wiki/Gemilang_Coachworks)) - [Mercedes-Benz O530 Citaro](/wiki/Mercedes-Benz_O530_Citaro) ([Daimler Buses](/wiki/Daimler_Buses)) - [Scania K230UB](/wiki/Scania_K_series) ([Gemilang Coachworks](/wiki/Gemilang_Coachworks)) - [Volvo B5L Hybrid](/wiki/Volvo_B5LH) ([MCV Evora](/wiki/MCV_Evora)) - [Zhongtong LCK6126EVG N12](/wiki/Zhongtong_Bus) (Integral) **Double deckers** - [Alexander Dennis Enviro500 MMC](/wiki/Alexander_Dennis_Enviro500_MMC) (3-door variant) - [MAN ND323F](/wiki/MAN_NDxx3F) Lion's City (A95) ([Gemilang Coachworks](/wiki/Gemilang_Coachworks)) - [Scania K310UD](/wiki/Scania_K_series) ([Gemilang Coachworks](/wiki/Gemilang_Coachworks)) demonstrator – *used for driver training purposes* - [Volvo B9TL](/wiki/Volvo_B9TL) ([Gemilang Coachworks](/wiki/Gemilang_Coachworks)) demonstrator – *used for driver training purposes* - [Volvo B9TL](/wiki/Volvo_B9TL) ([Wright Eclipse Gemini 2](/wiki/Wright_Eclipse_Gemini)) **Articulated buses** - [MAN NG363F](/wiki/MAN_Lion%27s_City#Chassis_variants_(for_external_bodywork)) Lion's City (A24) ([Gemilang Coachworks](/wiki/Gemilang_Coachworks)) ### Former vehicle fleet - [BYD B12A03](/wiki/BYD_B_series) (integral) LTA trial specifications demonstrator - [BYD K9RC](/wiki/BYD_K_series) ([Gemilang Coachworks](/wiki/Gemilang_Coachworks)) demonstrator - [Mercedes-Benz O530 Citaro C2 Hybrid](/wiki/Mercedes-Benz_Citaro) demonstrator - [Volvo B8L](/wiki/Volvo_B8L) ([Wright Eclipse Gemini](/wiki/Wright_Eclipse_Gemini) 3) demonstrator - [Volvo B9TL](/wiki/Volvo_B9TL) ComfortDelGro Engineering (CDGE) - [Volvo B10TL Super Olympian](/wiki/Volvo_Super_Olympian) - [Volvo Olympian](/wiki/Volvo_Olympian) - [Leyland Olympian](/wiki/Leyland_Olympian) - [Mercedes-Benz O405](/wiki/Mercedes-Benz_O405) (including one demonstrator Volgren CR221-bodied O405G articulated vehicle) - [Volvo B10BLE](/wiki/Volvo_B10BLE) - [Scania N113CRB](/wiki/Scania_N113) - [Volvo B10M](/wiki/Volvo_B10M), it some two Volvo B10M Mark IV demonstrator vehicles - Sunlong SLK6121UF14 Hybrid ([Gemilang Coachworks](/wiki/Gemilang_Coachworks)) demonstrator - [Scania L94UB](/wiki/Scania_4-series_(bus)) ([Volgren](/wiki/Volgren)) demonstrator - MAN 18.240 HOCL-NL (A69) ([Gemilang Coachworks](/wiki/Gemilang_Coachworks)) demonstrator - [Dennis Dart](/wiki/Dennis_Dart) - [Dennis Trident 3](/wiki/Dennis_Trident_3) ([Duple Metsec](/wiki/Duple_Metsec) 5000) - [Volvo B7RLE](/wiki/Volvo_B7RLE) (Soon Chow Workshop) demonstrator - [Mercedes-Benz 811D](/wiki/Mercedes-Benz_811D) - [Mercedes-Benz O305](/wiki/Mercedes-Benz_O305) When SBS was first formed in 1973, it inherited a wide variety of buses of various makes from its Chinese predecessors. Examples of such buses included the [Albion Viking](/wiki/Albion_Viking), [Mercedes-Benz](/wiki/Mercedes-Benz_buses) LP1113 and OF1413 and [Nissan Diesel](/wiki/UD_Trucks) RX102K3 with small numbers of [Ford R192 and 226](/wiki/Ford_R-Series), [Seddon](/wiki/Seddon_Atkinson), [Fargo-Kew](/wiki/Fargo_Trucks), [Bedford](/wiki/Bedford_Vehicles) and [Austin](/wiki/Austin_Motor_Company). Most of these buses were bodied by local coachbuilder Soon Chow although some were bodied by other companies such as Supreme Star and Strachan. Subsequent models that were purchased by SBS included [Berliet](/wiki/Berliet) and [Guy Victory](/wiki/Leyland_Victory_Mark_2) in the 1970s and the [Volvo B57](/wiki/Volvo_B57) and Mercedes-Benz OF1417 in the 1980s, the latter which were bodied by foreign coachbuilders like [New Zealand Motor Bodies](/wiki/Coachwork_International) and [Hawke Coachwork](/wiki/Hawke_Coachwork). In 1976, SBS purchased its first 20 [Leyland Atlantean AN68](/wiki/Leyland_Atlantean#AN68) buses to evaluate the suitability of [double-decker bus](/wiki/Double-decker_bus) operation, with the buses first entering service on bus 86 on 13 June 1977. Following the success of the trial, SBS ordered another 500 Leyland Atlantean AN68 buses from 1978 to 1984, all of which were either bodied by [Metal Sections](/wiki/Duple_Metsec) or [Walter Alexander Coachbuilders](/wiki/Walter_Alexander_Coachbuilders); SBS also conducted comparative trials of double-decker buses of other makes, namely the [Leyland Olympian](/wiki/Leyland_Olympian), [Volvo Ailsa B55](/wiki/Volvo_Ailsa_B55), [Scania BR112DH](/wiki/Scania_N112#BR112DH), [Dennis Dominator](/wiki/Dennis_Dominator), [Dennis Trident 3](/wiki/Dennis_Trident_3), [Mercedes-Benz O305](/wiki/Mercedes-Benz_O305) and [Volvo B10MD Citybus](/wiki/Volvo_B10M#Citybus_(B10MD/D10M)). In 1984, SBS purchased another 200 Leyland Olympian and 200 Mercedes-Benz O305 double-decker buses. SBS also conducted an evaluation of air conditioned buses (namely the ex-Singapore Airport Bus Services Mercedes-Benz OF1413 coaches) that year and conducted similar trials with other bus models like the Nissan Diesel U31S and [Renault PR100](/wiki/Renault_PR100) (SBS30P) before its first bulk order for 50 Scania N113CRB buses in 1989. In the 1990s, some bus models on the roads included the [Volvo B10M](/wiki/Volvo_B10M), [Scania N113CRB](/wiki/Scania_N113), [Mercedes-Benz O405](/wiki/Mercedes-Benz_O405), [Leyland](/wiki/Leyland_Olympian) and [Volvo Olympian](/wiki/Volvo_Olympian) and [Dennis Dart](/wiki/Dennis_Dart). SBS also conducted trials of high capacity single decker buses, namely a superlong Volvo B10M Mark IV (SBS997A), an articulated Volvo B10MA (SBS998Y) and an articulated Mercedes-Benz O405G (SBS999U), in 1996 although the trial did not succeed. The first [low-floor bus](/wiki/Low-floor_bus), a [Volgren](/wiki/Volgren)-bodied [Volvo Super Olympian](/wiki/Volvo_Super_Olympian) demonstrator (SBS9888Y) was brought to SBS by [Volvo Buses](/wiki/Volvo_Buses) for trial purposes in 1999. After its successful trial, 51 Volvo Super Olympian chassis were further brought in by SBS Transit. 50 buses are bodied by Volgren between 2002 and 2003 while 1 remaining chassis is being reserved for a ComfortDelGro Engineering bodywork, which entered revenue service by 2005. The first wheelchair-accessible bus was also brought into service in 2006. SBS Transit [compressed natural gas](/wiki/Compressed_natural_gas) [buses](/wiki/Volvo_B10BLE) began service in 2002. Hybrid and electric buses came into foray since 2019, although small-scale trials began in 2010. Between 2020 and 2021, one unit of Mercedes-Benz Citaro C2 Hybrid, SG4004B, was brought in for trial purposes and was loaned from Daimler South East Asia under a Special Purpose License. The bus was on revenue service from 9 March 2020 to 8 March 2021 on buses 93 & 272 with SBS Transit based at the [Ulu Pandan Bus Depot](/wiki/Ulu_Pandan_Bus_Depot) (UPDEP). All Volvo B10BLE CNG (rigid) buses were retired in 2019 except for the first two units which had been preserved, after that, both Volvo B10TLs and Volvo B9TL CDGEs were retired early and scrapped. Only 20 Volvo B9TL CDGE buses remained in operation until September 2023 when they reached the end of their lifespan, with the last day of service being 22 September. In March 2024, several units of the Scania K230UB (Euro IV and V) buses were transferred to SMRT Buses from SBS Transit for some testings at Woodlands Depot before the Jurong West Bus Package begins operations in September that year. In October 2021, [Alexander Dennis Enviro500 MMC](/wiki/Alexander_Dennis_Enviro500_MMC) with 3-door and 2-staircase buses was usually enter service debut on bus 974. new bearing Enviro500 MkIV bodywork type and shares with the Enviro400 MMC exterior design, such as new feature for Hong Kong. In 2025, All these electric buses were began operating service debuts to replace with the traditional diesel EEV buses. ## Rail ### Mass Rapid Transit (MRT) SBS Transit operates two of Singapore's six [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) lines in the network, the [North East Line](/wiki/North_East_Line) (NEL) since its opening on 20 June 2003 and the [Downtown Line](/wiki/Downtown_Line) (DTL) since its opening on 22 December 2013. SBS Transit is also set to operate the [Jurong Region Line](/wiki/Jurong_Region_Line) (JRL) as a joint venture alongside French rail operator RATP Dev under the operator name Singapore One Rail when it opens in 2027. The NEL currently spans 21.6 km and 17 stations, running from [HarbourFront](/wiki/HarbourFront_MRT_station) in the south-west to [Punggol Coast](/wiki/Punggol_Coast_MRT_station) in the north-east. As of 2023, the NEL uses a fleet composed of three very similar series of 49 [Alstom Metropolis](/wiki/Alstom_Metropolis) train-sets, namely the [C751A](/wiki/Alstom_Metropolis_C751A), [C751C](/wiki/Alstom_Metropolis_C751C) and [C851E](/wiki/Alstom_Metropolis_C851E). The operating license for the NEL was awarded to SBS Transit in order to foster competition with [SMRT Trains](/wiki/SMRT_Trains) and to create multi-modal public transport companies, each specialising in their own district. In 2018, it was confirmed that SBS Transit's contract for maintaining the NEL would last until 31 March 2033. The NEL was Singapore's third metro line and the city's first [automated and driverless](/wiki/Automatic_train_operation) system. At times, it has been referred to as \"the first driverless heavy metro line in the world\" or the \"world's first fully automated and driverless high-capacity rapid transit line\" by some. While driverless metro systems have existed long before (notably the [Lille Metro](/wiki/Lille_Metro) since 1983, the [Vancouver Skytrain](/wiki/Vancouver_Skytrain) since 1985 and the [Kelana Jaya Line](/wiki/Kelana_Jaya_line) and [Paris Métro Line 14](/wiki/Paris_M%C3%A9tro_Line_14) since 1998), the NEL is the first application of a fully automated and driverless metro system with heavy rail characteristics such as an [overhead catenary](/wiki/Overhead_catenary) (in contrast to earlier systems using [third rail](/wiki/Third_rail)) and [1,435 mm standard-gauge](/wiki/Standard-gauge_railway) (in contrast to earlier systems featuring smaller rail profiles). Till today, it is the only MRT line in Singapore using the overhead catenary electrical system while the rest of Singapore's MRT uses the third rail. The DTL currently spans 41.9 km and 35 stations as of 2025, running from [Bukit Panjang](/wiki/Bukit_Panjang_MRT/LRT_station) station in the north-west to [Expo](/wiki/Expo_MRT_station) station in the east via the [Central Area](/wiki/Central_Area,_Singapore). The DTL is fully automated and driverless as well and consists of a fleet of 92 [Bombardier Movia](/wiki/Bombardier_Movia) [C951](/wiki/Bombardier_Movia_C951/C951A) trainsets. NameImageMaximum speed (km/h)Trains builtCars builtCars per setLines servedBuiltNumber in serviceIntroductionDesignService[C751A](/wiki/Alstom_Metropolis_C751A)10090251506[North East Line](/wiki/North_East_Line)2000‍–‍2003 2019‍–‍2026[nb 1]2520 June 2003[C751C](/wiki/Alstom_Metropolis_C751C)181082014‍–‍2016181 October 2015[C851E](/wiki/Alstom_Metropolis_C851E)6362020628 July 2023[C951(A)](/wiki/Bombardier_Movia_C951/C951A)9080922763[Downtown Line](/wiki/Downtown_Line)2012‍–‍20179222 December 2013[J151](/wiki/Hyundai_Rotem_J151)70TBA62186[Jurong Region Line](/wiki/Jurong_Region_Line)2022‍–‍202602027 - The trains are classified as contracts unlike other countries which use \"class\". ### Light Rail Transit (LRT) Out of three LRT lines in Singapore, two are operated and maintained by SBS Transit, namely the [Sengkang LRT line](/wiki/Sengkang_LRT_line) and [Punggol LRT line](/wiki/Punggol_LRT_line) (SPLRT). These lines serve a total of 29 stations and provide feeder connections to [Sengkang](/wiki/Sengkang_MRT/LRT_station) and [Punggol](/wiki/Punggol_MRT/LRT_station) stations. As of 2025, these lines use a fleet of 57 sets comprising two series of [Mitsubishi Heavy Industries](/wiki/Mitsubishi_Heavy_Industries) [Crystal Mover](/wiki/Crystal_Mover) [APMs](/wiki/People_mover) (namely the [C810](/wiki/Mitsubishi_Heavy_Industries_Crystal_Mover_C810A) and [C810A](/wiki/Mitsubishi_Heavy_Industries_Crystal_Mover_C810A)), a number expected to increase in the future with the introduction of [C810D](/wiki/Mitsubishi_Heavy_Industries_Crystal_Mover_C810D) APMs. In 2018, it was confirmed that SBS Transit's contract for both LRT lines would run until 31 March 2033. NameImageMaximum speed (km/h)Trains builtCars per setLines servedBuiltNumber in serviceIntroductionDecommissionedDesignService[C810](/wiki/Mitsubishi_Heavy_Industries_Crystal_Mover_C810)8070411 or 2[Sengkang LRT](/wiki/Sengkang_LRT_line) [Punggol LRT](/wiki/Punggol_LRT_line)2000 – 20033918 January 20032025 – 2028[C810A](/wiki/Mitsubishi_Heavy_Industries_Crystal_Mover_C810A)162012 – 2016165 April 2016—N/a[C810D](/wiki/Mitsubishi_Heavy_Industries_Crystal_Mover_C810D)2522024 – 2027215 July 2025—N/a - The trains are classified as contracts unlike other countries which use \"class\". ### Depots Out of ten operational rail depots in Singapore, SBS Transit maintains three, namely: - [Sengkang Depot](/wiki/Sengkang_Depot) which houses NEL and SPLRT trains. The depot is undergoing an expansion program which is targeted for completion in 2027 in order to accommodate more trains, after being in operation since 2003. - [Tai Seng Facility Building](/wiki/Tai_Seng_Facility_Building) which houses some DTL trains. - [Gali Batu Depot](/wiki/Gali_Batu_Depot) which houses the majority of DTL trains. It has undergone expansion towards the end of 2010s. - [East Coast Integrated Depot](/wiki/East_Coast_Integrated_Depot) which is expected to house DTL trains upon its opening in 2026. ## Operations The table below shows the changes in SBS Transit's operated bus and train over the years. YearBus RoutesBus FleetTrain StationsTrain Fleet20241963,3298119820232223,5727819820222183,5627819220212283,5487819220202263,5317819220192233,5127819220182223,47178192 **Bus Depot(s)** DepotArea ServedStatusAng Mo Kio Bus Depot[Central Region](/wiki/Central_Region,_Singapore)Closed on 3 January 2025 Ayer Rajah Bus Park[NUS](/wiki/National_University_of_Singapore)Closed in 2018 / Facility upkeep [Bedok North Bus Depot](/wiki/Bedok_North_Bus_Depot)[Eastern Region](/wiki/East_Region,_Singapore)Opened[Braddell HQ Bus Park](/wiki/Braddell_Bus_Park)[Central Region](/wiki/Central_Region,_Singapore)Opened[Bukit Batok Bus Depot](/wiki/Bukit_Batok_Bus_Depot)[Clementi](/wiki/Clementi,_Singapore)Opened[Bulim Bus Depot](/wiki/Bulim_Bus_Depot)[Boon Lay](/wiki/Boon_Lay)Opened[Hougang Bus Depot](/wiki/Hougang_Bus_Depot)[Central](/wiki/Central_Region,_Singapore) & [North East](/wiki/North-East_Region,_Singapore) RegionOpened[Seletar Bus Depot](/wiki/Seletar_Bus_Depot)[North Region](/wiki/North_Region,_Singapore)Opened in 2018Sengkang West Bus Depot[North East Region](/wiki/North-East_Region,_Singapore)Opened on 4 January 2025 [Soon Lee Bus Park](/wiki/Soon_Lee_Bus_Park)[Western Region](/wiki/West_Region,_Singapore)Operations transferred to [SMRT Buses](/wiki/SMRT_Buses) in 2024[Ulu Pandan Bus Depot](/wiki/Ulu_Pandan_Bus_Depot)[South](/wiki/Central_Area,_Singapore) & [West](/wiki/West_Region,_Singapore) RegionOpened in 2018 **Train Depot(s)** DepotArea ServedStatus[East Coast Integrated Depot](/wiki/East_Coast_Integrated_Depot)[Downtown Line](/wiki/Downtown_Line)U/C[Gali Batu Train Depot](/wiki/Gali_Batu_Depot)[Downtown Line](/wiki/Downtown_Line)Opened[Sengkang Train Depot](/wiki/Sengkang_Depot)[North East Line](/wiki/North_East_Line) [Sengkang](/wiki/Sengkang_LRT_line)-[Punggol LRT](/wiki/Punggol_LRT_line) Opened[Tai Seng Facility Building](/wiki/Tai_Seng_Facility_Building)[Downtown Line](/wiki/Downtown_Line)Opened[Tengah Train Depot](/wiki/Tengah_Depot)[Jurong Region Line](/wiki/Jurong_Region_Line)Testing Phase ## Notes - Ilsa Sharp, (2005), SNP:Editions, *The Journey — Singapore's Land Transport Story*. [ISBN](/wiki/ISBN_(identifier)) 981-248-101-X - York, FW; Davis, Mike; Phillips, Ron (2005). *Singapore Buses Volume 1 Singapore Bus Service Part 1: Early Single-Deck Buses and the First Double-Deckers*. DTS Publishing. [ISBN](/wiki/ISBN_(identifier)) 978-1-900515-75-7. - Davis, Mike; Phillips, Ron (2005). *Singapore Buses Volume 1 Singapore Bus Service Part 2: Double and Single-Deck Buses from the 1980s to 2005*. DTS Publishing (published 2006). [ISBN](/wiki/ISBN_(identifier)) 978-1-900515-26-9. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:49:29.681102",
  "title": "SBS Transit",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/SBS_Transit"
}