{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:50:55.834962"
  },
  "content": "Singaporean supermarket chain **Scarlett Supermarket** ([Chinese](/wiki/Chinese_language): 思家客国货超市 Sī Jiā Kè Guóhuò Chāoshì) is a Singapore-based supermarket chain primarily focused on selling Chinese products. It was founded in Singapore, with its first store opening in October 2020 on [Trengganu Street](/wiki/Trengganu_Street) in Chinatown. It later expanded to areas such as [Geylang](/wiki/Geylang) and [Bedok](/wiki/Bedok), and launched an online store on [Shopee](/wiki/Shopee) in 2021. ## Products and services Scarlett Supermarket mainly sells food and daily necessities made in China, including snacks, beverages, condiments, frozen foods, and household goods. It offers both online and offline shopping channels. ## Store locations As of May 2025[update], Scarlett Supermarket operates a total of 39 stores in Singapore, covering the [city center](/wiki/Central_Area,_Singapore) and various residential districts. The stores in [Chinatown](/wiki/Chinatown), [Geylang](/wiki/Geylang), and [Bedok](/wiki/Bedok) are open 24 hours. ## Controversies Scarlett Supermarket has been involved in a number of controversies. ### Illegal suppliers In May 2021, Scarlett Supermarket was found to be selling products sourced from illegal food operators. The [Singapore Food Agency](/wiki/Singapore_Food_Agency) ordered the products to be withdrawn from sale. ### Missing English labels In September 2021, over half of the food products at Scarlett Supermarket were found not to have English labels as required by law. The company was also found to have sold banned meat products. ### Ingredient translation error In November 2024, an instant product called **\"Liu Yi Pao Xi'an Paomo\"** sold by Scarlett Supermarket mistakenly listed the food additive [glacial acetic acid](/wiki/Acetic_acid) as the controlled drug [methamphetamine](/wiki/Methamphetamine) in its English ingredient label, causing public concern. General Manager Wang Liwen clarified that the product did not contain the drug, and the error was due to a Chinese supplier's mistranslation. The affected batch was removed from the [Lot One](/wiki/Lot_One) store and sent back to the warehouse for disposal. This [Singaporean corporation or company](/wiki/List_of_companies_of_Singapore) article is a stub. You can help Wikipedia by expanding it. - v - t - e This [supermarket](/wiki/Supermarket) article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:50:55.834499",
  "title": "Scarlett Supermarket",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Scarlett_Supermarket"
}