{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:50:59.889969"
  },
  "content": "Science museum in Singapore **Science Centre Singapore**, previously known as the **Singapore Science Centre**, is a science-themed attraction in [Jurong East](/wiki/Jurong_East), Singapore, specialising in the promotion of scientific and technological education for the general public. It houses over 850 exhibits over eight exhibition galleries and receives over a million visitors every year. In 2003, it celebrated its [silver jubilee](/wiki/Silver_jubilee). ## History This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Science Centre Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2025)* *(Learn how and when to remove this message)* The Science Centre was carved out of the [National Museum of Singapore](/wiki/National_Museum_of_Singapore) as a separate institution so that the latter could focus on its artistic and historical collections. This idea was first mooted in 1969 by the former Science Council of Singapore, now known as the [Agency for Science, Technology and Research](/wiki/Agency_for_Science,_Technology_and_Research) (A*Star), and was approved by the [government](/wiki/Government_of_Singapore). The SCS building's design was decided by an [architectural competition](/wiki/Architectural_competition) organised by the Science Centre Board, in which Raymond Woo architects' entry was selected. Built at a cost of [S$](/wiki/Singapore_dollar)12 million on a 60,000-square-metre (650,000 sq ft) site in [Jurong East](/wiki/Jurong_East), it was officially opened on 10 December 1977 by Dr. [Toh Chin Chye](/wiki/Toh_Chin_Chye), the Minister-in-charge of the centre. In 1987, the centre saw a significant expansion with the opening of Singapore's first and only [OMNIMAX](/wiki/IMAX#Dome_and_Omnimax) theatre, the [Omni-Theatre](/wiki/Omni-Theatre,_Science_Centre_Singapore). Costing $18 million, it has a 276-seat theatre underneath a 23-metre (75 ft) tilted dome. In 1999, a $38 million renovation expanded the centre's exhibition space with larger open areas, a direct connection to the separate Omni-Theatre building, as well as a new entrance. In 2000, [Snow City](/wiki/Snow_City), a recreation of a −5 °C (23 °F) environment in tropical Singapore, was set up beside the Omni-Theatre. On 7 December 2007, in its 30th anniversary year, the centre rebranded itself as the **Science Centre Singapore** (SCS). ### Relocation On 4 April 2008, the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) announced plans to relocate the Science Centre next to [Chinese Garden MRT station](/wiki/Chinese_Garden_MRT_station) within ten to 15 years. On 24 May 2019, the Science Centre board awarded a multi-disciplinary team led by Architects 61 a contract for the design of the new Science Centre. At the time, the project was expected to be completed by 2025. The Science Centre commented that the team, which includes [Zaha Hadid](/wiki/Zaha_Hadid) architects, submitted the \"best proposal which reflected the boldness of scientific endeavour and future focused Stem aspirations\". On 2 December 2022, the Science Centre and the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) jointly announced that a new Science Centre would be opened in the [Jurong Lake District](/wiki/Jurong_Lake_District) in 2027, which is set to be the 50th anniversary of the Science Centre. According to the joint press release, the new Science Centre will be designed by Zaha Hadid Architects and Architects 61, and will consist of 5 interlocking rectangular buildings, each with large glass windows overlooking [Jurong Lake](/wiki/Jurong_Lake). ## Exhibitions and events In 2023, the Science Centre held an exhibition featuring art pieces inspired by the [Korean pop group BTS](/wiki/BTS) as well as props worn by the group's members. The exhibit, named \"BTS x [James Jean](/wiki/James_Jean): Seven Phases Exhibition\", ran from 16 December 2023 until 25 February 2024 at the Science Centre. ## Observatory ### Location The Science Centre Observatory is situated at 15.27 metres (50.1 ft) above mean sea level and is one of the few observatories in the world located next to the [equator](/wiki/Equator). Its unique position allows constellations in both the northern and southern celestial hemispheres to be observed. ### Telescope The main telescope of the Observatory is a 40-centimetre (16 in) [Cassegrain reflector](/wiki/Cassegrain_reflector) of a combined [focal length](/wiki/Focal_length) of 520 centimetres (200 in). The sub-telescope is a 15-centimetre (5.9 in) [apochromatic](/wiki/Apochromatic) [Kepler refractor](/wiki/Kepler_refractor) with a focal length of 180 centimetres (71 in). The [equatorial mount](/wiki/Equatorial_mount) for the telescopes was designed for Singapore's unique location; the accompanying [English yoke](/wiki/Equatorial_mount#English_or_Yoke_mount) provides the stability needed for the drive and tracking mechanisms. The 5.5-metre (18 ft) stainless steel dome can be made to swivel in any direction and its shutter can be made to slide open for the telescope to be focused on to interesting objects in the sky. ### Stargazing sessions The Observatory has been open to the public for stargazing sessions every Friday night since June 2006. The opening hours are from 7:50 to 10:00 pm. The Observatory can comfortably accommodate 50 visitors per session. It is important to note that stargazing through the observatory telescope is only possible when the sky is clear. However, regardless of weather conditions, the staff will be present.[*citation needed*] The Observatory hosted a viewing session for the 20 April 2023 [solar eclipse](/wiki/Solar_eclipse) from 11am to 1pm. It set up telescopes which were available for use, gratis, for anyone with a Science Centre admission ticket. The eclipse was also livestreamed on the Science Centre's [YouTube](/wiki/YouTube) channel. ## Controversies The Science Centre organised a discussion titled \"What is the difference between Gender and Sex?\" to be held on 14 June 2024 at [The Projector](/wiki/The_Projector). Attendance at the event was limited to persons aged 18 years old and above. According to the synopsis, the discussion was intended to center around the psychological, social, and cultural factors shaping the understanding of gender and sex in Singapore. On 1 June 2024, several hours after initially publicising the event on [Facebook](/wiki/Facebook), the Science Centre announced that the event was cancelled and that all tickets would be refunded. According to news reports, a [Telegram](/wiki/Telegram_(software)) channel named \"Protect Singapore\", which described itself as \"a channel for those who want to safeguard the future of Singapore in the face of LGBTQ+ activism so that Singapore can continue to thrive\", had shared the event and requested that its subscribers \"write in and express your concern to MOE and The Science Centre\". - [List of tourist attractions in Singapore](/wiki/List_of_tourist_attractions_in_Singapore) - [List of science centers#Asia](/wiki/List_of_science_centers#Asia) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:50:59.889560",
  "title": "Science Centre Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Science_Centre_Singapore"
}