{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:02.071623"
  },
  "content": "Singaporean low-cost airline **Scoot Pte Ltd**, operating as **Scoot**, is a [low-cost airline](/wiki/Low-cost_airline) based in [Singapore](/wiki/Singapore) and a subsidiary of the country's flag carrier [Singapore Airlines](/wiki/Singapore_Airlines). It began its operations on 4 June 2012 on medium and long-haul routes from Singapore, predominantly to various airports throughout the [Asia-Pacific](/wiki/Asia-Pacific) region. Scoot's airline slogan is *Escape the Ordinary*. The airline is part of the [KrisFlyer](/wiki/KrisFlyer) frequent-flyer program. Previously, it was a member of the [Value Alliance](/wiki/Value_Alliance). Its head office is at [Changi Airport](/wiki/Changi_Airport), and its focus city is the [Taoyuan International Airport](/wiki/Taoyuan_International_Airport) in Taiwan. [Tigerair](/wiki/Tigerair), another low-cost Singaporean airline, was merged into Scoot in 2017, where its operations were absorbed into Scoot with the use of Tigerair's [air operator's certificate](/wiki/Air_operator%27s_certificate) (AOC). With the change of AOC following the merger, Scoot's IATA code was changed to Tigerair's TR from TZ, and its [ICAO](/wiki/ICAO_airport_code) code was changed to Tigerair's TGW from SCO. The Scoot brand and the Scooter callsign were retained. Scoot's fleet initially consisted of six [Boeing 777-200ER](/wiki/Boeing_777-200ER) aircraft previously operated by Singapore Airlines. In 2015, Scoot began to transition its long-haul fleet to the [Boeing 787 Dreamliner](/wiki/Boeing_787_Dreamliner). Scoot also uses the [Airbus A320](/wiki/Airbus_A320_family), inherited from Tigerair, along with [Airbus A320neo family](/wiki/Airbus_A320neo_family) aircraft for its short-haul flights. ## History ### 2011–2013: Inception In May 2011, [Singapore Airlines](/wiki/Singapore_Airlines) announced it would establish a low-cost subsidiary airline for medium and long-haul routes. In July 2011, Singapore Airlines announced [Campbell Wilson](/wiki/Campbell_Wilson) as the founding CEO of the new airline. In November 2011, the airline was named \"Scoot\". In June 2012, Scoot flew its first flight from Singapore to [Sydney Airport](/wiki/Sydney_Airport) in Australia. In June 2012, Scoot started flying to [Gold Coast](/wiki/Gold_Coast_Airport), its second Australian destination. In October 2012, Scoot announced that its parent company Singapore Airlines would be transferring the 20 [Boeing 787-9 Dreamliners](/wiki/Boeing_787_Dreamliner) they had ordered to Scoot to replace the existing fleet of Boeing 777-200 aircraft and help with its ongoing expansion and future growth. Scoot began to consider having a mixed fleet of different variants of the Boeing 787, instead of having an all-[Boeing 787-9](/wiki/Boeing_787-9) fleet. In October 2012, Scoot announced that passengers could purchase \"Interline\" tickets with [Tigerair](/wiki/Tigerair). In January 2013, Scoot announced it would increase its fleet by taking delivery of a fifth Boeing 777-200 by the end of May or early June, to add two or three more routes to the network. The airline also introduced ScooTV, an in-flight entertainment streaming service for passengers, and iPads for rent. In March 2013, Scoot announced that it would launch a thrice-weekly connecting flight between [Singapore](/wiki/Singapore), [Taipei](/wiki/Taipei) and [Seoul](/wiki/Seoul). The route was the first low-cost flight between [Singapore](/wiki/Singapore) and [Seoul](/wiki/Seoul). As part of the launch campaign, Scoot allowed customers to determine the launch fares through a social media campaign. The next day, Scoot announced that the 20 Boeing 787 Dreamliners they have on order would be 10 Boeing 787-8s and 10 Boeing 787-9s. In June 2013, Scoot started its Singapore-Taipei-Seoul flight. In November 2013, Scoot began its five-weekly flights from Singapore to Hong Kong, which increased to daily services in December 2013. Later that December, Scoot commenced its five-weekly flights from [Singapore](/wiki/Singapore) to [Perth](/wiki/Perth). ### 2014–2015: Expansion In September 2014, Scoot announced that it would introduce the Boeing 787-9 in [Sydney](/wiki/Sydney_Airport), [Perth](/wiki/Perth_Airport) and [Hong Kong](/wiki/Hong_Kong_International_Airport) from March 2015. [Bangkok](/wiki/Don_Mueang_International_Airport) and [Gold Coast](/wiki/Gold_Coast_Airport) followed in late April. [Tianjin Binhai International Airport](/wiki/Tianjin_Binhai_International_Airport), [Shenyang](/wiki/Shenyang_Taoxian_International_Airport) and [Qingdao](/wiki/Qingdao_Liuting_International_Airport) came in May. In December 2014, Scoot announced it would launch services from Singapore to [Melbourne](/wiki/Melbourne) in November 2015, using [Boeing 787](/wiki/Boeing_787) aircraft. In December 2014, Scoot announced its new long haul carrier in [Thailand](/wiki/Thailand), [NokScoot](/wiki/NokScoot), a joint venture between Scoot and [Nok Air](/wiki/Nok_Air). NokScoot began commercial flights from Bangkok's [Don Mueang airport](/wiki/Don_Mueang_International_Airport) in the second half of 2014. Nok Air owned 51% of NokScoot, with Scoot owning remaining 49%. In February 2015, Scoot took delivery of the first of 10 [Boeing 787-9 Dreamliners](/wiki/Boeing_787_Dreamliner). The aircraft entered service in February 2015 and were deployed on the Singapore-Perth route. It was then operated on the Singapore-Hong Kong route the next day. As Scoot continues to take deliveries of the Boeing 787, the airline has phased out all six of its aging Boeing 777 aircraft acquired from [Singapore Airlines](/wiki/Singapore_Airlines). Scoot would then begin to transition to an all-[Boeing 787](/wiki/Boeing_787_Dreamliner) fleet. On the completion of the transition, Scoot would operate a total of 20 [Boeing 787 Dreamliners](/wiki/Boeing_787_Dreamliner). In July 2015, parent company Singapore Airlines announced that Scoot suffered an operating loss of [S$](/wiki/Singapore_dollar)20 million during the first quarter of the 2015 financial year and achieved a load factor of 81.4%. In October 2015, [Singapore Airlines](/wiki/Singapore_Airlines) announced that Scoot would replace its existing Singapore to [Jeddah](/wiki/Jeddah) service via [Dubai](/wiki/Dubai) and launch direct services between Singapore and Jeddah. The new flights began in May 2016 after regulatory approvals. In April 2016, Scoot announced its intention to start flights to three Indian cities: [Amritsar](/wiki/Amritsar), [Chennai](/wiki/Chennai), and [Jaipur](/wiki/Jaipur), subject to regulatory approvals. Scoot's parent company, [Singapore Airlines](/wiki/Singapore_Airlines), would serve the maximum number of 15 cities allowed after the start of Scoot's services to India. In May 2016, Scoot joined the world's largest low-cost carrier alliance, [Value Alliance](/wiki/Value_Alliance). In May 2016, [Singapore Airlines](/wiki/Singapore_Airlines) established Budget Aviation Holdings, a holding company to own and manage its budget airlines Scoot and Tiger Airways, following the delisting of Tiger Airways from the [Singapore](/wiki/Singapore) stock exchange. ### 2016–2019: Merger with Tigerair In November 2016, [Singapore Airlines](/wiki/Singapore_Airlines) announced that [Tigerair](/wiki/Tigerair) would merge into Scoot. The rebranding did not affect the existing joint-ventures [Tigerair Australia](/wiki/Tigerair_Australia) or [Tigerair Taiwan](/wiki/Tigerair_Taiwan). Tigerair Taiwan is co-owned by China Airlines, which holds 80%, and its subsidiary Mandarin Airlines holding the remaining 20%. In July 2017, [Tigerair](/wiki/Tigerair) was merged into Scoot, using Tigerair AOC, but retaining the 'Scoot' brand. With the change of AOC, the IATA code was changed from TZ to TR, and the ICAO code was changed from SCO to TGW. Scoot announced flights to five more destinations: [Harbin](/wiki/Harbin_Taiping_International_Airport), [Kuantan](/wiki/Sultan_Haji_Ahmad_Shah_Airport), [Kuching](/wiki/Kuching_International_Airport), [Palembang](/wiki/Sultan_Mahmud_Badaruddin_II_Airport) and [Honolulu](/wiki/Daniel_K._Inouye_International_Airport). In December 2017, Scoot announced that it will launch flights to Berlin in 2018. ### Developments since 2020 This article needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(December 2025)* Due to [COVID-19](/wiki/COVID-19) travel restrictions, Scoot only flew to two cities in April and May 2020: [Hong Kong](/wiki/Hong_Kong) and [Perth](/wiki/Perth). On 20 May 2020, Scoot expanded flight operations in June 2020 to six cities: [Guangzhou](/wiki/Guangzhou), [Hong Kong](/wiki/Hong_Kong), [Ipoh](/wiki/Ipoh), [Kuching](/wiki/Kuching), [Penang](/wiki/Penang) and [Perth](/wiki/Perth). In June 2020, Scoot cancelled both of their routes to Europe, with [Athens](/wiki/Athens) and [Berlin](/wiki/Berlin) not resuming until at least the summer of 2021. In July 2020, Scoot announced that they would resume flights to [Kuala Lumpur](/wiki/Kuala_Lumpur) in August 2020, with enhanced health and safety measures. In August 2020, Scoot announced that one of its [Airbus A320](/wiki/Airbus_A320_family) aircraft underwent cabin modifications to [carry cargo in the cabin](/wiki/Preighter). This temporary arrangement doubled its cargo capacity compared to other Airbus A320s, using only bellyhold space. In November 2021, Scoot announced that [London Gatwick](/wiki/Gatwick_Airport) would be added to the European network, with thrice-weekly flights from 16 December 2021 until the end of the month. The service then resumed on a seasonal basis on 22 March 2022 twice weekly, and then thrice-weekly on 27 March 2022 onwards. In May 2022, [Singapore Airlines](/wiki/Singapore_Airlines) announced Leslie Thng as the CEO of the airline, replacing the outgoing [Campbell Wilson](/wiki/Campbell_Wilson), whose last day was 16 June 2022. In 2025, Scoot announced changes to its European services, replacing the Singapore-Berlin-Athens route with a direct service between Singapore and Athens alongside a new route to [Vienna](/wiki/Vienna), replacing [Berlin](/wiki/Berlin). Commencing 14 April 2025, Scoot will be servicing direct flights between Singapore and [Iloilo](/wiki/Iloilo). Scoot will also launch new routes to [Okinawa](/wiki/Okinawa_Island) and [Labuan Bajo](/wiki/Labuan_Bajo) starting August 2025, taking over routes that were operated by [Jetstar Asia](/wiki/Jetstar_Asia) following their closure in July. In early November 2025, 21 Scoot planes were affected by the Airbus A320 recall which was due to a software flaw. ## Corporate affairs ### Business trends These are the key trends for Scoot (as of the financial year ending 31 March). The figures of 2016 include both Scoot and Tigerair, that merged in 2017. Revenue (S$ m)[Net profit](/wiki/Net_income) (S$ m)Number of employeesNumber of passengers (m)Passenger load factor (%)Number of destinationsFleet sizeReferences20161,21921.41,7207.583.93320171,38821.61,8478.582.43520181,53316.02,0519.485.7644020191,71−40.82,33410.485.3664720201,624−2512,40610.485.768492021125−6761,9760.089.950472022432−4771,7470.515.1435320231,96543.52,5508.383.9585520242,446182.42,65612.791.2675120252,34922.22,95612.988.47153 ### Headquarters The airline's head office is located at Changi Airport Terminal 3. It operates from Terminal 1, having moved there in October 2019. ### Corporate design The aircraft are painted in a yellow-white livery. In January 2012, Scoot unveiled its cabin crew uniform with a black and yellow theme, designed by ESTA. Following the merger with Tigerair, a new cabin crew uniform with thicker fabric was unveiled. ### NokScoot NokScoot was a [Bangkok](/wiki/Bangkok)-based low-cost long-haul airline which was founded in 2015. It was a joint venture of Thailand's [Nok Air](/wiki/Nok_Air) and Scoot, with Scoot holding a 49% stake. The airline operated out of Bangkok's [Don Mueang International Airport](/wiki/Don_Mueang_International_Airport). NokScoot entered liquidation in June 2020 due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic). ### Alliance In May 2016, Scoot joined Value Alliance, the world's largest low-cost carrier alliance. The new alliance included Philippines' [Cebu Pacific](/wiki/Cebu_Pacific), South Korea's [Jeju Air](/wiki/Jeju_Air), Thailand's [Nok Air](/wiki/Nok_Air) and [NokScoot](/wiki/NokScoot), [Tigerair Singapore](/wiki/Tigerair), [Tigerair Australia](/wiki/Tigerair_Australia) and Japan's [Vanilla Air](/wiki/Vanilla_Air). ## Destinations From [Singapore](/wiki/Singapore), Scoot flies to over 16 countries and 56 destinations across Asia, Europe and Oceania. ### Codeshare agreements Scoot [codeshares](/wiki/Codeshare_agreement) with the following airlines: - [Air New Zealand](/wiki/Air_New_Zealand) - [Air Canada](/wiki/Air_Canada) - [Air India Express](/wiki/Air_India_Express) - [Jeju Air](/wiki/Jeju_Air) - [Olympic Air](/wiki/Olympic_Air) - [Singapore Airlines](/wiki/Singapore_Airlines) ### Interline agreements - [Aegean Airlines](/wiki/Aegean_Airlines) - [Air New Zealand](/wiki/Air_New_Zealand) - [Air Canada](/wiki/Air_Canada) - [Air India](/wiki/Air_India) - [Air India Express](/wiki/Air_India_Express) - [Austrian Airlines](/wiki/Austrian_Airlines) - [Bangkok Airways](/wiki/Bangkok_Airways) - [Brussels Airlines](/wiki/Brussels_Airlines) - [Citilink](/wiki/Citilink) - [EasyJet](/wiki/EasyJet) - [Ethiopian Airlines](/wiki/Ethiopian_Airlines) - [Eurowings](/wiki/Eurowings) - Hahn Air - [Jeju Air](/wiki/Jeju_Air) - [Lufthansa](/wiki/Lufthansa) - [Olympic Air](/wiki/Olympic_Air) - [Singapore Airlines](/wiki/Singapore_Airlines) - [Swiss International Air Lines](/wiki/Swiss_International_Air_Lines) - [Thai VietJet Air](/wiki/Thai_VietJet_Air) - [United Airlines](/wiki/United_Airlines) - [Virgin Australia](/wiki/Virgin_Australia) - [Vueling](/wiki/Vueling) ## Awards and recognition On 24 June 2024, Scoot was voted 2024 *Best Long Haul Low-Cost Airline in the World* by [Skytrax](/wiki/Skytrax). ## Fleet ### Current fleet As of October 2025[update], Scoot operates the following aircraft: Scoot fleet AircraftIn serviceOrdersPassengersNotesWYTotal[Airbus A320-200](/wiki/Airbus_A320-200)6——180180[Airbus A320neo](/wiki/Airbus_A320neo)117—186186Deliveries until 2025.[Airbus A321neo](/wiki/Airbus_A321neo)124—236236[Boeing 787-8](/wiki/Boeing_787-8)13—1831132921314335[Boeing 787-9](/wiki/Boeing_787-9)10135340375Three aircraft orders were converted to the larger [Boeing 787-10s](/wiki/Boeing_787-10) and transferred to [Singapore Airlines](/wiki/Singapore_Airlines) in May 2023.[Embraer E190-E2](/wiki/Embraer_E190-E2)9——112112Leased from Azorra Aviation.Total6112 ### Fleet development The Scoot fleet began with [Boeing 777-200ER](/wiki/Boeing_777) aircraft acquired from its parent airline, [Singapore Airlines](/wiki/Singapore_Airlines), reconfigured with a new seating layout and modified (de-rated) engines. The airline had planned to operate a fleet of 14 aircraft by 2016. In October 2012, Scoot announced that parent company Singapore Airlines would be transferring the 20 [Boeing 787-9 Dreamliners](/wiki/Boeing_787_Dreamliner) it had on order to Scoot to replace Scoot's current fleet of Boeing 777-200s. Scoot retired all six of its Boeing 777-200ERs by August 2016. They moved to an 'all-Boeing 787' fleet, following the delivery of the first of ten Boeing 787-9s in February 2015 and the first of ten Boeing 787-8s in mid 2015. In July 2017, [Tigerair](/wiki/Tigerair) was merged into Scoot. Tigerair's entire fleet was transferred to Scoot. In October 2018, Singapore Airlines converted two of its [Boeing 787-10s](/wiki/Boeing_787-10) on order to the smaller Boeing 787-8s, and allocated them to Scoot. In July 2019, Scoot announced that it was ordering 16 [Airbus A321neos](/wiki/Airbus_A320neo_family). The first one entered service in June 2021. In December 2022, it was reported that Scoot was in talks with [Embraer](/wiki/Embraer) regarding a potential purchase of [E-Jet family](/wiki/Embraer_E-Jet_family) aircraft. A letter of intent was signed to lease nine E190-E2 aircraft, with the first delivered in April 2024. ### Former fleet Scoot former fleet AircraftTotalIntroducedRetiredReplacementNotes/references[Airbus A319-100](/wiki/Airbus_A319-100)420172019[Airbus A320neo family](/wiki/Airbus_A320neo_family)[Boeing 777-200ER](/wiki/Boeing_777-200ER)620122015[Boeing 787 Dreamliner](/wiki/Boeing_787_Dreamliner) - [List of airlines of Singapore](/wiki/List_of_airlines_of_Singapore) - Official website - Media related to Scoot at Wikimedia Commons Portals: - Singapore - Companies - Aviation\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:02.071146",
  "title": "Scoot",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Scoot"
}