{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:04.456949"
  },
  "content": "Singaporean electric car manufacturer **Scorpio Electric** is a [Singaporean](/wiki/Singaporeans) [electric vehicle](/wiki/Electric_vehicle) manufacturer specialising in [electric motorcycles](/wiki/Electric_motorcycles_and_scooters), focusing on design, performance and technology. The brand is owned by EuroSports Technologies Pte Ltd (EST). ## History Before 2017, EuroSports Technologies was named [Spania GTA](/wiki/Spania_GTA) Asia Pacific Private Ltd., a wholly owned subsidiary of EuroSports Global Limited. In 2017, the company announced amendments in its scope of business to an investment holding company and manufacturing and assembly of [motorcycles](/wiki/Motorcycle) and scooters. It was with this change that Scorpio Electric was established. In 2018, Scorpio Electric received S$2 million (US$1.5 million) worth of seed capital from its [Singapore](/wiki/Singapore)-listed parent company EuroSports Global (ESG), with a commitment of another S$3 million (US$2.2 million) subject to hitting milestones. A [prototype](/wiki/Prototype) design model of the X1 was first unveiled in 2019 at the Singapore Week of Innovation and Technology (SWITCH) and [Singapore Fintech Festival](/wiki/Singapore_FinTech_Festival) (SFF) with Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) and the [Minister of Foreign Affairs](/wiki/Ministry_of_foreign_affairs), Dr Balakrishnan, in attendance. In November 2020, Scorpio Electric announced that it had completed a US$6.3 million fundraising without disclosing investors’ identities. US$5 million of these funds were raised through share subscription agreements with investors, while an additional US$1.3 million was raised from EST [convertible loans](/wiki/Convertible_loan). In October 2021, Scorpio Electric launched pre-orders globally for the first [Singapore](/wiki/Singapore) electric motorcycle, the X1. ## The X1 Pre-orders for the X1 began in November 2021, and the company aims to start shipping the bikes in late 2022 and early 2023. Pre-orders for the X1 can be made via the company's official website for US$1,000, though the motorbike retails for US$9,800, exclusive of taxes and other charges. ### Design and Technical Specifications Indicative design and technical specifications were released. Styling for the X1 follows a conventional scooter design with [telescopic](/wiki/Telescoping_(mechanics)) front forks and a single shock absorber in the rear. Braking is similar, with a single [hydraulic disc](/wiki/Hydraulic_Disc_Brake) on the front and rear wheels, with [LED lighting](/wiki/LED_lighting), windshield and seating for passenger and pillion completing the fit-out. The X1 is powered by a 10 kW electric motor fed by a 4.8 kWh, 72-Volt, 73 Ah [lithium-ion battery](/wiki/Lithium-ion_battery) and claims to reach top speeds of 105 kilometres per hour and deliver up to 200 kilometres on a single charge. Charging is said to take 2.5 hours, from a low battery percentage to 90% charging capacity. Three ride modes are provided – Eco, Urban and Sport, with a reverse mode included. ### Mobile Application and AI Functions The X1 also comes with software-driven capabilities that can be accessed through a dedicated proprietary mobile application. A TFT-LCD screen in the cockpit displays all necessary information. Some key features include keyless access, remote locking/unlocking, real-time vehicle status information (e.g. trip summary, battery status, estimated range and other vital statistics), smart navigation (e.g. alerting riders on adverse conditions or high incident occurrence route), vehicle locator, and anti-theft alerts. It is also equipped with sensors and [AI](/wiki/Artificial_intelligence) capabilities that help collect live data. With the seamless integration between the app and the X1, the company believes this innovation can help conserve battery and improve efficiency during long trips. ## Other Services In 2021, Scorpio Electric's parent company, EuroSports Technologies (EST) partnered with Strides Transportation, a subsidiary of public transport operator [SMRT](/wiki/SMRT_Corporation), to develop, market and supply smart [electric motorcycles](/wiki/Electric_motorcycles_and_scooters) for commercial and corporate clients. The two signed an MOU that will see Strides act as the sole distributor of electric motorcycles in [Singapore](/wiki/Singapore) and the Asia Pacific region. This will include the development of electric two-wheel and three-wheel motorcycles equipped with \"smart riding features\" as well as supporting systems such as in-house charging stations. - Official site This article **needs additional or more specific categories**. Please help out by adding categories to it so that it can be listed with similar articles. *(June 2023)*\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:04.456588",
  "title": "Scorpio Electric",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Scorpio_Electric"
}