{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:08.817556"
  },
  "content": "Bungalow in Singapore **Sea Breeze Lodge** is a historic bungalow in [Marine Parade, Singapore](/wiki/Marine_Parade). Completed for businessman Choa Kim Keat in 1898, the building initially stood along the seaside. It is the last remaining bungalow along Marine Parade Road to have been built before reclamation works shifted the shore away from the road. ## History The single-storey bungalow, which initially stood 5m away from the sea, was built by prominent local businessman Choa Kim Keat of the [Straits Trading Company](/wiki/Straits_Trading_Company). It is \"arguably Singapore’s first waterfront private property.\" He used the building as a weekend retreat. During the [Japanese Occupation of Singapore](/wiki/Japanese_Occupation_of_Singapore), the bungalow was occupied by Japanese soldiers. After the end of the occupation, the Choa family reoccupied the property. The bungalow is raised and a staircase leads up to the verandah at the front entrance. Following reclamation works, which began in the mid-1960s, the shore moved away from the bungalow, which no longer stood by the seaside. The Choa family received multiple offers to redevelop the site, but they were rejected as Eric Choa, the grandson of Choa Kim Keat, wished to live the rest of his life in the bungalow. The 47,400 sqft property on which the building, which has a gross floor area of 3,100 sq ft, stands, was opened for tender following the 2009 death of Eric Choa in May 2011. It was sold to Orchard Mall of the [Far East Organization](/wiki/Far_East_Organization) for $103.8 million on 7 June. The sale set a \"new benchmark land price for the area.\" The Choa family reportedly had \"mixed feelings\" about the sale, as they had owned the building for generations, although they were appreciative of its conservation. They claimed to have chosen this period to sell the house as the property market was \"good.\" The bungalow was gazetted for conservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), which placed it within the [Joo Chiat Secondary Settlement](/wiki/Joo_Chiat_Road). 1°18′09″N 103°54′14″E﻿ / ﻿1.30254°N 103.90393°E﻿ / 1.30254; 103.90393\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:08.817170",
  "title": "Sea Breeze Lodge",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sea_Breeze_Lodge"
}