{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:11.595069"
  },
  "content": "Singaporean entrepreneur and filmmaker **Sean Foo** (born 24 April 1991) is a Singaporean entrepreneur, filmmaker and advocate known for his contributions to the LGBT community through his work with [Dear Straight People](/wiki/Dear_Straight_People). He is also recognized as the creator of Singapore's first gay [boys' love](/wiki/Yaoi) web drama series, [*Getaway*](/wiki/Getaway_(web_series)). ## Early life and education An alumnus of [Catholic Junior College](/wiki/Catholic_Junior_College), Foo graduated from [Monash University](/wiki/Monash_University) in Melbourne, where he earned a double degree in Arts and Accounting. Foo realised he was gay during his teenage years. However, societal prejudice against homosexuality compelled him to remain in the closet throughout his adolescence and early adulthood. ## Career During his final year of university, Foo founded LGBT media platform [Dear Straight People](/wiki/Dear_Straight_People), which first made a name for itself through its coming out stories. Following his graduation, Foo began his career as an auditor, working in one of the [Big Four accounting firms](/wiki/Big_Four_accounting_firms). He later transitioned to the media industry when he joined The Smart Local, a media company in Singapore. After running Dear Straight People anonymously for a period of two years, Foo publicly revealed himself as the founder of the platform in 2017 in a self-penned letter. His coming out story received significant attention, where it was covered in media publications such as [Metrosource](/wiki/Metrosource). Following his public coming out, Foo emerged as a prominent figure in the LGBTQ+ community, actively participating in various forms of media engagement and advocacy. In 2023, Foo was featured in the documentary *Regardless Of Sexuality* by [Channel News Asia](/wiki/Channel_News_Asia). Hosted by [Janil Puthucheary](/wiki/Janil_Puthucheary), *Regardless Of Sexuality* was Singapore's first LGBT documentary to air on national television in almost 20 years. ### Venture into film-making Despite lacking prior experience in film-making, Foo set out to create Singapore's first gay boy's love web series. In 2022, Foo wrote, produced and starred in [*Getaway*](/wiki/Getaway_(web_series)), which premiered on YouTube on 23 May 2022. Comprising five episodes, *Getaway* featured an openly queer cast from Singapore and Thailand. Following the popular reception to *Getaway*, Foo made his directorial debut with the gay short film titled *Home Par*. The gay short film premiered on YouTube on 15 December 2022. ## Filmography ### As filmmaker YearTitleDirectorWriterProducerActorRef2022*Getaway*NoYesYesYes2022*Home Par*YesYesYesNo2025*Straight Best Friend*NoYesYesYes2025*Connection*YesYesYesNo ## Awards and nominations OrganisationYearCategoryNominated workResultRefThe Pinwheels2023Content of the Year*Getaway*NominatedThe Pinwheels2025Most Social Good Video\"The Raw Truth About Bareback Sex\" (*The Unfiltered Gay Podcast*)Won - Sean Foo at [IMDb](/wiki/IMDb_(identifier))\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:11.594677",
  "title": "Sean Foo",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sean_Foo"
}