{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:12.125372"
  },
  "content": "Singaporean companyThis article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"Seatrium\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2018)* *(Learn how and when to remove this message)* **Seatrium Limited** is a Singaporean state-owned company. Formed in 2023, from the acquisition of **Keppel Offshore & Marine** by **Sembcorp Marine** which was subsequently renamed Seatrium, the company is listed on the [Singapore Exchange](/wiki/Singapore_Exchange) (SGX). Seatrium's products and services include rigs & floaters, repairs & upgrades, [offshore platforms](/wiki/Offshore_platform) and specialised [shipbuilding](/wiki/Shipbuilding). It conducts its businesses globally through shipyards in Singapore, Indonesia, the United Kingdom and Brazil. ## History ### Keppel Offshore & Marine (2001–2023) In 2001, Keppel privatised its offshore and marine business which resulted in the integration of Keppel Shipyard together with Keppel FELS and Keppel Singmarine to form the Keppel Offshore & Marine group in 2002. In 2015, Keppel Shipyard got a secured floating Production storage and Offloading conversion project worth of $89 million. The project includes repair, upgrade and modification. FPSO Conversion has already started and it is going to be completed in third quarter of 2016. They were the recipients of the Business China Enterprise Award in 2015, for their contributions to China-Singapore business relations. ### Sembcorp Marine (2000–2023) Sembcorp Marine was formed from [Jurong](/wiki/Jurong) Shipyard in 2000. In October 2017, Sembcorp Marine won a $490m contract for the construction of a new floating production storage and offloading hull and living quarters with Statoil Petroleum AS. In November of the same year, it announced a collaboration with DNV GL, [A*Star's](/wiki/Agency_for_Science,_Technology_and_Research) Singapore Institute of Manufacturing Technology and the National Additive Manufacturing Innovation Cluster to develop [drones](/wiki/Unmanned_aerial_vehicle), additive manufacturing and digital twin technologies. On 5 September 2018, Sembcorp Marine acquired the intellectual property of Sevan Marine, specialized marine engineering and design house. Its acquisition consisted of interests and titles to all of Sevan Marine ASA’S intellectual property, and 95% of shares of HiLoad LNG AS, for a cash consideration of $39 million. In April 2019, Semborp Marine was given the Offshore & Marine Engineering Award in the Singapore International Maritime Centre Awards 2019, and in May of the same year, Sembcorp Marine revealed [The Sleipnir](/wiki/SSCV_Sleipnir), the world's largest crane vessel (which cost around US$1.5 billion). In March 2020, it was announced that [Sembcorp](/wiki/Sembcorp), the then-parent company of Sembcorp Marine, was replacing their CEO, an action which is often taken due to adverse events, and can have negative effects on a company's performance and valuation. Sembcorp failed to declare an interim dividend for 1H 2020 (as is usual practice), instead choosing to defer any decision regarding payment of dividends for the fiscal year 2020 until the end of the year. In June of the same year, trading was halted for Sembcorp as well as Sembcorp Marine (the latter of which had its shares decline by 36% in 2020). Representatives from both companies declined to comment. The companies were subsequently [demerged](/wiki/Demerge). Between June 11 and July 24, 2020, Sembcorp Industries' share price declined by 11%. In September 2020, [Shell](/wiki/Shell_Oil) postponed a major contract to Sembcorp Marine for an oil rig in the US Gulf of Mexico to 2021, citing economic uncertainty caused by the [COVID-19 pandemic](/wiki/COVID-19_pandemic). On 8 June 2020, it was reported that Temasek stepped in to support Sembcorp Marine's $1.5 billion rights issue Sembcorp Marine has also been involved in corruption probes in Brazil. The charges were in connection with certain drilling rig construction contracts entered into by Sembcorp Marine's subsidiaries in Brazil back in 2012. ### Seatrium (2023–present) On 28 February 2023, Sembcorp Marine completed its acquisition of [Keppel Corporation](/wiki/Keppel_Corporation)'s Offshore & Marine division for $3.34 billion. Subsequently, on 27 April 2023, Sembcorp Marine's shareholders approved the company's name change to Seatrium. - Seatrium\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:12.124940",
  "title": "Seatrium",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Seatrium"
}