{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:22.208096"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Secondary education in Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2015)* *(Learn how and when to remove this message)* **Secondary education in Singapore** is largely [public](/wiki/State_school), and is compulsory until a child has reached 16 years of age. At the end of public [primary education](/wiki/Primary_education), Singapore students take the [Primary School Leaving Examination](/wiki/Primary_School_Leaving_Examination) (PSLE) and are placed into the different streams and secondary schools based on their results. There are three main public [secondary education](/wiki/Secondary_education) bands: G1, G2 and G3, with [special](/wiki/Special_education) and [private education](/wiki/Independent_school) courses also being available. The G3 level has a more stringent cut-off than the G2 level, which is in turn more selective than the G1 level. G1 is the foundation while G2 is the middle ground and G3 is the top scorers. Secondary students can move between streams based on their academic performance. The Express stream is a four-year course leading to the [Singapore-Cambridge GCE Ordinary Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) (O-level) examinations, while the Normal streams are four-year courses leading to the [Normal Level](/wiki/Singapore-Cambridge_GCE_Normal_Level) (N-level) examinations. N(A) students take the N(A) examinations, which allows them to apply for local polytechnics and [Institutes of Technical Education](/wiki/Institute_of_Technical_Education) (ITE). After their N(A)-levels, students may also choose to remain in secondary education for an additional year as a secondary five student to study for the O-levels, which allows students to enter [junior colleges](/wiki/Junior_college_(Singapore)) and the [Millennia Institute](/wiki/Millennia_Institute). N(T) students take the N(T) examinations, which allows students to apply to the ITEs. After their N(T)-levels, students may choose to transfer to the N(A) stream to study an additional year for the N(A) examinations. From 2024, all incoming Secondary 1 students will be taking subjects based on the Subject-Based Banding format, with Secondary 4/5 students in 2025 being the last batch for streaming. Streaming will be abolished by 2025. ## Co-curricular activities \"Co-Curricular Activities\" (CCAs) are compulsory in all secondary schools, where all pupils must participate in at least one core activity, and participation is graded together with other achievements throughout the four years in a scoring system known as LEAPS (\"Leadership, Enrichment, Achievement, Participation, Service\"). There are many co-curricular activities offered at the secondary level, and each student is judged based in these areas. ## Special Assistance Plan The **Special Assistance Plan** ([Abbreviation](/wiki/Abbreviation): **SAP**; [Chinese](/wiki/Simplified_Chinese_characters): 特别辅助计划) is a special programme in Singapore introduced in 1979 that caters to academically strong students who excel in both Chinese as well as English. The main objective of the programme is to preserve schools with strong cultural backgrounds and create bi-cultural environment, to allow capable students to master both these languages. The special programme were run in designated institutions that offers English and Chinese at first-language level under the Special stream (a variation of the Express stream, according to the education grading system in use since 1982). Nine secondary schools piloted the programme, which is deemed overwhelming successful with five of the designated schools consistently attaining top ten positions in the secondary school ranking in the 1990s, surpassing several established English-medium schools. ## Gifted Education Programme The Gifted Education Programme (GEP) was set up by the Ministry of Education in 1984 amid some public concern to cater for [intellectually gifted](/wiki/Gifted) students. Seven secondary schools originally started the programme, but with the introduction of the Integrated Programme, most have folded the GEP programmes into their IP curriculum. The Secondary School Gifted Education Programme was discontinued at the end of 2008 as more students were taking the Integrated Programme (IP). Pupils entered the programme through a series of tests at Primary 3, which identified the top 1 per cent of the student population. A second selection used to be conducted at Primary 6 for those who do well in the PSLE, but this was discontinued after it was found to be too difficult for these students to catch up with the programme. In the programme, pupils were offered special enrichment programmes to cater for their needs. However, not all students in GEP were successful. Some were not accustomed to the fast pace of study, which affected their performance in the core subjects, and chose not to continue the programme at secondary level. ## Integrated Programme The Integrated Programme, also known as the \"Through-Train Programme\" (直通车), is a scheme which allows the most able secondary students in Singapore to bypass \"O\" levels and take \"A\" levels, [International Baccalaureate](/wiki/International_Baccalaureate) or an equivalent examination directly at the age of 18 after six years of secondary education. First introduced in 2004, the programme allows for more time to be allocated to enrichment activities. By bypassing the GCE \"O\" level examinations, the students are supposedly given more time and flexibility to immerse themselves in a more broadly-based education. In addition, the students enjoy more freedom in the combination of subjects between Years 1 and 4 as compared to their non-IP counterparts. Generally, only the top performers (usually from Special, and sometimes Express, stream) are eligible to be part of the IP programme. This will ensure that the main body of the students pursue their secondary education at their own pace by first completing a 4-year \"O\" level course before going on to a 2-year \"A\" level education (as opposed to a 2-year \"O\" level and 4-year \"A\" level education). As a result, schools offering IP allow their students to skip the \"O\" levels at Secondary 4 and go straight into junior colleges (JCs) in Year 5/JC1. The [Integrated Programme](/wiki/Integrated_Programme) with the revised Singapore-Cambridge GCE \"A\" levels or the [IB Diploma](/wiki/International_Baccalaureate_Diploma_Programme) as a terminal qualification has become an increasingly popular alternative to the standard secondary education pathway. This is because it is perceived as having moved away from the usually heavy emphasis on the sciences, a phenomenon resulting from the post-independence need for quick and basic technical and industrial education; to subjects in the arts and humanities. Such programmes are more project-based and students are expected to be independent learners. The first batch of IP students sat for the revised GCE \"A\" Level or International Baccalaureate Diploma examinations in 2007. ## Admission to post-secondary institutions Upon completion of the 4- or 5-year secondary school education, students (excluding IP students) will participate in the annual [Singaporean GCE 'O' Level](/wiki/Singaporean_GCE_%27O%27_Level), the results of which determine which pre-universities or post-secondary institutions they may apply for. Pre-university centres include [Junior Colleges](/wiki/Junior_college_(Singapore)) for a two-year course leading up to [GCE 'A' Level](/wiki/GCE_%27A%27_Level), or the [Millennia Institute](/wiki/Millennia_Institute) for a three-year course leading up to [GCE 'A' Level](/wiki/GCE_%27A%27_Level). Junior Colleges and the Millennia Institute accept students on merit, with a greater emphasis on academics than vocational-technical education. Students who wish to pursue vocational education go on to post-secondary institutions such as the [polytechnics](/wiki/Institute_of_technology#Singapore) and the [Institute of Technical Education](/wiki/Institute_of_Technical_Education) (ITE), where they receive a diploma upon successful completion of their courses. Admission to a two-year pre-university course at Junior Colleges after graduating from secondary school is determined by a scoring system based on the 'O' Level subject grades. Students scoring 20 points and below may be admitted for either a Science or Arts Course. Pre-university centres that are particularly associated with academic excellence, however, usually expect students to attain points in the single digits, to be admitted. This is because the system is [merit-driven](/wiki/Meritocracy), with places given to those with lower scores first. For students seeking admission to diploma courses in polytechnics, a scoring system is still used, albeit a different one. However, students will also be required to meet specific prerequisites outlined by the different polytechnic schools they are applying for. Students applying for courses in the Institute of Technical Education (ITE) Colleges will also have an independent scoring system, depending on the course they are applying for. ## Private education Most students in Singapore are educated at public schools. A minority are [home-schooled](/wiki/Homeschooling) or educated in private schools. The Ministry of Education prohibits students who are Singapore citizens from being educated in private schools without prior permission. Admission to public schools for international students is not guaranteed and is based on aptitude and school vacancies. - [Education in Singapore](/wiki/Education_in_Singapore) - [List of secondary schools in Singapore](/wiki/List_of_secondary_schools_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:22.207713",
  "title": "Secondary education in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Secondary_education_in_Singapore"
}