{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:26.230476"
  },
  "content": "The coming of the [British](/wiki/British_Empire) to [Singapore](/wiki/Singapore) and the subsequent establishment of British rule saw the rise of [secret societies](/wiki/Secret_societies) in this small colony. Whilst known as \"secret\" societies, paradoxically they often worked in the open, and even played essential and functional roles within society, with state knowledge or tacit cooperation. Secret societies have a significant role in [colonial Singapore](/wiki/Singapore_in_the_Straits_Settlements) society. They were a source of support for a significant portion of society, and this was possible due to their political, economic as well as social influence. Straddling both legitimate and illegitimate businesses which involved employment of large amounts of labour as well as various clientele, and involvement with authorities who gained from the economic as well as societal influence the secret societies wielded, ensured their continued influence throughout long extended periods during the colonial period. Survival and flourishing of secret societies depended upon how they managed their place in society, and more importantly, negotiations with the state authorities and their relevance over time. These would be what led to rise of the secret societies, their extended period of dominance, as well as their eventual decline (but not disappearance), in colonial Singapore. ## Background There are varying definitions as to what being a secret society constitutes. Most secret societies in general would have the following features of 1) claims to exclusivity, 2) their own special secrets and 3) the inclination to prioritize fellow members. Secret societies despite the naming \"secret\" are not in the sense organisations that are unknown to the public, but it is more of its members and many of the activities in which they carry out that tend to secretive rather than their existence. Secret societies have existed well before the coming of the British, but it was with the mass immigration from the colonial era onwards that saw a significant rise of secret societies, largely due to the importation of large populations of labour as the colony's economy developed. The exponential growth in the ethnic [Chinese](/wiki/Chinese_people) population would be a key reason for the rise of the secret societies throughout most of the colonial period. Secret societies in colonial Singapore played multi-faceted roles and were involved in a whole range of activities. This could be from [prostitution](/wiki/Prostitution) to the managing of [opium](/wiki/Opium) dens, to the sourcing for [coolies](/wiki/Coolies) from [Southern China](/wiki/South_China) as well as simultaneously managing lucrative legitimate businesses like [pepper](/wiki/Piper_(plant)) and [gambier](/wiki/Uncaria_gambir) farming. ### Secret societies in colonial Singapore The earliest known written records are by [Munshi Abdullah](/wiki/Munshi_Abdullah), in his work [Hikayat Abdullah](/wiki/Hikayat_Abdullah), where it mentions of his visit to the [Ghee Hin](/wiki/Ghee_Hin) [initiation](/wiki/Initiation) ceremony in 1824, and how when enquiring about its membership, was given an estimate of about 8000 members. While the numbers were likely to have been exaggerated, the idea of the existence of secret societies forming and growing to such a sizeable extent only after the British presence in 1819 is unlikely, and their roots probably existed in smaller and varied forms prior.[*citation needed*] ### Dominance of ethnic Chinese secret societies Due to ethnic composition, with the increasingly huge ethnic Chinese immigration population vis-à-vis the rest of the local population, the dominant narrative on secret societies in colonial Singapore has been centred upon ethnic Chinese secret societies. However, this is not to say there were no [multi-ethnic](/wiki/Multi-ethnic) secret societies or those of other ethnic groups. Notable ethnic [Indian](/wiki/Indian_people) secret societies have been known to exist, and it was also not unknown for ethnic Chinese secret societies to incorporate members of other ethnicities. It may thus be more of the size and scale of the ethnic Chinese secret societies that result in the non-ethnic Chinese ones being overshadowed, as well as a need for more research to be done. At the same time, it is important to note Chinese secret societies themselves were far from homogeneous. In fact, the collective term \"Chinese\" used to describe them would make little sense at this period. This is due to what is today known as the [People's Republic of China (PRC)](/wiki/China) itself going through a period of transition from an ailing imperial dynasty to a long transition of defining its identity and nationhood. The Chinese migrants in varying periods of the colonial era themselves had varying definitions of how they saw themselves, of which a collective term of being \"Chinese\" as an overall marker held little sway. For many Chinese secret societies and its members, they were instead marked by regional and/or dialect allegiances, such as being [Hokkien](/wiki/Hokkien), [Teochew](/wiki/Teochew_people), [Cantonese](/wiki/Cantonese) or [Hakka](/wiki/Hakka), and hailing from provinces of [Southern China](/wiki/Southern_China), namely [Guangdong](/wiki/Guangdong) and [Fujian](/wiki/Fujian), rather than seeing themselves as a homogeneous ethnic group. ## Push factors in joining secret societies Secret societies played functional roles in colonial Singapore society, in a context of a male dominated [immigrant society](/wiki/Immigrant_society) where law and order were at many times significantly under their control. Secret societies also provided some form of leadership and guidance given a colonial authority that was largely out of touch with the common man, in rather effective ways. With such a context, secret society membership thus became a viable option to many. Given the variety of push factors to join, many did so out of practical reasons, of which a few factors will be explored below: ### Seamless services of secret societies The idea of providing seamless services to members may seem like a relatively modern term, but such was what the secret societies provided to new immigrants. From having agents to recruiting labour from Southern China, settling the transportation means to Singapore and funnelling them to the various employers, such were some of the integrative services and solutions provided. This does not end here, as in the control of illicit businesses, the daily lives of members in terms of the desire to smoke [opium](/wiki/Opium) or for [prostitution](/wiki/Prostitution) was also provided by the secret societies. Protection of members was also guaranteed in an era where law enforcement was nowhere comparable to the case of Singapore today. The secret societies were thus efficient in providing seamless services to members, and its many benefits were a draw, serving as an important push factor for membership. ### Demographics of colonial Singapore The continued importation of male labour for much of the colonial period, saw a massive gender imbalance resulting in a highly skewed male dominated population. It is estimated that up to the end of the 19th century, the ratio was every five males to one female. This meant many would not be able to settle down and start families, and thus an alternative to [kinship](/wiki/Kinship) and family would be joining associations, and such is where the secret societies come into play. Also, the ethnic Chinese population as mentioned, were a highly diverse group. Particularly apparent would be the different dialects used, that were largely not mutually intelligible. Joining a secret society that spoke the same dialect as well as having members coming from a similar place in Southern China brought a sense of \"home\" to them. ### Moral authority of secret societies The idea of linking [moral authority](/wiki/Moral_authority) with that of secret societies could prove puzzling to many, who do not see how the two could be related. However, if we look at the context of society in colonial Singapore, ruled by the British who were but a minute portion of the entire population and similarly relied on a proportionally small group of local peoples of various backgrounds to help in governing, the secret societies could prove themselves as a viable alternative.[*citation needed*] Given the alienation the public had from authorities, which was exacerbated by language barriers, the secret societies with their seamless services and corresponding influence and power allowed them to be a recognised authority in society. Often the secret societies were looked upon for security and protection, rather than the state enforcers, which were small in numbers. Their moral authority was also recognised by the state, who had to often invoke the aid of leaders of secret societies in times of serious disputes within the ethnic Chinese community, where the ethnic Chinese population looked more towards the secret societies as being representative of their interests and concerns instead. ## Business synergies of secret societies in colonial Singapore An important point to note about secret societies were that they seldom functioned as singular distinct entities. As mentioned, they were not unknown to the public and were very much a part of the wider society. Their economic impact and influence was not to be taken lightly. Such was possible as secret societies were often tied to both to lucrative legitimate as well as illegitimate businesses, and state authorities had a hand in them as well. In the 19th century, Singapore was the only place to be reported of having [Europeans](/wiki/Europeans) joining secret societies due to their extent of influence. This clearly showed how much political and economic influence they wielded given the scale of the wide range of activities carried out by them. Secret societies would thus have to be seen and measured in this larger context of the intertwining of seemingly varied yet related agencies, how this impacts society at large, and in those under their influence. ### Influence of prominent members Iconic members of the Singapore Chinese community such as Whampoa [Hoo Ah Kay](/wiki/Hoo_Ah_Kay) were known to be members, and many if not most leaders were indeed affiliated to the secret societies. Chinese community leaders often straddled both legitimate businesses as well as the activities of secret societies, meaning that the influence of secret societies was widespread to the extent that these community leaders had government connections, moral authority in society and economic power all conflated together. ### \"Pig\" trade The need for labour in the growing colonial economy saw an increase in the immigration of Chinese [coolies](/wiki/Coolies) to Singapore. While some of the better off ones had the financial means to make their way, be it from family back home or sponsored help, many could not afford the necessary fees needed to provide for the expenses of the journey. Most of these coolies required passage assistance, and such was provided by the agents of secret societies or labour brokers who recruited on behalf of the secret societies in the coastal provinces of Southern China. They were given an advanced sum of money for the expenses of the trip, from which the contracted [debt](/wiki/Debt) was transferred to their employer whom they had to work for to pay off the debt. Such took at least three years in most cases. Many coolies faced exploitation and abuse, and on top of that, the hard labour often involved with coolie work, as well as poor living conditions in cram and unhygienic [squatters](/wiki/Squatters) took a toll both on their bodies and health. Proper public healthcare was also practically non-existent for them at this period. It was then no surprise that many coolies also turned to opium as a form of relief and a means of escape from the reality of their lives, even if only illusionary. ### Opium syndicates and legitimate businesses It is to note that the production as well as consumption of opium was not illegal then, and was an important source of revenue for the organisations that control the opium trade, as well as for the colonial government who collected tax revenues from its sales. Its consumption was also both domestic as well as an export good to other parts of Asia. Secret societies were involved with the Chinese [Kongsi](/wiki/Kongsi) that concurrently ran lucrative legitimate businesses. In fact, the very same opium farming syndicates are also the ones that are involved with the lucrative pepper and gambier businesses, showing the extent of economic power and authority. ### Illicit activities Apart from opium dealings, secret societies were also involved in a range of illicit activities, from prostitution to [gambling](/wiki/Gambling) and [loan-sharking](/wiki/Loan-sharking), amongst others. Prostitution particularly was a long-standing stronghold of the secret societies, and had continually been under their provision. Given the lucrative nature of prostitution in a society with a majority male population, competition and rivalry for control of the prostitution trade amongst secret societies was a constant happening. A partial reason of the secret societies' ability to engage and sustaining their hold in these activities was the special connection they had with the British colonial government due to the revenue generated from these activities being shared. There was also an understanding between the state and leaders of secret societies that in times of trouble they could solicit the help of these leaders, who as mentioned were often respected community leaders at the same time as being leaders of secret societies. ### A vicious cycle The secret societies, with its running of both legitimate as well is illegitimate businesses, clearly had great influence in society, and this was particularly great among the Chinese coolies, amongst many other groups of people. Many coolies being part of the \"pig trade\" which was controlled by the secret societies, were contracted to work in places such as the gambier and pepper plantations or opium plantations. Consequently, many were also consumers of opium, which meant they were feeding the very organisations they were working for. For coolies who became opium [addicts](/wiki/Addicts), many of them faced the consequences of being unable to clear their debts from the contracts, and being indebted and bounded even further. Likewise, the same could be said of their engagement in [vices](/wiki/Vices) like prostitution and gambling, which again came under the purview of the secret societies. These activities often came together with opium consumption and had the similar consequences of causing further indebtedness, as well as in the case of prostitution saw greater health issues such as the spread of [sexually transmitted diseases](/wiki/Sexually_transmitted_diseases). It thus formed a vicious cycle where the very people employed became consumers of what they helped to produce and become further indebted, supporting the businesses and activities of secret societies, and perpetuating this system of [exploitation](/wiki/Exploitation_of_labour). ## Secret societies and riots As seen so far, the influence and authority in which secret societies had over society was indeed significant. Such power could be wielded various ways, such as to be used in keeping order, which was something that the colonial state recognised for an extended period as a benefit of having the secret societies. However, while their power could help maintain order, it also meant that the opposite could happen as well. A couple of major [riots](/wiki/Riots) that took place during the colonial period were linked to instigations by the secret societies. The riots were significant in two aspects: Firstly, the riots were all mainly amongst members of ethnic Chinese community, which clearly showed how as mentioned the so-called ethnic Chinese \"group\" was not at all homogeneous and each saw themselves as belonging to different affiliations based on factors like dialect or place of origin in China, as well as religious differences. Secondly, the involvement of the secret societies in riots showed that while secret societies played a functional role in society, such as providing protection and guidance for new migrants as well as being a potential leader of the Chinese community to work with the colonial authorities in times of need, their involvement/ instigation of the riots proved them to be double-edge swords for the authorities, since their influence can be both beneficial but at the same time destructive if left unchecked. Such would later have a great influence on the mindset of the colonial authorities as well as the subsequent impact on the policies towards secret societies. ### Anti-Catholic riots The first of which was the Anti-Catholic Riots which took place from February 15–20, 1851, with an estimated 500 dead. The reasons for the riots were due to the successes in which the Catholics had in having converts to [Catholicism](/wiki/Catholicism), which meant that the pool in which secret societies could draw membership from had shrunk, given the [Taoist](/wiki/Taoist) styled religious connotation that secret societies entailed. ### Teochew-Hokkien riots The second was the Teochew-Hokkien Riots, also known as the Great Riots of 1854 or the Five [Catties](/wiki/Catties) of Rice Riots, which took place three years later from 5–17 May 1854, with an almost equal death toll estimated at 480 dead, alongside another 222 injured. The riots happened due to rivalry between the two largest Chinese dialect groups, namely the Teochews and the Hokkiens. The trigger for the riot started over a rather petty issue, where on 5 May a dispute between a Hokkien shopkeeper and a Teochew buyer regarding the price of rice drew the attention of bystanders, who took sides based on their affiliations, and ended up escalating into a major riot. A major player amongst the secret societies in this incident was said to be the [Ghee Hin](/wiki/Ghee_Hin) society, which had splintered off into various groups, including Teochew and Hokkien affiliated ones respectively. ## Beginnings of decline While secret societies were initially for a significant period seen, and used by the colonial government as a means of regulating society and the ethnic Chinese population, the problems created by the secret societies, such as their involvement in the riots, saw a desire by the colonial government to rein them in. This first begin with attempts at [regulation](/wiki/Regulation), and when these attempts came to nought, it eventually resulted in strict enforcement which would lead to the decline, although not disappearance of the secret societies. ### Early attempts at regulating secret societies Constant rivalries between secret societies had been a cause for concern for the colonial authorities, who initially first sought to regulate them, due to still seeing their functional roles in society. They did so through first the Peace Preservation Act (also known as the banishment act) of 1867, followed by the 1869 [Ordinance](/wiki/Local_ordinance) for the Suppression of Dangerous Societies, and finally the establishment of [Chinese Protectorate](/wiki/Chinese_Protectorate) in 1877. The Peace Preservation Act of 1867 gave authorities the power to [deport](/wiki/Deport) Chinese immigrants convicted of crime, and thus served as a deterrence to secret societies and kept them at bay for fear of losing membership. The Ordinance for the Suppression of Dangerous Societies of 1869 would take a step further, where all societies with more than ten members had to be registered, which allowed greater scrutiny upon their activities. However, the extent to which the authorities had control was questionable since it was hard to both enforce as well as keep taps over their wide-ranging activities. The 1877 establishment of the [Chinese Protectorate](/wiki/Chinese_Protectorate) was an arguably more successful approach, with the appointment of a Chinese Protector serving as a bridge between the Chinese immigrant community and the colonial government. The appointed Protector in 1877, [William Pickering](/wiki/William_A._Pickering), was knowledgeable in Chinese customs and language, and had a good relationship with the Chinese community, allowing many potential issues and problems to be solved as he communicated effectively as the intermediary between the colonial government and the Chinese community. Pickering was also involved in the helping of exploited coolies and prostitutes. However, despite the good work, or rather due to the work being done, it was seen to affect the secret societies which thrived upon exploiting labour. This ended up in an attempted assassination of Pickering in 1887, by a purported secret society member who sought to fling an axe to his head. The incident was a failed attempt, but led to Pickering's forced retirement the following year. ### Suppression of 1890 The failure to regulate the secret societies, coupled with Pickering's attempted assassination, led to the colonial government deciding to fully curb the secret societies. The decline of secret societies in Singapore took place with the Societies Ordinance coming into effect on 1 January 1890. The Ordinance would be a strict enforcement of the previous 1869 Ordinance. This time, with the Societies Ordinance, under its provision any society with more than ten members was deemed illegal unless it was registered and received government approval. Furthermore, the Ordinance gave overarching powers to the government over the secret societies, giving them the authority to ban and dissolve any societies in which they deemed unlawful. The Societies Ordinance of 1890 dealt a major blow and led to the decline of the secret societies in colonial Singapore, but despite such, they continued to exist in smaller scales, and in varied ways and forms. ## Continued existence of secret societies in modern day Singapore Despite suppression by the colonial government, and later by the government of independent Singapore, secret societies continue to exist well into the present day, except not being in the same scale and influence today given Republic of Singapore's strict laws and enforcement. The Societies Ordinance of 1890 as mentioned did not wipe out secret societies, but rather either forced existing secret societies to go underground or break-up and form new secret societies. An example of the latter was the case for former members of the Ghee Hok Society. The end of the colonial era saw the continuation of secret societies, as well as the rise of new ones with a wide spectrum of types and means of organisation given the different societal context. Significant Malay secret societies have also arisen, such as the OMEGA gang (acronym for Orang Melayu Enter Gangster Area), which continues to exist today. There were even female dominated secret societies, such as the Red Butterfly, also known as Ang Hor Tiap. Probably the most well-known modern day secret society in Singapore would be the \"[Sah Lak Kau](/wiki/Salakau)\" or \"369\" gang. Despite strict law enforcements in Singapore, it made it into the news after a significant lapse in time when it comes to gang fights with significant casualties on 8 November 2010, involving 6 students who suffered injuries from a slashing incident, involving youths who were linked to the \"Sah Lak Kau\". In fact, as recent as 3 March 2017, raids were made due to 7 men chanting the name \"Sah Lak Kau\" during the funeral procession of an ex-member. ## Potential narratives to be further explored We see that the secret societies present in the post-colonial period are highly varied, not because this only took place post-colonial, but rather that the dominant narrative about the colonial period has yet to reflect such heterogeneity. The role of other ethnicities in secret societies have constantly been overshadowed by that of the dominant ethnic Chinese majority, and this is in a large part due to the limited research and possibly lack of sources as compared to the works being done on the Chinese secret societies. However, there has been emerging scholarship on the ethnic minorities and their roles, filling up the gaps in our understanding of secret societies in colonial Singapore. The importance of including more narratives into the dominant narrative lies in giving us a fuller picture of secret societies in colonial era Singapore. Singapore society from the past to present has always been a multi-ethnic state, and while various ethnicities may maintain their own distinctiveness to varying extents, there was no doubt still constant levels of interactions amongst all the various ethnic groups, especially given the constraint of size of a city-state like Singapore. Leaving out the narrative of the other ethnicities would not give an accurate reflection of our understanding of secret societies in colonial Singapore, and hopefully more research would be carried out in these areas. ### Ethnic Indians and secret societies Emerging research has shown that Indian secret societies did play significant roles in colonial Singapore, disproving of the dominating narrative of other ethnic secret societies being insignificant in comparison to the Chinese secret societies. Well in the early years around 1831, Indians had their own secret societies alongside the existing Chinese ones, namely the Red Flag and White Flag. The Red and White Flag respectively showed how there was great diversity amongst and within secret societies, as while both groups comprised mainly Indian [Muslims](/wiki/Muslims), there were also Indian [Hindus](/wiki/Hindus), [Jawi Peranakans](/wiki/Jawi_Peranakan) and [Malays](/wiki/Malays_(ethnic_group)), which showed how secret societies transcended religion and ethnicity. The trend of authorities having a hand in collaboration with secret societies is again seen with the case of the Red Flag and White Flag, where ethnic Indian police were bribed to join them. Also, when conflicts between these two groups broke out in the 1860s, they turned to collaborating with their Chinese secret society counterparts. Their mutual collaboration was not superficial, and went down to the level of helping each other in the daily operations of the secret societies. Paralleling the case of the Chinese secret societies, clashes between the Red Flag and White Flag, contributed to the colonial authority's clamming down of both secret societies in 1865. Like how the Chinese secret societies were initially seen as being beneficial but later clamped down as well due to the problems they caused, the story and trend is repeated here. This showed that the Indian secret societies too wielded significant influence like the Chinese secret societies, so much so that they were deemed a serious enough threat to the colonial authorities. The above shows that we should not look at secret societies as ethnically divided and isolated from one another, since they can intermix and collaborate with one another to fulfil their respective objectives. Their impact on society also goes further to prove why we need to include these narratives in our understanding of secret societies in colonial Singapore. ### Samseng and secret societies Even less mentioned in the narratives on secret societies are the Malays, of whom also played a significant role in the secret societies, in the form of Samseng, or professional thugs. While still much more research would be needed on this group, we know from records that their numbers were indeed significant and played an important role even in the major Chinese secret societies. This could be seen in the case of Ghee Hok Society, where it alone had 4,000 Samseng under its wing in 1872. ## Secret societies in colonial Singapore as an integral part of Singapore's history As with how exploring further narratives helps to give a fuller picture of secret societies in colonial Singapore, likewise to want to know about Singapore's history, in this case the colonial period, not knowing about secret societies which played a significant role in society then is akin to missing out on a big part of the colonial period history. Furthermore, the legacy of secret societies does not end with the colonial period, but carries on till the present day. While secret societies today have changed in many ways, and are far less prominent as during much of the colonial period, their existence has been of a continued permanence. Secret societies are therefore something in which we cannot ignore, and regardless of their reputation, will continue to be part of what constitutes Singapore as we know it. - [List of riots in Singapore](/wiki/List_of_riots_in_Singapore) - [Secret Societies in Singapore](/wiki/Secret_societies_in_Singapore) - [Salakau](/wiki/Salakau) - [Ghee Hin Kongsi](/wiki/Ghee_Hin_Kongsi) - [Secret society](/wiki/Secret_society) - abuse of coolies - Comber, Leon. \"Chinese Secret Societies in Malaya; an Introduction.\" *Journal of the Malayan Branch of the Royal Asiatic Society* 29.1 (173 (1956): 146–162. - Comber, Leon. *Chinese Secret Societies in Malaya: A Survey of the Triad Society from 1800 to 1900* (1959) - online review - Farrer, D. S. \"Captivation, false connection and secret societies in Singapore.\" *Martial Arts Studies* 5 (2018): 36–51. online - Freedman, Maurice. \"Immigrants and associations: Chinese in nineteenth-century Singapore.\" *Comparative studies in society and history* 3.1 (1960): 25–48. - Freedman, Maurice, and Marjorie Topley. \"Religion and social realignment among the Chinese in Singapore.\" *Journal of Asian Studies* 21.1 (1961): 3-23. - Lau-Fong Mak. *The sociology of secret societies: A study of Chinese secret societies in Singapore and peninsular Malaysia* (Oxford University Press, 1981). - Ken, Wong Lin, and C. S. Wong. \"Secret Societies in Malaya.\" *Journal of Southeast Asian History* (1960): 97–114. online - Mohamed Nasir, Kamaludeen. \"Protected Sites: Reconceptualising Secret Societies in Colonial and Postcolonial Singapore\" *Journal of Historical Sociology* (2016) 29#2 pp. 232–249. doi: 10.1111/johs.12073 online - Mak, Lau-Fong. \"The Knots of the Chinese Secret Societies in Early Singapore.\" in *A General History of the Chinese in Singapore* (2019) pp. 153–168. online - Ownby, David, and Mary F. Somers Heidhues, eds. *Secret Societies Reconsidered: Perspectives on the Social History of Early Modern South China and Southeast Asia* (Routledge, 2016) excerpt - [Pickering, William A.](/wiki/William_A._Pickering) (1878). \"CHINESE SECRET SOCIETIES AND THEIR ORIGIN.\". *Journal of the Straits Branch of the Royal Asiatic Society*. Vol. 1. pp. 63–84 – via [Wikisource](/wiki/Wikisource). JSTOR - [Pickering, William A.](/wiki/William_A._Pickering) (1879). \"\"CHINESE SECRET SOCIETIES.\" PART II.\". *Journal of the Straits Branch of the Royal Asiatic Society*. Vol. 3. pp. 1–18 – via [Wikisource](/wiki/Wikisource). - Trocki, Carl A. \"The rise and fall of the Ngee Heng Kongsi in Singapore.\" in *Secret Societies Reconsidered: Perspectives on the Social History of Early Modern South China and Southeast Asia* (Routledge, 2016) pp. 89–119.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:26.230131",
  "title": "Secret societies in colonial Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Secret_societies_in_colonial_Singapore"
}