{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:29.588217"
  },
  "content": "Singaporean home furniture company **Secretlab** is a Singaporean [furniture](/wiki/Furniture) company established by [Ian Ang](/wiki/Ian_Ang) and Alaric Choo in 2014. It primarily designs and manufactures [gaming chairs](/wiki/Gaming_chair). ## History Secretlab was founded as a [startup company](/wiki/Startup_company) in December 2014 by former professional [esports](/wiki/Esports) players [Ian Alexander Ang](/wiki/Ian_Ang) and Alaric Choo, both of whom specialised in *[StarCraft II](/wiki/StarCraft_II)*. Its starting capital, which came from the two founders' savings, was [S$](/wiki/Singapore_dollar)50,000, and went mostly into research and development. The company's first product was a [gaming chair](/wiki/Gaming_chair), the Secretlab Throne V1, that was launched in March 2015. Two more chairs, the Throne V2 and the Omega, were released in October 2015. In 2020, the company sold its millionth chair. In 2020 and 2021, during the [COVID-19 pandemic](/wiki/COVID-19_pandemic), demand for the company's chairs rose greatly, partly because of office workers who had to work from home. In April 2021, the company unveiled the Magnus, a magnetic metal desk. ## Facilities and partners The company operates its corporate headquarters, a research and development facility, and an esports gaming arena along Braddell Road, Singapore. It also has a factory in China. The company has partnered multiple times with organisers of official [esports](/wiki/Esports) tournaments, where the partnership involves Secretlab providing chairs for the players. In partnership with [HBO](/wiki/HBO), it introduced [Game of Thrones](/wiki/Game_of_Thrones)-themed gaming chairs. ## Sales and finances In August 2019, Heliconia Capital Management, a subsidiary of the Singaporean wealth fund [Temasek Holdings](/wiki/Temasek_Holdings), bought a minority stake in the company, causing its market capitalisation to reach a reported S$200–300 million. Secretlab reported 2020 chair deliveries of \"at least\" 500,000. For the fiscal year 2020, the annual operating profit and revenue were an estimated S$70 million and S$350 million respectively. In March 2021, *Tech in Asia* estimated that the company was \"within striking distance of surpassing US$1 billion in valuation\", thereby making it a [unicorn](/wiki/Unicorn_(finance)). ## Reception of products *[PC Gamer](/wiki/PC_Gamer)* named Secretlab's Omega 2020 the best gaming chair of 2019, praising it for its adjustable armrest; the same product was named best gaming chair in 2020 by *GamesRadar+*. *T3* called the Magnus the best gaming accessory of 2021, while *[IGN](/wiki/IGN)* listed the Titan Evo 2022 as the best gaming chair of 2022. In 2020, there were complaints that the covering of certain chairs sometimes peeled away; Ang commented that this was due to unexpectedly high humidity and that it was being addressed. A 2022 [University of California, Berkeley](/wiki/University_of_California,_Berkeley) study compared the Secretlab Titan Evo, whose seat pan was made with cold cure foam, with a mesh chair. Subjects were made to perform various tasks in both chairs as part of an 8-hour blind test that spanned two days. The results indicated that supportability, seat pressure distribution, and \"subjective performance on computer-based tasks\" were better with the Titan Evo. However, the study also found \"minimal differences in comfort, discomfort and pain when sitting on a fully adjustable mesh chair versus a fully adjustable foam chair.\" - Singapore portal - Companies portal - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:29.587867",
  "title": "Secretlab",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Secretlab"
}