{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:24.318432"
  },
  "content": "* *Secret societies in Singapore** have been largely eradicated as a security issue in the city-state. However many smaller groups remain today which attempt to mimic societies of the past. The membership of these societies is largely adolescent. Despite fading from contemporary Singaporean society, these [secret societies](/wiki/Secret_societies) hold great relevance to [Singapore's modern history](/wiki/History_of_Singapore). The founding of the city-state in 1819 saw the arrival of thousands of Chinese, thereby transplanting to Singapore social systems already present in China itself. Although the secret societies were commonly associated with violence, extortion and vice, they also played a part in building a social fabric for early Chinese migrants in Singapore. They were given leeway to control the Chinese populace due to the hands-off policy adopted by the British colonial government, who hoped to create stability. ## History The secret societies formed in Singapore can be traced to mid-18th century [Fujian](/wiki/Fujian) province in China, with the local offshoots adopting an organisational structure mirroring the parent organisation. The [Hongmen](/wiki/Hongmen), the first secret society to be established in Singapore, traced its origins to the [Tiandihui](/wiki/Tiandihui) in Fujian. ## Policing secret societies Despite their founding principles of mutual assistance and bonding, secret societies have, over time, come to conjure up impressions of violence and disorder. This association, perhaps exaggerated, has been encouraged by law enforcement officers since their formation in the colonial era. This perception was strengthened by several factors, including the inability of the colony's administration to control their activities, the branding of arrested society members as \"criminal gangsters\" by the media and an upsurge in violent crime in the 19th Century sparked by a few society members. These factors came together during the same period in which the country was trying to gain a foothold fresh from having attained political independence it did not foresee. Several important riots in Malayan history had prompted the colonial government to respond. These riots include the Penang Riots of 1867 (which involved the [Ghee Hin](/wiki/Ghee_Hin_Kongsi)) and the Post Office Riots of 1876. The Societies Ordinance of 1889 was introduced as an attempt at suppression. ## Reasons for the decline In the early 19th century, secret societies posed a significant threat to law and order in Singapore. The early Chinese immigrants' clandestine activities and occasional turf wars proved too much of a problem for the British authorities. The British authorities were therefore obliged to curb the growing problem. They employed a number of methods, both on purpose and not, to check the growth of secret societies. This resulted in the decline of secret societies. ### Singapore becoming a Crown Colony The transfer of authority over Singapore from the [Indian Government](/wiki/Government_of_India) to the colonial office in London is considered by most to be the most important factor that helped the British colonial government check the growth of secret societies. The elevation of Singapore to a [Crown Colony](/wiki/British_Overseas_Territories) meant that London was willing to spend money and resources and provide proper administrators which it had been unprepared to do. Thus, Singapore was given a significantly larger priority, and only with the transfer of power, could the authorities initiate the following changes. ### Legislation of strict laws The legislation of strict laws had an enormous effect in checking the growth of the secret societies. Two significant laws were passed in the 1860s. The first was the Peace Preservation Act (also known as the banishment act) of 1867, which gave the colonial government the power to detain and deport [Chinese immigrants](/wiki/Overseas_Chinese) who were convicted of crime. This was a major weapon against the secret societies members as it created fear and deterred the immigrants from joining the secret societies. With this law, the power of the secret societies was significantly curtailed. In 1869, the Peace Preservation Act was amended, and the Dangerous Societies Suppression Ordinance was also enacted. This required that secret societies be registered. By requiring only the societies, and not the individual members, to be registered, the police attracted people to go to provide insight on the actual strength of the societies. 10 societies, 618 office bearers and 12371 members were registered in the first round of registrations. This ordinance also accorded the colonial government the power to inspect any society that was deemed dangerous to public peace. This way the colonial government could monitor the activities of the secret societies closely. This prevented the Chinese immigrants from joining the secret societies, causing it to reduce in influence in Singapore in the 19th century. ### Improvements to police force In 1843, there were only 133 police personnel. Even if the army of 595 men was brought in, they were still no match for the Chinese community consisting of 32,132 people (most of whom were secret society members). [Thomas Dunman](/wiki/Thomas_Dunman), the first [Commissioner of Police](/wiki/Commissioner_of_Police_(Singapore)), wrote that his police force was underpaid and drew salaries lower than the average coolies. By 1865, there were 385 policemen to 50,043 Chinese, but the ratio of policemen to Chinese was still too few to be effective. This was compounded by the fact that no one in the police force was qualified to deal with the Chinese. The officers' posts were held by Europeans while Indians made up the rank and file. No Chinese were employed because of their possible dealings with secret societies. Thus, the police force was ignorant of the language and ways of the Chinese, which was also the most volatile community. So ineffective was the police force that the wealthy had to hire private watchmen and carry personal arms to ensure their own safety. However, after Singapore became a Crown Colony, large improvements were made to the local police force. This was an important factor that helped check the growth of secret societies. The police force started to receive more funding, better equipment and proper training. All these made the police force a much more effective force than it had been under the rule of the British. Even more significant was the hiring of Chinese police officers who could understand and deal with the problems associated with the secret societies. ### Establishment of Chinese Protectorate The establishment of the [Chinese Protectorate](/wiki/Chinese_Protectorate) is yet another factor that led to the societies' growth being checked. The first Chinese Protector, [William Pickering](/wiki/William_A._Pickering), maintained close contact with the Chinese immigrant community and provided them with assistance. Being fluent in written and spoken Mandarin as well as in other [varieties of Chinese](/wiki/Varieties_of_Chinese), Pickering looked after the welfare of the newly arrived coolies, prevented coolie abuse and kept track of the numbers of coolies leaving and arriving. Pickering also licensed coolie depots. To qualify for a licence, the depots required a constant and plentiful supply of water and good ventilation. He also visited the coolies to ask them in person what their connections in Singapore were, making sure they had someone to turn to during their stay. This establishment of the Chinese Protectorate let the British sustain, for the first time in history of Singapore, a satisfactory relationship with the Chinese community. Pickering was known affectionately as daren (大人), Chinese for 'Sir'. The Protectorate effectively became a legitimate alternative where migrants could come and try solve their problems, instead of putting it forward to the societies for a normally violent conclusion. It thus helped to deter many new immigrants from increasing the membership of secret societies. - [Secret societies in colonial Singapore](/wiki/Secret_societies_in_colonial_Singapore) - [Salakau](/wiki/Salakau) - [Ang Soon Tong](/wiki/Ang_Soon_Tong) - [Ah Kong](/wiki/Ah_Kong) - [Ghee Hin Kongsi](/wiki/Ghee_Hin_Kongsi) - [Chung Keng Quee](/wiki/Chung_Keng_Quee) - [Hai San Secret Society](/wiki/Hai_San_Secret_Society) - [List of Chinese criminal organizations](/wiki/List_of_Chinese_criminal_organizations) - [Tan Kim Ching](/wiki/Tan_Kim_Ching) - [Triad (underground society)](/wiki/Triad_(underground_society)) - Chwee, Cheng Foon (2003). \"Secret societies in Singapore: Survival strategies, 1930s to 1950s\" (PDF). - Mohamed Nasir, Kamaludeen. \"Protected Sites: Reconceptualising Secret Societies in Colonial and Postcolonial Singapore\" *Journal of Historical Sociology* (2016) 29#2 pp. 232–249. - Lim, Irene (1999). *Secret Societies in Singapore (Featuring the William Stirling Collection)*. National Heritage Board, Singapore History Museum. [ISBN](/wiki/ISBN_(identifier)) 978-9813018792. - \"Tracing the origins of Singapore gangs\". [AsiaOne](/wiki/AsiaOne). 16 November 2010. Archived from the original on 20 November 2010.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:24.318146",
  "title": "Secret societies in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Secret_societies_in_Singapore"
}