{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:31.243009"
  },
  "content": "Singapore public housing redevelopment programme The **Selective En bloc Redevelopment Scheme**, or **SERS** for short, is an urban [redevelopment](/wiki/Redevelopment) strategy employed by the [Housing and Development Board](/wiki/Housing_and_Development_Board) in Singapore in maintaining and upgrading public housing flats in older estates in the city-state. Launched in August 1995, it involves a small selection of specific flats in older estates which undergo [demolition](/wiki/Demolition) and redevelopment to optimise land use, as opposed to [upgrading](/wiki/Renovation) of existing flats via the [Main Upgrading](/wiki/Main_Upgrading_Programme) and Interim Upgrading Programmes. To date, 82 SERS sites have been announced, of which 77 were completed. The implementation of SERS also depends on the availability of replacement sites and the Government's financial resources. It will be replaced by *Voluntary Early Redevelopment Scheme* (VERS) in 20 years time. Only 4% of HDB flats have been identified for SERS since it was launched in 1995. All residents displaced by the redevelopment works are offered a new 99-year lease in new flats constructed nearby. These residents have the privilege to select their units prior to public release of the remaining units, are compensated financially, and are given subsidised prices for their new flats. The scheme also gives residents the opportunity to continue living near their kin and neighbours, thereby retaining kinship bonds and strengthening community ties. The Selective En bloc Redevelopment Scheme has attracted opposition and controversy. The national government has power, under the Land Acquisitions Act of 1966, to carry out the Selective En Bloc scheme. This power invokes the principle of [eminent domain](/wiki/Eminent_domain) as with most urban redevelopment projects. In April 2020, to deal with the [COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore) in foreign worker dormitories, it was announced that HDB blocks in Bukit Merah which had been purchased as part of the SERS would be used to temporarily house those foreign workers who were well and worked in critical services. ## References and notes -\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:31.242551",
  "title": "Selective En bloc Redevelopment Scheme",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Selective_En_bloc_Redevelopment_Scheme"
}