{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:39.904229"
  },
  "content": "Planning area and regional centre in North-East Region, Singapore **Seletar** (/səˈliːtɑːr/ *sə-LEE-tar*) is the [regional centre](/wiki/Regional_centre_(Singapore)) of the [North-East Region](/wiki/North-East_Region,_Singapore) of [Singapore](/wiki/Singapore). The place name was derived from the Malay subgroup who were indigenous to the area, the *Orang Seletar*. It shares boundaries with the [planning areas](/wiki/Planning_areas_of_Singapore) of [Sengkang](/wiki/Sengkang) to the south, [Punggol](/wiki/Punggol) to the east, [Yishun](/wiki/Yishun) and [Simpang](/wiki/Simpang) to the west, as well as the [Straits of Johor](/wiki/Straits_of_Johor) to the north. Formerly a [Royal Air Force](/wiki/Royal_Air_Force) (RAF) [military airbase](/wiki/Seletar_Airport) site, the area now houses the [Seletar Aerospace Park](/wiki/Seletar_Aerospace_Park). The [aerospace](/wiki/Aerospace) park houses industries specialising in [aircraft maintenance](/wiki/Aircraft_maintenance) and repair services. Despite its status as a regional centre, the area remains relatively rural in a local context, with more residential and commercial developments being constructed in the neighbouring planning area of Punggol. There remains future plans to transform Seletar into one of Singapore's regional centres, along with [Jurong East](/wiki/Jurong_East), [Tampines](/wiki/Tampines) and [Woodlands](/wiki/Woodlands,_Singapore). ## Geography ### Geographical extent According to the book *Down the Seletar River: Discovering a Hidden Treasure of Singapore*, Seletar generally refers to a region defined by the [Ponggol River](/wiki/Sungei_Punggol) to the east, the [Seletar River](/wiki/Lower_Seletar_Reservoir) to the west, [Ang Mo Kio](/wiki/Ang_Mo_Kio) to the south and the [Straits of Johore](/wiki/Straits_of_Johore) to the north. It includes the areas covering [Yio Chu Kang](/wiki/Yio_Chu_Kang), [Jalan Kayu](/wiki/Jalan_Kayu), [Lower Seletar Reservoir](/wiki/Lower_Seletar_Reservoir) and a part of [Upper Thomson](/wiki/Thomson,_Singapore). ### Seletar Planning Area Seletar Planning Area, as defined by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), shares a land boundary with planning areas of [Sengkang](/wiki/Sengkang) to the south, riverine boundaries with [Punggol](/wiki/Punggol) to the east and [Yishun](/wiki/Yishun) to the west. Its northern boundary is made up by the [Straits of Johor](/wiki/Straits_of_Johor). Seletar Planning Area is officially divided into 4 subzones – Seletar, Seletar Aerospace Park, Pulau Punggol Barat and Pulau Punggol Timor. ## History The area was home to the indigenous [Malay](/wiki/Malays_(ethnic_group)) population, especially the *[Orang Seletar](/wiki/Orang_Seletar)* (Malay for *Seletar people*) - a subgroup of [Malay sea gypsies](/wiki/Orang_Laut) living on the waters of the island. There were already hundreds of them even before the arrival of Raffles. Seletar was originally a rubber plantation estate owned and managed by the Singapore United Rubber Plantations Ltd. In 1923, the Straits Settlement government bought 600 acres (2.4 km2) from the Singapore United Rubber Plantations Ltd and gave it to the British [Royal Air Force](/wiki/Royal_Air_Force) as a site for its military air base in Singapore. Construction of the airfield was completed in 1929 and it was officially opened in 1930. The airfield was the first RAF base east of India and had also served as a civilian airport until 1937, when [Kallang Airport](/wiki/Kallang_Airport) was opened to the public. The Seletar Reservoir (now known as [Upper Seletar Reservoir](/wiki/Upper_Seletar_Reservoir)), was first built in 1920, after the First World War to cope with the water demand in Singapore. It was marked as a conservation site in August 1999. The area is also dotted with colonial bungalows that were built for the military personnel of the RAF, which still stands today. In 2007, the government announced that some 174 bungalows has been set aside for demolition to make way for the new Seletar Aerospace Park, while the remaining 204 bungalows will be retained and some of these units will be converted into aerospace training schools and food and beverage outlets, while 131 units will be set aside for residential use. - [Seletar Airport](/wiki/Seletar_Airport) ## Sources - Victor R Savage, Brenda S A Yeoh (2003), *Toponymics – A Study of Singapore Street Names*, Eastern Universities Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-205-1\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:39.903822",
  "title": "Seletar",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Seletar"
}