{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:36.340142"
  },
  "content": "Primary school in Singapore **Selegie Integrated Primary School** was a primary school in Singapore. Located at 1A Short Street near the junction with Selegie Road, the school opened in 1963 and operated until it merged with another school in 1987. The building later served as the Selegie campus of the [Nanyang Academy of Fine Arts](/wiki/Nanyang_Academy_of_Fine_Arts) (NAFA). At the time of its completion, Selegie Integrated Primary School had the tallest school building in [Asia](/wiki/Asia). ## History On 14 October 1960, [Yong Nyuk Lin](/wiki/Yong_Nyuk_Lin), [Minister for Education](/wiki/Ministry_of_Education_(Singapore)), announced that the 10-storey Selegie Integrated Primary School would be built at the junction of Selegie Road and Short Street at a cost of $660,000. The school was to have 38 classrooms for 3,000 children attending morning and afternoon sessions. The school's construction began in the middle of 1961 and was to end in the following year. The school featured two lifts which could carry 40 students each, two dental clinics cum dressing rooms, two kitchens, two canteens, a bookshop, a store and an assembly hall that was located in a separate block. It was officially opened by [Deputy Prime Minister of Singapore](/wiki/Deputy_Prime_Minister_of_Singapore) [Toh Chin Chye](/wiki/Toh_Chin_Chye) on 19 January 1963. The \"skyscraper school\" was the tallest school building in Southeast Asia at the time of its completion, a title it continued to hold until 1973. According to *Roots*, which is published by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)), the building's \"pragmatic box-like framework is characteristic of industrial modernism – a no-frills architecture style that mimicked machinery to appear more modern.\" The school merged with the Stamford Primary School in 1987, after which it moved into the latter's premises. Beginning in 1990, the building was leased to the NAFA as its Selegie Campus. In 2015, the building was acquired by the Centurion Corporation. The building were subsequently acquired by the Centurion Corporation in 2015. It was later used as a student accommodation had been returned to the state since the end of the [pandemic](/wiki/COVID-19_pandemic). According to [MOH](/wiki/Ministry_of_Health_(Singapore)) media release on 7 August 2023, the site had been selected to provide accommodation for foreign healthcare workers who are new to Singapore and employed by the public healthcare institutions.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:36.339703",
  "title": "Selegie Integrated Primary School",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Selegie_Integrated_Primary_School"
}