{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:35.010363"
  },
  "content": "Residential complex in Singapore **Selegie House** is a public housing complex which includes blocks 8-10 along Selegie Road in Singapore. ## History Selegie House is sandwiched between Selegie Road, Short Street and Rochor Canal Road and was part of the urban renewal scheme in 1960s. Prior to its construction, the plot of land had 3 lanes- Veerappa Chitty Lane, Annamalai Chetty Lane, and Swee Hee Lane. The street stretch from Albert Court to New Bugis Street. Veerappa Chitty Lane, Annamalai Chetty Lane, Swee Hee Lane, Nagapa Lane, might have been named to reflect the enclaves and community gatherings (Indian and Chinese) that used to occupy the site where Selegie House is now. SIT buildings and hawker food used to line along Albert Street from 1950s. Military barracks that housed [Sepoys](/wiki/Sepoy) and British soldiers was once located at short street around 1819. Construction of Selegie House as a mixed residential building project begun in 1962, costing $3.8 million, a labour of 151,212 people, and supply of used materials from local quarries. The complex included three larger blocks, with the tallest being twenty stories high, which made it the 5th tallest modern housing in Singapore at the time of its opening. The blocks were originally interlinked by four rows of two-storey blocks which were later demolished and replaced with link ways. The tallest block included a glass enclosure at the twentieth floor for sightseeing. It was also completed in a record time of 18 months and adorned the cover of the HDB’s 1963 Annual Report. The complex was scheduled to be opened on 1 June 1963, but it was rescheduled to a day earlier and inaugurated by Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) on 31 May 1963. HDB recreation club was created in 1964 and used to hold rooftop parties at Selegie House. The rental flats in the complex costed $120 per month at the time of its opening. However, the complex did not include a multi-storey car park. When HDB first started, the flats were initially designated solely for rental to aid low income Singaporeans. However, in 1964, HDB decided to release the flats for sale instead. By 1968, policies were formulated so that Singaporeans could use their CPF to pay and own an HDB flat. [Halimah Yacob](/wiki/Halimah_Yacob), sworn in as the 8th President of the Republic of Singapore on 14 September 2017, the first female President in Singapore's history was a notable resident at Selegie House. By the 1970s, the building was sensationalised by tabloid newspaper due to reports of suicidal attempts by jumpers. Around 1980s, residents moved out to pursue new neighbourhoods with better amenities. There were also new residents who moved to Selegie House due to its proximity to City Centre. On 4 April 1997, the government expanded [Main Upgrading Programme](/wiki/Main_Upgrading_Programme) in batches for HDB flats, which included Selegie House under batch 11.The flat owners had been billed accordingly on 20 July 2004. In May 1998, a majority of residents of the complex voted for upgrades and better amenities for the complex. In 2003, the complex received a new gateway, drop-off porches, a playground, sheltered walkways and a pavilion. The building can be conveniently located in between [Little India MRT station](/wiki/Little_India_MRT_station) and [Rochor MRT station](/wiki/Rochor_MRT_station) within 5 to 10 minutes walking distance. Since 2006, Lee Tor Joon and his wife, residents of Selegie House had been helping their neighbours to put up Singapore's national flag every year on national day. Soon after, the building was featured on television and became a favourite amongst photo enthusiasts during national day. On 10 March 2008, [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) unveiled plans for Ophir-Rochor Corridor for Rochor district (which Selegie House was situated). The redevelopment plan was to increase offices, hotels, residential and other complementary facilities set within a park-like environment over the next 10–15 years. The district had since been rebranded as arts, education and culture district under Rochor Planning Area. The building was proudly featured in \"Experience Singapore\", issue 47 in 2013. Since 2018, major redevelopments had been ongoing near Selegie House, from the en-bloc and redevelopment of Golden Wall Centre (en bloc for value of 276.2 million sgd), Peace Center, Peace Mansion (en-bloc for 650 million sgd) to redevelopments of Selegie Center (en bloc for 120 million sgd) into new hotels along Selegie Road and construction of [North South Corridor](/wiki/North%E2%80%93South_Corridor,_Singapore). 1°18′12″N 103°50′53″E﻿ / ﻿1.3032°N 103.8481°E﻿ / 1.3032; 103.8481\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:35.010047",
  "title": "Selegie House",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Selegie_House"
}