{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:44.798894"
  },
  "content": "Historical progress from UK colony (1819) to sovereign state (1965)This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Self-governance of Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2020)* *(Learn how and when to remove this message)*Part of a series on the[History of Singapore](/wiki/History_of_Singapore)[Early history](/wiki/Early_history_of_Singapore) (pre-1819)[Srivijaya](/wiki/Srivijaya)650–1377[Temasek](/wiki/Temasek), [Long Ya Men](/wiki/Long_Ya_Men), [Ban Zu](/wiki/Ban_Zu)c.14th century[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)1299–1398[Majapahit](/wiki/Majapahit)1398–1400[Malacca Sultanate](/wiki/Malacca_Sultanate)1400–1528[Johor Sultanate](/wiki/Johor_Sultanate)1528–1819British colonial era (1819–1942)[Founding](/wiki/Founding_years_of_modern_Singapore)1819–1826[Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements)1826–1867[Crown colony](/wiki/Singapore_in_the_Straits_Settlements#Crown_colony_(1867–1942))1867–1942[Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) (1942–1945)[Fall of Singapore](/wiki/Fall_of_Singapore)1942[Sook Ching](/wiki/Sook_Ching)1942[Double Tenth incident](/wiki/Double_Tenth_incident)1943[Post-war period](/wiki/Colony_of_Singapore) (1945–1962)[First Legislative Council](/wiki/History_of_Singapore#First_Legislative_Council_(1948–1951))1948–1951[Maria Hertogh riots](/wiki/Maria_Hertogh_riots)1950[Second Legislative Council](/wiki/History_of_Singapore#Second_Legislative_Council_(1951–1955))1951–1955[Anti-National Service Riots](/wiki/1954_National_Service_riots)1954Internal self-government (1955–1963)[Hock Lee bus riots](/wiki/Hock_Lee_bus_riots)1955[Singapore Glass Factory strikes](/wiki/Singapore_Glass_Factory_strikes)1960[Pulau Senang prison riots](/wiki/Pulau_Senang_prison_riots)1963[Merger with Malaysia](/wiki/History_of_the_State_of_Singapore_(Malaysia)) (1963–1965)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)1962[Operation Coldstore](/wiki/Operation_Coldstore)1963[Race riots in Singapore](/wiki/1964_race_riots_in_Singapore)1964[MacDonald House bombing](/wiki/MacDonald_House_bombing)1965[Republic of Singapore](/wiki/History_of_the_Republic_of_Singapore) (1965–present)[ASEAN Declaration](/wiki/ASEAN_Declaration) ([ASEAN](/wiki/Association_of_Southeast_Asian_Nations))1967[1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore)1969[Laju incident](/wiki/Laju_incident)1974[Operation Spectrum](/wiki/Operation_Spectrum)1987[Asian financial crisis](/wiki/1997_Asian_financial_crisis#Singapore)1997[Embassies attack plot](/wiki/Singapore_embassies_attack_plot)2001[H1N1 pandemic](/wiki/2009_swine_flu_pandemic_in_Asia#Singapore)2009–2010[Bus drivers' strike](/wiki/2012_Singapore_bus_drivers%27_strike)2012[Little India riot](/wiki/2013_Little_India_riot)2013[2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit)2018[COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore)2020–2022By topic - [Timeline](/wiki/Timeline_of_Singaporean_history) - [Riots](/wiki/List_of_riots_in_Singapore) - [Military](/wiki/Military_history_of_Singapore) Singapore portal - v - t - e The **self-governance of Singapore** was carried out in several stages. Since [the founding](/wiki/Founding_years_of_modern_Singapore) of [Singapore](/wiki/Singapore) in 1819, Singapore had been under the [colonial rule](/wiki/Colony_of_Singapore) of the British. The first local elections on a limited scale for several positions in the [government of Singapore](/wiki/Government_of_Singapore) started in 1948 following an amendment to the [Constitution of Singapore](/wiki/Constitution_of_Singapore). This was further amended with the *Rendel Constitution*, strengthening local representation. Singapore was granted full internal self-government in 1959, but the colonial administration still controlled external relations and shared control of several key internal policies such as [internal security](/wiki/National_security). In 1963, [Singapore joined Malaysia](/wiki/Singapore_in_Malaysia), relieving it of colonial rule and becoming an autonomous state within the [Malaysian federation](/wiki/Malaysia). After a fallout in the [relations](/wiki/PAP-UMNO_relations) between the [United Malays National Organisation](/wiki/United_Malays_National_Organisation) (UMNO) and the [People's Action Party](/wiki/People%27s_Action_Party) (PAP), the [ruling parties](/wiki/Ruling_party) of the Federation and Singapore respectively, full independence came about with [Singapore's expulsion from Malaysia in 1965.](/wiki/Singapore_in_Malaysia#Expulsion) ## Yearning for independence Following the end of the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) during [World War II](/wiki/World_War_II), the British returned to power in Singapore. On 1 April 1946, the [Straits Settlements](/wiki/Straits_Settlements) was dissolved and Singapore became a separate [crown colony](/wiki/Colony_of_Singapore) with a civil administration headed by a [Governor](/wiki/List_of_governors_of_Singapore). In July 1947, separate Executive and legislative councils were established and the first local election for six members of the [Legislative Council](/wiki/Legislative_Council_of_Singapore) was held in the [1948 Legislative Council elections](/wiki/1948_Singapore_general_election). The [Singapore Progressive Party](/wiki/Singapore_Progressive_Party) (SPP), a political party with a [progressive](/wiki/Progressivism) platform of working with the British for gradual reform and self-governance, won half of the seats. This was technically a [plurality](/wiki/Plurality_(voting)), as independent candidates won the other three: the SPP became the ruling party of the local representation. The majority of seats were still appointed by the colonial administration. However, the early political leaders in Singapore did not press for self-government. These early leaders were organised into two main parties, the Malayan Democratic Union (MDU) and the SPP. The MDU wanted Singapore to join the Federation of Malaya. The SPP wanted eventual self-government, but was too comfortable with the existing situation of cooperating with the British colonial government to set a target date. The period after the war saw a political awakening amongst the local populace and the rise of [anti-colonial](/wiki/Anti-colonialism) and nationalist sentiments, epitomised by the slogan *[Merdeka](/wiki/Merdeka)*, or \"independence\" in the Malay language. An important anti-colonial incident was the [Maria Hertogh riots](/wiki/Maria_Hertogh_riots). The British, on their part, were prepared to embark on a program of gradually increasing [self-governance](/wiki/Self-governance) for Singapore and Malaya, although the British wanted to retain control of Singapore because of its important port facilities and resources of rubber. The prospects for self-government or independence for Singapore was initially deemed to be less than optimistic. Within Singapore itself, there was little demand for self-government, let alone independence. The communists were the only group that wanted the British to leave, and the communist party was illegal. In fact, the independence movement led by the communists convinced non-communists that British presence was needed to prevent the communists from taking over the government. In 1953, a British Commission, headed by [Sir George Rendel](/wiki/George_William_Rendel), proposed a limited form of self-government for Singapore. A new [Legislative Assembly](/wiki/Legislative_Assembly_of_Singapore) with twenty-five out of thirty-two seats chosen by popular election would replace the Legislative Council, from which a [Chief Minister](/wiki/Chief_Minister) as [head of government](/wiki/Head_of_government) and Council of Ministers as a cabinet would be picked under a [parliamentary system](/wiki/Parliamentary_system). The British would retain control over areas such as [internal security](/wiki/National_security) and [foreign affairs](/wiki/Foreign_policy), as well as veto power over legislation. The [1955 election for the Legislative Assembly](/wiki/1955_Singaporean_general_election) held on 2 April 1955 was a lively and closely fought affair, with several newly formed political parties joining the fray. Unlike previous elections, voters were automatically registered, expanding the electorate to around 300,000. The SPP was soundly defeated in the election, winning only four seats. The newly formed, left-leaning [Labour Front](/wiki/Labour_Front) was the biggest winner with ten seats and it formed a coalition government with the [UMNO](/wiki/United_Malays_National_Organisation)-[MCA](/wiki/Malaysian_Chinese_Association) Alliance, which won two seats. Another new party, the [leftist](/wiki/Left-wing_politics) [People's Action Party](/wiki/People%27s_Action_Party) (PAP), won three seats. ## Partial internal self-government (1955–1959) The leader of the Labour Front, [David Marshall](/wiki/David_Marshall_(Singaporean_politician)), became the first Chief Minister of Singapore. He presided over a shaky government, receiving little co-operation from either the colonial government or the other local parties. In May 1955, the [Hock Lee Bus Riots](/wiki/Hock_Lee_Bus_Riots) broke out, killing four people, and seriously discredited [Marshall's government](/wiki/Chief_ministership_of_David_Marshall). The [Chinese Middle School riots](/wiki/Chinese_Middle_School_riots) broke out in 1956 among students in schools such as the [Chinese High School](/wiki/The_Chinese_High_School_(Singapore)), further increasing the tension between the local government and the Chinese students and unionists who were perceived. In April 1956, Marshall led a delegation to London to negotiate for complete self-rule in the [Merdeka Talks](/wiki/Merdeka), but the talks fell through due to British concerns about communist influence and unrest and [labour strikes](/wiki/Strike_action) from workers and from trade unions which were undermining Singapore's economic stability. Marshall continued to pressure the British, before declaring that if the British did not give Singapore self-rule, he would resign. However, the British were unrelenting and wanted to retain important control over Singapore's internal security. Marshall resigned following the failure of the talk. His successor as Chief Minister, [Lim Yew Hock](/wiki/Lim_Yew_Hock), launched a crackdown on communist and leftist groups, imprisoning many trade union leaders and several pro-communist members of the PAP under the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)). The British government approved of Lim's tough stance against communist agitators, and when a new round of talks was held beginning 11 March 1957, they were amenable to granting almost complete self-government, only retaining control over external security, and allowing internal security to be an area of shared responsibility between the local government and them. When the talks concluded on 11 April, it was agreed that a State of Singapore would be created, with its own citizenship. The Singapore Citizenship Ordinance 1957, which commenced on 1 November 1957, granted Singaporean citizenship to all people who were born in Singapore (except children of diplomats and enemy aliens). People who were born in the Federation of Malaya or citizens of the United Kingdom and Colonies who had been resident for two years, and others who had been resident for eight years were able to register or naturalise as Singaporean citizens. The Legislative Assembly would be expanded to fifty-one members, entirely chosen by popular election, and the Prime Minister and Cabinet would control all aspects of government except defence and foreign affairs. On 1 August 1958, the State of Singapore Act would be given royal assent after having been passed by the Parliament on 24 July, providing for the establishment of the State of Singapore. The British-appointed Governor was to be replaced by a *[Yang di-Pertuan Negara](/wiki/Yang_di-Pertuan_Negara)*, to represent [Queen Elizabeth II](/wiki/Queen_Elizabeth_II), who remained titular [head of state](/wiki/Head_of_state). The British government would be represented by a Commissioner, who had responsibility for defence and foreign policy, apart from trade and cultural relations, and would preside over an Internal Security Council, consisting of three members from the [United Kingdom](/wiki/United_Kingdom), three from Singapore (including the [Prime Minister](/wiki/Prime_Minister_of_Singapore)) and one from the [Federation of Malaya](/wiki/Federation_of_Malaya). ## Full internal self-government (1959–1963) [Elections for the new Legislative Assembly](/wiki/1959_Singapore_general_election) were held in May 1959. This time round, the PAP swept the election, winning forty-three of the fifty-one seats. They had accomplished this by courting the Chinese-speaking majority, particularly those in the labour unions and radical student organisations. The leader of the PAP, [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), became the first Prime Minister of Singapore. The PAP's victory was viewed with dismay by foreign and local business leaders. Although Lee and the other leaders of the PAP hailed from the \"moderate\" wing of the party, many of the other members were staunchly pro-communist. Many businesses promptly shifted their headquarters from Singapore to Kuala Lumpur. Despite these ill omens, the PAP government embarked on a vigorous program to address Singapore's various economic and social problems. The plan for the economy was overseen by the capable [Goh Keng Swee](/wiki/Goh_Keng_Swee), the new Minister of Finance, whose strategy was to encourage foreign and local investment using a wide variety of measures, ranging from low tax rates and [tax holidays](/wiki/Tax_holiday) to the establishment of a new [industrial estate](/wiki/Industrial_estate) in the [Jurong](/wiki/Jurong) area. At the same time, the education system was revamped with the goal of suiting the workforce to the needs of employers; more [technical](/wiki/Technical_school) and [vocational schools](/wiki/Vocational_education) were established, and [English](/wiki/English_language) was promoted over [Chinese](/wiki/Chinese_language) as a language of instruction. The long-standing problem of labour unrest was suppressed by consolidating existing labour unions, sometimes forcibly, into a single umbrella organisation, the [National Trades Union Congress](/wiki/National_Trades_Union_Congress) (NTUC), which was closely affiliated with the government. On the social front, an attack was launched on the long-standing housing problem by an aggressive and well-funded public housing program, overseen by the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB). Headed by the banker and industrialist [Lim Kim San](/wiki/Lim_Kim_San), the HDB constructed more than 5,000 high-rise, low-cost apartments during its first two years of operation. ## Campaign for Malaysia Despite their successes in governing Singapore, the leaders of the PAP, including Lee and Goh, believed that Singapore's future lay with Malaya. They felt that the historical and economic ties between Singapore and Malaya were too strong for them to continue as separate nations, and campaigned vigorously for a merger. On the other hand, the sizeable pro-communist wing of the PAP were strongly opposed to the merger, fearing a loss of influence; the government in Kuala Lumpur, headed by ruling party [United Malays National Organisation](/wiki/United_Malays_National_Organisation), was staunchly anti-communist, and would support the PAP in such an event against them. The UMNO leaders were also sceptical of the idea; there was some distrust of the PAP government, and some were concerned that a merger with Singapore, with its large urban Chinese population, would alter the racial balance on which their political power base depended. The issue came to a head in 1961, when [Ong Eng Guan](/wiki/Ong_Eng_Guan), a long-standing member of the PAP, stormed out of the party and beat a PAP candidate in a subsequent by-election, a move that threatened to bring down Lee's government. Faced with the prospect of a takeover by the pro-communist wing of the PAP, UMNO did an about-face on the merger. On 27 May, Malaya's Prime Minister, [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman), mooted the idea of [Malaysia](/wiki/Malaysia), comprising the existing Federation of Malaya, Singapore, [Brunei](/wiki/Brunei) and the British Borneo territories of [Sabah](/wiki/Sabah) and [Sarawak](/wiki/Sarawak). They held to the idea that the additional Malay population in the Borneo territories would offset Singapore's Chinese population. The Malaysia proposal ignited the long-brewing conflict between the moderates and pro-communists in the PAP. The pro-communists, led by [Lim Chin Siong](/wiki/Lim_Chin_Siong), left the PAP to form a new opposition party, the [Barisan Sosialis](/wiki/Barisan_Sosialis) (Socialist Front), to campaign against entry into Malaysia under the conditions that the PAP wished. In response, Lee [called for a referendum](/wiki/1962_Merger_Referendum_of_Singapore) on the merger, to be held in September 1962, and initiated a vigorous campaign in advocation of their proposal of merger, possibly aided by the fact that the government had a large influence over the media. The referendum did not have an option of objecting to the idea of merger because no one had raised the issue in the Legislative Assembly before then. However, the method of merger had been debated, by the PAP, [Singapore People's Alliance](/wiki/Singapore_People%27s_Alliance) and the Barisian Sosialis, each with their own proposals. The referendum was called therefore, was to resolve this issue. The referendum called had three options. Singapore could join Malaysia, but would be granted full autonomy and only with fulfilment of conditions to guarantee that, which was option A. The second option, option B, called for full integration into Malaysia without such autonomy, with the status of any other state in Malaysia. The third option, option C, was to enter Malaysia \"on terms no less favourable than the Borneo territories\", noting the motive of why Malaysia proposed the Borneo territories to join as well. ### Referendum on joining Malaysia After the referendum was held, the option A received 70% of the votes in the referendum, with 26% of the ballots left blank as advocated by the Barisan Sosialis to protest against option A. The other two plans received less than two percent each. On orders from Prime Minister Lee Kuan Yew, Operation Coldstore was carried out in Singapore on 2 February 1963 with the arrest of more than 150 journalists, labor and student leaders, and members of political parties who opposed Lee's People's Action Party (PAP). On 9 July 1963, the leaders of Singapore, Malaya, Sabah, Sarawak and the United Kingdom signed the [Malaysia Agreement](/wiki/Malaysia_Agreement) to establish [Malaysia](/wiki/Malaysia), which was planned to come into being on 31 August. Tengku Abdul Rahman later changed the date to 16 September to allow the United Nations to complete a survey with the people of Sabah and Sarawak on the merger. On 31 August, Singapore declared its independence from the United Kingdom, with Yusof bin Ishak as the head of state (Yang di-Pertuan Negara) and Lee Kuan Yew as prime minister; sixteen days later, Singapore would join the Federation of Malaysia. Singapore held polls for a general election as a state of Malaysia five days after the merger in the [1963 state elections](/wiki/1963_Singapore_general_election) on 21 September 1963. The PAP won 71% of the seats, defeating the Barisan Sosialis, but their popular vote had slipped to 46.9%. ### The difficulties of merger Due to worsening [PAP-UMNO relations](/wiki/PAP-UMNO_relations), Singapore's status in Malaysia became increasingly tense as time went on. Singapore retained its autonomy, but differences in racial policy concerning issues of [racial discrimination](/wiki/Racial_discrimination) affected Singapore. The UMNO backed [Article 153 of the Constitution of Malaysia](/wiki/Article_153_of_the_Constitution_of_Malaysia), which gave the government of Malaysia power to enforce special social and economic privileges for the [Bumiputra](/wiki/Bumiputra), which were ethnically and religiously defined. The PAP called for a [Malaysian Malaysia](/wiki/Malaysian_Malaysia), that favoured all Malaysians, rather than specific ethnic groups. Singapore was also required to pay the Federal Government a large percentage of its budget, money which would not be necessarily returned as services towards Singapore. At the same time, [free trade](/wiki/Free_trade) was not granted between Singapore and other states of Malaysia. Following these difficulties, Lee Kuan Yew reluctantly signed a separation agreement on 7 August 1965, after [the Parliament of Malaysia voted for Singapore's expulsion from the Federation](/wiki/Singapore_in_Malaysia#Expulsion). Singapore officially left Malaysia on 9 August 1965.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:44.798589",
  "title": "Self-governance of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Self-governance_of_Singapore"
}