{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:54.420257"
  },
  "content": "Historic mosque in Singapore **Masjid Petempatan Melayu Sembawang**, also referred to as the **Sembawang Malay Settlement Mosque**, is a mosque located in [Sembawang](/wiki/Sembawang), in the [North Region](/wiki/North_Region,_Singapore), Singapore. It was formerly known as the **Masjid Kampong Tengah**. The mosque is regarded as the last of its kind in Singapore due to it being built in the traditional style of [Malay architecture](/wiki/Architecture_of_Malaysia) used in older villages ([kampong](/wiki/Kampong)). ## History During the 1960s, plans were made to construct a larger mosque for the residents of nearby villages. The mosque was opened in 1963 under the name of *Masjid Kampung Tengah*. It was built by the local villagers, especially the youth who dedicated their time to its construction. However, the name was later changed to *Masjid Petempatan Melayu Sembawang* in honour of the existing Malay settlement ([Malay](/wiki/Malay_language): *petempatan Melayu*). In 1970, the mosque was officially opened under its current name. It received renovations twice, in 1984 and later in 2007. Currently, the mosque is still active and is used for prayers. Religious classes are also held at the mosque. The mosque's facilities, such as the toilets, are open for anyone to use regardless of religion. ## Significance The mosque has been described as the last of the kampung-styled mosques in Singapore, due to its style of construction. It is also one of the last remnants of the village atmosphere in Singapore. The rubber tree next to the mosque has local significance due to its old age. It is believed to have existed for more than a century. - [Surau Al Firdaus](/wiki/Surau_Al_Firdaus) - [Kampong Lorong Buangkok](/wiki/Kampong_Lorong_Buangkok) - [List of mosques in Singapore](/wiki/List_of_mosques_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:54.419979",
  "title": "Sembawang Malay Settlement Mosque",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sembawang_Malay_Settlement_Mosque"
}