{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:58.386459"
  },
  "content": "Shopping center in Sembawang, Singapore **Sembawang Shopping Centre** is a four-storey commercial development located along Sembawang Road in Sembawang Spring Estate of [Sembawang](/wiki/Sembawang), [Singapore](/wiki/Singapore). It was first opened in 1986 and underwent a refurbishment in 2007 and reopened in December 2008. In April 2018, the Centre was sold to Lian Beng-Apricot Sembawang. ## History Sembawang Shopping Centre was developed by CapitaLand Mall Trust on a [freehold land](/wiki/Freehold_(law)). It consists of four retail [stories](/wiki/Storey) (including one [basement](/wiki/Basement)). It has a total floor area of 197,676 square feet (18,364.7 m2), of which 134,534.99 square feet (12,498.710 m2) are used for commercial purposes. The mall underwent a refurbishment in 2007 and reopened in December 2008. The [architectural firm](/wiki/Architectural_firm) involved in the redesigning of the mall is DCA Architects. In April 2018, with [Colliers International](/wiki/Colliers_International) as the [estate agent](/wiki/Estate_agent), the Centre was sold to a [joint venture](/wiki/Joint_venture) of Lian Beng Group and Apricot Capital (Lian Beng-Apricot Sembawang) in an attempt to diversify the portfolio of CapitaLand Mall Trust. This was for an amount of S$248 million, an amount that is double the valuation of the mall as well as the largest sum for any private dedicated mall in Singapore for the immediate few years of time.[*clarification needed*] After the purchase, Knight Frank Property Asset Management Pte Ltd is the managing agent for the mall. ## Locality The shopping mall is a landmark along Sembawang Road, and is located within the vicinity of [landed](/wiki/Landed_property) Sembawang Spring Estate. ## Awards YearAwardAwarding agencyRef.2009BCA Green Mark Gold Award (Category: Buildings)[Building & Construction Authority of Singapore](/wiki/Building_and_Construction_Authority) (BCA) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:58.386077",
  "title": "Sembawang Shopping Centre",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sembawang_Shopping_Centre"
}