{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:53.034240"
  },
  "content": "Hot spring park in Sembawang, Singapore **Sembawang Hot Spring Park** is a natural [hot spring](/wiki/Hot_spring) and a public park in [Singapore](/wiki/Singapore). It is located beside a military camp about 100 metres (330 ft) off the main road, Gambas Avenue. Its natural spring water had once been bottled commercially by [Fraser and Neave](/wiki/Fraser_and_Neave), under the brand name of Seletaris. Since its discovery in 1909, the spring has been through a few changes of ownership and potential redevelopment proposals. The hot spring has a rural rustic feel for visitors to unwind from the hustle and bustle of the modern metropolitan city. The [National Parks Board](/wiki/National_Parks_Board) took over the ownership of the park for redevelopment, which officially reopened on 4 January 2020. Sembawang Hot Spring is one of two hot springs in Singapore, with the other located on [Pulau Tekong](/wiki/Pulau_Tekong). ## History In 1909, a Chinese merchant named Seah Eng Keong, the son of [Chinese](/wiki/Chinese_in_Singapore) pioneer [Seah Liang Seah](/wiki/Seah_Eu_Chin#Plantation_and_mercantile_activity), discovered hot springs in his pineapple estate in [Sembawang](/wiki/Sembawang). The three springs were channelled into one, so that the water would be conveniently concentrated in one area. A well was built along with the spring, which became popular with the villagers, who frequently sought the waters for their supposed healing powers. The spring's fame spread, resulting in the village becoming known as *Kampong Ayer Panas*, which means \"Village of Hot Water\" in [Malay](/wiki/Malay_language). Soft drinks firm [Fraser & Neave](/wiki/Fraser_%26_Neave) (F&N) acquired the site in 1922, and set up a bottling plant at nearby Semangat Ayer to tap the mineral water, which they labelled *Seletaris*. During the [Second World War](/wiki/Second_World_War), the spring's flow was temporarily interrupted when a bomb fell near the well during the [Imperial Japanese](/wiki/Empire_of_Japan) air raid over Singapore in 1942. After the [fall of Singapore](/wiki/Battle_of_Singapore#Fall_of_Singapore), the [Imperial Japanese Army](/wiki/Imperial_Japanese_Army) military seized the place and converted it into recreational thermal baths (onsen). The hot spring was frequented by gamblers in 1960, who took \"good luck\" baths before the start of horse races. That same year, the villagers urged the authorities to develop the area into a spa-like [onsen](/wiki/Onsen) tourist resort. However, F&N shelved the suggestion after geologists could not trace the source of the spring water. In 1967, the proposal of the spa surfaced again, when F&N proposed plans for the development of a bathhouse, restaurants, a miniature golf course and even a nature reserve. However, the plans did not materialize, so the hot spring remained untouched and forgotten. ### Water properties According to local geologists, the exact source of the spring remains unknown, but it is believed that its origin may be southwest of its actual location, possibly at [Bukit Timah](/wiki/Bukit_Timah). Hot springs are formed when underground water comes into contact with hot rock masses. The resulting high pressure causes the water to seep upwards through cracks, forcing itself out of the ground as a spring. A series of tests conducted by the PSB Corporation and SGS Testing & Control Services found the spring water contains 420 [mg](/wiki/Milligram) of [chloride](/wiki/Chloride) per litre, an amount which is substantially higher than the 35 to 100 mg in the water from [Choa Chu Kang](/wiki/Choa_Chu_Kang) and [Bedok](/wiki/Bedok) waterworks. It was also found that the [sulphide](/wiki/Sulphide) content is three times more than tap water and the spring water is also slightly alkaline due to the presence of minerals. Natural spring waters may have health benefits, similar to the hot springs of other countries near tectonic plates with volcanoes, in a search for cures for some skin conditions, as well as debilitating ailments like [rheumatism](/wiki/Rheumatism) and [arthritis](/wiki/Arthritis). Although local [rheumatologists](/wiki/Rheumatologist) conceded that [hydrotherapy](/wiki/Hydrotherapy) is an accepted treatment that can be helpful for mild forms of rheumatism or muscle strain, they, along with [dermatologists](/wiki/Dermatologist), remain skeptical of claims about the alternative healing of the natural spring water. Hot hard water bubbles continuously in the well, releasing a slightly unpleasant [sulphur](/wiki/Sulfur) mud-like odour together with steam. The temperature of the spring water is measured by precision instrument to be constant 70 °C (160 °F). In an investigation carried out by the [Nanyang Technological University](/wiki/Nanyang_Technological_University) in 1994, the hot spring was found to have an estimated yield of approximately 150 litres (33 imp gal; 40 US gal) per minute at ground level through installed steel casings. ## Land acquisition by MINDEF In 1998, the [Ministry of Defence](/wiki/Ministry_of_Defence,_Singapore) (Mindef) acquired the land containing the spring for the expansion of the nearby [Sembawang Air Base](/wiki/Sembawang_Air_Base), leaving F&N with less than 4 [hectares](/wiki/Hectare) (10 acres) of land. Its water-bottling plant survived until the early 1990s, however. In January 2002, local interest in the hot spring caught the attention of Singaporeans after the surrounding land had been cleared to begin the RSAF air base extension. Sembawang community leaders gathered signatures to petition Mindef, which was going to fence off the area, to preserve and develop the hot spring for the general public. Mindef gave the green light to the appeals and opened a small side gate pavement for the public to access the spring. During that same year, a series of scalding cases, including an incident in which a senior citizen diabetic lost six toes to [gangrene](/wiki/Gangrene) after soaking in the hot spring, prompted the [Singapore General Hospital](/wiki/Singapore_General_Hospital) to warn that people with nerve disorders or diseases affecting blood circulation should be cautious to hot mineral springs. As a result of some negative rumors and hearsay, and the RSAF redevelopment, public interest began to wane and the number of visitors dwindled. ## Prior to 2018 During its peak, up to 300 people visited the hot spring daily. On 1 March 2002, it was closed for two months while upgrading and improvement works were carried out to the area around the spring, which had become sodden and muddy. Littering had also become a problem because of the increased number of visitors. The former dirt track leading to the spring was paved with cement, and lined with [bougainvillea](/wiki/Bougainvillea) bushes and high fences to ensure the security of the air base. Drainage pipes were also installed. Mindef, which owns the land, allows public access between 7 am and 7 pm daily, free-of-charge. When the spring reopened on 1 May 2002, more than 100 people visited the site despite the afternoon drizzle. At the same time, some new free-hold condominiums were built in the surrounding area; one of the developments, built by the property arm of F&N in 2001, is called Seletaris, named after the company's former mineral water. In July 2005, a [Business Times](/wiki/Business_Times_(Singapore)) reader proposed that the authorities should explore the possibility of tapping the [geothermal](/wiki/Geothermal_(geology)) heat that lies many miles under Sembawang—similar to the project in [South Australia](/wiki/South_Australia)'s [Cooper Basin](/wiki/Cooper_Basin)—in order to reduce Singapore's reliance on oil and gas for its energy needs. The proposal was not acted upon. As of 2014, the well could still be seen locked inside a red-brick enclosure with a steel gate, and its geothermal heat can be felt outside the building. Some plastic chairs, pails and mini-tubs kindly donated by visitors were stored at the perimeter of the compound, which has a makeshift shed in one corner. A caretaker, paid for by Mindef, takes care of the place to maintain its overall cleanliness, but there is no toilet on location. The hot spring has been less frequented nowadays and remains rustic. ## Redevelopment by the National Parks Board Sembawang Hot Spring was redeveloped into a 1.1-hectare park called **Sembawang Hot Spring Park**, which reopened on 4 January 2020. Following feedback from the general public, the [National Parks Board](/wiki/National_Parks_Board) later erected more signs within the park premises. - Singapore portal - [Hot springs around the world](/wiki/Hot_springs_around_the_world) - [List of parks in Singapore](/wiki/List_of_parks_in_Singapore) - Pictures of Sembawang Hot Spring - Renuka, M.; Nureza Ahmad (2002-02-08). \"Sembawang Hot Springs\". [National Library Board](/wiki/National_Library_Board). Archived from the original on 2008-10-14.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:53.033907",
  "title": "Sembawang Hot Spring Park",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sembawang_Hot_Spring_Park"
}