{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:52:00.358429"
  },
  "content": "Energy and urban development company in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **may have been created or edited in return for undisclosed payments**, a violation of Wikipedia's terms of use. It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. *(December 2020)*This article **may be in need of reorganization to comply with Wikipedia's layout guidelines**. Please help by editing the article to make improvements to the overall structure. *(September 2020)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Sembcorp Industries** is a [Singaporean](/wiki/Singapore) state-owned [energy](/wiki/Energy) and [urban development](/wiki/Urban_planning) company. Sembcorp's [marine division](/wiki/Sembcorp_Marine) provided a variety of services, including the engineering and construction of [offshore platforms](/wiki/Offshore_platform) for [oil extraction](/wiki/Oil_extraction), until it was [demerged](/wiki/Demerge) from Sembcorp in 2020 following poor financial performance. Sembcorp currently has an energy portfolio of over 12,600[MW](/wiki/Megawatt), with more than 2,600MW of renewable energy capacity globally. The company also develops raw land into urban developments. Sembcorp is listed on the main board of the [Singapore Exchange](/wiki/Singapore_Exchange). It is a component stock of the [Straits Times Index](/wiki/Straits_Times_Index) and sustainability indices including the [FTSE4Good Index](/wiki/FTSE4Good_Index), the [Dow Jones Sustainability Asia Pacific Index](/wiki/Dow_Jones_Sustainability_Indices) and the iEdge SG ESG indices. ## History ### Sembawang Shipyard Limited (1969-1994) Sembawang Shipyard Limited was formed in 1968 as a wholly-owned management body of the newly established Sembawang ship-repairing complex, under the purview of [Swan Hunter](/wiki/Swan_Hunter). The Sembawang ship-repairing complex (or Sembawang Shipyard), which majority of premises formerly Her Majesty's Sembawang Dockyards, begun operations on 2 December 1968. In 1984, Sembawang shipyard secured the contract to repair the damaged propeller shaft of the [HMS Invincible](/wiki/HMS_Invincible_(R05)), a British aircraft carrier. The same year also saw the diversification of Sembawang Shipyard Ltd into civil projects, with the firm securing the contract for the construction of Newton Circus MRT station and civil defence station ([Newton MRT Station](/wiki/Newton_MRT_station)) through a joint venture with French company Dragages et Travaux Publics, valued at [S$](/wiki/Singapore_dollar)43 million. The joint venture also saw the transfer of technology from Dregages, which was one of the main contractors for the [Hong Kong Mass Transit Railway](/wiki/MTR#Modified_initial_system). ### Sembawang Corporation Limited Sembawang Shipyard underwent an extensive organisational restructure between 1990 and April 1994. Its assets restructured into a single conglomerate with four sectors, namely shipyard, maritime, engineering, and industrial. The restructuring also saw a name change to Sembawang Corporation Limited, announced on 7 May 1994 to reflect its diverse business atop of shipbuilding. ### Formation of Sembcorp Industries On 1 June 1998, a joint announcement was made by Singapore Technologies Industrial Corporation (STIC) and Sembawang Corporation for the intention to merge as a single entity - Sembcorp Industries (SCI). This merger would form the largest civil engineering and building construction firm in Southeast Asia region, with a niche in infrastructure, marine engineering, information technology and lifestyle. The merger also saw SembCorp Industries assuming one of Asia’s leading industrial park developers and managers, with jurisdiction of industrial parks in Indonesia, China and Vietnam. STIC and Sembawang Corporation was fully integrated under the name of Sembcorp Industries by 5 October 1998. ### Demerger of Sembcorp Marine In March 2020, it was announced that Sembcorp was replacing their CEO. Sembcorp did not declare an interim dividend for 1H 2020, instead choosing to defer any decision regarding payment of dividends for the fiscal year 2020 until the end of the year. In June of the same year, trading was halted for Sembcorp as well as [Sembcorp Marine](/wiki/Sembcorp_Marine), a loss-making subsidiary whose shares had declined by 36% in 2020. Representatives from both companies declined to comment. Between 11 June and 24 July 2020, Sembcorp Industries' share price declined by 11%. On 12 August 2020, the demerger of Sembcorp Marine (SCM) from Sembcorp Industries through a distribution in specie (4911 of SCM shares for every 1 SCI shares held) was confirmed, along with proposal of a S$2.1 billion recapitalization of the former through renounce-able right issue. ## Business This section's **tone or style may not reflect the encyclopedic tone used on Wikipedia**. See Wikipedia's guide to writing better articles for suggestions. *(October 2025)* *(Learn how and when to remove this message)* ### Singapore Sembcorp owns and operates the largest [NEWater](/wiki/NEWater) plant in Singapore, and provides [solid waste management](/wiki/Waste_management) services. It is the only established power gentailer (generation-affiliated retailer) in Singapore to offer renewable energy. Sembcorp also has 250MWp of [renewable energy](/wiki/Renewable_energy) capacity in operation and under development. ### China Sembcorp operates power generation, [industrial water](/wiki/Industrial_water) and [wastewater treatment](/wiki/Wastewater_treatment) facilities, and sustainable [urban developments](/wiki/Urban_Development). Sembcorp is an investor in the [China-Singapore Suzhou Industrial Park](/wiki/Suzhou_Industrial_Park), Wuxi-Singapore Industrial Park, International Water Hub and Singapore-Sichuan Hi-tech Innovation Park. In November 2023, Sembcorp announced it would acquire 200 MW of operational wind power assets from Qinzhou Yuanneng for S$130 million. ### India Despite their commitment to renewable energy in China and Singapore, Sembcorp constructed a 1,320-megawatt supercritical coal-fired [power plant](/wiki/Power_Plant) in [Andhra Pradesh](/wiki/Andhra_Pradesh). In 2015, they acquired a wind and solar power company, Green Infra. In 2016, Sembcorp launched a $3 billion, 2,640-megawatt power complex in Andhra Pradesh. In 2020, Sembcorp commemorated the completion of 800MW of Solar Energy Corporation of India wind power projects. In November 2023, Sembcorp announced it would acquire 228 MW of operational wind power assets from Leap Green Energy Pvt Ltd for S$70 million. ### United Kingdom In 2003, Sembcorp acquired a centralised utilities business at [Wilton International](/wiki/Wilton_International), [Teesside, UK](/wiki/Teesside). In 2018, Sembcorp acquired UK Power Reserve, the UK's largest flexible distributed energy generator. ### Myanmar In 2015, Sembcorp pivoted away from renewable energy investments, beginning the development of a 225-megawatt [gas-fired power plant](/wiki/Gas-fired_power_plant) (the Sembcorp Myingyan Power Plant) which officially opened in 2019. However, solar power generation was integrated into the plant. ### Oman In 2009, Sembcorp won a project to develop the US$1 billion Salalah Independent Water and Power Plant. ### United Arab Emirates In 2006, Sembcorp started work on the [Fujairah 1 Independent Water and Power Plant](/wiki/Fujairah_F1_Independent_Water_and_Power_Plant), a 893 MW and 130 million imperial gallons per day hybrid [desalination](/wiki/Desalination) plans. ### Vietnam In 1996, the first Vietnam Singapore Industrial Park (VSIP) was established in [Binh Duong](/wiki/B%C3%ACnh_D%C6%B0%C6%A1ng_Province) province in [southern Vietnam](/wiki/Southern_Vietnam). In 2001, Sembcorp made an investment to develop the Phu My 3 independent power plant. In 2005, Sembcorp expanded its presence in southern Vietnam with VSIP Binh Duong II. In 2007, Sembcorp began a third VSIP project, VSIP Bac Ninh. In 2009, Sembcorp entered a joint venture agreement for its fourth VISP project, VSIP Hai Phong, also an integrated township and industrial park. In 2012, Sembcorp signed an agreement for a fifth project in Vietnam, VSIP Quang Ngai, and in 2015, their sixth and seventh VSIPs - VSIP Hai Duong and VSIP Nghe An. In 2019, Sembcorp signed a joint venture agreement with Becamex IDC Corporation and VSIP. ### Bangladesh In 2019, Sirajganj Unit 4 combined-cycle gas turbine power plant, Sembcorp's first thermal power plant in Bangladesh, commenced full commercial operation. ### Indonesia Sembcorp was appointed by the Singapore government in the 1990s to develop its first bilateral [special economic zones](/wiki/Special_economic_zone), the 320-hectare Batamindo Industrial Park, on the Riau Island of [Batam](/wiki/Batam), and the 270-hectare Bintan Industrial Estate, on [Bintan Island](/wiki/Bintan_Island). Sembcorp is now developing the Kendal Industrial Park in [Central Java](/wiki/Central_Java). ### Australia In December 2025, it was announced Sembcorp would acquire [Australian](/wiki/Australia) energy company [Alinta Energy](/wiki/Alinta_Energy) from Hong Kong-based [Chow Tai Fook Enterprises](/wiki/Chow_Tai_Fook) for an enterprise value of A$6.5 billion. The acquisition expands Sembcorp’s footprint in Australia and aligns with its strategy to increase global renewable energy capacity to 25 GW by 2028. - [Sembcorp Energy India](/wiki/Sembcorp_Energy_India) - [SembCorp Logistics](/wiki/SembCorp_Logistics) - [Water privatisation](/wiki/Water_privatisation) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:52:00.358132",
  "title": "Sembcorp",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sembcorp"
}