{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:51:49.823091"
  },
  "content": "Town in North Region, SingaporePlanning Area and Town in North Region, Singapore **Sembawang** ([IPA](/wiki/International_Phonetic_Alphabet): /səmˈbɑːwʌŋ/ *səm-BAH-wung*) is a [planning area](/wiki/Planning_Areas_of_Singapore) and [residential town](/wiki/New_towns_of_Singapore) located in the [North Region](/wiki/North_Region,_Singapore) of [Singapore](/wiki/Singapore). Sembawang planning area is bordered by [Simpang](/wiki/Simpang) to the east, [Mandai](/wiki/Mandai) to the south, [Yishun](/wiki/Yishun) to the southeast, [Woodlands](/wiki/Woodlands,_Singapore) to the west and the [Straits of Johor](/wiki/Straits_of_Johor) to the north. Despite the relatively large development in the Sembawang New Town, the area remains largely suburban, with military, industrial and [recreational](/wiki/Recreation) facilities at its periphery. It hosted a major [naval base](/wiki/Singapore_Naval_Base) and port facilities since the early 20th century, and continues to handle regular shipping traffic today along its wharves. Sembawang has nine subzones, these are [Admiralty](/wiki/Admiralty,_Singapore), Sembawang Central, Sembawang East, Sembawang North, Sembawang Springs, Sembawang Straits, Senoko North, Senoko South and the Wharves. ## Etymology The earliest reference to Sembawang is found in [Franklin and Jackson's 1830 *Map of Singapore*](/wiki/Jackson_Plan), which refers to the River Tambuwang. The place is said to have got its name from the *pokok sembawang* ([Malay](/wiki/Malay_language) for the [*kayae ferruginea*](/wiki/Kayea_ferruginea)*),* which has been renamed *[Mesua ferruginea](/wiki/Mesua_ferruginea)* from 1980. This tree can be seen at [Sembawang Park](/wiki/Sembawang_Park). ## History The Sembawang area in the early twentieth century was the site of the [Nee Soon](/wiki/Yishun) Rubber estate. During colonial times, Sembawang was home to a major British naval base, the construction of which began in 1928 and was completed in 1938. The base included [dockyards](/wiki/Shipyard), [wharves](/wiki/Wharve) and workshops, as well as supporting administrative, residential and commercial areas. The Naval Base has since been handed over to the [Singapore government](/wiki/Government_of_Singapore), which in 1968 converted it into a commercial dockyard (as Sembawang Shipyard, now part of [Singapore Exchange](/wiki/Singapore_Exchange)-[listed](/wiki/Companies_listed_on_the_Singapore_Exchange#S) [SembCorp Marine](/wiki/SembCorp_Marine)) that went on to become SembCorp, a major state-owned industrial [conglomerate](/wiki/Conglomerate_(company)). Operations in the Sembawang Shipyard are expected to wind down in 2028, and the area is set for redevelopment into a mixed-use waterfront lifestyle district, with homes, dining and recreation. Extensive [land reclamation](/wiki/Land_reclamation) throughout Singapore has left Sembawang with one of the country's last natural beaches, the Wak Hassan Beach located at [Sembawang Park](/wiki/Sembawang_Park). Today, the vegetable farms, rubber [plantations](/wiki/Plantation) and Chinese graveyards surrounding the former naval base have given way to modern housing, especially in the 1990s during the development of a [New Town](/wiki/New_town) by the Singapore [Housing and Development Board](/wiki/Housing_and_Development_Board). The town remains a major port, with Sembawang [Wharves](/wiki/Wharve) handling a high volume of bulk [commodities](/wiki/Commodities) cargo, such as timber and rubber. The planning of Sembawang New Town started in 1996 where the Woodlands MRT Extension was opened, and [Sembawang MRT station](/wiki/Sembawang_MRT_station) was also opened at the same time. When the station was opened, the area was undeveloped except the Canberra Road and the then-developing Sembawang New Town. This was resolved in 1998 because of the accelerating development of Sembawang New Town, which was completed in 2004. These HDB flats were within Sembawang, Canberra and Gambas division. In late 2022, Sembawang had their first [hawker centre](/wiki/Hawker_centre) and [polyclinic](/wiki/Polyclinic) at [Bukit Canberra](/wiki/Bukit_Canberra), which opened progressively from July 2022 onwards. ## Politics Sembawang once begun as a constituency named [Seletar](/wiki/Seletar) but later carved out forming a dedicated [Sembawang Single Member Constituency](/wiki/Sembawang_Single_Member_Constituency) beginning in the (/wiki/1955_Singaporean_general_election), then resized to a smaller constituency leaving only the northern areas. Sembawang has always been held by the [People's Action Party](/wiki/People%27s_Action_Party) since its formation and has been expanded to include subregions of Admiralty, Canberra and Naval Base since it became a [Group Representation Constituency](/wiki/Sembawang_Group_Representation_Constituency). Former [President of Singapore](/wiki/President_of_Singapore) [Tony Tan Keng Yam](/wiki/Tony_Tan) was one of the notable Members of Parliament of Sembawang and helmed the constituency until (/wiki/2006_Singaporean_general_election); [Tanjong Pagar GRC](/wiki/Tanjong_Pagar_GRC) Member of Parliament and former Transport Minister [Khaw Boon Wan](/wiki/Khaw_Boon_Wan) succeeded him as the anchor minister until (/wiki/2020_Singaporean_general_election), where he was taken over by current Health minister [Ong Ye Kung](/wiki/Ong_Ye_Kung), who first elected there in (/wiki/2015_Singaporean_general_election). One of Sembawang's divisions, [Sembawang West](/wiki/Sembawang_West_SMC), which was managed by [Poh Li San](/wiki/Poh_Li_San), became an SMC in (/wiki/2025_Singaporean_general_election). ## Military The completion of [Royal Navy](/wiki/Royal_Navy)'s [Singapore Naval Base](/wiki/Singapore_Naval_Base) (also known as HMS Sembawang) in 1938 and [RAF Sembawang (also known as HMS Simbang)](/wiki/Sembawang_Air_Base) in March 1940 marked the start of military presence in Sembawang. In February 1942, both bases were partially torched and wrecked by the retreating British forces during the [Battle of Singapore](/wiki/Battle_of_Singapore) to deny their use by units of the advancing [Imperial Japanese Army](/wiki/Imperial_Japanese_Army). After the end of [World War II](/wiki/World_War_II) in 1945, both bases were reverted to British control and would eventually go on to play an important part in Britain's continued military presence in the Far East (along with the three other RAF bases in Singapore: [RAF Changi](/wiki/Changi_Air_Base), [RAF Seletar](/wiki/Seletar_Airport) and [RAF Tengah](/wiki/Tengah_Air_Base)) during the critical period of [Malayan Emergency](/wiki/Malayan_Emergency) (1948–1960), the [Brunei Revolt](/wiki/Brunei_Revolt) in 1962 and during the [Indonesia–Malaysia confrontation](/wiki/Indonesia%E2%80%93Malaysia_confrontation) (1962–1966). Despite the [withdrawal of some part of British forces from Singapore in 1971](/wiki/East_of_Suez) and the handover of the Singapore Naval Base to [Singaporean Government](/wiki/Government_of_Singapore) in 1968, the British [Ministry of Defence (MoD)](/wiki/Ministry_of_Defence_(United_Kingdom)) continues to maintain [Naval Base](/wiki/British_Defence_Singapore_Support_Unit) at Sembawang wharf to control most of the foreign military activities there, which includes repair, refuel and resupply for ships of the Australian, British and New Zealand navies as well as those from other [Commonwealth countries](/wiki/Commonwealth_of_Nations) under the auspices of [Five Power Defence Arrangements](/wiki/Five_Power_Defence_Arrangements) (FPDA). This special arrangement was also extended to the United States Navy since early 1960s to support the American involvement in the [Vietnam War](/wiki/Vietnam_War). As part of a 1990 agreement between Singapore and the United States, [American military forces](/wiki/United_States_armed_forces) (primarily [naval](/wiki/United_States_Navy) and [air force](/wiki/United_States_Air_Force)) have been making use of Sembawang's base facilities. The [Task Force 73](/wiki/Task_Force_73) (and Commander Logistic Group Western Pacific), part of [US 7th Fleet](/wiki/US_7th_Fleet), has been headquartered in Sembawang since 1992. ### Sembawang Camp The Sembawang Camp is a [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) military base on Admiralty Road, open only to military personnel on official business. The camp houses the 1st and 3rd Transport Battalion of the [Singapore Army](/wiki/Singapore_Army), as well as the [Republic of Singapore Navy](/wiki/Republic_of_Singapore_Navy)'s [Naval Diving Unit (NDU)](/wiki/Naval_Diving_Unit_(Singapore)). Also, the compound housing the Naval Diving Unit was previously known as Terror Camp in deference to the old admin and Officers club section of the Royal Naval facility which was called HMS Terror. ## Transportation facilities Sembawang Road is one of the key roads built to connect the naval base to the city centre in the South. This road began as a track in the 1920s and was officially named Sembawang Road in 1938. Buses operated by various private companies were then the main mode of transport. The thoroughfare was also dotted with many villages along its length: Chye Kay Village, Sungei Simpang Village, Chong Pang Village, Sembawang Village. Most of these villages were cleared during the 1970s–1990s to make way for [Yishun](/wiki/Yishun) and Sembawang New Towns. The last of the villages, [Kampong](/wiki/Kampung) Wak Hassan, was cleared in 1998. Present day Sembawang Road is a major arterial road linking the Northern and Central portion of Singapore. Many other roads in Sembawang are named after various [Royal Navy](/wiki/Royal_Navy) dockyards, [warships](/wiki/Warship), [admirals](/wiki/Admiral), countries and cities. Examples include [Wellington](/wiki/Wellington), [Canberra](/wiki/Canberra), Canada, [Gibraltar](/wiki/Gibraltar), [Kenya](/wiki/Kenya) and [Falkland](/wiki/Falkland_Islands). These names were given during the previous British administration, and reflect the town's history as a British [naval base](/wiki/Naval_base). The main river running through Sembawang, the 4-kilometre (2.5 mi) long Sungei Sembawang, flowed along a winding route and ended to the west of Sembawang Shipyard. Its middle section was diverted in the 1920s to provide the land needed for the British Naval Base. During the 1970s, the Northern portions of the river was straightened and [canalized](/wiki/River_engineering#Canalization_of_rivers). The Southern portions of the river, which consisted of [mangroves](/wiki/Mangrove), ponds and grassland, was filled in during the 1990s in preparation for the development of Sembawang New Town. ### Public transport #### Rail Sembawang is served by two MRT stations on the [North–South Line](/wiki/North%E2%80%93South_Line_(Singapore)) - [Sembawang](/wiki/Sembawang_MRT_station) and [Canberra](/wiki/Canberra_MRT_station). The former is located in the heart of Sembawang New Town, and offers connectivity to Sembawang Bus Interchange, Sun Plaza shopping centre, and the Bukit Canberra integrated sports and community hub. The latter is an infill station which serves the suburban estate of Sembawang Springs, and is connected to Canberra Plaza suburban mall via a link bridge on one of its platforms. #### Bus services The [Sembawang Bus Interchange](/wiki/Sembawang_Bus_Interchange), located next to Sun Plaza, was completed on 20 November 2005. This replaced the old bus terminals located at the Northern tip of Sembawang Road, just next to [Sembawang Park](/wiki/Sembawang_Park) and the other located along Admiralty Road West. ## Education Sembawang has a total of five primary schools and two secondary schools. - Five primary schools, including Sembawang Primary School, Canberra Primary School, Endeavour Primary School, Wellington Primary School, and Northoaks Primary School. - Two secondary schools, including [Sembawang Secondary School](/wiki/Sembawang_Secondary_School) and Canberra Secondary School. ## Amenities ### Commercial Three shopping centres, including [Sembawang Shopping Centre](/wiki/Sembawang_Shopping_Centre), [Canberra Plaza](/wiki/Canberra_Plaza,_Singapore) and [Sun Plaza](/wiki/Sun_Plaza,_Singapore) next to the [Sembawang MRT station](/wiki/Sembawang_MRT_station). ### Parks, recreational and sport venues [Sembawang Public Library](/wiki/Sembawang_Public_Library), which is managed by the [National Library Board](/wiki/National_Library_Board) and situated within the Sun Plaza shopping centre. - [Bukit Canberra](/wiki/Bukit_Canberra), an integrated sports and community hub with amenities such as a hawker centre, polyclinic, a senior care centre, a childcare centre, and several parks, was officially opened on 17 December 2022. - [Sembawang Park](/wiki/Sembawang_Park), a 15 hectare tranquil park developed in the 1970s and maintained by the [National Parks Board](/wiki/National_Parks_Board), is situated at the Northern tip of Sembawang Road. One of the few parks in Singapore with a natural beach, the Wak Hassan Beach. It is a popular spot for campers as well as families who wish to spend an idyllic day by the beach. One can dine at the Beaulieu House, built in 1910, which was the residence of Admiral Sir [Geoffrey Layton](/wiki/Geoffrey_Layton) (Commander-in-Chief [British Eastern Fleet](/wiki/British_Eastern_Fleet), 1940–1942). A wide range of fauna and flora awaits visitors, ranging from the spectacular cannonball tree (*[Couroupita guianensis](/wiki/Couroupita_guianensis)*) to the many species of birds which have made the park their nesting grounds. Within the park is a Battleship-themed outdoor playground that pays tribute to the area's naval history. - [Sembawang Hot Spring Park](/wiki/Sembawang_Hot_Spring_Park) is the only hot spring park found in Singapore. It is located along [Gambas Avenue] near the junction with Sembawang Road. It reopened on 4 January 2020 after upgrading works, and now features a cascading pool and cafe. Main attractions here are dipping your feet in the spring water and cooking eggs in the spring water. - The Sembawang Park Connector is part of the Park Connector Network managed by the National Parks Board. As their name implies, these connectors aim to form a continuous loop which would hopefully connect all the major parks is a [planning area](/wiki/Planning_Areas_of_Singapore) and [residential town](/wiki/New_towns_of_Singapore) located the [North Region](/wiki/North_Region,_Singapore) of [Singapore](/wiki/Singapore). Sembawang planning area is bordered by [Simpang](/wiki/Simpang) to the east, [Mandai](/wiki/Mandai) to the south, [Yishun](/wiki/Yishun) to the southeast, [Woodlands](/wiki/Woodlands,_Singapore) to the west and the [Straits of Johor](/wiki/Straits_of_Johor) to the north. ## Bibliography - *The Northern Village*. Godfrey Robert, Sharon Han, NBSS Book Project Committee. Singapore. 2020. [ISBN](/wiki/ISBN_(identifier)) 978-981-14-8734-7. [OCLC](/wiki/OCLC_(identifier)) 1237603797.`{{cite book}}`: CS1 maint: location missing publisher (link) CS1 maint: others (link) - *Chronicles of Remembrance: Stories of Sembawang GRC Residents for Everyone*. 2015. - Aravindan, Kamaladevi (2020). *Sembawang-A Novel*. Anitha Devi Pillai. MarshallCavendishEditions: Marshall Cavendish International (Asia) Private Limited. [ISBN](/wiki/ISBN_(identifier)) 978-981-4928-02-1. [OCLC](/wiki/OCLC_(identifier)) 1202463898.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:51:49.822651",
  "title": "Sembawang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sembawang"
}