{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:52:05.468476"
  },
  "content": "Planning Area and HDB Town in the North-East Region, SingaporePlanning Area and HDB Town in North-East Region, SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Sengkang\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2023)* *(Learn how and when to remove this message)* **Sengkang** (locally /ˈseɪŋkɑːŋ/, [Chinese](/wiki/Simplified_Chinese_characters): 盛港, [Tamil](/wiki/Tamil_language): செங்காங்) is a [planning area](/wiki/Planning_Areas_of_Singapore) and [residential town](/wiki/New_towns_of_Singapore) located in the [North-East Region](/wiki/North-East_Region,_Singapore) of [Singapore](/wiki/Singapore). The town is the second-most populous in the region, being home to 249,370 residents in 2020. Sengkang shares boundaries with [Seletar](/wiki/Seletar) and [Punggol](/wiki/Punggol) in the north, [Pasir Ris](/wiki/Pasir_Ris) and [Paya Lebar](/wiki/Paya_Lebar) in the east, [Hougang](/wiki/Hougang) and [Serangoon](/wiki/Serangoon) to the south, as well as [Yishun](/wiki/Yishun) and [Ang Mo Kio](/wiki/Ang_Mo_Kio) to the west. Originally a [fishing village](/wiki/Fishing_village), Sengkang was rapidly developed by the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) into a mature housing estate. ## Etymology The name *Sengkang* means \"prosperous harbour\" in Chinese, and “to chock, block or wedge” in [Malay](/wiki/Malay_language). The name was derived from *Lorong Sengkang,* a former Malay kampong road, off *Lorong Buangkok. Lorongs* were common in the area before urban redevelopment. The area was formerly known as *Kangkar* (*Gang Jiao* 港脚) or \"foot of the port\" as there was once a fishing port located along [Sungei Serangoon](/wiki/Sungei_Serangoon). ## History Sengkang originated from the area once called Kangkar, named after the port and fishing village along Sungei Serangoon. By the mid-20th century, the area was home to several [rubber](/wiki/Rubber_tapping), [pepper](/wiki/Piper_(plant)), and [pineapple](/wiki/Pineapple) plantations. At that time, the nearest public housing estate then was the Punggol Rural Centre located along Punggol Road. Sengkang was largely left alone until 1994, when an [urban design](/wiki/Urban_design) team of ten from HDB began conceptualization for a new town in Sengkang. Sengkang was carved up into seven subzones that would house a total of 95,000 public and private housing units in the long term. Conjured by local newspapers, Sengkang's theme became 'Town of the Seafarer', which reflects its history as a fishing village. Two sub-themes were assigned to the four neighbourhood areas (namely [Rivervale](/wiki/Rivervale,_Singapore), [Compassvale](/wiki/Compassvale), [Anchorvale](/wiki/Anchorvale), and [Fernvale](/wiki/Fernvale,_Singapore)) of the new town: one reflected Sengkang's marine history, while the other related to the sprawling plantations that previously covered parts of the area. The neighborhoods were each given a name and a [colour scheme](/wiki/Colour_scheme) to go with their respective themes. The three-storey [pilotis](/wiki/Pilotis) or [stilt](/wiki/Stilts_(architecture)) effect was also utilized in the design of housing blocks, to resemble the stilts of fishing villages and trunks of the various plantations of bygone years. The town's first public apartments (known locally as *flats* per British English) at Rivervale were completed in 1997. By September 13 2001, about 33,700 dwelling units were completed. As of 31 March 2017, there are 65,981 HDB dwelling units in Sengkang. In October 1999, a steering committee chaired by Michael Lim, then-[Member of Parliament](/wiki/Parliament_of_Singapore#Members_of_Parliament) (MP) for [Cheng San Group Representation Constituency](/wiki/Cheng_San_Group_Representation_Constituency) (GRC), was formed to look into providing sufficient [amenities](/wiki/Amenities) in Sengkang New Town. In view of feedback from residents, it completed its report on the need for facilities and services in the new town in July 2000. They coordinated with various organizations to open more void-deck precinct shops, a new shopping mall and childcare centres. ## Geography Sengkang is a primarily residential town situated to the north of [Hougang New Town](/wiki/Hougang_New_Town) in the north-eastern part of Singapore, under the [North-East Region](/wiki/North-East_Region,_Singapore) as defined by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA). The town is bordered to the north by the [Tampines Expressway](/wiki/Tampines_Expressway) (TPE), to the east by the [Kallang–Paya Lebar Expressway](/wiki/Kallang%E2%80%93Paya_Lebar_Expressway) (KPE), Yio Chu Kang Road and [Buangkok](/wiki/Buangkok) Drive to the south and the [Central Expressway](/wiki/Central_Expressway,_Singapore) (CTE) to the west. [Sungei Punggol](/wiki/Sungei_Punggol) ([Punggol](/wiki/Punggol) River) cuts through the new town, and divides the town into *Sengkang East* and *Sengkang West*. Sengkang Town Centre is located in [Compassvale](/wiki/Compassvale). A new industrial area, 'Sengkang West Industrial Area', is to be built to the west of Sengkang West Road in the near[*when?*] future. The construction of Sengkang West Road, which begins where Yio Chu Kang Road and [Jalan Kayu](/wiki/Jalan_Kayu) intersect, started in 2011 and the first section was opened to traffic on 13 October 2013. The remaining section of the road opened on 16 May 2015. The road passes through the extended roads of Fernvale Lane, Sengkang West Avenue, Sengkang West Way in front of the [Fernvale](/wiki/Fernvale,_Singapore) neighbourhood, cuts through the TPE across the Seletar Aerospace Flyover and links to [Seletar Aerospace Park](/wiki/Seletar_Aerospace_Park). An extension of Sengkang West Way to Sengkang West Road opened on 14 May 2017. ### Subzones Sengkang New Town is divided into the following seven subzones. - [Rivervale](/wiki/Rivervale,_Singapore) - [Compassvale](/wiki/Compassvale) - [Anchorvale](/wiki/Anchorvale) - [Fernvale](/wiki/Fernvale,_Singapore) - Sengkang Town Centre - Sengkang West - Lorong Halus North ## Demographics As of June 2024, the most populous subzone in Sengkang is Rivervale with 62,470 residents, closely followed by Sengkang Town Centre with 59,700 residents. In contrast, subzones such as Sengkang West and Lorong Halus North are completely unpopulated. ### Population history Resident Population 2000-2025YearPop.±%200061,300—200187,560+42.8%2002102,650+17.2%2003113,030+10.1%2004122,270+8.2%2005130,330+6.6%2006138,270+6.1%2007144,730+4.7%2008152,990+5.7%2009160,980+5.2%2010167,050+3.8%2011171,250+2.5%2012177,770+3.8%2013182,980+2.9%2014191,910+4.9%2015206,680+7.7%2016219,380+6.1%2017232,100+5.8%2018240,640+3.7%2019244,640+1.7%2020249,370+1.9%2021248,630−0.3%2022252,730+1.6%2023257,910+2.0%2024265,060+2.8%2025267,600+1.0%Source: ### Age profile The data below is from the population report published by the Singapore Department of Statistics as of June 2025. Age group (years)MalesFemalesTotal population% of total population0–46,4806,19012,6704.735–98,2007,66015,8605.9310–148,6508,15016,8006.2815–198,0207,63015,6505.8520–247,0906,83013,9205.2025–297,6807,79015,4705.7830–349,52010,63020,1507.5335–3910,67012,52023,1908.6740–4411,57012,86024,4309.1345–4910,64011,59022,2308.3150–5410,22010,21020,4307.6355–598,2607,91016,1706.0460–647,5907,71015,3005.7265–696,7007,06013,7605.1470–744,7805,1809,9603.7275–792,9303,4106,3402.3780–841,2001,6202,8201.0585–896101,0001,6100.6090+2106208300.31Age group (years)MalesFemalesTotal population% of total population0–1423,33022,00045,33016.9315–6491,26095,680186,94069.8665+16,43018,89035,32013.20 The population distribution of Sengkang in 2025 demonstrates a balanced population structure. There is a higher population concentration among younger and middle-aged and groups, with males and females both peaking at the 40-44 age range at 4.32% and 4.81% respectively. Notably, Sengkang has a relatively low proportion of elderly residents. In 2025, the proportion of residents above 65 years old was 13.2%, significantly lower than the national proportion of 18.8%. ### Household As of 2025, there were 223,940 people living in [HDB](/wiki/Housing_and_Development_Board) flats, representing 83.7% of the population. This is higher than the national proportion of HDB dwellers (75.8%), reflecting a greater prevalence of public housing in the area. 100,680 residents, or 37.6% of the population, live in 4-Room Flats, making it the most common type of dwelling. 41,400 residents (15.5%) live in condominiums and other apartments, while 1,540 (0.58%) live in landed properties. The average household size in Sengkang as of 2020 is 3.42. Among the 79,376 households in Sengkang, the most common household size is four persons, representing 23.9% of total households. Sengkang has a [home ownership](/wiki/Owner-occupancy) rate of 94.0% as of 2020. This is significantly higher than the national home ownership rate of 87.9%, making Sengkang the highest in home ownership rate among all planning areas in Singapore. This reflects a greater prevalence of homeowners in Sengkang. ### Ethnicity Ethnic groups in Sengkang (2000−2020) Year[Chinese](/wiki/Chinese_Singaporeans)[Malays](/wiki/Malay_Singaporeans)[Indians](/wiki/Indian_Singaporeans)Others[Pop.](/wiki/Population)PercentagePop.PercentagePop.PercentagePop.Percentage**2000**49,67881.04%7,58712.38%3,4915.69%5440.89%**2010**131,92578.97%17,08710.23%13,8498.29%4,1932.51%**2015**160,59077.7%22,58010.93%18,2008.81%5,3102.57%**2020**192,87077.35%28,56011.45%21,6908.7%6,2402.5% As of 2020, Sengkang has a slightly lower level of ethnic diversity compared to the national average. This is due to the larger proportion of Chinese residents (77.35%) compared to the national average of 74.35%, although this proportion has gradually declined over the years. ### Religion Consistent with the rest of Singapore, the largest religion in Sengkang is [Buddhism](/wiki/Buddhism_in_Singapore), with 72,229 practising residents (35.06% of the population). The second most common group consists of residents with [no religion](/wiki/Irreligion_in_Singapore) (43,436 residents, 21.09% of the population). [Islam](/wiki/Islam_in_Singapore) is also prominent in Sengkang, with 26,557 Muslims (12.89%). [Christianity](/wiki/Christianity_in_Singapore) is practised by 34,381 residents (16.69%), with 14,123 Catholics (6.86%). Other religious affiliations include [Taoism](/wiki/Taoism_in_Singapore) and [other Chinese religions](/wiki/Chinese_folk_religion) (17,591 residents, 8.54%), [Hinduism](/wiki/Hinduism_in_Singapore) (10,715 residents, 5.20%), and [Sikhism](/wiki/Sikhism_in_Singapore) (639 residents, 0.22%). ### Language Languages most frequently spoken at home, Sengkang (2020 census)Languagespercent[English](/wiki/Singapore_English)49.5%[Mandarin Chinese](/wiki/Mandarin_Chinese)32.5%[Malay](/wiki/Malay_Language)6.9%[Chinese dialects](/wiki/Chinese_dialects)7.0%[Tamil](/wiki/Tamil_Language)2.7%[Other Indian languages](/wiki/Languages_of_India)0.9%Others0.6% The frequently spoken languages in Sengkang are largely consistent with the national average, with a lower proportion of [Malay](/wiki/Malay_Language) and [Chinese dialect](/wiki/Chinese_dialects) speakers. Of the 8,161 [Indian language](/wiki/Languages_of_India) speakers, majority (6,170 residents) are [Tamil](/wiki/Tamil_Language) speakers, constituting 2.7% of residents. ### Education As of 2020, 98.2% of the population above 15 years old in Sengkang is literate. This ranking the 6th highest among all planning areas in Singapore. 70.1% of residents are literate in two languages, with the most common language pair being English and Chinese (52.4% of residents). 7.1% of residents are literate in three or more languages. 62,586 residents in Sengkang have attained a university qualification, constituting 33.6% of the population. In contrast, 15,853 residents, or 8.5% of the population, have no educational qualifications. ### Employment and income According to the 2020 Census of Population, 141,414 of residents aged 15 years and over in Sengkang are employed, out of the 148,800 in the [labour force](/wiki/Workforce). This equates to an employment rate of 95.0%, higher than the [national employment rate](/wiki/Employment_in_Singapore) of 94.2%. The remaining 57,197 residents aged above 15 in Sengkang are outside the labour force. Among the employed residents in Sengkang aged 15 years and over, most earn a gross monthly income of between S$1,000 and S$1,999, with 12.2% being in that category. 6.1% earn less than S$1,000 per month, while 4.7% earn above S$15,000 per month. Additionally, most resident households in Sengkang have a monthly household income of S$20,000 and over, constituting 11.0% of all households. The second highest category for monthly household income is between S$15,000 and S$17,499, encompassing 7.6% of all households. ## Notable places Sengkang's two main rivers, [Sungei Punggol](/wiki/Sungei_Punggol) and [Sungei Serangoon](/wiki/Sungei_Serangoon), run through the town with a network of green connectors along their [banks](/wiki/Bank_(geography)). They link housing precincts to neighbourhood parks such as [Sengkang Riverside Park](/wiki/Sengkang_Riverside_Park), as well as the Sengkang Swimming Complex, [Sengkang Hockey Stadium](/wiki/Sengkang_Hockey_Stadium), Lorang Hualus and Anchorvale Community Centre. These park connectors are linked to the [Coney Island](/wiki/Coney_Island,_Singapore) Park in [Punggol New Town](/wiki/Punggol_New_Town) and the existing [Punggol Park](/wiki/Punggol_Park) in the south, to better serve the recreational needs of the residents of Sengkang. [Sengkang Sculpture Park](/wiki/Sengkang_Sculpture_Park), located in [Compassvale](/wiki/Compassvale), is an elongated green space created below the [LRT](/wiki/Sengkang_LRT) viaducts. Sengkang's major [public transport](/wiki/Transport_in_Singapore) amenities were built in tandem with the main public housing development. The main heavy rail tunnels through Sengkang and the elevated track infrastructure of the intra-town [Sengkang LRT](/wiki/Sengkang_LRT_line) were developed as the existing public housing blocks were being built in the late 1990s. The amenities were built in a contiguous [building complex](/wiki/Building), which gives commuters direct access between [Sengkang MRT/LRT station](/wiki/Sengkang_MRT/LRT_station), [Sengkang Bus Interchange](/wiki/Sengkang_Bus_Interchange), Compass Heights condominium and [Compass One](/wiki/Compass_One) shopping centre. The [Compassvale bus Interchange](/wiki/Compassvale_Bus_Interchange) was later built besides Sengkang Bus Interchange, and came into operations on 12 March 2017. ## Transportation City planners plan for [public transport](/wiki/Public_transport) to eventually become the preferred [mode of transport](/wiki/Mode_of_transport). The government of Singapore uses public transport to reduce pollution caused by heavy road traffic. Sengkang is part of the [Urban Redevelopment Authority's](/wiki/Urban_Redevelopment_Authority) focus for realising this [urban planning](/wiki/Urban_planning) model. As Sengkang is relatively distant from the [city](/wiki/City) centre at the [Central Area](/wiki/Central_Area,_Singapore), an efficient, high-volume and high-speed public transport system is also preferred to using [road networks](/wiki/Road_transport_in_Singapore), as the government is aiming to reduce the number of cars on the road. ### Public transport #### North East Line Sengkang Town is linked to the city via the [North East Line](/wiki/North_East_Line) (NEL) at [Sengkang MRT/LRT station](/wiki/Sengkang_MRT/LRT_station), located at the town centre, and [Buangkok station](/wiki/Buangkok_MRT_station), located at the southern end of the town. The NEL is a fully automated heavy rail mass rapid transit line which started operations on 20 June 2003. It is operated by [SBS Transit](/wiki/SBS_Transit). Sengkang station, an interchange with the Sengkang LRT, shares a building complex with [Sengkang Bus Interchange](/wiki/Sengkang_Bus_Interchange) for commuters' ease of switching across the different available modes of public transport. The MRT portion of the station began operations on 20 June 2003, together with most of the NEL, whereas the LRT portion of the station had already opened on 18 January that year. Buangkok station, the other station along the NEL in Sengkang Town, serves the housing developments in [Buangkok](/wiki/Buangkok), at [Compassvale](/wiki/Compassvale), and the northern part of [Hougang New Town](/wiki/Hougang_New_Town). The station was initially left unopened due to a lack of development in the vicinity, but started operations on 15 January 2006 once the first development in the area was completed. #### Sengkang LRT line The intra-town Sengkang [Light Rail Transit](/wiki/Light_Rail_Transit_(Singapore)) (LRT) system is a 10.7 km light rail line that serves to link residents to the town centre. It is a fully automated system, and its rolling stock is supplied by [Mitsubishi](/wiki/Mitsubishi) Heavy Industries. The system is also operated by SBS Transit. The Sengkang LRT line forms two loops, East Loop and West Loop, that skirt the perimeter of the new town. The LRT line has 14 stations and all are in operation. The line began service on 18 January 2003. #### Sengkang Bus Interchange The Sengkang Bus Interchange was opened on 12 June 1998 as a terminal. At that time, developments around the area in Sengkang New Town were still actively in progress. The Sengkang Bus Interchange is located at the ground level of Compass Heights condominium, next to [Sengkang station](/wiki/Sengkang_MRT/LRT_station), which was opened on 18 January 2003, and is the second [air-conditioned](/wiki/Air-conditioned) bus interchange in Singapore, after [Toa Payoh Bus Interchange](/wiki/Toa_Payoh_Bus_Interchange). #### Compassvale Bus Interchange On 24 November 2014, LTA officially announced the expansion of the Sengkang Bus Interchange to accommodate future bus services under the Bus Service Enhancement Programme (BSEP) Scheme as the current interchange does not have enough parking spaces for more services. The expansion consists of 12 additional parking bays, boarding and alighting facilities, concourse area, staff lounge and a canteen. The expansion works were completed in the third quarter of 2016. The extension, named Compassvale Bus Interchange, is located adjacent to Sengkang Bus Interchange along Sengkang Square and it officially opened on 12 March 2017. With the opening of Buangkok ITH, the interchange has ceased to operate on 1 December 2024. #### Buangkok Bus Interchange A new bus interchange, Buangkok Bus Interchange, opened as part of a mixed, integrated development named Sengkang Grand Residences/Mall on 1 December 2024. The interchange was due to be completed by the third quarter of 2023 but was delayed. It is accessible from Exit A of [Buangkok MRT station](/wiki/Buangkok_MRT_station) on the [North East Line](/wiki/North_East_Line). ### Road network Sengkang is connected to many parts of Singapore through its road network. The [Tampines Expressway](/wiki/Tampines_Expressway) (TPE) links Sengkang Town up with Singapore's [expressway](/wiki/Controlled-access_highway) network. The [Kallang–Paya Lebar Expressway](/wiki/Kallang%E2%80%93Paya_Lebar_Expressway), which provides a direct route to the [city area](/wiki/Central_Area,_Singapore) via TPE, was completed in late 2008. New roads were built in the early 2000s to ease [traffic congestion](/wiki/Traffic_congestion) on Punggol Road. Buangkok Green and Buangkok Drive were completed in the second half of 1999. They shorten the drive from the [Central Expressway](/wiki/Central_Expressway,_Singapore) near Ang Mo Kio Avenue 5 to Punggol Road. The first part of a S$23 million project to make Sengkang town less congested was opened on 7 April 2001. The completed work involved an extension to Sengkang East Road, which runs from Compassvale Street to Tampines Expressway (TPE), and a slip road to the TPE in the direction of the [Seletar](/wiki/Seletar_Expressway) and [Central Expressways](/wiki/Central_Expressway,_Singapore). The second part of the project involved the completion of the Sengkang East Road and Sengkang East Drive Flyovers. The Sengkang East Road and Sengkang East Drive Flyovers were officially opened on 16 May 2004, making it easier for residents of Sengkang and Punggol new towns in the north-east to travel to other parts of Singapore. Extensions had been made to Sengkang West Avenue and Sengkang West Way to connect to the future Sengkang West Industrial Park. Major roads that run within the boundaries of Sengkang Planning Area include Sengkang East Drive, Sengkang East Avenue, Sengkang East Road, Sengkang East Way, Sengkang West Avenue, Sengkang West Road, Sengkang West Way and [Jalan Kayu](/wiki/Jalan_Kayu). ## Sengkang Town Centre There are four major [building complexes](/wiki/Building#Complex) within the Sengkang Town Centre. ### Compass Heights Compass Heights is a private condominium complex that is integrated with public transportation facilities in its surroundings. ### Sengkang Interchange Sengkang Interchange, located in the centre of the town, consists of the [Sengkang Bus Interchange](/wiki/Sengkang_Bus_Interchange) and the [Sengkang MRT/LRT station](/wiki/Sengkang_MRT/LRT_station). ### Compass One [Compass One](/wiki/Compass_One), formerly known as Compass Point, is Singapore's first thematic suburban shopping centre based on the theme of learning, resulting in the inclusion of a public library. The Compass Point Shopping Centre was constructed at a cost of [S$](/wiki/S$)230 million. The shopping mall started operations in August 2002. The only other shopping mall predating Compass One in Sengkang is Rivervale Plaza, which was initially built with an open-bazaar concept with a wet market until its renovation in 2013, transforming it into an official shopping mall. Compass One also is connected to the Sengkang MRT Station. ### Sengkang Community Hub [Sengkang Community Hub](/wiki/Sengkang_Community_Hub), and its community club and neighbourhood police centre, were officially opened by [Teo Chee Hean](/wiki/Teo_Chee_Hean), [Minister for Defence](/wiki/Ministry_of_Defence_(Singapore)) and Member of Parliament for [Pasir Ris-Punggol Group Representation Constituency](/wiki/Pasir_Ris-Punggol_Group_Representation_Constituency), on 10 December 2005. Some of the facilities that it houses are the KK Women's Clinic @ Sengkang, Sengkang Central Constituency Office, Sengkang Neighbourhood Police Centre, [Sengkang Community Club](/wiki/Sengkang_Community_Club), and the Sengkang Branch of Singapore Post Office. ## Amenities ### Education There are twelve [primary schools](/wiki/Primary_school) and six [secondary schools](/wiki/Secondary_school) in Sengkang New Town as of 2024. The list of schools is as follows: #### Primary schools - Anchor Green Primary School - Compassvale Primary School - Fern Green Primary School - Fernvale Primary School - Nan Chiau Primary School - North Spring Primary School - North Vista Primary School - Palm View Primary School - Rivervale Primary School - Seng Kang Primary School - Sengkang Green Primary School - Springdale Primary School #### Secondary schools - [CHIJ St. Joseph's Convent](/wiki/CHIJ_Saint_Joseph%27s_Convent) - [Compassvale Secondary School](/wiki/Compassvale_Secondary_School) - [Nan Chiau High School](/wiki/Nan_Chiau_High_School) - [North Vista Secondary School](/wiki/North_Vista_Secondary_School) - [Outram Secondary School](/wiki/Outram_Secondary_School) (from 2026) - [Pei Hwa Secondary School](/wiki/Pei_Hwa_Secondary_School) - Seng Kang Secondary School There are also five large childcare centres being built since then, to provide the needs of the town's large demographic of young families. Land provision has also been made for a [junior college](/wiki/Junior_college) in the town to meet future educational demand in the North-East Region. ### Commercial facilities The town depended on one neighbourhood mall; Rivervale Plaza, which was built by HDB and opened in 1999 with a wet market, several shops and a NTUC Fairprice supermarket, before Rivervale Mall opened in 2001. [Compass Point](/wiki/Compass_One) opened in 2002, a year before the Sengkang MRT/LRT station & air-conditioned bus interchange opened. Fernvale Point served the residents of Sengkang West and mostly Fernvale for almost ten years, which was eventually demolished. [Seletar Mall](/wiki/Seletar_Mall), opened in 2014 with the first cinema in Sengkang (closed in Dec 2024). Anchorvale Village, a mixed residential/commercial development; originally slated to open by 2022, will open with a 3-storey hawker centre and neighbourhood shops within its compound below HDB blocks. As of 2024, the development's opened in May 2024. ### Community facilities The first community centre of the new town, Rivervale Community Centre, was opened on 20 June 2004, by [Teo Chee Hean](/wiki/Teo_Chee_Hean), Minister of Defence and Member of Parliament for [Pasir Ris-Punggol Group Representation Constituency](/wiki/Pasir_Ris-Punggol_Group_Representation_Constituency), which was situated at the void deck of Blk 193 Rivervale Drive. It served residents of the town a year before Sengkang Community Club opened a year later at the Town Centre. Anchorvale Community Club opened beside the Sengkang Sports Complex in 2009, while the Fernvale Community Club opened in 2022 with a hawker centre, childcare and a wet market. A new standalone building behind Rivervale Plaza, Rivervale Community Club, was built to replace the old Rivervale Community Centre. It was opened on 30 July 2022. The HDB Branch Office for Sengkang is at Rivervale Plaza. ### Fire stations Sengkang Fire Station, which opened on 19 May 2001, is the biggest [fire station](/wiki/Fire_station) in Singapore. The [S$](/wiki/S$)14 million fire station covers 7,000 square metres, and is used by the [Singapore Civil Defense Force](/wiki/Singapore_Civil_Defense_Force). Sengkang Fire Station has a capacity for 700 [fire fighters](/wiki/Fire_fighter) and rescue personnel. It is also the first station to employ a [water conservation](/wiki/Water_conservation) system where water used during drills are diverted to a pump well for recycling purposes. ### Medical facilities [Sengkang General and Community Hospital](/wiki/Sengkang_Health) is a 1,400 bed regional hospital serving the residents of the north-east region. The hospital was opened on 18 August 2018. Also located in Sengkang is the [SingHealth](/wiki/SingHealth) Sengkang Polyclinic. ### Sports facilities [Sengkang Sports Centre](/wiki/Sengkang_Sports_Centre), formerly known as Sengkang Sports and Recreation Centre, it is co-located with the People’s Association Anchorvale Community Club, and offers one of the two sheltered pools managed by Sports Singapore. Sengkang has established itself as a world-class venue for hockey, with significant facility upgrades being undertaken for the inaugural [Youth Olympic Games](/wiki/Youth_Olympic_Games) in 2010. ## Politics As of 2025, there are 6 MPs representing Sengkang; all 4 MPs from the [Workers' Party](/wiki/Workers%27_Party_(Singapore)) (WP) for [Sengkang GRC](/wiki/Sengkang_Group_Representation_Constituency), 1 of 5 MPs from the governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP) in [Ang Mo Kio GRC](/wiki/Ang_Mo_Kio_Group_Representation_Constituency), and the 1 PAP MP for [Jalan Kayu Single Member Constituency](/wiki/Jalan_Kayu_Single_Member_Constituency) (SMC). Sengkang GRC comprises Rivervale, Compassvale, Sengkang Town Centre, Anchorvale and the northern part of Buangkok while majority of the Fernvale portion is part of [Jalan Kayu SMC](/wiki/Jalan_Kayu_SMC). The remaining portion of Fernvale and the southern part of Buangkok (including Kampong Lorong Buangkok) comes under the Buangkok–Fernvale South ward of the [Ang Mo Kio GRC](/wiki/Ang_Mo_Kio_GRC). Sengkang has been divided and split into many constituencies in the past. Before 1988, the entire area east of [Sungei Punggol](/wiki/Sungei_Punggol) fell under [Punggol SMC](/wiki/Punggol_Single_Member_Constituency), its Member of Parliament (MP) was [Ng Kah Ting](/wiki/Ng_Kah_Ting), who served from 1963 to 1991. The area west of Sungei Punggol fell under [Jalan Kayu SMC](/wiki/Jalan_Kayu_Single_Member_Constituency), whose MP was Heng Chiang Meng, who entered Parliament in 1984. Jalan Kayu SMC was absorbed into [Cheng San GRC](/wiki/Cheng_San_Group_Representation_Constituency) in 1988, followed by Punggol SMC in 1991; by then, the entire Sengkang Town and Punggol New Town were under Cheng San GRC. Michael Lim became the MP for Punggol division following Ng Kah Ting's retirement. For the [1997 general election](/wiki/1997_Singaporean_general_election), Punggol division of Cheng San GRC was split into three wards, Punggol Central, Punggol East and Punggol South, as a result of the growing population in Hougang. The current Sengkang planning area was under Michael Lim, who served the Punggol Central ward. The GRC was contested by a Workers' Party (WP) team led by the then-Secretary-General and former opposition MP [Joshua Benjamin Jeyaretnam](/wiki/Joshua_Benjamin_Jeyaretnam), and [Tang Liang Hong](/wiki/Tang_Liang_Hong), a senior lawyer. In 2001, [Rivervale](/wiki/Rivervale,_Singapore) and [Compassvale](/wiki/Compassvale) fell within the newly-formed [Pasir Ris–Punggol GRC](/wiki/Pasir_Ris%E2%80%93Punggol_Group_Representation_Constituency), as part of the Punggol South and Punggol Central wards, with Michael Lim and [Charles Chong](/wiki/Charles_Chong) respectively as their MPs. Most of [Anchorvale](/wiki/Anchorvale) and [Fernvale](/wiki/Fernvale,_Singapore) fell within the [Jalan Kayu](/wiki/Jalan_Kayu) division of [Ang Mo Kio GRC](/wiki/Ang_Mo_Kio_Group_Representation_Constituency), under [Wee Siew Kim](/wiki/Wee_Siew_Kim). In the [2006 general election](/wiki/2006_Singaporean_general_election), Pasir Ris–Punggol GRC was expanded from five to six MPs as the population in Sengkang and Punggol new towns had grown since 2001. As such, the Punggol East ward was formed from parts of the Punggol South and Punggol North wards, served by [Michael Palmer](/wiki/Michael_Palmer_(politician)). Michael Lim retired from politics in 2006 and did not take part in the election that year, with [Teo Ser Luck](/wiki/Teo_Ser_Luck) replacing him in the Punggol South ward. Meanwhile, in Ang Mo Kio GRC, Jalan Kayu division was carved to include Sengkang West ward, returning debut MP [Lam Pin Min](/wiki/Lam_Pin_Min) to parliament. Most of Rivervale was carved out of Pasir Ris–Punggol GRC to form the [Punggol East SMC](/wiki/Punggol_East_Single_Member_Constituency) in the [2011 general election](/wiki/2011_Singaporean_general_election). Punggol East SMC saw the only three-cornered fight in the 2011 elections, with Palmer from the People's Action Party, Desmond Lim from the [Singapore Democratic Alliance](/wiki/Singapore_Democratic_Alliance), and [Lee Li Lian](/wiki/Lee_Li_Lian) from the Workers' Party contesting, eventually the SMC was retained by incumbent Michael Palmer. Compassvale, and a small portion of Rivervale, came under the Punggol South and Punggol Central divisions of Pasir Ris–Punggol GRC, with Teo Ser Luck taking over as MP for Punggol Central from Charles Chong, and [Gan Thiam Poh](/wiki/Gan_Thiam_Poh) replacing Teo in Punggol South. Anchorvale and Fernvale were carved into [Sengkang West SMC](/wiki/Sengkang_West_Single_Member_Constituency), with Lam Pin Min as its MP. In December 2012, Palmer quit the PAP over an extra-marital affair, thereby vacating his seat and paving the way for a [by-election](/wiki/2013_Singaporean_by-election) in Punggol East SMC that was called by the Prime Minister in January 2013. SDA's Lim and WP's Lee returned to contest the by-election, and the PAP fielded a newcomer, [Koh Poh Koon](/wiki/Koh_Poh_Koon), who had joined the party only three weeks earlier. They were joined by a fourth competing party, the [Reform Party](/wiki/Reform_Party_(Singapore)), represented by its secretary-general [Kenneth Jeyaretnam](/wiki/Kenneth_Jeyaretnam). Despite this being a four-way fight, WP's Lee emerged victorious with 54.52% of valid votes cast, shocking many on both sides of the political divide, who expected it to be a close fight. PAP's Koh came in second with 43.71% of the votes, with the RP and SDA candidates losing their electoral deposits with less than 2% of the votes combined. Lee was unseated in the [2015 general election](/wiki/2015_Singaporean_general_election) when PAP candidate and incumbent Deputy Speaker [Charles Chong](/wiki/Charles_Chong) garnered 51.76% of the valid votes cast in a straight fight. Teo Ser Luck's Punggol Central ward in Pasir Ris–Punggol GRC was renamed Sengkang Central, while Gan Thiam Poh's Punggol South ward was transferred to Ang Mo Kio GRC and renamed Sengkang South. A portion of Fernvale was absorbed from Sengkang West SMC back into Ang Mo Kio GRC as part of the Sengkang South ward. In 2020, [a new namesake four-member GRC](/wiki/Sengkang_Group_Representation_Constituency) was formed from Punggol East SMC, the eastern half of Sengkang West SMC and the Sengkang Central ward of Pasir Ris–Punggol GRC. The Sengkang Central ward was split into half; the Compassvale ward was formed from the northern half, while the [Buangkok](/wiki/Buangkok) ward consisted of the southern half and a small portion of Rivervale; Punggol East and Sengkang West were renamed Rivervale and Anchorvale respectively. With the retirements of Charles Chong and Teo Ser Luck, then-Minister in the Prime Minister's Office [Ng Chee Meng](/wiki/Ng_Chee_Meng) was sent to lead the People's Action Party team in the [2020 general election](/wiki/2020_Singaporean_general_election). Raymond Lye succeeded Chong in Punggol East, while Sengkang Central was intended to be divided between Ng and [Amrin Amin](/wiki/Amrin_Amin), with Lam Pin Min defending Sengkang West. However, they were defeated by a WP team consisting of [He Ting Ru](/wiki/He_Ting_Ru), [Jamus Lim](/wiki/Jamus_Lim), [Louis Chua](/wiki/Louis_Chua) and [Raeesah Khan](/wiki/Raeesah_Khan), who would serve as the MPs for Buangkok, Anchorvale, Rivervale and Compassvale respectively. Fernvale was re-absorbed into Ang Mo Kio GRC, forming a namesake division with Gan Thiam Poh as its MP. [Raeesah Khan](/wiki/Raeesah_Khan) resigned from the WP on 30 November 2021.. ### Town councils Currently, Sengkang falls under the jurisdiction of three town councils:Sengkang Town Council, Ang Mo Kio Town Council and Jalan Kayu Town Council. Most of Sengkang is under the Sengkang Town Council which is managed by the Workers' Party, while the Fernvale and Jalan Kayu constituencies are under the PAP-run Jalan Kayu Town Council. Prior to 2015, the town has seen jurisdiction under various town councils. With Cheng San Town Council from the beginning of the town to its dissolution in 2001, after which the wards of Punggol Central was under Pasir Ris-Punggol, throughout 2001-2020, while Jalan Kayu, then split into Sengkang West, under Ang Mo Kio, throughout 2001–present and for a short time, Aljunied-Hougang-Punggol East, which manages [Punggol East SMC](/wiki/Punggol_East_SMC) then from 2013-2015. - Singapore portal - [New towns of Singapore](/wiki/New_towns_of_Singapore) - [List of Kangchu system placename etymologies](/wiki/List_of_Kangchu_system_placename_etymologies) ### Bibliography - Victor R Savage, Brenda S A Yeoh (2003). *Toponymics – A Study of Singapore Street Names*. Singapore: Eastern Universities Press. [ISBN](/wiki/ISBN_(identifier)) 981-210-205-1. - Tommy Koh; Timothy Auger; Jimmy Yap; Ng Wei Chian, eds. (2006). *Singapore: The Encyclopedia*. Singapore: Editions Didier Millet. [ISBN](/wiki/ISBN_(identifier)) 981-4155-63-2. - \"Transcript of Prime Minister Lee Hsien Loong's National Day Rally English Speech on 19 August 2007 at NUS University Cultural Centre\". *[Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts_(Singapore))*. 19 August 2007. Archived from the original on 27 September 2007. Retrieved 2 September 2007. - Sengkang West Portal - Jalan Kayu Community Website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:52:05.468084",
  "title": "Sengkang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sengkang"
}