{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:52:18.939442"
  },
  "content": "Island of Singapore **Sentosa Island** ([IPA](/wiki/International_Phonetic_Alphabet): /sɛnˈtoʊsə/ *sen-TOH-sə*), known mononymously as **Sentosa**, is an [island](/wiki/Island) located off the southern coast of [Singapore](/wiki/Singapore)'s [main island](/wiki/Singapore_Island). The island is separated from the main island of Singapore by a channel of water, the [Keppel Harbour](/wiki/Keppel_Harbour), and is adjacent to [Pulau Brani](/wiki/Pulau_Brani), a smaller island wedged between Sentosa and the main island. Formerly used as a British military base and afterwards as a Japanese prisoner-of-war camp, the island was renamed Sentosa in the 1970s to become a popular tourist destination. It is now home to a popular resort that receives up to 25 million visitors per year. Attractions include a 2.5 km (1.6 mi) long sheltered beach, [Madame Tussauds Singapore](/wiki/Madame_Tussauds_Singapore), an extensive cable car network, [Fort Siloso](/wiki/Fort_Siloso), two [golf courses](/wiki/Golf_course), 14 [hotels](/wiki/Hotels) as well as the [Resorts World Sentosa](/wiki/Resorts_World_Sentosa), which features the [Universal Studios Singapore](/wiki/Universal_Studios_Singapore) theme park and one of Singapore's two casinos, the other being in [Marina Bay Sands](/wiki/Marina_Bay_Sands). Sentosa is also widely known as being the location of the [2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit), where [North Korean Chairman](/wiki/Chairman_of_the_Workers%27_Party_of_Korea) [Kim Jong-un](/wiki/Kim_Jong-un) and [U.S. President](/wiki/President_of_the_United_States) [Donald Trump](/wiki/Donald_Trump) met at the [Capella Singapore](/wiki/Capella_Singapore) located on the island. This was the first-ever meeting between the leaders of [North Korea](/wiki/North_Korea) and the [United States](/wiki/United_States). As an island geared towards recreation and tourism with its casino and resorts under a tropical climate, as well as residences for the wealthy, Sentosa is more than twice the size of [Monaco](/wiki/Monaco). ## Etymology The name *Sentosa* translates to \"peace and tranquility\" in [Malay](/wiki/Malay_language), which was in turn derived from the [Sanskrit](/wiki/Sanskrit) term *[Santosha](/wiki/Santosha)*, meaning \"contentment, satisfaction\". Sentosa was formerly known as **Pulau Blakang Mati** which in [Malay](/wiki/Malay_language) means the \"Island of Death Behind\". The name *Blakang Mati* is old; an island was identified as *Blacan Mati* in [Manuel Godinho de Erédia](/wiki/Manuel_Godinho_de_Er%C3%A9dia)'s 1604 map of Singapore. Other early references to the island of Belakang Mati include *Burne Beard Island* in Wilde's 1780 MS map, *Pulau Niry*, *Nirifa* from 1690 to 1700, and the nineteenth century reference as *Pulau Panjang* (J.H. Moor). However, early maps did not separate Blakang Mati from the adjacent island of [Pulau Brani](/wiki/Pulau_Brani), so it is uncertain to which island the seventeenth century place names referred. The island has changed name several times. Up to 1830, it was called Pulau Panjang (\"long island\"). In an 1828 sketch of Singapore Island, the island is referred to as *Po. Panjang*. According to Bennett (1834), the name Blakang Mati was only given to the [hill](/wiki/Hill) on the island by the [Malay](/wiki/Malay_people) villagers on the island. The Malay name for this island is literally translated as \"dead back\" or \"behind the dead\"; *belakang* means \"at the back\" or \"behind\" or \"after\"; *mati* means \"dead\". It is also called the \"dead island\" or the \"island of the dead\" or perhaps \"island of after death\". There are a number of different suggestions on how the island came to acquire such an unpropitious name: - One account attributed the ominous name to murder and [piracy](/wiki/Piracy) in the island's past. - A second claimed that the island is the material paradise for the [spirits](/wiki/Ghost) of warriors said to have been buried at [Pulau Brani](/wiki/Pulau_Brani). - A third account claims that an outbreak of [disease](/wiki/Disease) on the island in the late 1840s almost wiped out the original [Bugis](/wiki/Bugis) settlers on the island. Dr Robert Little, a [British](/wiki/United_Kingdom) [coroner](/wiki/Coroner) investigating the deaths, stumbled upon what was called Belakang Mati Fever, purportedly a type of [fever](/wiki/Fever) caused by [miasmastic](/wiki/Miasma_theory) fumes arising from decaying leaves and [swampy](/wiki/Swamp) water on the island. This led to a controversy in medical circles at that time as to the causes of this disease. The disease was later recognised in 1898 as [malaria](/wiki/Malaria) spread by the *[Anopheles](/wiki/Anopheles)* [mosquito](/wiki/Mosquito). The government's malaria research station was originally located here. - A fourth interpretation is that \"dead back island\" was so-called because of the lack of fertile [soil](/wiki/Soil) on the hills. However, since the island creates an area of dead water behind it with no wind (hence \"still behind\" - still or stopped being an alternative translation of mati) it may be as simple as this — less romantic perhaps, but believable from a nautical viewpoint. In 1827, Captain Edward Lake of the [Bengal Engineer Group](/wiki/Bengal_Engineer_Group) in his report on [public works](/wiki/Public_works) and [fortifications](/wiki/Fortification) had proposed an alternative name for Belakang Mati as the \"Island of St George\". However, the island was seen as too unhealthy for habitation and his proposed name was never realised. In a 1972 contest organised by the [Singapore Tourist Promotion Board](/wiki/Singapore_Tourist_Promotion_Board), the island was renamed *Sentosa*, a Malay word meaning \"[peace](/wiki/Peace) and [tranquility](/wiki/Tranquility)\", from [Sanskrit](/wiki/Sanskrit), *[Santosha](/wiki/Santosha)*. ## History ### Early period #### Pulau Blakang Mati *Pulau Blakang Mati* was once home to the native Malays who were relocated to the mainland, together with the [Pulau Brani](/wiki/Pulau_Brani) villagers, due to urban redevelopment in the late 1970s. In the nineteenth century, the island was considered important because it protected the passage into [Keppel Harbour](/wiki/Keppel_Harbour). Plans to fortify the island as part of the defence plan for Singapore were drawn up as early as 1827, but few fortifications actually materialised until the 1880s, when the rapid growth of the [harbour](/wiki/Harbour) led to concern over the protection of [coal](/wiki/Coal) stocks against enemy attack. The four [forts](/wiki/Fort) built on the island were [Fort Siloso](/wiki/Fort_Siloso), Fort Serapong, Fort Connaught and the Mount Imbiah Battery. #### Fort Siloso and Sarang Rimau The western end of Pulau Blakang Mati, the place where Fort Siloso is now, used to be called *sarang rimau* (the [tiger](/wiki/Tiger)'s den). *Selusuh* is a kind of [herb](/wiki/Herb) used as a remedy in [childbirth](/wiki/Childbirth), but there is no explanation of how the fort came to be so called, the *orang laut* of Kampong Kopit only knowing the place by the name of *sarang rimau*. By the 1930s, the island was heavily fortified and a crucial component of Fortress Singapore, and the base of the [Royal Artillery](/wiki/Royal_Artillery). #### Fort Connaught *Fort Connaught*, on eastern side of Sentosa island, was earlier called *Belakang Mati East Battery* which was constructed in 1878. It had ammunition similar to Fort Siloso, with three [Mark I 7 Inch RML Guns](/wiki/RML_7-inch_gun) of 6+1⁄2 tons and two [RML 64-pounder 64 cwt guns](/wiki/RML_64-pounder_64_cwt_gun). In 1890 it was renamed the Fort Connaught to mark the visit of [Duke of Connaught](/wiki/Duke_of_Connaught). In 1930s, fort was rebuilt and three [Mark X 9·2-Inch Guns](/wiki/BL_9.2-inch_Mk_IX_%E2%80%93_X_naval_gun) on 30° [Mark VII Mountings](/wiki/BL_14-inch_Mk_VII_naval_gun) with better range replaced the older firepower. On Mount Serapong, an underground Battery Plotting Room was constructed on the northern side and a Battery Observation Post on top of the hill. In 1942, during WWII, British forces at this fort exhausted their ammunition, and guns were tempered and disabled before the British surrendered to Japanese forces. A significant part of Mount Serapong was removed and it made way for the present day *[Tanjong Golf Course](/wiki/Sentosa_Golf_Club)*, due to which a major part of the fort was destroyed. Presently few remains of the fort can still be seen in the extreme east corner of the Tanjong Golf Course, namely observation tower in the northeast corner of golf course near Allenbrooke road, then to the south of it are gun number 3, gun number 2 and engine room, and finally gun number 1 - all short distance from each other. #### Fort Serapong *Fort Serapong*, Fort Siloso, Fort Connaught and Imbiah Battery were constructed on Sentosa island in 1870 to form the southern defence of Singapore. Presently only 20% of the original fort has been discovered. Ruins are reachable via Fort Serapong Road, then walking on a forested ridge which has several \"Danger: keep out\" type of signs. ### Second World War During the [Second World War](/wiki/Second_World_War), the island was a British military fortress. The British set up large-calibre gun fortifications at various points along the island that were aligned to the south, facing the sea in expectation of a seaward [Japanese](/wiki/Japan) assault. The myth that the guns were incapable of pointing north developed after the War but this was wrong, they could swivel to point north but they were only equipped with armour-piercing shells for ships which made the shells ineffective against land based forces. The Japanese invaded and captured Singapore from the north, after having done the same to [Malaya](/wiki/British_Malaya) (now known as West or [Peninsular Malaysia](/wiki/Peninsular_Malaysia)). Following the surrender of the Allied Forces on 15 February 1942, [Fort Siloso](/wiki/Fort_Siloso) became a [prisoner of war](/wiki/Prisoner_of_war) camp, housing Australian and British prisoners of the Japanese. During the [Japanese Occupation](/wiki/Japanese_Occupation_of_Singapore), under the [Sook Ching Operation](/wiki/Sook_Ching_Operation), [Chinese](/wiki/China) men who were suspected, often arbitrarily, of being involved in anti-Japanese activities were brutally killed. 300 bodies, riddled with bullet wounds, washed up on the beach of Pulau Belakang Mati, and were buried by the British prisoners. ### 1945–72 After the [Japanese surrender](/wiki/End_of_World_War_II_in_the_Pacific) in 1945 and the return of Singapore to British rule, the island became the base of the locally enlisted First Singapore Regiment of the Royal Artillery (1st SRRA) in 1947. Other locally enlisted men from Singapore were sent to the island for [basic military training](/wiki/Recruit_training) before being sent to other units of the [British Army](/wiki/British_Army) in Singapore. Ten years later, the 1st SRRA was disbanded and its guns dismantled. The coast [artillery](/wiki/Artillery) was replaced with [Gurkha](/wiki/Gurkha) [infantry](/wiki/Infantry) units, first the 2/7th [Duke of Edinburgh](/wiki/Duke_of_Edinburgh)'s own Gurkha Rifles and later the 2/10th Princess Mary's own Gurkha Rifles. Fort Siloso and Mount Imbiah became a religious [retreat](/wiki/Retreat_(spiritual)) and a [Protestant](/wiki/Protestant) [church](/wiki/Church_(building)) house respectively. Fort Connaught was left in ruins. Fort Serapong became a secure communications and listening station. In the early 1960s, during the [Indonesian Confrontation](/wiki/Indonesian_Confrontation), the 2/10th occupied the island. Even though Indonesia was in close proximity there were few amateurish attempts of direct action by the Indonesians against Singapore. The Gurkha battalion rotated on a six monthly basis to Borneo where most military action during the Confrontation took place. A significant parade took place on the island during the Confrontation to announce the award of the Victoria Cross to [Rambahadur Limbu](/wiki/Rambahadur_Limbu) for an action in Borneo. With the end of the Confrontation in 1966 and the withdrawal of the Gurkha battalion from the island, the British handed over Sentosa to the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) of the newly independent [Government of Singapore](/wiki/Government_of_Singapore) in 1967. In 1967, Pulau Belakang Mati became the [base](/wiki/Military_base) for the Singapore Naval Volunteer Force, which relocated there from its old base at [Telok Ayer](/wiki/Telok_Ayer) Basin. The School of Maritime Training was also set up there, as was the first Naval Medical Centre. It became part of the Republic of Singapore Navy. Also in 1967, Pulau Belakang Mati became the military base for the School of Field Engineers, which relocated there from Pasir Leba Camp. The Field Engineer School trained the 1st Batch of Combat Engineer Commanders who in turn trained the 1st batch of Full Time National Servicemen who were enlisted in 1968. The 1st operational Combat Engineer Battalion was also raised here. The Engineer Headquarters (EHQ) was established here 1970 before moving to Gillman Camp in 1971. By 1967, the Singapore government had reached an agreement with [Esso](/wiki/Esso) to build an oil refinery on the island with the intent to eventually turn the island into a petrochemical complex. However, the then-chief of the Urban Renewal Unit (the forerunner of the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority)), [Alan Choe](/wiki/Alan_Choe), wanted to somehow preserve the greenery of the island. With the support of Dr [Albert Winsemius](/wiki/Albert_Winsemius), he managed to convince then-Finance Minister [Goh Keng Swee](/wiki/Goh_Keng_Swee) and then-Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) to turn the island into a tourism destination, and shift the planned Esso refinery to [Jurong Island](/wiki/Jurong_Island) instead. ### Tourism development from the 1970s In the late 1960s, the government began to set out proposals for developing the island, and a contest to find a new name for the island was held in November 1969. The island was renamed \"Sentosa\" in September 1970, which means *peace and tranquility* in [Malay](/wiki/Malay_language) (from [Sanskrit](/wiki/Sanskrit), *[Santosha](/wiki/Santosha)*), from a suggestion by the public. In March 1971, the government announced plans to develop the island into a [holiday resort](/wiki/Holiday_resort) for local visitors and [tourists](/wiki/Tourist), and a S$124-million plan for developing Sentosa was unveiled in March 1972. The [Sentosa Development Corporation](/wiki/Sentosa_Development_Corporation) was formed and incorporated on 1 September 1972 to oversee the development of the island. Since then, some [S$](/wiki/Singapore_dollar)420 million of private capital and another S$500 million of government funds have been invested to develop the island. In 1974 the [Singapore Cable Car](/wiki/Singapore_Cable_Car) system was built, linking Sentosa to [Mount Faber](/wiki/Mount_Faber). Finally, in 1975, the Republic of Singapore Navy had moved out from the Sentosa to Pulau Brani Island. A series of attractions were subsequently opened for visitors including [Fort Siloso](/wiki/Fort_Siloso), [Surrender Chamber](/wiki/Surrender_Chamber) wax museum, [Musical Fountain](/wiki/Sentosa_Musical_Fountain), and the [Underwater World](/wiki/Underwater_World,_Singapore). The causeway bridge was opened in 1992 connecting Sentosa to the [mainland](/wiki/Pulau_Ujong). The [Sentosa Monorail](/wiki/Sentosa_Monorail) system was opened in 1982 to transport visitors across seven stations located around the western side of the island. ### Stagnation in the 1990s Sentosa's attractions in the 1990s were criticised for being \"expensive, dated and lacking appeal\". While some attractions like [Underwater World](/wiki/Underwater_World,_Singapore) (1991-2016) were popular, others including [Fantasy Island](/wiki/Fantasy_Island,_Singapore) (1994-2001), Volcano Land (1995-2002) and Asian Village (1993-2001) shut down due to lack of patronage. Singaporeans joked about \"Sentosa\" being an acronym of \"So Expensive and Nothing To See Also\". The former political prisoner and Nobel prize nominee [Chia Thye Poh](/wiki/Chia_Thye_Poh) spent three-and-a-half years in internal exile on Sentosa after he was freed from 23 years in jail in 1989. ### Relaunch in the 2000s In June 2002, a S$3 billion, 10-year overhaul of Sentosa was announced. This included the launch of the [Sentosa Cove](/wiki/Sentosa_Cove) residential enclave in 2003 and the controversial decision to award the Malaysian [Genting Group](/wiki/Genting_Group) the right to build the [Resorts World Sentosa](/wiki/Resorts_World_Sentosa) [integrated resort](/wiki/Integrated_resort), offering [gambling](/wiki/Gambling) and the [Universal Studios Singapore](/wiki/Universal_Studios_Singapore) theme park. An environmental assessment conducted by the government of Singapore concluded that the construction of an integrated resort on Sentosa would result in a high likelihood of high scale [biodiversity loss](/wiki/Biodiversity_loss), habitat destruction, soil erosion and climate change, as well as several other destructive ecological impacts. Therefore, over two hundred trees and plants from the area that was to be cleared for the construction of the resorts were replanted elsewhere on the island to minimize negative environmental impact. On 16 March 2005, the monorail service was discontinued to make way for the new [Sentosa Express](/wiki/Sentosa_Express), which commenced operations on 15 January 2007. In 2009, construction of a new [footbridge](/wiki/Footbridge) began. The S$70 million Sentosa Boardwalk includes themed [gardens](/wiki/Gardens), [shops](/wiki/Retail) and [eateries](/wiki/Eateries). There are covered [walkways](/wiki/Walkways) and travellators along the boardwalk for rainy days. The Boardwalk, officially opened by Singapore's Deputy Prime Minister Teo Chee Hean on 29 January 2011, provides visitors with an alternative mode of travel to reach the island. Sentosa Boardwalk, designed by Aedas, was named Best Leisure Architecture in Asia Pacific and 5* Best Leisure Architecture in Singapore, at the 2014 Asia Pacific Property Awards. Resorts World Sentosa opened in 2010, with Universal Studios Singapore following in 2011, and the S.E.A. Aquarium (now [Singapore Oceanarium](/wiki/Singapore_Oceanarium)) and [Adventure Cove Waterpark](/wiki/Adventure_Cove_Waterpark) in 2012. ### 2018 The island hosted the [2018 North Korea–United States summit](/wiki/2018_North_Korea%E2%80%93United_States_summit) between the United States President [Donald Trump](/wiki/Donald_Trump) and [Kim Jong-un](/wiki/Kim_Jong-un) of [North Korea](/wiki/North_Korea) on 12 June 2018, at the [Capella Singapore](/wiki/Capella_Singapore). Sentosa island was gazetted as a 'special event area' by the Singapore Government and the Capella Singapore was chosen as the venue by the [White House](/wiki/White_House), a week prior to the summit. In his 2018 autobiography, Emeritus Senior Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) revealed that, when the tourism sector was suffering, Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) made an attempt to allow a [nudist resort](/wiki/Nudist_resort) to be built on Sentosa in order to attract tourists, but the motion was ultimately vetoed. ### 2024 oil spill On 14 June 2024 at about 2.20pm, a dredger hit a stationary bunker vessel stationed at [Pasir Panjang](/wiki/Pasir_Panjang) Terminal, causing an [oil spill](/wiki/Oil_spill) that spread across several [Southern Islands](/wiki/Southern_Islands) through [East Coast Park](/wiki/East_Coast_Park), including Palawan, Siloso and Tanjong beaches. Sentosa announced that the beaches are still available, but any water-related activities are suspended until 3 August while cleaning is underway. SDC personnel joined a multi-agency effort that collected over 71,000 kg of oil-soaked sand and debris from the island's coastlines. Following the incident, the National Parks Board (NParks) launched a 15-month study with local research institutions to monitor the long-term effects of the oil spill on the marine biodiversity in affected areas, including Sentosa. ## Geography This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(January 2024)* *(Learn how and when to remove this message)* The island has an area of close to 5 km2 (1.9 sq mi). It lies just half a kilometre (a quarter of a mile) away from the southern coast of the [main island of Singapore](/wiki/Main_island_of_Singapore). It is Singapore's fourth-largest island (excluding the [main island](/wiki/Pulau_Ujong)). 70% of the island was covered by secondary rainforest, the habitat of [monitor lizards](/wiki/Monitor_lizard), [monkeys](/wiki/Monkey), [peacocks](/wiki/Peacock), [parrots](/wiki/Parrot) as well as other native fauna and flora, also, when the construction of [Resorts World Sentosa](/wiki/Resorts_World_Sentosa) commenced; environmental impact was kept at a minimum when over two hundred trees in the designated area were replanted elsewhere on the island. Further development has significantly impacted the [biodiversity](/wiki/Biodiversity) of the island, resulting in the loss of much of the native [fauna](/wiki/Fauna) and [flora](/wiki/Flora). The island also has a 3.2 km (2.0 mi) stretch of white sand beach, which has impacted the reef. Significantly large portions of land are currently being added to Sentosa due to [land reclamation](/wiki/Land_reclamation). ## Facilities ### Transport #### Cable Car and Mainland Buses Sentosa can be reached from the [Singapore mainland](/wiki/Singapore_mainland) via a short [causeway](/wiki/Causeway) or [Cable Car](/wiki/Singapore_Cable_Car), which originates from [Mount Faber](/wiki/Mount_Faber) and passes through [HarbourFront](/wiki/HarbourFront) en route to its final destination at [Imbiah Lookout](/wiki/Imbiah_Lookout). In 2015, Sentosa opened an intra-island Cable Car to facilitate travelling within the island. Dubbed the \"Sky Network\", the Cable Car has 3 stations, in Siloso, Imbiah, and near the now-closed Merlion, and is not linked to the original Cable Car. Public bus services are available to connect Sentosa Island to the mainland. Tong Tar Transport service RWS8 operates between VivoCity/ HarbourFront station to Resorts World Sentosa during peak hours only. On 30 July 2017, SBS Transit Bus Service 123 was extended to enhance connectivity to Resorts World Sentosa, Merlion Tower (now closed), and [Beach Station Bus Terminal](/wiki/Beach_Station_Bus_Terminal). Prior to [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore), SMRT had operated Express Bus Services 188R and 963R between Choa Chu Kang and Woodlands towards Resorts World Sentosa respectively on weekends and public holidays. These bus routes were withdrawn on 7 April 2020 due to low demand. #### [Sentosa Express](/wiki/Sentosa_Express) The island is also accessible by the [Sentosa Express](/wiki/Sentosa_Express) monorail, which replaced the old [Sentosa Monorail](/wiki/Sentosa_Monorail) that operated from 1982 to 2005. The Sentosa Express has three stations on Sentosa and one on mainland Singapore. The northern terminus of the line, which opened on 15 January 2007, is located at the [VivoCity](/wiki/VivoCity) shopping mall on the mainland and the southernmost terminus, Beach Station, is located on Sentosa Island. In Vivocity, the mainland [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) is in turn served by the [HarbourFront](/wiki/HarbourFront_MRT_station) of the [North East Line](/wiki/North_East_Line) and the [Circle Line](/wiki/Circle_Line_(Singapore)). #### Bus Terminal The [Beach Station Bus Terminal](/wiki/Beach_Station_Bus_Terminal) within Sentosa serves both residents and tourists access to various amenities around Sentosa. There are two [bus](/wiki/Bus) services serving the terminal, identified as Bus A and Bus B. [SBS Transit](/wiki/SBS_Transit) Bus Service 123 also serves this terminal. #### Car/Foot Since 1998, passenger cars have been allowed to enter the island. Visitors can also access the island via the Sentosa Boardwalk which is parallel to the causeway (which opened on 29 January 2011). The first two days of its opening were marked with free entry into Sentosa for visitors who walk, and subsequently, an SGD 1 admission fee into Sentosa is charged. From 7 June 2014 to 4 January 2015, walk-in entry into Sentosa via the Sentosa Boardwalk is free on weekends and public holidays. Walk-in has been free of charge since the end of [SG50](/wiki/SG50) celebrations. The Sentosa Boardwalk hosts frequent bazaars on weekends. #### Beach Shuttle Sentosa Beach Shuttle is a free-to-ride tram that serves Palawan Beach, Siloso Beach, and Tanjong Beach, using four vehicles including 2 Volvo B12BLEAs, in which the second carriage is an open-top and another one with green and blue liveries. The Volvo B12BLEAs were manufactured by ComfortDelGro Engineering bodywork, which has since been taken out of service. The connection is at [Beach Station Bus Terminal](/wiki/Beach_Station_Bus_Terminal), beside [Beach Station](/wiki/Beach_Monorail_Station). Separately, a 3-car tram used to serve Underwater World. An Autonomous Bus Trial was also conducted from mid-2019 to the end of 2019. ### Attractions #### Operating attractions Sentosa offers a variety of attractions, museums, and other facilities. These include [Universal Studios](/wiki/Universal_Destinations_%26_Experiences) and [Madame Tussauds](/wiki/Madame_Tussauds) chain of attractions, as well as a Marine Life Park, which consists of a water park and an aquarium. Most of the attractions on Sentosa are located in either [Resorts World Sentosa](/wiki/Resorts_World_Sentosa), [Imbiah Lookout](/wiki/Imbiah_Lookout), or the Sentosa Beachfront. - **Magical Shores** opened on Siloso Beach in January 2020, - **The [*Royal Albatross*](/wiki/Royal_Albatross_(ship))** is a unique 47 m [class A](/wiki/Tall_ship#Class_A) luxury Tall Ship (pirate ship) that is berthed behind the SEA Aquarium at Resorts World Sentosa. The ship has 4 masts, 22 sails, and is the largest charter yacht in Singapore, with a capacity of 149 passengers. It is owned and operated by **Tall Ship Adventures Pte Ltd** and can be chartered by the hour or day for private and corporate events. The company also sells tickets for short cruises via their website. The ship was featured as Bruce Wayne's luxury yacht in the Batman movie *The Dark Knight*. - **Butterfly Park and Insect Kingdom** is a landscape garden with over 15,000 live butterflies, representing more than fifty [species](/wiki/Species). Housed in a cool outdoor conservatory, these butterflies range from the 25 millimetre (1 in) *[Eurema sari](/wiki/Eurema_sari)* to the 150 mm (6 in) *[Papilio iswara](/wiki/Papilio)*. The Insect Kingdom houses some 3,000 species of rare insects from around the world, including a 160 mm *[Dynastes Hercules](/wiki/Hercules_beetle)* beetle. - **Wings of Time** a multimedia performance which started its run on 17 June 2014 replacing previous successor show called Songs of the Sea, with pyrotechnics displays, water fountains, water screens, laser projectors, flame bursts. The show currently runs every evening once during weekdays and twice during weekends, eve of [public holidays](/wiki/Public_holidays_in_Singapore) and on public holidays. - **Sentosa 4D Adventureland** contains Singapore's and [Southeast Asia](/wiki/Southeast_Asia)'s first four-dimensional theatre. Opened in January 2006 at the cost of S$3.5 million, the theatre is equipped with digital projection and a [DTS](/wiki/DTS_(sound_system)) 6.1 sound system. Currently, there are several attractions in Sentosa 4D Adventureland: 1. An immersive 4-D movie - \"Journey 2: The Mysterious Island\", based on the film starring [Dwayne Johnson](/wiki/Dwayne_Johnson) 2. A virtual 4-D roller coaster - \"Extreme Log Ride\" 3. An interactive 4-D Shoot-Out game - \"Desperados\" 4. A new 4-D experience ride - \"Haunted Mine\" - **[Fort Siloso](/wiki/Fort_Siloso)** is located in the west of the island, with the guns of this preserved fort still standing. Fort Siloso was built by the British in 1880s to guard the narrow western entrance to [Keppel Harbour](/wiki/Keppel_Harbour). The fort guarded the western approaches to Singapore during [World War II](/wiki/World_War_II). By 1939 it was armed with two 6-inch (150 mm) Mark2 guns and two rapid firing 12-pounder guns. Fort Siloso is now the only surviving coastal gun battery from the twelve such batteries that made up Fortress Singapore at the start of the war.The [ammunition](/wiki/Ammunition) [bunkers](/wiki/Bunker), barracks, tunnels, and gun emplacements of the fort are now open to visitors as a military-themed attraction. Also on display is a collection of artillery guns dating from the 17th century to World War II. Life-sized replicas of British soldiers and other people are on display to depict life at the fort. Fort Siloso is home to the country's largest collection of World War II memorabilia, including photographs, documents and film clips. The fort also served as the place of [internment](/wiki/Internment) for the Singaporean [political prisoner](/wiki/Political_prisoner) [Chia Thye Poh](/wiki/Chia_Thye_Poh) in the period 1989–1993. This attraction was once served by the [Fort Siloso Monorail Station](/wiki/Fort_Siloso_Monorail_Station) of the discontinued [Sentosa Monorail](/wiki/Sentosa_Monorail). After the monorail closed in 2005, the station was repurposed to add on to this attraction. An elevated walkway, called the Fort Siloso skywalk, was opened in 2015, giving visitors an aerial view of the fort and its surrounding foliage. - **Hydrodash Sentosa** is Singapore's first inflatable water park located at Palawan Beach, officially opened in 2020. It is made up of 4 zones, zone 1 being kid's friendly – for kids between 5–8 years old, and zone 2-4 for adults. - **[Mega Adventure Park](/wiki/Mega_Adventure_Park)**, located at the top of Mount Imbiah, is Singapore's first adventure park with one of the longest and steepest zip wires in [Asia](/wiki/Asia) (MegaZip), a 3-level, 40 feet-high aerial rope course (ClimbMax), a 50-foot high free fall simulator (ParaJump) and a challenging 16-metre-high rock climbing wall (NorthFace). At over 450 metres long and 72 metres above sea level, MegaZip is Asia's most extreme zip line. Guests descend at speeds of up to 50 km/h from the jungle canopy of Imbiah Hill to the sands of Fox Finishing Point at Siloso Beach. This attraction was visited on the [sixteenth season](/wiki/The_Amazing_Race_16) of the American reality show, [The Amazing Race](/wiki/The_Amazing_Race_(American_TV_series)). - **[Madame Tussauds Singapore](/wiki/Madame_Tussauds_Singapore)** is part of the worldwide [Madame Tussauds](/wiki/Madame_Tussauds) chain of wax attractions and is situated at [Imbiah Lookout](/wiki/Imbiah_Lookout). It connects to [Images of Singapore](/wiki/Images_of_Singapore), a historical museum that exhibited the culture and history of Singapore. After the opening of Madame Tussauds, Images of Singapore was turned into a live show. Images of Singapore and Madame Tussauds Singapore has eight fully themed interactive zones, a new \"Spirit of Singapore\" boat ride, and the Madame Tussauds wax museum zone. Madamme Tussauds Singapore also has frequent wax displays on tour, including One Direction and the Marvel Avengers showcase. It has also recently added a [Marvel Comics](/wiki/Marvel_Comics) 4D cinema and a [Formula One](/wiki/Formula_One) race car simulation to its full experience. - **Wave House Sentosa** is located at Siloso Beach. The 70,000-square-foot (6,500 m2) Wave House consists of the Double FlowRider and the 10-foot (3.0 m) FlowBarrel, Singapore's first artificial barreling wave. - The **[Skyline Luge](/wiki/Sentosa_Luge) & Skyride** features a self-steering, gravity-driven three-wheel cart. Invented in New Zealand over 27 years ago, this non-motorised cart allows riders to speed down a hill choosing among the 688-metre-long Dragon trail, the 628-metre-long Jungle trail, the 658-metre-long Expedition trail, or the newly opened 638-metre-long Kupu Kupu trail, all ending at Siloso Beach. At the foot of the hill, guests can board one of two Skyrides, a [chairlift](/wiki/Chairlift) which affords a bird's-eye view of Sentosa Island, the Singapore city skyline and the [South China Sea](/wiki/South_China_Sea). The Luge has extended operations to include night rides. - **iFly Singapore** - Measuring 16.5 feet in diameter with a flying height of 56.5 feet, iFly Singapore is the world's largest themed vertical wind tunnel. - **Sentosa Nature Discovery** features interactive and colourful exhibits as well as a 1.8 km-long nature walk on an elevated boardwalk that was once the monorail's tracks. - **AJ Hackett Sentosa** opened in 2018 at Siloso Beach. It features Singapore's first bungy jump, as well as the Giant Swing and a vertical wall for extreme sports, and a skybridge for leisure viewing of the Sentosa beachfront. - **Headrock VR** opened in late 2018 as Singapore's first virtual reality theme park. It is located at [Resorts World Sentosa](/wiki/Resorts_World_Sentosa). - **KidZania Singapore** opened in 2016 at Palawan Beach, as an interactive indoor theme park for children aged 4 to 17, part of the international indoor chain of family entertainment centers, [Kidzania](/wiki/Kidzania). Due to the COVID-19 pandemic, KidZania Singapore was closed until May 16, 2024, when it reopened after a few months of renovations. #### Defunct attractions - A section of **Imbiah Lookout** closed down on 27 March 2007 to make way for [Resorts World Sentosa](/wiki/Resorts_World_Sentosa). Some of the attractions listed here may have closed down earlier.[*citation needed*] - **Sijori Wondergolf** was a [miniature golf](/wiki/Miniature_golf) park. There were 54 landscaped greens set in three different 18-hole courses. It eventually went under redevelopment. - **[Fantasy Island](/wiki/Fantasy_Island,_Singapore)** was a water-based [theme park](/wiki/Theme_park). Opened in 1994 at a cost of S$54 million, it had numerous water slides and other features. It was plagued by several accidents that resulted in several people getting injured as well as two fatalities. All these accidents led to the eventual closure of the attraction on 2 November 2002. - **Adventure Asia Park**, adjacent to Fantasy Island, was a separate gated attraction housed within the Asian Village-themed area. The park closed permanently before 1998. - **[Sentosa Monorail](/wiki/Sentosa_Monorail)** circled the western half of Sentosa until it closed in March 2005. Most of the island monorail was dismantled though several of the stations were repurposed for other uses and parts of the original track structure still remain and some of them reused. The monorail was replaced by the three internal bus lines and the current [Sentosa Express](/wiki/Sentosa_Express), which operates from the main island of Singapore to Sentosa. - **Volcanoland** featured an artificial [volcano](/wiki/Volcano) along with [Mayan](/wiki/Maya_civilization) motifs and scenery. It was closed down to make way for the new integrated resort, [Resorts World Sentosa](/wiki/Resorts_World_Sentosa) - **[Sentosa Musical Fountain](/wiki/Sentosa_Musical_Fountain)**, opened in 1982, underwent three extensive renovations in 1992 (upgrading project) and 1999 (major restoration and upgrading). In 2002, [Yves Pépin](/wiki/Yves_P%C3%A9pin) who also designed *[Songs of the Sea](/wiki/Songs_of_the_Sea)* and *Wings of Time* created a new musical fountain show named [Magical Sentosa](/wiki/Magical_Sentosa) Show which lasted for 5 years, from 2002 to 2007. The fountain itself eventually shut down on 25 March 2007 to make way for the [Resorts World Sentosa](/wiki/Resorts_World_Sentosa). - **[Sentosa Ferry Terminal](/wiki/Sentosa_Ferry_Terminal)** opened in 1973, and was the first cruise center in the region. For some time it was a popular attraction which ferried 9 million passengers to and from Sentosa, but passenger traffic started to decline steadily after 1998 when cars were allowed into the island for the first time. The [Ferry Terminal Monorail Station](/wiki/Ferry_Terminal_Monorail_Station) of the now-defunct [Sentosa Monorail](/wiki/Sentosa_Monorail) once connected tourists to the western half of the island, but it no longer does after the station closed in 2005. The ferry terminal itself was demolished along with the [Sentosa Musical Fountain](/wiki/Sentosa_Musical_Fountain) and the [Fountain Gardens](/wiki/Fountain_Gardens) that connected the terminal to the musical fountain in 2007 to make way for [Resorts World Sentosa](/wiki/Resorts_World_Sentosa) which would occupy the area. The demolition was watched by Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), the media, and the general public. - **Asian Village** Opened in 1993, Asian Village closed in 2000. - **[Underwater World](/wiki/Underwater_World,_Singapore)** was an [oceanarium](/wiki/Oceanarium). Opened on 13 May 1991, the Underwater World closed on 26 June 2016. - **[Tiger Sky Tower](/wiki/Tiger_Sky_Tower)** (previously known as the Carlsberg Sky Tower) was a free-standing [observation tower](/wiki/Observation_tower). At a height of 110 m (360 ft) above ground and 131 m (430 ft) above sea level, it offers a panoramic view of Sentosa, Singapore, and the Southern Islands. It has a lifting speed of 1.2 meters per second and weighs 200 metric tonnes. On a clear day, the view extends to parts of [Malaysia](/wiki/Malaysia), Johor Bahru (30 km / 18 miles), [Indonesia](/wiki/Indonesia), Pulau Bintan (45 km / 28 miles) and Pulau Bintan (43 km / 27 miles). At ground level, visitors enter a large disc-shaped air-conditioned cabin fitted with glass windows all around. The cabin then revolves slowly as it ascends the column of the tower. The cabin has a capacity of 72 visitors. The Sky Tower sits at the very spot of what was formerly known as the *Dragon Court*. It had a dragon statue as the centerpiece with water spouting from its mouth. In one of its claws, it held a previous logo of Sentosa which was used in the early 1980s. Its tail ended at the Dragon Trail in the northern part of [Imbiah Lookout](/wiki/Imbiah_Lookout). The statue was demolished a few months before the groundbreaking ceremony of the Sky Tower. The Sky Tower was officially opened on 7 February 2004, is situated in the [Imbiah Lookout](/wiki/Imbiah_Lookout) zone in the center of Sentosa and can be reached by [Cable Car](/wiki/Singapore_Cable_Car), [Sentosa Luge Chair Lift](/wiki/Sentosa_Luge), the [Sentosa Express](/wiki/Sentosa_Express) or by an internal bus. Tiger Sky Tower closed on 28 December 2018 after three breakdowns occurred; it was dismantled shortly afterwards. - **Sentosa Merlion** was a gigantic 37-meter-tall replica of the [Merlion](/wiki/Merlion) which was completed in 1995, housing two viewing galleries and a souvenir shop. The Merlion statue once played a role in the Rise of the Merlion, Spirits of Sentosa, and *[Magical Sentosa](/wiki/Magical_Sentosa)* show, since the show was discontinued in March 2007 to make way for [Resorts World Sentosa](/wiki/Resorts_World_Sentosa), The laser from the Merlion Eye never used again. The Sentosa Merlion closed on 20 October 2019 with the four shops closing from the next day, making way for a [S$](/wiki/S$)90 million Sentosa Sensoryscape project to be completed by 2022. ### Beaches Sentosa has a stretch of sheltered beach of more than 2 km (1.2 mi) on its southern coast, divided into three portions: Palawan Beach, Siloso Beach and Tanjong Beach. These beaches are artificial, reclaimed using sand bought from Indonesia and Malaysia. They are guarded by a beach patrol lifeguard team who are easily identified by their red and yellow uniforms. - **Palawan Beach** lies in the centre of the southern coast of Sentosa. There is a suspension bridge that leads to a small islet off the coast which is said to be the southernmost point of continental Asia, or Asia's closest point to the [Equator](/wiki/Equator). The attractions [Kidzania](/wiki/Kidzania) Singapore, MOSH! and the Port of Lost Wonder are located at Palawan Beach. There are several bars along the beach offering food and beverage options to visitors as well as [Beach Station](/wiki/Beach_Monorail_Station) of the [Sentosa Express](/wiki/Sentosa_Express). Palawan Beach was once served by [Central Beach Monorail Station](/wiki/Central_Beach_Monorail_Station), but this station closed in 2005. - **Siloso Beach** lies on the west portion of the southern coast and it is known as the place for beach volleyball and other outdoor activities such as canoeing, skimboarding, mountain biking and rollerblading. There are also dining and shopping outlets along the beach. The beach underwent a SGD$3 million facelift in December 2012. The [Rasa Sentosa Resort](/wiki/Shangri-La_Hotels_and_Resorts) is located at the western end of Siloso Beach, along with the Siloso Beach Resort and the Costa Sands Resort Sentosa. It is the location of attractions like [AJ Hackett](/wiki/AJ_Hackett) Sentosa, Wavehouse, iFly Singapore, and *Wings of Time*. - **Tanjong Beach** is located on the relatively more secluded eastern part of the coast. The crescent-shaped beach is sometimes used for special events or parties. The Tanjong Beach Club is now the main draw on Tanjong Beach. ### Other facilities The Singapore Civil Defence Force's (SCDF) newest fire station officially commenced operations on the island of Sentosa at 8am on Monday (6 June 2016). Sentosa Fire Station, which is located at 37 Artillery Avenue, has a fleet of five emergency vehicles: two fire engines, a fire bike, an ambulance and an aerial firefighting and rescue support vehicle. It is strategically placed to provide emergency services within the island and the immediate vicinity such as the HarbourFront and Telok Blangah areas. #### Hotels There are several hotels and resorts in Sentosa (excluding [Resorts World Sentosa](/wiki/Resorts_World_Sentosa) accommodations): - Amara Sanctuary Resort Sentosa has five-star hotel facilities, and 140 guest rooms, suites, villas and mansion to offer. - [Capella Singapore](/wiki/Capella_Singapore) is a luxury resort situated on 30-acres of lush grounds and gardens. It has 112 [manors](/wiki/Manor_house), suites and guestrooms designed by Norman, Lord Foster. It is developed by Pontiac Land. It was officially opened in March 2009. Capella Singapore's long-stay accommodation arm, The Club at Capella Singapore features 81 serviced apartments, penthouses and manors. The hotel was the venue for the [2018 North Korea–United States summit](/wiki/2018_North_Korea%E2%80%93United_States_summit) between US president [Donald Trump](/wiki/Donald_Trump) and North Korea leader [Kim Jong-un](/wiki/Kim_Jong-un) on 12 June 2018. - Costa Sands Resort operates a number of [chalets](/wiki/Chalet) and 15 [kampung](/wiki/Kampung)-like huts. It is located on a hill overlooking Siloso Beach. - Oasia Resort Sentosa is a 191-room resort and spa located at the former Le Meridien Hotel and Spa. The resort opened in the second quarter of 2021. - [Shangri-La's Rasa Sentosa Resort, Singapore](/wiki/Shangri-La_Hotels_and_Resorts) is a beachfront five-star hotel located at the western tip of Siloso beach, with 454 rooms and [suites](/wiki/Suite_(hotel)). - Siloso Beach Resort opened in July 2006. It has 172 rooms, 10 family suites, 1 treehouse and 12 Villas overlooking the sea. In line with ecologically friendly carbon credit practices, over 600 of the original trees that are native to Sentosa island were preserved. 1000 more fruit trees, flowering plants, exotic ferns, and herbs were planted. The architecture of the resort was purposely structured to circumnavigate and protect these trees. - The Barracks Hotel Sentosa is a 40-room luxury resort housed in a conserved colonial building. - The Outpost Hotel Night Club Sentosa is a 193-room dance resort. - Sofitel Singapore Sentosa Resort & Spa (known as The Sentosa Resort & Spa till 2015) is a five-star hotel with 214 rooms and suites. - Village Hotel Sentosa is a 606-room hotel and is the flagship property of the Village hotel brand. - W Singapore - Sentosa Cove is a 240-room five star luxury resort hotel well known for providing a variety of services & facilities including the popular Whatever/Whenever service. The property is connected to a 228 unit residential complex (W Residences) located at Quayside Isle - inaugurated in September 2012. In addition, there are six hotels in [Resorts World Sentosa](/wiki/Resorts_World_Sentosa): - Crockfords Tower is an exclusive all-suite hotel. - Hotel Michael designs its rooms in the style of a gallery, with mural-adorned walls and artistic furnishing. - [Hard Rock Hotel Singapore](/wiki/Hard_Rock_Cafe) - Festive Hotel - Equarius Hotel - Spa Villas #### Spa - Fish Reflexology is a foot massage where Turkish spa fish or African spa fish nibble on the dead skin of one's feet, making the skin smooth. This is followed by a reflexology session. This is available in the [Underwater World](/wiki/Underwater_World,_Singapore). - Spa Botanica is set in the Sentosa Resort & Spa. It has facilities including mud pools and [Turkish-styled steam baths](/wiki/Turkish_bath). #### Events - **2018 North Korea–United States summit**: [Capella Singapore](/wiki/Capella_Singapore) in Sentosa island was used for the [2018 North Korea–United States summit](/wiki/2018_North_Korea%E2%80%93United_States_summit) during 10 to 13 June 2018. Singapore announced the several locations related to the Trump-Kim summit would be designated as \"Special event areas\" and secured by both leaders' own personal security teams and elite Singaporean police. - **[Barclays Singapore Open](/wiki/Singapore_Open_(golf))** was held yearly at the [Sentosa Golf Club](/wiki/Sentosa_Golf_Club)'s Serapong Course from 2006 to 2012. The event was co-sanctioned by the [Asian Tour](/wiki/Asian_Tour) and the [European Tour](/wiki/European_Tour). In 2013, the Sentosa Golf Club began hosting the annual [HSBC Women's Champions](/wiki/HSBC_Women%27s_Champions) golf tournament, played at the Serapong Course until 2016 and since 2017 at the Tanjong Course. - **Sentosa Balloon Hat Festival** began in 2004. It is a gathering of local secondary school bands who would do display marches from Tanjong Beach to Palawan Beach before a mass display event. The participants would wear balloon hats made by themselves and each school comes up with their own unique design. At the end of the event, all the students would pop their balloons followed by the release of a large number of balloons into the air. The event began as part of an attempt to create the world record for the gathering of the largest number of balloon hats. It was discontinued after 2006. - **Beach parties:** [Hed Kandi](/wiki/Hed_Kandi), a dance music label owned by [Ministry of Sound](/wiki/Ministry_of_Sound), began a monthly dance party on Siloso Beach in 2011, drawing over 14,000 visitors over a seven-month span. The [Hed Kandi](/wiki/Hed_Kandi) events and [Ministry of Sound](/wiki/Ministry_of_Sound) events are produced by SEAM in Singapore. The Siloso Beach in Sentosa is host to the annual *ZoukOut* beach dance party organised by [Zouk](/wiki/Zouk_(club)) nightclub. On 10 December 2005, some 18,000 people attended the event. A New Year's Eve party, Siloso NYE Splash (later rebranded as Siloso Beach Party), is also held annually at Siloso Beach. On 31 December 2005, the party attracted some 15,000 people. - **Sentosa Flowers:** Running from 2005 to 2013, the annual Sentosa Flowers event showcased rare and special blooms unique to the spring season. The event, which coincided with the [Chinese New Year](/wiki/Chinese_New_Year) or \"Spring Festival\" celebration in Singapore, hosted other activities including mural painting and photography competitions and a festival market for gardening enthusiasts. - The **[Swatch FIVB World Tour 2007](/wiki/Swatch_FIVB_World_Tour_2007)** for [beach volleyball](/wiki/Beach_volleyball) was held on 24–27 May 2007 at Siloso Beach. This was the first ever Women's World Tour event and was the biggest-ever beach lifestyle event hosted on the island. This was also the first time Olympic-level athletes competed on Singapore soil for Beach Volleyball. - **Experience Mars** was held on 12 and 13 November at Palawan Beach as part of [National Geographic](/wiki/National_Geographic)'s promotion of its six-part TV series \"MARS\". - **Sandsation** was held at Siloso Beach on 1–17 September 2017. - **Peroni Sunset Cinema** is a seasonal open air cinema held at the beachfront. It offers audiences the opportunity to watch on headsets in a silent environment in deck chair seating. The movies are accompanied with DJ's before the films start, sunset drinks and coastal cuisine. - **[2025 World Aquatics Championships](/wiki/2025_World_Aquatics_Championships)**- high diving and open water swimming events will be held there. #### Resorts World Sentosa This is a family-oriented [Integrated Resort](/wiki/Integrated_Resort) with a [casino](/wiki/Casino) at its core. A resort developer and operator was chosen on 8 December 2006. The winning proposal was the [Genting](/wiki/Genting_Group)/[Star Cruises](/wiki/Star_Cruises) consortium in their bid for [Resorts World Sentosa](/wiki/Resorts_World_Sentosa). It has a [Universal Studios Theme Park](/wiki/Universal_Destinations_%26_Experiences) (known as [Universal Studios Singapore](/wiki/Universal_Studios_Singapore)) which occupies nearly half of the resort space. Development of the resort was financed privately at a cost of $SGD5.75 billion and it does not receive any government subsidies. The proposal for a casino was met with extensive opposition from many [conservative](/wiki/Conservatism) critics. Nevertheless, the government has constantly reassured the public that there would be stringent measures in place to maintain the social fabric of the nation Singapore, and to prevent problems such as [gambling addiction](/wiki/Problem_gambling). It is also home to several celebrity chef restaurants, including [Joël Robuchon](/wiki/Jo%C3%ABl_Robuchon), and the Ocean Restaurant by Cat Cora, which faces the open ocean display of the S.E.A. Aquarium. The Adventure Cove waterpark offers water rides (including the Southeast Asia's first hydro wet coaster), and marine experiences like [swimming with dolphins](/wiki/Swimming_with_dolphins), sharks, manta rays, as well as snorkeling in an artificial reef. It also has a concert venue known as the Hard Rock Colosseum, which has played host to musical acts like [Of Monsters and Men](/wiki/Of_Monsters_and_Men), [Jimmy Eat World](/wiki/Jimmy_Eat_World) and [Bastille](/wiki/Bastille_(band)). On 14 February 2010 at exactly 12:18 p.m., which was also the first day of the Chinese New Year, Resorts World Sentosa was opened to the public. In Cantonese, \"1218\" sounds like \"prosperity\", hence the opening time. The resort's main attractions include Universal Studios Singapore, Adventure Cove water park, S.E.A. Aquarium, the Maritime Experiential Museum, *The Royal Albatross* and the Trick Eye Museum Singapore. In 2019, Resorts World Sentosa is listed as a winner in TripZilla Excellence Award ## Sustainability [Sentosa Development Corporation](/wiki/Sentosa_Development_Corporation) (SDC) has developed a [sustainability](/wiki/Sustainability) plan to safeguard the environment and to conserve Sentosa's heritage assets. In fact, many parts of Sentosa still retain her original tranquil and lush environment - driven by the corporation's land-use policy of maintaining 60% of the island as green and open spaces (natural area reduced to about 25% by 2014). Efforts are made to raise awareness among both visitors and staff of the island regarding environmental issues and [sustainable tourism](/wiki/Sustainable_tourism). This is done via regular campaigns and educational talks. Key sustainability-related achievements include: - Sentosa was shortlisted as a Sustainable Tourism Destination finalist in the [World Travel and Tourism Council](/wiki/World_Travel_and_Tourism_Council)'s \"Tourism for Tomorrow\" Awards in 2013. - The island is home to some 30 [heritage trees](/wiki/Heritage_tree) (listed in the [National Parks Board](/wiki/National_Parks_Board)'s Heritage Tree Register) and over 20 conserved colonial buildings, some of which date back to the 1800s. - Singapore's only fully restored coastal military fort, [Fort Siloso](/wiki/Fort_Siloso). - Several Green Mark-certified buildings such as [Sentosa Cove](/wiki/Sentosa_Cove) Village, Sentosa Family Entertainment Centre, W Hotel, and [Resorts World Sentosa](/wiki/Resorts_World_Sentosa). The Green Mark is awarded by Singapore's [Building and Construction Authority](/wiki/Building_and_Construction_Authority) to buildings that fulfill specific environmentally friendly criteria. - An eco-hotel, Siloso Beach Resort. - Developing the Sentosa Boardwalk, which is a covered pedestrian walkway with various [sustainability](/wiki/Sustainability) features, to connect the island with the Singapore mainland. Guests are encouraged to use the Boardwalk to enter and exit Sentosa as it leaves a minimal [carbon footprint](/wiki/Carbon_footprint). - Partnering with [Nanyang Technological University](/wiki/Nanyang_Technological_University) (NTU) to testbed Singapore's first low-flow tidal turbine at the Sentosa Boardwalk. - Community-giving initiatives such as an annual \"Sentosa Gives\" initiative in September, which sees more than 1,500 children, teenagers and seniors from the participating voluntary welfare organizations, schools and charities benefiting from the many activities planned for them. The corporation also offers island entry concessions to charity groups throughout the year. - [Southern Islands](/wiki/Southern_Islands) - [Sentosa Luge](/wiki/Sentosa_Luge) Listen to this article (1 minute)was created from a revision of this article dated 18 February 2005 (2005-02-18), and does not reflect subsequent edits.(Audio help · More spoken articles) - Media related to Sentosa at Wikimedia Commons - Singapore/Sentosa travel guide from Wikivoyage - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:52:18.939097",
  "title": "Sentosa",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sentosa"
}