{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:52:29.432274"
  },
  "content": "Former cruise terminal in Singapore 1°15′26″N 103°49′15″E﻿ / ﻿1.25722°N 103.82083°E﻿ / 1.25722; 103.82083 The **Sentosa Ferry Terminal** was a cruise [terminal](/wiki/Berth_(moorings)) located on the island of [Sentosa](/wiki/Sentosa), [Singapore](/wiki/Singapore). The cruise center was the first of its kind in the region. Built by the [Sentosa Development Corporation](/wiki/Sentosa_Development_Corporation) in 1972, the terminal was the first of nine planned structures to be built on [Sentosa](/wiki/Sentosa). The terminal could cater maritime traffic to various parts of [Indonesia](/wiki/Indonesia), [Batam](/wiki/Batam), [Karimun Jawa](/wiki/Karimun_Jawa), [Tanjungbalai](/wiki/Tanjungbalai_(city)), [Penang](/wiki/Penang) and [Malacca](/wiki/Malacca). The terminal building was completed in 1987, with the now-defunct [Ferry Terminal Monorail Station](/wiki/Ferry_Terminal_Monorail_Station) located within the building. After the station closed in March 2005, the station interior was kept intact, and the old monorail tracks were covered up and left forgotten. With the then-future [Resorts World Sentosa](/wiki/Resorts_World_Sentosa) about to occupy the site in 2007, the structure was subsequently demolished to make way for its new occupant. ## History Prior to the Sentosa Ferry Terminal, there used to be another ferry terminal with the same name, though by February 1980 the Pacific Area Travel Association (Pata) task force recommended the [Sentosa Development Corporation](/wiki/Sentosa_Development_Corporation) (SDC) to build a second gateway to Sentosa, possibly from [Clifford Pier](/wiki/Clifford_Pier), and to move the previous ferry terminal closer to [Fort Siloso](/wiki/Fort_Siloso). By July, as part of the SDC's changes in line with the recommendation made from Pata, a new ferry terminal was being considered to directly face the [World Trade Centre](/wiki/World_Trade_Centre,_Singapore) Ferry Terminal for quicker access to Sentosa and to be connected to the planned [Sentosa Monorail](/wiki/Sentosa_Monorail). In December, it was announced by the SDC that the new ferry terminal will be built about 300 metres (980 ft) to the left of the existing terminal, with the SDC promising it will provide a \"spectacular entrance to [Sentosa]\" by leading people to a garden plaza and musical fountain. A year later in December 1981, preliminary works for the terminal began. By that time, the terminal costed [S$](/wiki/Singapore_dollar)12.5 million ([US$](/wiki/USD)9.33 million) and was expected to be finished by 1985. By November 1984, the cost increased to [S$](/wiki/Singapore_dollar)18 million ([US$](/wiki/USD)13.43 million), with plans revealed for the two-storey ferry terminal to have four berths with a capacity of 4,000 people as well as to be built at Imbiah Bay and be completed within the next 5 years. It was also announced the ferry terminal's monorail will be built outside the station in a [central plaza.](/wiki/Fountain_Gardens) Since the terminal's opening in the early 1970s, at least 9 million passengers pass through its operations. However, passenger traffic declined in the mid-1990s when a small causeway (Sentosa Gateway) was built to connect the island to mainland Singapore. The [Ferry Terminal Monorail Station](/wiki/Ferry_Terminal_Monorail_Station) once served visitors to the western half of the island, until [Sentosa Monorail](/wiki/Sentosa_Monorail) closed down in 2005. By the start of the early 2000s, it had become clear to locals and foreigners that with the decline of passenger traffic, the ferry terminal was losing its purpose.[*citation needed*] ## Demolition The Ferry Terminal which was alongside the famous [Sentosa Musical Fountain](/wiki/Sentosa_Musical_Fountain) and [Fountain Gardens](/wiki/Fountain_Gardens), were demolished on 26 March 2007. The demolishing ceremony was witnessed by prime minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), the media, and people from all walks of life. Today, [Resorts World Sentosa](/wiki/Resorts_World_Sentosa) stands on the demolished section of Imbiah Lookout, with the Crane Dance performance now standing close to where the ferry terminal once stood. ## Replacement After the demolition of the ferry terminal, the government later built another cruise center, the [Marina South Pier](/wiki/Marina_South_Pier). It was eventually replaced by the [International Cruise Terminal](/wiki/International_Cruise_Terminal) in the second quarter of 2012. - [Imbiah Lookout](/wiki/Imbiah_Lookout) — *entertainment zone*. - Roots webpage\n",
  "language": "en",
  "processed_at": "2026-01-12T11:52:29.431881",
  "title": "Sentosa Ferry Terminal",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sentosa_Ferry_Terminal"
}