{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:52:21.955618"
  },
  "content": "Residential enclave in SingaporeThis article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(November 2021)* *(Learn how and when to remove this message)* **Sentosa Cove** is a residential enclave in the eastern part of [Sentosa](/wiki/Sentosa) Island in [Singapore](/wiki/Singapore), which is planned to include about 2,500 units when fully expanded. It is largely made up of [reclaimed land](/wiki/Land_reclamation). The master developer of the site was Sentosa Cove Pte. Ltd., a subsidiary of [Sentosa Development Corporation](/wiki/Sentosa_Development_Corporation), which purchased the site from the [Singapore Land Authority](/wiki/Singapore_Land_Authority) for about [S$](/wiki/Singapore_dollar)800 million.[*citation needed*] About 60% of property buyers in Sentosa Cove are foreigners. It is the only place in Singapore where foreigners are allowed to purchase landed homes. All residential properties in Sentosa Cove are [leasehold](/wiki/Leasehold) titles subject to a [99-year lease](/wiki/99-year_lease). ## Attractions There are multiple attractions found in the Sentosa Cove enclave, including hotels and F&B outlets. ### Hotels - ONE°15 Marina Sentosa Cove, Singapore - A boutique 26-room hotel situated by the marina at Sentosa Cove. It is also a members' club and is the point of contact for berthing at the Sentosa Cove marina. - W. Singapore, Sentosa Cove - A 240-room five-star luxury resort hotel known for providing a variety of services & facilities including the Whatever/Whenever service. The property is connected to a 228-unit residential complex (W. Residences) located at Quayside Isle. ### Spas - Spa Rael - Situated within ONE°15 Marina Sentosa Cove - AWAY Spa - Situated within W. Singapore ### Food & Beverages There is a wide variety of food and beverage options available at Sentosa Cove, notably along Quayside Isle, the enclave's upscale waterfront shopping centre. This includes: - Boaters' Bar - Blue Lotus - Chinese Eating House - Gin Khao Bistro - Greenwood Fish Market - [Joe & The Juice](/wiki/Joe_%26_The_Juice) - Miska Cafe - Mykonos on the Bay - Rock Bar - Burger & Steakhouse - Sabio by the Sea - Tapas Bar & Grill - SolePomodoro Trattoria Pizzeria - Two Chefs Bar - WOK°15 Kitchen, situated within ONE°15 Marina Sentosa Cove - Official website of Sentosa Cove 1°14′55.46″N 103°50′36.13″E﻿ / ﻿1.2487389°N 103.8433694°E﻿ / 1.2487389; 103.8433694 This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:52:21.955223",
  "title": "Sentosa Cove",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sentosa_Cove"
}