{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:52:33.532885"
  },
  "content": "Dancing Fountain in Sentosa, Singapore The **Sentosa Musical Fountain**, also known as the **Magical Fountain of Sentosa**, or as the **Musical Fountain** by locals, was a former [musical fountain](/wiki/Musical_fountain) water feature and entertainment venue made by Waltzing Waters on [Sentosa](/wiki/Sentosa) Island in Singapore. It was located on a now-demolished portion of the [Imbiah Lookout](/wiki/Imbiah_Lookout) entertainment zone on the island. The Musical Fountain was officially opened on 11 June 1982, and ceased operations 25 years later on 26 March 2007, and was demolished that same year. The venue arena could accommodate more than 5000 people. It hosted five different shows through the 25 years it had been in operation, including the famous *[Magical Sentosa](/wiki/Magical_Sentosa)* show which ran during the last 5 years of the fountain's operations. ## History ### Origins In the late 1960s, the [Singapore government](/wiki/Government_of_Singapore) decided to develop of a plot of land on the then-named *Pulau Blakang Mati* (currently known as Sentosa Island) for entertainment purposes. After the [Sentosa Development Corporation](/wiki/Sentosa_Development_Corporation) was incorporated, one of their major plans for the island was to build a [musical fountain](/wiki/Musical_fountain) feature. The fountain would be located at the Northwest of the island, which would be known as Imbiah Bay, (later called Imbiah Lookout). ### Construction Construction began in 1972. A contract was signed between Mr. Tham Tuck Yen—then director of the Sentosa Development Corporation, and Mr. Norman Wee, the director of Venus Enterprises Pte Ltd and a building contractor. The Sentosa Musical Fountain required a decade to build, at a cost of [SG$ (Singapore dollar)](/wiki/Singapore_dollar) 3.2 million. In 1982, the fountain was officially opened as part of Sentosa Island's grand opening. ### Preview and Official opening On 30 April 1982, Singapore news publication, [The Straits Times](/wiki/The_Straits_Times) reported that the fountain will open briefly for an official preview on May Day. The half an hour event was graced by 500 guests which included the two guests of honor, then [Home Affairs minister](/wiki/Minister_for_Home_Affairs_(Singapore)), Chua Sian Chin and the now-retired [Minister in Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)), [Lee Khoon Choy](/wiki/Lee_Khoon_Choy). On 7:30 pm ([SST](/wiki/Singapore_Standard_Time)) on 11 June 1982, The Musical Fountain was officially opened to the general public. The fountain was declared open by then [Sentosa Leisure Group](/wiki/Sentosa_Development_Corporation) chairman, Mr. Tan I. Tong. At the point of its opening, the outdoor fountain was the largest of its kind in Asia. ### Renovations In the late 1980s, the concrete wall that stood behind the fountain was rebuilt into a man-made cliff and waterfall, then in 1992, the co-operation decided that extra features like the newly introduced 1982 Sentosa logo; drawn onto a large wooden plank, ponds, a symphony stage, and renewed water jets would be added. Plans were drawn for the water jets to shoot up over 23 metres (75 ft) high, but due to high cost estimates their height was only raised up to 20 metres (66 ft). The colonnades at the top of the fountain also had their design changed. In 1996, the gigantic 31 metres (102 ft) tall [Merlion](/wiki/Merlion) Statue was added above the Musical Fountain as a new attraction on Sentosa Island. Afterward, the idea was developed to install Stella Ray's [Laser](/wiki/Laser) beams in the Merlion's eyes, with the intention that laser would be part of the musical fountain's show. Laservision was commissioned to make a major upgrade to the fountains and install 6 lasers to the fountain. The laser light beams from the Merlion eyes are strong enough to be seen from 2 kilometres (1.2 mi) away. After this upgrade, visitors had no access to the Merlion Statue tower after 7 pm due to [laser radiation](/wiki/Radiation) blinding and other safety issues. Also, the 1982 Sentosa logo was then taken down and replaced with a different logo, but still bearing the same name. The 1982 logo would reappear again for a brief period until ECA2 Group was commissioned to restore the fountain where it was once again taken down and replaced by the plastic sculpture of the Sentosa Logo. ### 1999 restoration In 1999, the fountain underwent a major two-year restoration project directed by Fischer Media Group under the supervision of ECA2 Group. During the restoration, the wooden plank with the old Sentosa logo from 1982 was replaced by a [plaster](/wiki/Plaster#Gypsum_plaster) sculpture for two reasons. Firstly, due to termite infestation and secondly as a prop for the [Magical Sentosa](/wiki/Magical_Sentosa) show after it was commissioned in September 2002. The fountain's exterior design and the colonnade's design were re-designed to the more attractive [Neoclassical design](/wiki/Neoclassical_Architecture). In addition, the seats in the fountain's gallery were repainted to resemble the seven colors of a [rainbow](/wiki/Rainbow). The previously installed laser fixtures were draped in green fabric by Laservision Australia. ### Events The Sentosa Musical Fountain was the venue for many events, special performances, and variety shows – from its opening in 1982 until its closure in March 2007. It was one of the hosting venues for the 2005 [Singapore Youth Festival](/wiki/Singapore_Youth_Festival). The Musical Fountain was the venue for a gala dinner held in conjunction with the Ministerial Conference of the [World Trade Organization](/wiki/World_Trade_Organization) in 1996. In 1993 the flame of the [1993 Southeast Asian Games](/wiki/1993_Southeast_Asian_Games) was lit at the symphony stage of the fountain by then Prime Minister, [Goh Chok Tong](/wiki/Goh_Chok_Tong). In 2002, the then unheard of, [Media Development Authority](/wiki/Media_Development_Authority) was announced at the fountain by David Lim, the then acting minister for the [Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts). ## Shows Through the Musical Fountain's years as an entertainment venue, five different shows were staged there. Each one required up to five months to fully design, choreograph, and install. ### Fountain Display Show The first programmed show at the Musical Fountain was the \"Fountain Display Show\" and it’s programmed by Venus Enterprises Pte Ltd, running through the 1980s and early 1990s. It was inspired by the synchronized water dance of the [Fountains of Bellagio](/wiki/Bellagio_(hotel_and_casino)#Fountains_of_Bellagio) on the [Las Vegas Strip](/wiki/Las_Vegas_Strip). Usually, the show used computer choreographed [Broadway show tunes](/wiki/Broadway_theatre) and other famous songs. The show ran thrice nightly with an additional show during Sundays and Public Holidays. In the late 1990s, the show was repeated during the day from 4 pm to 5 pm but without the colourful lights. Between 2000 and 2002, the show was repeated in the evening until [Magical Sentosa](/wiki/Magical_Sentosa) permanently replaced the show. ### Rise of the Merlion **Running period: 1994 – 1997 and 2000 – 2002** **Production company: [Laservision](/wiki/Laservision) Mega Media Pty Ltd** \"Rise of the Merlion\" is considered the first show to use laser animation and graphics at the 'Musical Fountain'. The show gave a fictional [History of Singapore](/wiki/History_of_Singapore) that included the outcome of the [Merlion](/wiki/Merlion) (country mascot). In 1994 the show's lighting was improved by *[Laservision](/wiki/Laservision) Mega Media Pty Ltd*, before the show was shut down a year later. This show returned for a brief period between 2000 and 2002 to fill the gap during the upgrade for the upcoming Magical Sentosa Show that would debut in 2002. ### Journey Around the World and Spirits of Sentosa **Running period: 1997 – 2002** **Production company: [Laservision](/wiki/Laservision) Mega Media Pty Ltd (Spirits of Sentosa); Disputed (Journey Around the World)** In 1997 came two shows, the first part of the show was *Journey Around the World*, which has disputed origins. The second part was \"Spirits of Sentosa\", developed by [Laservision](/wiki/Laservision) Mega Media Pty Ltd designers, Simon McCartney, Lloyd Weir, and Richard Tan. According to the only known video taken during the show's run, the show starts with an old wizard speaking to the audience about the wonders of Sentosa, which is also inhabited by spirits. The three Spirits of Sentosa are then shown one at a time, and it is revealed that their mystical powers are bound in a magical pearl. Unfortunately, the pearl is stolen by an evil 2D/CGI dragon, who wants it for its own selfish needs. Upon realizing that their magical pearl was stolen, the three spirits battle with the dragon to regain the pearl, with the evil dragon being defeated in the end. The pearl is returned to its rightful place and the fountains dance in celebration. The show ends with a final monologue from the same old wizard, and the show closes with a final dance from the fountains. It is noticeable too in the video that before the actual *Spirits of Sentosa* show starts, there is footage showing laser images projecting iconic [world landmarks](/wiki/Landmark). This suggests that *Journey Around the World* could have been played first before *Spirits of Sentosa* is actually being performed. In a behind-the-scenes video, the cast members who performed as the three \"Spirits of Sentosa\" were filmed while posed in a bathtub while on set in [Laservision](/wiki/Laservision)'s Sydney studio. According to many videos on YouTube, Spirits of Sentosa was periodically switched with the Rise of the Merlion show between 2000 and 2002 to fill the gap during the upgrade for the upcoming Magical Sentosa show that would debut in 2002. ### Magical Sentosa **Running period: 2002 – 2007** **Production company: ECA2 Group and Fischer Media Group** \"[Magical Sentosa](/wiki/Magical_Sentosa)\" was the fifth and final show staged on the fountain and arguably the most recognizable among the other shows that staged on Sentosa Musical Fountain. The show was created in 2000, when [Yves Pépin](/wiki/Yves_P%C3%A9pin) (designer of the *Songs of the Sea* show) designed a show to fit the [Imbiah Lookout](/wiki/Imbiah_Lookout) zone's theme of [fantasy](/wiki/Fantasy). After using ideas from earlier production in France and restoring the fountain again which took about two years, engineers installed new equipment to create an all-new nighttime show that placed [Kiki the Hyperactive Monkey of Sentosa](/wiki/Kiki_the_Hyperactive_Monkey_of_Sentosa), the official mascot of Sentosa Island at that time, as the host. It was also the first time that the audience saw him in [CGI—Computer Generated Imagery](/wiki/Computer_Generated_Imagery). ## Demolition After operating for 25 years, the Musical Fountain staged its last [Magical Sentosa](/wiki/Magical_Sentosa) show on 25 March 2007. It was then shut down and demolished to make way for a new [integrated resort](/wiki/Integrated_resort) named [Resorts World Sentosa](/wiki/Resorts_World_Sentosa), which now occupies the site. The area where the fountain once stood is the present site of the [Crocksford Tower](/wiki/Resorts_World_Sentosa#Hotels), [Hotel Micheal](/wiki/Resorts_World_Sentosa#Hotels), retails, and the walkway that features many reminiscences of the former Fountain Garden that occupied by '[Lake of Dreams](/wiki/Resorts_World_Sentosa#Shows)'. Part of the Musical Fountain's old entrance location was used in the construction of the Festive Walk walkway into the Imbiah Lookout area, landscapes, and seating for the 'Lake of Dreams' show, featuring many reminiscences of the former Fountain Garden. A new lower and much smaller fountain almost similar to the roundabout fountain located at the old Fountain Garden marks the site of the former tall waterfall, cliff, and parts of the pool, which is now used as the entrance between Imbiah Lookout to the [Resorts World Sentosa](/wiki/Resorts_World_Sentosa). The bridge between Imbiah Lookout and [Resorts World Sentosa](/wiki/Resorts_World_Sentosa), without [Resorts World Sentosa](/wiki/Resorts_World_Sentosa) logo, is, in fact, the original bridge that connected from the Merlion Plaza into the colonnades area. The Sentosa Musical Fountain was eventually replaced by another computer-programmed large musical fountain show named *[Songs of the Sea](/wiki/Songs_of_the_Sea)*, situated along Siloso Beach. ### Songs of the Sea After demolition works began on the old musical fountain on 26 March 2007, the development plans for Sentosa included a new musical fountain entertainment venue, to be named [Songs of the Sea](/wiki/Songs_of_the_Sea). The new musical fountain is sited at [Siloso Beach](/wiki/Sentosa#Siloso_Beach), near [Sentosa Express](/wiki/Sentosa_Express)'s Beach Station. Construction work on Songs of the Sea began in January 2006, and was completed in February 2007. The show made its debut on 26 March 2007. Between 26 March 2007 and 31 December 2007, the [\"Songs of the Sea\" program](/wiki/Songs_of_the_Sea) had been watched by 992,000 visitors. ## Architecture and engineering During its final renovation, the Musical Fountain's redesign was based on two opposite themes. The first theme which is widely seen in the fountain's design was the formal [Neoclassical architecture](/wiki/Neoclassical_architecture). But despite this, both Classical Revival and [Postmodern](/wiki/Postmodern_architecture) versions; especially the substantially decorated [colonnades](/wiki/Colonnade) are seen. The other theme was from informal 'nature's wonderland' imagery; using a small pond, flowering trees and [ornamental plants](/wiki/Ornamental_plant), and a constructed large naturalistic [waterfall](/wiki/Waterfall), which was formerly a concrete wall. The fountain's symphony stage is better recognized for the location of the \"SENTOSA\" plaster sculpture, which is the centerpiece of the fountain. The sculpture sits in place of the earlier wooden plank with the 1982 Sentosa logo drawn on it. The Musical Fountain's main swan-shaped pool was 5 metres (16 ft) deep and contained 31,700 gallons of water, which took a total of 3 hours to completely fill. The pool length itself is 40 metres (130 ft) wide. The largest water jets of the fountain were able to shoot water up to a height of 20 metres (66 ft). The fountain could also produce more than 19 different water formations (16 originally), including the famous form of a [Phoenix](/wiki/Phoenix_(mythology)) flanked by waltzing chorus-lines. Other patterns of the main fountain included at least six spinners nozzle fountains, three-tiered water formations at the sides of the main pool, and eight pairs of swaying fountain jets. Numerous fireball shooters and water geysers added to the pool and the pond during the upgrade by ECA2 Group and later used on the Magical Sentosa show. Additionally, the fountain had two terrace pools flanking it. These contained two rings of water jets shooting inward, a central nozzle shooting water higher than 15 meters, a single spinner nozzle fountain, and arcing jets that shot water towards the main pool. Also, the Musical Fountain had three large water projection screens, one on the main fountain, and another two on the terrace pools. - [Fountain Gardens](/wiki/Fountain_Gardens) promenade. - [Imbiah Lookout](/wiki/Imbiah_Lookout) – *Sentosa entertainment zone: former and current features*. - [Sentosa](/wiki/Sentosa) Island – *former and current features*. - [Magical Sentosa](/wiki/Magical_Sentosa) - official **Sentosa Island** website – *(english)* - Sentosa.gov: Sentosa Island Milestones - www.Laservision.com.au: Spirits of Sentosa\n",
  "language": "en",
  "processed_at": "2026-01-12T11:52:33.532470",
  "title": "Sentosa Musical Fountain",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sentosa_Musical_Fountain"
}