{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:52:19.825230"
  },
  "content": "Causeway between Sentosa and Singapore The **Sentosa Causeway** is a 380-metre (1,250 ft) [causeway](/wiki/Causeway) connecting [mainland Singapore](/wiki/Mainland_Singapore) to the island of [Sentosa](/wiki/Sentosa). Initially as two separate links to Pulau Brani and Sentosa from the mainland, it was merged into one link in December 1986. There was debate over whether the link should be a causeway, bridge, or tunnel, with the tunnel allowing ships to pass through the Keppel Channel, though more expensive, whilst the causeway or bridge would be cheaper and more visually appealing. Although the government leaned to the tunnel, it was decided in November 1987 and February 1988 that the Pulau Brani and Sentosa links will be a causeway, respectively, as a causeway for the Pulau Brani link would reduce land transport time for cargo. The causeway opened on 16 December 1992. ## History ### Initial plans Prior to the Sentosa Causeway, the only way to get to [Sentosa](/wiki/Sentosa) was by ferry or the [cable car](/wiki/Singapore_Cable_Car). Mentions of a link connecting Sentosa to [mainland Singapore](/wiki/Mainland_Singapore) were first considered by the [Port of Singapore Authority](/wiki/PSA_International) (PSA) in August 1986 by extending a planned link for [Pulau Brani](/wiki/Pulau_Brani), either a 1.5-kilometre (0.93 mi) tunnel or causeway, to Sentosa. In early December, it was announced that as part of [S$](/wiki/Singapore_dollar)470 million (1986) ([US$](/wiki/USD)215.85 million) project to improve Sentosa's accessibility and facilities, a [S$](/wiki/Singapore_dollar)265 million (1986) ([US$](/wiki/USD)121.7 million) link to Sentosa, which will either be a four-lane tunnel, causeway, or bridge, will be built, with the [Sentosa Development Corporation](/wiki/Sentosa_Development_Corporation) (SDC) having called for tenders two weeks before early January. By January 1987, the government merged the Pulau Brani and Sentosa links into one link, tentatively a tunnel due to allowing ships to pass through the Keppel Channel and the Southern Waters having strong currents, that would go from the [World Trade Centre](/wiki/World_Trade_Centre,_Singapore) to Pulau Brani, and then split into two separate branches leading to Pulau Brani and Sentosa. ### Debate between tunnel and causeway By April 1987, it was reported that the government was inclined to build a tunnel connecting mainland Singapore to Pulau Brani and a causeway between Pulau Brani and Sentosa, since the tunnel would allow ships to pass through the Keppel Channel, though more expensive, whilst the causeway or bridge would be cheaper and be more visually appealing. Around that time, there were eleven contractors interested in advising the government on the project as well as Electric and Geophysical Services conducting a marine seismic reflection survey as part of a [S$](/wiki/Singapore_dollar)23,000 (1987) ([US$](/wiki/USD)10,921.26) contract to determine which type of construction method will be used. In November, it was announced that the Pulau Brani link will be causeway as it would reduce land transport time for importers, exporters, and sea-air freighters, followed by the [Public Works Department](/wiki/Public_Works_Department_(Singapore)) (PWD) announcing in February 1988 that the Keppel-Pulau Brani link will start from the Prima Flour Mill along Keppel Road, and would reach to Sentosa via the western tip of Pulau Brani, though it was still debated if the Sentosa-Pulau Brani link would be a tunnel or a causeway. After this news, it was met with backlash in a letter to *[The Straits Times](/wiki/The_Straits_Times)*, where the letter argued that the causeway may have no real practical value because of Sentosa serving as a gateway away from the humdrum of vehicles in the mainland, the need for car parks and roads to be built on the island, the possibility of Pulau Brani becoming a naval base and thus rerouting the causeway, and the causeway potentially disrupting Sentosa's \"recreational\" nature. By that time, it was expected for the causeway to be completed by 1992. The SDC responded to the letter by saying that cars will only be restricted to the central parking area and select points on the island, with alternative methods of transport available to get to and around Sentosa. ### Construction By April, it was reported that despite 12 companies, from local, foreign, and joint-ventures, submitting proposals to supply consultancy services for the causeway to the government, none were accepted. A month later, between 7 contractors, it was announced that the PWD has selected Dutch firm Fugro-McCleland for investigating soil conditions for the causeway. Prequalifications commenced in January 1989, with the causeway to be built in two phases: a causeway from the World Trade Centre to Pulau Brani and a bridge joining the causeway from Pulau Brani to Sentosa. The Keppel-Brani's causeway [groundbreaking ceremony](/wiki/Groundbreaking_ceremony) commenced on 3 November 1990, and opened on 23 November 1991. On 16 December 1992, the Sentosa Causeway opened. ## Details The Sentosa Causeway is 380-metre (1,250 ft) long causeway with two towers on both sides signifying the end of the gateway to Sentosa. It is filled with trees and is lit at night with decorative lighting. - Infopedia article\n",
  "language": "en",
  "processed_at": "2026-01-12T11:52:19.824948",
  "title": "Sentosa Causeway",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sentosa_Causeway"
}