{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:52:30.724432"
  },
  "content": "Former monorail system in Singapore The **Sentosa Monorail** was a [monorail](/wiki/Monorail) system which served as the main means of transportation on the island of [Sentosa](/wiki/Sentosa) in Singapore, and has been replaced by the new monorail system, the [Sentosa Express](/wiki/Sentosa_Express). The system was constructed at a cost of S$14 million by [Von Roll](/wiki/Von_Roll) of Switzerland, who also built the [Singapore Cable Car](/wiki/Singapore_Cable_Car). Commencing operations on 23 February 1982, the line initially opened with only five stations, running in a clockwise loop. In 1987, the Ferry Terminal Monorail Station began operations when the Sentosa Ferry Terminal opened that year. In 1991, the line changed to an anti-clockwise direction after the Underwater World Monorail Station commenced operations, when [Underwater World](/wiki/Underwater_World,_Singapore) opened that year. It operated several 16-car, non-air conditioned trains in a unidirectional anti-clockwise single loop through seven stations located around the western half of the island. The monorail rides were initially charged at S$3 for adults and S$1.50 for children. The trip was later made free for passengers, who could ride the system as often as they wished throughout their stay on the island. Four of the stations have two platforms; for such stations, the [Spanish solution](/wiki/Spanish_solution) was implemented, where passengers alight at one platform and board at the opposite platform. ## History ### Background Plans for the monorail were first announced in June 1979 by the [Sentosa Development Corporation](/wiki/Sentosa_Development_Corporation) (SDC) to replace the double-decker buses that were used as transport around [Sentosa](/wiki/Sentosa). The route included seven stations near the [Sentosa Ferry Terminal](/wiki/Sentosa_Ferry_Terminal), Maritime Museum, the Apollo Hotel, the Coralarium, swimming lagoon, [cable car station](/wiki/Singapore_Cable_Car) and the [surrender chamber](/wiki/Surrender_Chamber), and [Fort Siloso](/wiki/Fort_Siloso). The SDC did consider implementing a monorail system earlier but chose not to due to the high costs of the previous design. It was estimated to cost [S$](/wiki/Singapore_dollar)12 million (1979) ([US$](/wiki/USD)5.52 million) and take 18 months to construct it, with the system planned to use 6 monorail carriages. According to an SDC spokesman, the monorail system was the \"most appropriate choice\" of transport when the SDC was choosing what type of transport to choose, which included [electric cars](/wiki/Electric_car) and [trailer buses](/wiki/Trailer_bus). However, it criticised by a nature lover writing to the *[New Nation](/wiki/List_of_newspapers_in_Singapore)* in December, where they wrote that building the monorail would disrupt the peace of the island and the monorail itself would be a \"gimmick\". The SDC responded to the letter a month later, assuring that the monorail would be \"as quiet and pollution free as possible\" and not a \"gimmick\". ### Construction and opening In February 1980, it was announced that the contract for the design and the installation of the monorail would be awarded to [Swiss](/wiki/Switzerland) company Habegger Thun, with the SDC hosting a [signing ceremony](/wiki/Signing_ceremony) between the two corporations at its headquarters. Habegger Thun proposed a similar route to SDC's route though it omitted the Coralarium station. It was also announced that United Engineers Pte Ltd would be the main subcontractor and carry out structural and civil engineering works. The cost of the monorail was estimated to be [S$](/wiki/Singapore_dollar)10.5 million (1980) ([US$](/wiki/USD)4.9 million) and it was expected for the construction period to be 20 months. Site surveys commenced in the same month, with piling works expected to start in the middle of March. However, the ceremony was held in July, with the chairman of the SDC driving the first [borehole](/wiki/Borehole) of the monorail. In October, they started laying the rails and the columns of the system, with expected completion by next September and 391 metres (428 yd) of rails being laid by December. The number of monorail carriages have also been increased from 6 to 9. By January 1981, 30% of the piling works have been completed, with about 550 metres (600 yd) of track laid out. There have been five confirmed stations by that time, being the Maritime Museum, the Apollo Hotel, the swimming lagoon, the cable car station and Fort Siloso, with Fort Siloso itself temporarily closed until February for piling works. However, the Ferry Terminal station has not been finalised yet. By June, it was expected for the monorail to be ready by December.By July, 3 kilometres (1.9 mi) of track was laid. In November, it was the expected completion date was March of next year. In the same month, the cost of the system rose to [S$](/wiki/Singapore_dollar)13 million (1981) ([US$](/wiki/USD)6.15 million). By December, the cost of the monorail grew to [S$](/wiki/Singapore_dollar)16 million (1981) ([US$](/wiki/USD)7.57 million). Initially expected to be completed in April 1982, it was completed two months before schedule at a cost of S$16 million, and opened on 23 February 1982. Four intermediate stations along the line at several locations around the island were opened on 1 December the same year. This resulted in the bus service to these locations being terminated, and the monorail thus became the main mode of transport around the island. As a result of the monorail's opening, as well as the opening of several other attractions, the number of visitors to Sentosa also shot up, increasing to 1,067,192 visitors from 567,567 visitors over the same period in the previous year. ### Closure Due to the rapid modernisation of the island, maintenance problems, increasing costs, and declining popularity as visitors started complaining that the ride was slow and uncomfortable, the Sentosa Monorail ceased operations on 16 March 2005 to make way for the new four-station [Sentosa Express](/wiki/Sentosa_Express) monorail. Much of the track and all of the rolling stock were sold as scrap for S$350,000. A subsequent assessment showed that some of the [butt welds](/wiki/Butt_welding) did not match the specification of [British Standards](/wiki/British_Standards). Parts of the track and some of the monorail stations were repurposed for other uses, such as the \"Surrender Chamber\" at Fort Siloso, a restaurant being developed at the Central Beach, and the SDC Office was rebuilt and converted into a bar. Gateway was demolished when the line closed and Ferry Terminal was demolished in March 2007 to make way for [Resorts World Sentosa](/wiki/Resorts_World_Sentosa).[*citation needed*] ## Stations There were no terminal stations for Sentosa Monorail. - **Station 1**: Ferry Terminal – Opened in 1987; closed in 2005; demolished in March 2007 - **Station 2**: Underwater World – Opened in 1991; closed in 2005; subsequently repurposed; demolished in 2017 together with Underwater World - **Station 3**: Fort Siloso (first station to be closed down) – Opened in 1982; closed in 2005; subsequently repurposed - **Station 4**: Cable Car – Opened in 1982; closed in 2005; subsequently repurposed - **Station 5**: Central Beach / Palawan Beach – Opened in 1982; closed in 2005; subsequently repurposed; demolished in 2022 - **Station 6**: SDC Office / Ficus – Opened in 1982; closed in 2005; subsequently repurposed; demolished in 2022 - **Station 7**: Gateway / Causeway / Visitor Arrival Centre – Opened in 1982; closed and demolished in 2005 - Entry on Roots - Media related to Sentosa Monorail at Wikimedia Commons\n",
  "language": "en",
  "processed_at": "2026-01-12T11:52:30.724017",
  "title": "Sentosa Monorail",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sentosa_Monorail"
}