{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:52:38.651988"
  },
  "content": "Singaporean women's rights advocate and politician **Seow Peck Leng** ([née](/wiki/Birth_name#Maiden_and_married_names) **Chua Seng Kim**, 17 September 1911 – 13 April 2007) was a Singaporean politician, educator and advocate for [women's rights](/wiki/Women%27s_rights). She was one of the first women members of parliament in [Singapore](/wiki/Singapore) and the only woman of an opposition party at the time. ## Biography Peck Leng was born on 17 September 1911 under the name Chua Seng Kim. She grew up in a middle class [Peranakan Chinese](/wiki/Peranakan_Chinese) family. After her mother died, when she was three years old, Peck Leng was raised by her aunt. Peck Leng went first to the [Singapore Chinese Girls' School](/wiki/Singapore_Chinese_Girls%27_School) and then to [Raffles Girls' School](/wiki/Raffles_Girls%27_School_(Secondary)). She started teaching in 1930, and was active in the [Singapore Teachers' Union](/wiki/Singapore_Teachers%27_Union). Peck Leng's experiences during [World War II](/wiki/World_War_II) changed her outlook in life and made her more confident. She went on to join the [Singapore Council of Women](/wiki/Singapore_Council_of_Women) led by [Shirin Fozdar](/wiki/Shirin_Fozdar) in 1952. In 1954, she was made the principal of the Cantonment School. Also in 1954, she created the Siglap Girls' Club, to help underprivileged girls in Singapore. In 1957, she expanded the mission of the club and renamed the group the Singapore Women's Association. She would lead the group until 1991. Peck Leng was voted into [Parliament](/wiki/Parliament_of_Singapore) as a [Singapore People's Alliance](/wiki/Singapore_People%27s_Alliance) (SPA) candidate for [Mountbatten](/wiki/Mountbatten_Single_Member_Constituency) in 1959. She was the only opposition MP woman in Parliament at the time. Peck Leng was able to work with members of the other party, the [People's Action Party](/wiki/People%27s_Action_Party) (PAP), work towards gender equality. She was involved with helping to pass the [Women's Charter](/wiki/Women%27s_Charter), and the 1962 provision for equal pay for equal work in the civil service sector. She lost her contest for [Joo Chiat](/wiki/Joo_Chiat_Single_Member_Constituency) in 1963 and retired from politics in 1965. After politics, she focused on charity work. Peck Leng promoted the \"Miss Singapore International\" [beauty pageant](/wiki/Beauty_pageant) shows for charity and to encourage women to help the less fortunate. In 1977, she was given a plaque of Life Patronage of the International Variety Club for raising the most charity funds. The [Ministry of Social Affairs](/wiki/Ministry_of_Social_and_Family_Development) awarded her a Certificate of Appreciation for \"valuable services rendered to others.\" Peck Leng died on 13 April 2007 in her home in [Keppel Bay](/wiki/Keppel_Bay). ## Legacy Peck Leng was honored on the Wall of Fame created by the [Singapore Council of Women's Organisations](/wiki/Singapore_Council_of_Women%27s_Organisations) (SCWO) in 2005. In 2014, she was added to the Singapore Memory Project. Also in 2014, she was inducted into the Singapore Women's Hall of Fame.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:52:38.651697",
  "title": "Seow Peck Leng",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Seow_Peck_Leng"
}