{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:52:54.110657"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Serangoon North\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2025)* *(Learn how and when to remove this message)*Place in Singapore **Serangoon North Village and Estate** is a cluster of [HDB](/wiki/Housing_and_Development_Board) apartment flats located north of [Serangoon Central](/wiki/Serangoon_Central) separated by [Serangoon Gardens](/wiki/Serangoon_Garden) to the west and private housing estates to the east with Yio Chu Kang Road connecting the two areas. It is a subzone of the neighbouring area [Hougang](/wiki/Hougang). It is sandwiched between [Ang Mo Kio](/wiki/Ang_Mo_Kio) to the west, Serangoon Gardens to the southwest, and [Hougang](/wiki/Hougang) to the east. Serangoon North has neighbourhood precincts of N1 and N5. Neighbourhood Zone 5 was the latest addition to Serangoon North, which is the current Serangoon North Estate that runs through Serangoon North Avenues 3, 4, 5, and 6. It was built in the period of years 1992 to 1994. The rest (Serangoon North Village), were built before the 1990s. Currently, there are 2 areas of Serangoon North, one by the [Workers' Party (WP)](/wiki/Workers%27_Party_of_Singapore) under the constitution management of [Aljunied GRC](/wiki/Aljunied_Group_Representation_Constituency), which is Serangoon North Village (Serangoon North Avenues 1 and 2). As of 2025, Serangoon North Estate on the other hand, is under the constitution management of the [People's Action Party (PAP)](/wiki/People%27s_Action_Party) under [Ang Mo Kio GRC](/wiki/Ang_Mo_Kio_Group_Representation_Constituency) Seletar-Serangoon Division (previously Jalan Kayu Ward). Serangoon North Village is also well known for its status as an animal paradise, having been named \"The Petwalk\". There are numerous establishments dealing in the sale of pets like birds, fishes and other animals. There are also veterinary clinics in the vicinity. Serangoon North will witness [Serangoon North MRT station](/wiki/Serangoon_North_MRT_station) as well, which is stipulated to commence operations as early as 2030. ## Facilities Serangoon North Estate is the area where factories opened and operated. Notable buildings around the area are [Keppel](/wiki/Keppel_Corporation) NTT and [Popular Holdings](/wiki/Popular_Holdings), which moved from its former site at Toh Tuck. Datacenters such as that of [Iron Mountain](/wiki/Iron_Mountain_(company)) have also been constructed in recent years. The ground level of First Centre offers car owners many options to have their vehicles serviced or enhanced. Ang Mo Kio Industrial Park II forms part of the industrial area as well. There is also a coffee shop, KPT located not far from the junction between Serangoon North Avenues 4 and 5 which operates 24 hours a day. ## Traffic issues After Rosyth School moved to its present premise along Serangoon North Avenue 4, the one-lane road witnessed severe traffic issues. This was a result of parents stopping their vehicles by the roadside to wait for their children to be dismissed from school. This traffic issue persisted until late-2011 when the school's field was moved to a higher level and a pick up/drop off area modelled after [Resorts World Sentosa](/wiki/Resorts_World_Sentosa)'s basement carpark was built. Today, Serangoon North Avenue 4 sees a smoother traffic flow. It is likely that this also enabled the [Land Transport Authority](/wiki/Land_Transport_Authority) (LTA) to amend existing bus service 315 and also introduce 116 to ply through the road.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:52:54.110365",
  "title": "Serangoon North",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Serangoon_North"
}