{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:52:47.455557"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Serangoon Garden\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2010)* *(Learn how and when to remove this message)*Place in Serangoon, Singapore **Serangoon Garden Estate** is a [residential](/wiki/Residential) [estate](/wiki/Housing_estate) in the [Serangoon](/wiki/Serangoon) district of the [North-East Region](/wiki/North-East_Region,_Singapore) of Singapore. It is also commonly known as \"Ang Sar Lee\" (*红砂厘)* for historical reasons, referring to red zinc roofs of the houses in the estate. ## History Serangoon Garden is one of the oldest estates on the island, and was built during the 1950s. The estate was upgraded in 2001 as part of the [Singapore Government](/wiki/Government_of_Singapore)'s plan to improve the older private housing estates in Singapore. Open roadside [drains](/wiki/Drainage) were covered up. [Streetlights](/wiki/Streetlight) and [road signs](/wiki/Road_sign) were replaced, and the estate's [parks](/wiki/Park) were also upgraded. Serangoon Garden Circus was used as one of the locations for the country-wide [millennium celebrations](/wiki/Millennium_celebrations). ### Electoral boundaries Until 1988, Serangoon Gardens was a single seat [constituency](/wiki/Constituency). When the [Group Representative Constituency](/wiki/Group_Representative_Constituency) was introduced, Serangoon Gardens became part of the GRC. Since then, it has been part of the [Aljunied GRC](/wiki/Aljunied_Group_Representation_Constituency). ## Housing Serangoon Gardens is generally a private housing estate. There are a variety of types of housing, including terrace homes, semi-detached and bungalows. This area is popular with affluent Singaporeans, with its close proximity to amenities and generally prestigious schools.[*citation needed*] ## Attractions The food and beverage outlets are located in the estate's central area. Serangoon Garden Circus is at the centre of the estate. In this vicinity, there are cafés, [restaurants](/wiki/Restaurant), [coffee shops](/wiki/Caf%C3%A9), [fast food restaurants](/wiki/Fast_food) and a shopping mall.[*citation needed*] All the roads radiate from the circus, and the houses are located within walking distance. The estate has a [tennis](/wiki/Tennis) and [squash](/wiki/Squash_(sport)) centre at Burghley Drive. At Kensington Park Road, there is a [country club](/wiki/Country_club) known as Serangoon Gardens Country Club. Although the Country Club serves its in-house members, members of the public can also enjoy delicious food such as cantonese cuisine - Swatow Garden - which serves popular Hong Kong Dim Sum and dishes.[*citation needed*] ## Education The [International French School of Singapore](/wiki/International_French_School_of_Singapore) is in Serangoon Gardens. A French community developed around the school. This community had developed by 2010. ## Amenities Situated behind Maju Avenue is Paramount Building which was developed as Serangoon Garden Village in 2001. A new small shopping mall called MyVillage has opened in its place with [NTUC FairPrice Finest](/wiki/NTUC_FairPrice) and a branch of [DBS Bank](/wiki/DBS_Bank) as its anchor tenants. ## Transport ### Public transport The estate is served by [public bus](/wiki/Bus) services. In addition, on weekday mornings from 7.30 am to 9 am, licensed private bus operators operate an express service plying between Serangoon Gardens and the [city centre](/wiki/City_centre). The nearest [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) station is [Serangoon MRT station](/wiki/Serangoon_MRT_station) on the [North East](/wiki/North_East_Line) and [Circle](/wiki/Circle_Line_(Singapore)) lines at [Upper Serangoon Road](/wiki/Upper_Serangoon_Road). [Lorong Chuan MRT station](/wiki/Lorong_Chuan_MRT_station) is another nearby option, especially for residents living further away from the central Serangoon Gardens area. From December 2029, [Tavistock MRT station](/wiki/Tavistock_MRT_station) will be the nearest option for Serangoon Gardens. Service 317 plies the Serangoon Garden Estate internally. The rest ply Serangoon Garden Circus. ### Roads There is 1 main road leading into the estate called **Serangoon Garden Way**. - [Lorong Chuan](/wiki/Lorong_Chuan)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:52:47.455093",
  "title": "Serangoon Garden",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Serangoon_Garden"
}