{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:52:52.336205"
  },
  "content": "Harbour in Singapore **Serangoon Harbour** ([Malay](/wiki/Malay_language): *Pelabuhan Serangoon*; [Chinese](/wiki/Simplified_Chinese_characters): 实龙岗港口; [pinyin](/wiki/Pinyin): *Shílónggāng Gángkǒu*) is a [harbour](/wiki/Harbour) in Singapore located between the mainland island of Singapore ([Pulau Ujong](/wiki/Pulau_Ujong)) and [Pulau Ubin](/wiki/Pulau_Ubin). ## History Before the founding of modern Singapore in 1819, the nearby Pulau Seletar and Pulau Ubin were home to the indigenous [Orang Laut](/wiki/Orang_Laut) and [Orang Seletar](/wiki/Orang_Seletar), who sailed and lived along the Serangoon Harbour, as well as the larger [Straits of Johor](/wiki/Straits_of_Johor). The harbour was later transformed into an important port in the northeast of the island, as quarry and timber from the neighbouring [Johor](/wiki/Johor) and Pulau Ubin became lucrative. Access to the harbour from the city was primarily via Serangoon Road. In World War II, the British and Allied troops mistakenly believed that the [Imperial Japanese Army](/wiki/Imperial_Japanese_Army) would invade Singapore by crossing the Serangoon Harbour after the Japanese troops moved into and captured [Pulau Ubin](/wiki/Pulau_Ubin). However the Japanese troops eventually landed on the [northwest of the island](/wiki/Lim_Chu_Kang) far from the harbour. ## Geography Serangoon Harbour is part of the [Straits of Johor](/wiki/Straits_of_Johor). It is south of the Nenas Channel which is the section of the Straits of Johor that lies between mainland [Malaysia](/wiki/Malaysia) and Pulau Ubin. The Serangoon Harbour lies entirely within Singapore territorial waters, in contrast only a small strip of the Nenas Channel lie within Singapore territorial waters. The depth of Serangoon Harbour is generally deep enough for commercial ships to pass on its way to either the [Sembawang Dock](/wiki/North_Region,_Singapore#Economy) in Singapore or [Pasir Gudang Johor Port](/wiki/Johor_Port) in Malaysia, although the Squance Bank near Pulau Ubin has shallower depths. The islands of [Coney Island](/wiki/Coney_Island,_Singapore), Pulau Ketam and [Pulau Sekudu](/wiki/Pulau_Sekudu) lie within this harbour. The rivers of Sungei Changi, Sungei Selarang, Sungei Loyang, Sungei Tampines and Sungei Api-Api, from east to west on mainland Singapore are tributaries into the harbour. The Sungei Serangoon and Sungei Punggol are no longer tributaries into the harbour after they have been dammed to create their respective reservoirs. The rivers of Sungei Tiga, Sungei Jelutong, Sungei Puaka and Sungei Teris from east to west on Pulau Ubin are also tributaries into the harbour. ## Infrastructure There are many [kelongs](/wiki/Kelong) in the Serangoon Harbour, these belong to fishermen who rear fishes and other sea animals that are sold in Singapore. These fishermen mainly use Changi Point Ferry Terminal or Lorong Halus Jetty as a drop off point to come onto mainland. The part of Serangoon Harbour off [Pasir Ris Park](/wiki/Pasir_Ris_Park) have floating buoys to demarcate the swimming boundary of the park. Further offshore, floating coloured lit buoy markers delimit the boundary of the shipping routes. There are no lighthouses operating in the harbour or its precincts. Along the coast on mainland Singapore, there are multiple jetties and boardwalks from east to west, the Changi Ferry Terminal, [SAF Changi Ferry Terminal](/wiki/SAF_Changi_Ferry_Terminal), Changi Airport Fuel Hydrant Installation (CAFHI) Jetty, Changi Point Ferry Terminal, Changi Sailing Club Jetty, [Changi Boardwalk](/wiki/Changi_Boardwalk), Police Coast Guard Loyang Base, Loyang Offshore Supply Base Jetty, Lorong Halus Jetty and the [Outward Bound Singapore](/wiki/Outward_Bound_Singapore) (OBS) Punggol Jetty. Along the coast of Pulau Ubin, there are multiple jetties and boardwalks from east to west, the [Chek Jawa](/wiki/Chek_Jawa) Boardwalk, Chek Jawa Viewing Jetty, Pulau Ubin Main Jetty, OBS Camp Two Jetty and OBS Main Jetty. The jurisdiction of Serangoon Harbour falls under the Police Coast Guard Loyang Base. In the event of an aviation accident in the area, the Changi Airport Emergency Service (AES) would be deployed too. ## Nature Pulau Ubin is adjacent to the harbour and is the location of one of few remaining undeveloped parts of Singapore that is rich in biodiversity. There have been spotting of crocodiles and dugongs amongst other wildlife. Migratory birds have also been known to use the area as a stopover point for their flight. There have been occasional phytoplankton blooms in the harbour too that have affected the water appearance as well as the fish stocks especially those in the kelongs. ## Transportation The main mode of transportation across the harbour is by small bumboat ferry service that originate from Changi Point Ferry Terminal and usually travel towards Pulau Ubin Main Jetty. Each ride costs SGD$3 per passenger and there usually is a short wait until each bumboat ferry has 12 passengers before the boat departs. Passengers arriving via ferry to this terminal have to undergo security screening of personnel and baggage from whichever location they are arriving from (even Pulau Ubin) for security reasons. The OBS School have their own private craft to ferry participants to and from the camps along the harbour. ## Developments ### Future Plans There are currently no future plans with regards to the harbour, which includes no plans for land reclamation in that area despite the land scarcity issue in Singapore. ### Unsuccessful Plans There were plans in the 1970s to reclaim land between Singapore and Pulau Ubin to build a large sea reservoir, to increase the country's water supply. This project was similar to Hong Kong's [Plover Cove Reservoir](/wiki/Plover_Cove_Reservoir) project years earlier. However, after reviewing the conditions of the seabed, costs and environmental concerns, as well as complications involving Malaysia, because the closing of the harbour would affect shipment in the nearby Pasir Gudang Port due to the narrowing of the access strait, the plan was eventually scaled down to limited land reclamation off Coney Island and Punggol and the construction of the [Serangoon](/wiki/Serangoon_Reservoir) and [Punggol](/wiki/Punggol_Reservoir) Reservoirs which instead lie within mainland Singapore. There were plans in the 1990s for a [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) line to be extended towards Pulau Ubin and [Pulau Tekong](/wiki/Pulau_Tekong) thus cutting across the harbour. The building of bridges or tunnels to link mainland Singapore to these islands were also considered so as to make these islands more accessible, in view of future plans to build light industries and high density housing on both islands, however due to environmental concerns and other complications the plan was shelved. There were also proposals to build a [third causeway](/wiki/Malaysia%E2%80%93Singapore_Third_Crossing) between Singapore and Malaysia with one of the suggestions being the bridge be built over the southern end of the harbour, linking [Changi](/wiki/Changi), Singapore and [Pengerang](/wiki/Pengerang), Malaysia, however Singapore had rejected the proposals in favour of the [Kuala Lumpur–Singapore high-speed rail](/wiki/Kuala_Lumpur%E2%80%93Singapore_high-speed_rail) project and this led to the proposal being scrapped by 2016. ## Incidents - On 3 January 2017, two vessels collided off Pasir Gudang Port resulting in a 300 tonne oil spill that floated near the Serangoon Harbour. Oil booms and buoys were deployed while the Johor Port Authority cleared the spill. There were neither injuries nor shipping traffic affected, although coastal fish farms located in the area were reported to have been affected by the spill. - On 21 February 2018, Chew Eng Han, City Harvest Church fund manager convicted of misusing church funds and sentenced to three years and four months jail was caught in Serangoon Harbour off Pulau Ubin by police coast guard minutes into his attempted escape to Malaysia via motorised sampan. He was to have started his jail term the next day, after seeking deferment for the start of his term. Two people who were found to have assisted him in his escape were charged separately in court. 1°24′N 103°56′E﻿ / ﻿1.400°N 103.933°E﻿ / 1.400; 103.933\n",
  "language": "en",
  "processed_at": "2026-01-12T11:52:52.335784",
  "title": "Serangoon Harbour",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Serangoon_Harbour"
}