{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:52:59.541406"
  },
  "content": "2023 Singaporean drama film ***Seven Days*** ([Chinese](/wiki/Chinese_language): 七天) is a 2023 Singaporean supernatural drama film written and directed by [Grace Wu](/wiki/Grace_Wu) in her directorial debut. The film revolves around a female ghost who incidentally took a chance to possess her younger brother's body for seven days to resolve unsettled matters with her family. The film premiered as the opening film of the Singapore Chinese Film Festival on 28 April 2023 and was released in theatres on 12 May 2023. ## Cast - [Ya Hui](/wiki/Ya_Hui) as Luo Ai-ling - Alicia Low as young Luo Ai-ling - [Ayden Sng](/wiki/Ayden_Sng) as Luo Ai-xiang - Charles Lam as young Luo Ai-xiang - [Henry Thia](/wiki/Henry_Thia) as Old Ghost (Chen Wei-kang) - [Xuan Ong](/wiki/Xuan_Ong) as Luo Ai-shi - Regina Lim as Chen Jing-yao - Brian Ng as Wang Xun-yang - [Peter Yu](/wiki/Peter_Yu) as Father - Doreen Toh as Mother - [Jasmine Sim](/wiki/Jasmine_Sim) as Lisa - Benjamin Eio as Frank - Liow Shi Suen as Xun-yang's mother - Debra Loi as Kelly - Elvis Chin as Henry - Teo Ser Lee as Café customer - Goh Wee-Ann as Ai-ling's daughter - Nicholas Lim as Ai-ling's son - Oh Ling En as young Ai-ling's classmate ## Production and marketing Principal photography began on 13 March 2022. Director and writer [Grace Wu](/wiki/Grace_Wu), who was born in [Chongqing](/wiki/Chongqing), became the first Chinese director to shoot a Singaporean-produced film. *Seven Days* also became the first Singaporean film to have its own [NFT](/wiki/Non-fungible_token) film art collection available on the platform [OpenSea](/wiki/OpenSea). - *Seven Days* at [IMDb](/wiki/IMDb_(identifier)) This article related to a Singaporean film is a stub. You can help Wikipedia by expanding it. - v - t - e This 2020s drama film–related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:52:59.541175",
  "title": "Seven Days (2023 film)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Seven_Days_(2023_film)"
}