{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:53:02.536624"
  },
  "content": "* *Sex trafficking in Singapore** is [human trafficking](/wiki/Human_trafficking) for the purpose of [sexual exploitation and slavery](/wiki/Sexual_slavery) that occurs in the [Republic of Singapore](/wiki/Republic_of_Singapore). Singapore is primarily a destination country for sexually trafficked persons. ## History In the 16th and 17th centuries, prior to [colonization](/wiki/Colonization), European traders who stopped at ports along the Malayan coast would trade goods with local chiefs for women. This was one of the methods used to flourish business relationships. Having a local woman as a wife or [concubine](/wiki/Concubinage) would give these traders better access into local markets. The bought women would act as a local guide and were beneficial to the traders in forming critical connections in the marketplace. The Dutch continued this practice for decades but as time progressed, growing ideas of [nationalism](/wiki/Nationalism) and racial degradation put an end to these mixed marriages. Aside from these more permanent relationships, men could buy sexual encounters with local women or slaves in taverns, inns and [opium dens](/wiki/Opium_den). Businesses began to import large numbers of women and girls from around the region to supply the increasing demand for sexual services. After the British arrived, the colonial government in Singapore imported a large number of laborers from [China](/wiki/China) which resulted in a highly unbalanced [sex ratio](/wiki/Sex_ratio). This unbalanced sex ratio resulted in a high demand for sex labor. At that same period, many women from rural [Japan](/wiki/Japan) and China were willing to migrate within [East Asia](/wiki/East_Asia) and engage in sex work to provide for their families. Organized criminal groups in Singapore took advantage of this situation and created networks between these impoverished women and the laborers in Singapore to profit from the migration of potential sex workers into the nation. Despite the government's attempt to enforce legislations, the colony had already built a highly sophisticated, intricately organized and prosperous sex labor network that was unable to be curbed successfully. After Singapore gained [independence](/wiki/Singapore_independence), the economic boom between the 1960s and 80s saw a turn in the sex labor market. The economic boom exacerbated existing economic inequalities which caused an increase in the local sex labor industry. Women were continually trafficked into Singapore to expand the multi-billion dollar sex labor industry. While the new government attempted to completely push the sex labor out of the country, this did not work. Ultimately in an attempt to grapple with the realities of the trade that was deeply entrenched in society, brothel owners, women and law enforcement officials came to an agreement on unofficial systems that would regulate and control sex labor in the country. While sex labor was unofficially regulated, sex trafficking was not formally dealt with until the early 21st century. ## Victims Historically, women were often trafficked from [South Asia](/wiki/South_Asia) into Singapore for sex work. During British colonization, women were mainly brought in from regions in Indonesia such as [Borneo](/wiki/Borneo) and [Sumatra](/wiki/Sumatra). Many of the victims were Chinese, Malay and Indonesian women. In current day Singapore, many women are trafficked into Singapore from [Southeast Asian](/wiki/Southeast_Asia) countries, mainly [Thailand](/wiki/Thailand), [Vietnam](/wiki/Vietnam) and the [Philippines](/wiki/Philippines), under false pretenses of working as a [domestic helper](/wiki/Domestic_worker) or other legal jobs. These women are forced to work at a KTV or [hostess clubs](/wiki/Host_and_hostess_clubs). Many of these women were brought in through agents and are subject to heavy debts, lack of freedom to move around the country and they are unable to control if clients engage in safe and protected sex with them. This has resulted in a rise in sexually transmitted diseases which have been unable to be controlled by the government. In recent years Singapore has seen a rise in forest based brothels compared to the traditional venues of KTVs and massage parlors. The conditions in these makeshift brothels are significantly poorer compared to other spots. The brothel comprises a mattress on the forest floor and a thin tarp to veil the deed. These brothels are often nearer to migrant worker dormitories. Victims are driven to the spot daily by their captors and immediately brought back to their apartment after. Most trafficked victims who work in forest based brothels come from Thailand. In the sex labor industry in Singapore, authorities have grouped workers into three broad categories to make identification of sex trafficked victims easier. The first group are women who have been lied to about the jobs they would be doing and were pressured to come. The second group are adult men and women who voluntarily sought employment in the sex labor industry but may have been lied to about working conditions such as the number of hours they would have to work. The third group is minors in the industry. Individuals in the third group are always considered to have been trafficked as they are underage and cannot give informed consent. The authorities have focused heavily on the third group and many cases they attend involve female minors. ## Perpetrators The perpetrators of sex trafficking in Singapore are often linked to [secret societies](/wiki/Secret_societies_in_Singapore) or an established network of brothels, commonly in hot spots such as [Geylang](/wiki/Geylang) and Joo Chiat. In some cases, the perpetrators are friends of the victims and coerce them to come to Singapore with promises of finding good employment. Some perpetrators also prey on victims in hostess bars overseas and lure them to Singapore with supposed better job prospects. Once in Singapore, the perpetrators confiscate the victims passports which leaves them stranded in the country and dependent on the pimps. Pimps act as agents for these trafficked victims and saddle them with huge debts that the victims have to attempt to pay back by servicing many customers and working long hours. These pimps also restrict the movement of victims around the country in fear of them escaping or alerting the authorities. Victims are also unable to use mobile phones without being supervised by their pimps. The pimps are often physically or sexually abusive towards victims. While authorities have cracked down on unlicensed brothels in known hot spots like Geylang, these perpetrators merely move their businesses elsewhere, such as to heartland areas like [Woodlands](/wiki/Woodlands,_Singapore) or [Jurong](/wiki/Jurong). ## Government Response In the late 1870’s, the Control of Disease Ordinance (CDO) was established by the colonial government in Singapore. This ordinance allowed officials to inspect brothels, register workers and ensure that they underwent frequent health checks which would allow the curb of sexually transmitted diseases. Brothels were required to register under the CDO and through this, women and girls who were trafficked were able to be identified easier and were liberated from participating in sex labor. Sex workers who had freely chosen to engage in this industry were not the primary concern of the CDO officials. Instead they focused on helping women who had been forced or tricked into the trade and had no other means of escape. In 1896, the Women’s and Girl’s Protection Ordinance was passed and acted similarly to the CDO with the belief that consensual sex labor was possible and had to be regulated by the authorities. Women under the age of 16 were removed from brothels by officials and placed in special homes to assist them. Officials were also allowed to search any brothel or ship they suspected was tied to human trafficking under this ordinance. While Singapore has attempted to regulate sex labor and liberate trafficked victims through legislations, the nation has not signed any international protocols or established any legislations that are directly targeted at anti-trafficking movements. Up until the 21st century, Singapore was mainly focused on regulating the rise of sex labor and ensuring that sexually transmitted diseases did not spread rampantly. In 2001, Singapore was placed under Tier 2 in the [Trafficking in Persons Report](/wiki/Trafficking_in_Persons_Report) (TIP) that was released by the [United States](/wiki/United_States). Countries under Tier 2 are deemed as those with governments who are attempting to be in compliance with the American [Trafficking Victims Protection Act](/wiki/Trafficking_Victims_Protection_Act) but have yet to fully do so. Singapore consistently remained in Tier 2 for the following years. The overseeing committee of the TIP maintained that perpetrators caught in Singapore were not justly convicted and that the nation had not done enough to protect trafficked victims. In 2010, Singapore was downgraded to the Tier 2 Watch List which put heightened international and local pressure on the government to make changes in regards to trafficking activities. The government responded by forming the Inter-Agency Task Force on Trafficking in Persons. Singapore also signed the United Nations [Protocol to Prevent, Suppress and Punish Trafficking in Persons, Especially Women and Children](/wiki/Protocol_to_Prevent,_Suppress_and_Punish_Trafficking_in_Persons,_Especially_Women_and_Children) (UN TIP) in 2015 and ratified the ASEAN Convention Against Trafficking in Persons in 2016. ## Non-Governmental Organization Response Various [non-governmental organizations](/wiki/Non-governmental_organization) (NGO) have worked to raise awareness and combat sexual trafficking in Singapore as well as to provide aid to victims. NGOs such as the [Association of Women for Action and Research](/wiki/Association_of_Women_for_Action_and_Research) (AWARE) and Transient Workers Count 2 (TWC2) have worked with authorities and the public to help victims. Some organizations which were originally formed to advocate for [migrant workers' rights](/wiki/Migrant_workers%27_rights), rebranded themselves or opened up an additional sector to raise awareness about sex trafficking. Due to the increase in public awareness about sex trafficking in the country through social and print media, organizations have been able to increase their volunteer pool. These groups have faced some prior pushback from the government as they were unable to directly interact with trafficked victims due to the authorities providing direct in-house services that keep the two parties from meeting. At the youth level, some student groups have been formed at [junior college](/wiki/Junior_college_(Singapore)) and university levels that work with NGOs to raise awareness among their peers about sex trafficking.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:53:02.536348",
  "title": "Sex trafficking in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sex_trafficking_in_Singapore"
}