{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:49:34.320732"
  },
  "content": "Singaporean social media website and news media company **SGAG** is a Singaporean [social media](/wiki/Social_media) website and news media company based in [Singapore](/wiki/Singapore). The company was founded by Karl Mak and Adrian Ang on 14 November 2011, as a Singaporean [spin-off](/wiki/Spin-off_(media)) of the popular social media website, [9GAG](/wiki/9GAG). Since the website's [incorporation](/wiki/Incorporation_(business)) on April 10, 2013, it has 1.1 million likes on Facebook, 587k followers on Twitter and 701k followers on Instagram as of February 2022. ## History The company was co-founded as a Facebook page in 2011 by [Singapore Management University](/wiki/Singapore_Management_University) students Karl Mak and Adrian Ang during one of their university classes, with the idea of having a Singapore version of [9GAG](/wiki/9GAG), with a focus on issues in Singapore and local Internet memes. The company first started going viral after its founders posted a meme after McDonald's Singapore ran out of curry sauce at its outlets, and has since then become popular among the youth for its funny video portrayals by [Annette Lee](/wiki/Annette_Lee) as \"Sue Ann\" and \"Suezanna Chole Tan\". ### Website, mobile app platform, MGAG and PGAG In December 2014, SGAG first launched its website where users can sign up for an account and publish their own content on the website. The website also has a leaderboard that rewards active participants with a certain number of points per action, with top users standing a chance to win prizes. In addition to launching a new website, the company also released the mobile app version of their website on both Android and iOS. On August 5, 2015, SGAG launched MGAG, the Malaysian branch of the company. MGAG also started off as a Facebook page before launching their own website. On January 21, 2018, PGAG, the Filipino branch of the company, was launched by SGAG. On November 27, 2019, SGAG launched \"Off-Track\", a strategy card game. - Singapore: SGAG Official Website - Malaysia: MGAG Official Website - Philippines: PGAG Official Website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:49:34.320461",
  "title": "SGAG",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/SGAG"
}