{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:53:07.704872"
  },
  "content": "Singaporean politician (1932–2009)**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)* **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(August 2025)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Sha'ari Tadin\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2025)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Sha'ari bin Tadin** (2 August 1932 – 13 December 2009), was a Singaporean politician and educator. Representing the People’s Action Party from 1968 to 1980, he was Parliamentary Secretary and later Senior Parliamentary Secretary for Culture, where he promoted the arts, culture, sports, and youth development. After politics, he returned to education as a principal, and later obtained a master’s degree in sociology, continuing to contribute to academia and community leadership. ## Early life and education Sha'ari was born in [Kuala Pilah](/wiki/Kuala_Pilah), [Negri Sembilan](/wiki/Negri_Sembilan), [Federated Malay States](/wiki/Federated_Malay_States). An ethnic [Malay](/wiki/Ethnic_Malays) of [Minangkabau](/wiki/Minangkabau_people) descent, he was the eldest of six siblings. He attended the Malay School in Kuala Pilah, completing his primary education in the sixth grade (Darjah 6) during the [Japanese occupation of Malaya](/wiki/Japanese_occupation_of_Malaya) in 1942–1945. After the war, Sha'ari moved to Singapore. He retook his primary education at [Outram School](/wiki/Outram_School), completing it in less than three years. He had his secondary education at [Victoria School](/wiki/Victoria_School). On obtaining his Senior Cambridge Certificate, he joined the Teachers' Training College (now [National Institute of Education](/wiki/National_Institute_of_Education)) and started his teaching career in 1957. In 1962, Sha'ari was awarded the [Colombo Plan](/wiki/Colombo_Plan) Scholarship to study at the [University of Malaya](/wiki/University_of_Malaya) (UM) in [Kuala Lumpur](/wiki/Kuala_Lumpur), leading up to a Bachelor of Arts (Honours) degree in Malay Studies. While at UM, he was elected President of the *Persatuan Kebangsaan Pelajar Islam Malaysia* (PKPIM) or National Union of Federation Muslim Students from 1963 to 1965, as well as Executive Committee member of the *Masjlis Belia Malaysia* or Malaysian Youth Council (MYC) Executive Committee in 1963 and 1964. He was also Deputy Leader of UM's first Student Exchange Programme delegation to [Chulalongkorn University](/wiki/Chulalongkorn_University), Bangkok in 1963; and part of MYC's delegation to the 5th General Assembly of the World Assembly of Youth (WAY) Conference at [University of Massachusetts Amherst](/wiki/University_of_Massachusetts_Amherst), USA. Sha'ari obtained a Master's degree in Social Sciences in Sociology from the [National University of Singapore](/wiki/National_University_of_Singapore) in 1987, at the age of 56. ## Career ### Educational career Sha'ari taught in various primary schools between 1954 and 1960, including Jalan Daud Primary School and Siglap Secondary School. In 1961, he taught Science to Malay-medium pupils at Siglap Secondary School. In 1962, Sha'ari went to Kuala Lumpur for further studies and returned to Singapore in 1965. He then taught Malay and Economics (in the Malay language) to the first batch of pre-University Malay-medium pupils at Sang Nila Utama Secondary School, the first Malay secondary school in Singapore. He was also part of the Singapore delegation to the Third Asian Teachers' Leadership Seminar Committee, Permanent Congress of Malay Language and Culture in 1966. Within 2 years at Sang Nila Utama Secondary School, he became Acting Principal in 1967. As one of the first few Singaporean Malay graduates and scholars in the 1960s, Sha'ari was Acting Principal at Sang Nila Utama Secondary School in 1967. In February 1977, Sha'ari rejoined the Ministry of Education as an aided Education Officer. That same year he was seconded as Principal of [Telok Kurau Secondary School](/wiki/Telok_Kurau_Secondary_School). Upon retiring from politics, Sha'ari was posted to the [Ministry of Education, Singapore](/wiki/Ministry_of_Education,_Singapore)'s Public Relations Unit in 1985 until 1987. Sha'ari served as a visiting fellow at the [Institute of South East Asian Studies](/wiki/Institute_of_South_East_Asian_Studies) in December 1987. ### Political career Sha'ari was approached by [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) to join the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) and contest in the general elections. It took much persuasion before Sha'ari agreed to join politics. He strongly believed in a strong foundation in education among the younger generation of citizens, and being in Parliament would enable him to continue his work and do more for the nation. In February 1968, Sha'ari retired from Government Service to enable him to stand as a PAP candidate for [Kampong Chai Chee Constituency](/wiki/Kampong_Chai_Chee_Constituency) in the [1968 general election](/wiki/1968_Singaporean_general_election). As the constituency was unopposed by other parties or candidates, it was a walkover for Sha'ari and he became the Member of Parliament (MP) for the constituency. Sha'ari established various initiatives in line with the spirit of Chai Chee’s sense of community, while transitioning from kampongs to living in new HDB flats. In May, Sha'ari was appointed Parliamentary Secretary to the Minister for Culture. He spent time and energy with the people, grassroots leaders and residents in his constituency to better understand their concerns and to be able to help them understand the need for building a better future for Singapore. He was also concerned with problems faced by the Malay community and called for solutions from a national perspective. In 1972, Sha'ari was promoted to Senior Parliamentary Secretary (Culture) in 1972. He had also temporarily performed the duties of Parliamentary Secretary (Education) before the [1972 general election](/wiki/1972_Singaporean_general_election). In 1976, Sha'ari was moved to contest the newly established [Bedok Constituency](/wiki/Bedok_Constituency), which was carved from [Siglap Constituency](/wiki/Siglap_Constituency), in the [1976 general election](/wiki/1976_Singaporean_general_election). The constituency was also challenged by Sim Peng Kim of the [United Front](/wiki/United_Front_(Singapore)) and Sha'ari won the contest with nearly 74 percent of the votes. In 1980, Sha'ari retired from politics. ## Contribution to the Arts During his tenure at the Ministry of Culture, he was instrumental in the promotion of Singapore's arts and culture locally and overseas, asserting that the arts could play a vital role in nation-building. In 1969, he founded *Majlis Pusat* (*Pertubuhan-Pertubuhan Budaya Melayu*) or Central Council of Malay Cultural Organisations, and became its patron until 1987. He helped to establish the National Dance Company (now Singapore Dance Theatre), which made its debut in the [Adelaide Festival of Arts](/wiki/Adelaide_Festival_of_Arts), Australia in 1972, thrilling local audiences with their music, costumes and dances representing Singapore's muticultural identity. He led cultural delegations to [Indonesia](/wiki/Indonesia), the [Soviet Union](/wiki/Soviet_Union), [Tehran](/wiki/Tehran) and [South Korea](/wiki/South_Korea) and was leader of the Singapore contingent at the [1974 Asian Games](/wiki/1974_Asian_Games) in Tehran. He was also a special guest of the Governments of [West Germany](/wiki/West_Germany), Japan and France in 1972, 1974, 1975 respectively. ## Other senior appointments - President, [Singapore Amateur Cycling Association](/wiki/Singapore_Cycling_Federation), 1977–1988. - Vice-President, [Singapore Sports Council](/wiki/Singapore_Sports_Council), 1974–1982. - Ex-Co Member, Asian Games Federation (now [Olympic Council of Asia](/wiki/Olympic_Council_of_Asia)), 1974–1982. - Member of Executive Board, [Singapore National Olympic Council](/wiki/Singapore_National_Olympic_Council) (SNOC), 1970s. - President, *Taman Bacaan* (Singapore Malay Youth Library Association), 1970s. - Chief Patron, Japanese Cultural Society, Singapore, 1970s. - Adviser of Regional Youth Council (East), [People's Association](/wiki/People%27s_Association), 1970s. - Chairman of Organising Committee, Summer Scholarship, Japan (Asian students), 1970s. - Founder, Chairman of Advisory Board & Patron, *Majlis Pusat*, 1969–1987. - President, *Persatuan Persuratan Pemuda Pemudi Melayu* (4PM) or the Malay Youth Literary Association from 1968-69. ## Awards In 1984, *Majlis Pusat* conferred Sha'ari with the *Anugerah Jasawan* (Meritorious Award). In the same year, the Singapore Government accorded him the *Pingat Bakti Setia* (Excellent Service Award) for his commitment and contribution to public service. ## Death Sha'ari died of heart failure on 13 December 2009, at the age of 77. - [Malays in Singapore](/wiki/Malays_in_Singapore) - [Members of the Singapore Parliament](/wiki/Members_of_the_Singapore_Parliament)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:53:07.704511",
  "title": "Sha'ari Tadin",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sha%27ari_Tadin"
}