{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:53:14.257359"
  },
  "content": "Shopping mall in Singapore **Shaw House and Shaw Centre** is a complex of two neighbouring buildings built by the same developer, [Shaw Organisation](/wiki/Shaw_Organisation). Located at the [junction](/wiki/Road_junction) of [Orchard Road](/wiki/Orchard_Road) and [Scotts Road](/wiki/Scotts_Road) in Singapore, it features the flagship Lido [Cineplex](/wiki/Multiplex_(movie_theater)) for the Shaw Organisation, a major shopping mall with [Isetan](/wiki/Isetan) as an [anchor tenant](/wiki/Anchor_tenant), and two office buildings. ## Shaw House Shaw House is a shopping mall and the home of Lido Cinema (now Lido 8 Cineplex). Lido Cinema was constructed in 1958 as a 10-storey office block, and was officially opened by [Lim Yew Hock](/wiki/Lim_Yew_Hock) on 22 November 1958. In the late 1980s, owner [Shaw Organisation](/wiki/Shaw_Organisation) decided to tear down the old Lido Cinema, and build a 21-storey building with a basement. This project, which was the Shaw Organisation's largest in Singapore to date, was completed in 1993 after three years of construction. Shaw House houses the main store of [Isetan](/wiki/Isetan) in Singapore, and occupies five floors. It has a Japanese supermarket in the basement, and has offices on the upper floors of the building. In mid-2010, plans were made to add two more [3D](/wiki/3D_film) theatres and one [IMAX](/wiki/IMAX) theatre. The Cineplex closed in late 2010 for renovations to add the new theatres. It reopened on 5 May 2011. The IMAX theatre officially opened on 19 May 2011 to screen its first film, *Pirates of the Caribbean: On Stranger Tides*. ## Shaw Centre Shopping mall in Orchard, Singapore Shaw Centre lies adjacent to Shaw House, and was the tallest building in Singapore when it was completed in 1972. The head office of Shaw & Shaw Pte Limited, the precursor of Shaw Organisation, moved into Shaw Centre in 1978. The old Lido Cinema and Shaw Centre were designed by architect, Gordon Dowsett of Van Sitteren & Partners. The high commission of [Pakistan](/wiki/Pakistan) is situated on the 24th floor of the building. - [Runme Shaw](/wiki/Runme_Shaw), founder of Shaw Organisation. - [Run Run Shaw](/wiki/Run_Run_Shaw), co-founder of Shaw Organisation.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:53:14.257011",
  "title": "Shaw House and Centre",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Shaw_House_and_Centre"
}