{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:53:15.996226"
  },
  "content": "Singaporean(sg) film distributor and movie-theatre chain **Shaw Organisation** is a film distribution company and cinema chain founded by brothers [Runme Shaw](/wiki/Runme_Shaw) and [Run Run Shaw](/wiki/Run_Run_Shaw) who went to Singapore in the 1920s to expand their family business founded by [Runje Shaw](/wiki/Runje_Shaw). The company originally operated as a distributor for the Shaw brothers' [Tianyi Film Company](/wiki/Tianyi_Film_Company) (also called Unique) in Shanghai. Run Run Shaw later moved to Hong Kong in the 1950s to run [Shaw Brothers Studio](/wiki/Shaw_Brothers_Studio), whilst Runme Shaw stayed in Singapore to continue Shaw Organisation's operations. Unlike Tianyi, Shaw Organisation does not produce films but distribute them in their theatre's. ## History Shaw Organisation has a long history in Singapore since its founding in 1928. They bought the land which the Shaw House now stands in the year 1952. The plot of land was originally granted to William Scott in 1845. About 500,000 square feet of land was levelled original Shaw House and the adjacent Lido Theatre. The company managed single-screen cinemas until the late 1980s, when it decided to build [cineplexes](/wiki/Multiplex_(movie_theatre)) to give more flexibility in offering different types of films. The first cineplexes built were the Prince and Jade cineplexes in Shaw Towers, opened in February 1988. Cineplexes have now become the standard for cinemas offering varied shows for smaller crowds. The Shaw Organisation was founded in 1928 when Tan [Runme Shaw](/wiki/Runme_Shaw) (1901–1985) arrived in Singapore from Shanghai. He was the third of seven children of a Shanghai textile merchant, Shaw Yuh Hsuen (1867–1920). In Shanghai, Runme's eldest brother [Runje Shaw](/wiki/Runje_Shaw) had founded the [Tianyi Film Company](/wiki/Tianyi_Film_Company) (aka Unique). Not satisfied with the domestic market, the Shaw brothers sought business opportunities elsewhere, especially South-East Asia. Runme, as distribution manager was tasked to search for a suitable investment city. Runme's original destination was Indochina where he hoped to meet with the film distributors. However, he was denied permission to land there and instead, he ended up in Singapore, creating the Shaw Organisation. He was joined by his younger brother Sir Run Run Shaw two years later. After the [Great Depression](/wiki/Great_Depression), the Shaws decided to diversify their risk by branching out from their entertainment business into areas like amusement parks. They brought in ideas from abroad and modelled the parks after those in Shanghai, which proved to be popular amongst the local population. From the mid 30s to the 80s, Shaw operated two popular fairgrounds – the [Great World Amusement Park](/wiki/Great_World_Amusement_Park) and the [New World Amusement Park](/wiki/New_World_Amusement_Park). At its height, the company owned multiple cinemas and amusement parks throughout Singapore, [Malaysia](/wiki/Malaysia) and [Borneo](/wiki/Borneo), and spawned [Shaw Brothers Studio](/wiki/Shaw_Brothers_Studio) in Hong Kong to feed its then-burgeoning operation. By August 2000, a computerised ticketing system developed jointly with Singapore Computer Systems was launched. This system linked all Shaw theatres into a single network for automated telephone credit card purchases. With its extensive infrastructure, Shaw is now the biggest distributor of Asian cinema. Today, it manages and runs 84 screens in 8 locations in Singapore. ## Business operations ### Cinemas Shaw Theatres has 8 cinemas and 84 screens in Singapore currently. A ninth cineplex in Shaw Oriental (former Oriental Plaza) will open in late 2026. #### Current locations **Cinema****Screens/Halls****Seats****Location****Opening Year****Digital Hall****IMAX****3D Digital Hall****Shaw Premiere****Shaw Lumiere****Dreamers**[Lido](/wiki/Shaw_House_and_Centre) (Shaw House)111978[Orchard](/wiki/Orchard_Road)1993YYYNNN[Lot One](/wiki/Lot_1_Shoppers%27_Mall)8664[Choa Chu Kang](/wiki/Choa_Chu_Kang)1996YNYNNN[Balestier](/wiki/Shaw_Plaza) (Shaw Plaza)11721[Balestier](/wiki/Balestier)1999YNYNYY[Nex](/wiki/Nex,_Singapore)101285[Serangoon](/wiki/Serangoon)2010YNYYNN[Waterway Point](/wiki/Waterway_Point)111450[Punggol](/wiki/Punggol)2016YYYNNN[Jewel](/wiki/Jewel_Changi_Airport)11828[Changi Airport](/wiki/Changi_Airport)2019YYYNYYPaya Lebar Quarter12986[Paya Lebar](/wiki/Paya_Lebar)2019YYYNYN[Jem](/wiki/Jem,_Singapore)8TBC[Jurong East](/wiki/Jurong_East)2025YNYYNN #### Upcoming locations **Cinema****Screens/Halls****Seats****Location****Opening Year****Digital Hall****IMAX****3D Digital Hall****Shaw Premiere****Shaw Lumiere****Dreamers**Shaw OrientalTBCTBC[Chinatown](/wiki/Chinatown)2026YNYTBCTBCTBC #### Former locations **Cinema****Screens/Halls****Seats****Location****Opening Year****Closed Year**Bugis Junction31080[Downtown Core](/wiki/Downtown_Core)20012016Century Square6979[Tampines](/wiki/Tampines)19952017Changi31154[Bedok](/wiki/Bedok)19802000Chinatown Point2684[Chinatown](/wiki/Chinatown)19911999Great World4[River Valley](/wiki/River_Valley,_Singapore)19361992Hoover1900[Balestier](/wiki/Balestier)19601996[JCube](/wiki/JCube)71010[Jurong East](/wiki/Jurong_East)20122023Oriental2[Chinatown](/wiki/Chinatown)19902000President11200[Balestier](/wiki/Balestier)19731996Republic3[Marine Parade](/wiki/Marine_Parade)19801999Roxy11200[Katong](/wiki/Katong)19311978Savoy2Boon Lay1980s1998[Seletar](/wiki/The_Seletar_Mall)8764[Sengkang](/wiki/Sengkang)20142024[Shaw Tower](/wiki/Shaw_Tower,_Singapore)41200Beach Road20012009Taman Jurong1Jurong1970s1990sVision41200[Hougang](/wiki/Hougang)19932000Woodlands2619[Woodlands](/wiki/Woodlands,_Singapore)19801999 ### Commercial properties Besides its involvement in film distribution, Shaw Organisation had investments in properties as well. The most prominent one is the Shaw House located at 350 Orchard Road with [Isetan](/wiki/Isetan) as its anchor tenant. The [Shaw House](/wiki/Shaw_House_and_Centre) is actually the organisation's largest project to date in Singapore. It took three years to construct and was finally completed in 1993. Other than the Shaw House, the Shaw Organisation also owns other commercial properties including the Shaw Plaza, [Shaw Centre](/wiki/Shaw_House_and_Centre), Shaw Corner, Oriental Plaza, Balestier Warehouse, North Bridge Road Shophouse and Mackenzie Road Shophouse. **Commercial Property****Type****Location****Description**Shaw PlazaShopping Mall360 [Balestier Road](/wiki/Balestier_Road), Singapore 329783A modern 5-storey shopping mall with a 2-storey annexe block. Last renovated in 2023.[Shaw House](/wiki/Shaw_House_and_Centre)Office Tower350 [Orchard Road](/wiki/Orchard_Road), Singapore 238868A 21-storey office building with a 6-storey retail/ entertainment complex.[Shaw Centre](/wiki/Shaw_House_and_Centre)Shopping Mall & Office Towers1 [Scotts Road](/wiki/Scotts_Road), Singapore 228208A 27-storey office building with a 5-storey retail and F&B mall.Shaw CornerIntermediate Apartment12 Boon Teck Road, Singapore 329586A 4-storey [commercial building](/wiki/Commercial_building).Oriental Plaza[Duplex](/wiki/Duplex_(building)) Apartment291 [New Bridge Road](/wiki/New_Bridge_Road), Singapore 088756A 4-storey commercial building.North Bridge Road ShophouseDuplex Apartment791/ 791A/ 791B [North Bridge Road](/wiki/North_Bridge_Road), SingaporeA 2-storey [shophouse](/wiki/Shophouse) with an atticBalestier WarehouseDuplex Apartment12A [Jalan Ampas](/wiki/Jalan_Ampas), Singapore 329526A 9-storey warehouse development.Mackenzie Road ShophouseDuplex Apartment13 Mackenzie Road, Singapore 228676A 4-storey shophouse. ### Residential projects Shaw Organisation also owns residential properties in Singapore. The two notable ones are Twin Heights and Hullet Rise. The others are single houses (With the exception of Jalan Sampurna which is a plot of land with two houses). **Residential Property****Type****Location****Description**Twin HeightsCondominium350 Balestier Road, Singapore 329779; 352 Balestier Road, Singapore 329780Two 21-storey freehold apartment blocks comprising 2 and 3-bedroom apartments and four penthouses.Hullet RiseApartment Block6 Hullet Rise, Singapore 229159A 16-storey apartment block comprising bedroom apartments.25 Jalan SampurnaSemi-detached House25 Jalan Sampurna, Singapore 2683032 houses on the same plot of land with symmetrical layouts.23 Fernhill RoadIntermediate Apartment23 Fernhill Road, Singapore 259075A 3-storey intermediate apartment with a car porch.45 Coronation Road WestDuplex Apartment(Duplex House) Singapore 2692612-storey detached duplex apartment with car porch and swimming pools.43 Coronation Road WestDuplex Apartment(Duplex House) Singapore 2662042-storey detached duplex apartment with car porch and swimming pools. ## Subsidiaries Shaw Organisation Pte Ltd owns the Shaw Properties Pte Ltd and Shaw Theatres Pte Ltd. Shaw Properties Pte Ltd oversees the operations in property development, acquisition and leasing whilst Shaw Theatres Pte Ltd oversees the operations in film purchase, distribution and the cinema's food and beverages. ## Charity ### Shaw Foundation The Shaw Foundation was set up in 1957 by the Shaw brothers and is currently one of the largest philanthropic organisations in the world. Most of the money comes from its revenue from the properties under Shaw Properties Pte Ltd. All earnings from the Shaw Centre since the late 70s have been given to charitable organisations. The largest amount that the Shaw Foundation has ever set aside was SGD 17.7 million in the year 1999. The largest share of the funding went to the National Kidney Foundation and most of its recipients were in the healthcare sector. In the educational sector, the Shaw Foundation has been a regular donor to the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS) since 1987, awarding around 240 scholarships to date. Dr. Vee Meng Shaw is currently the chairman of the Shaw Foundation. He is also the eldest son of [Run Run Shaw](/wiki/Run_Run_Shaw). #### National Kidney Foundation Singapore scandal The major recipient of Shaw Foundation's donations, the [National Kidney Foundation (NKF) of Singapore](/wiki/National_Kidney_Foundation_Singapore) was caught in a [scandal](/wiki/National_kidney_foundation_singapore_scandal) mainly involving the misuse of donation funds of NKF. The incident circled around then chief executive officer, [T.T Durai](/wiki/T.T_Durai) understating NKF's reserves and exaggerating the number of patients to encourage more donations, using the funds for personal reasons such as maintaining his personal car, travelling frequently on first class flights and an installation of a 'golden tap' in his private office suite. Durai dropped NKF's claims against the [Singapore Press Holdings](/wiki/Singapore_Press_Holdings) on 13 July 2005 after making several confessions during the trial and the entire board of NKF resigned on 14 July 2005. Since the incident, there has been a said irreversible effect on trust issues for donations to charitable organisations in Singapore, including Shaw Foundation. For NKF itself, donations plummeted from $73 million in 2004 to $21 million in 2013 – signifying the lasting impact of the incident. ## Incidents On 30 August 2020 at about 4.45pm, a piece of [ventilation duct](/wiki/Duct_(flow)) was dislodged on a cinema hall in the [nex](/wiki/Nex,_Singapore) outlet while screening *[Tenet](/wiki/Tenet)*, resulting in two injuries. A spokesperson informed that the outlet would be temporarily closed until further notice. The theatre later resumed operations on March 18, 2021. - [List of cinemas in Singapore](/wiki/List_of_cinemas_in_Singapore) - [Cathay Cineplexes](/wiki/Cathay_Organisation) - [Golden Village](/wiki/Golden_Village) - [WE Cinemas](/wiki/Eng_Wah_Global) - [Shaw Theatre](/wiki/Shaw_Theatre) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:53:15.995803",
  "title": "Shaw Organisation",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Shaw_Organisation"
}