{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:53:26.864498"
  },
  "content": "Former skyscraper in Singapore The **Shell House**, later known as the **Singapore Rubber House**, or simply **Rubber House**, was a skyscraper in [Collyer Quay](/wiki/Collyer_Quay), Singapore. It was officially opened in 1960 as the Singapore headquarters of [Shell plc](/wiki/Shell_plc). At the time of the building's completion, it was the fourth tallest building in Singapore, rising over 190 ft above ground level. ## Description The building had 15 storeys and rose over 190 ft above ground level, making it the fourth tallest building in Singapore at the time of its opening. The building also included a [theatrette](/wiki/Theatre_(structure)) in the basement which could accommodate 100 people. The building was air-conditioned, and had three letter lifts, 17 passenger lifts, four high speed lifts, a waste paper chute, and an automatic telephone exchange system. ## History Plans for the construction of the building were submitted to the local authorities in September 1954. By November, [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust), had not approved the construction of the building. Architectural firm [Swan and MacLaren](/wiki/Swan_and_MacLaren) were commissioned to design the building. The construction of the Shell House cost over $7 million and lasted four years, having begun at the end of 1955. The interior decor of the building was designed by English architect [Jane Drew](/wiki/Jane_Drew) on her third visit to Singapore. The building was officially opened at the end of March 1960, as the local headquarters of [Shell plc](/wiki/Shell_plc). Both the [flag of Singapore](/wiki/Flag_of_Singapore) and the flag of Shell were unfurled on top of the building on 29 March 1960. Plans to demolish the building to make way for a newer building were first announced in December 1973. The new building would be developed with another partner. In 1976, the building was sold to the Rubber Association of Singapore for $7.1 million. The building became the headquarters of the association and was renamed the Singapore Rubber House. In 1978, the eighth, ninth, and eleventh floors underwent a $2 million renovation. The Rubber Association of Singapore put the building up for sale for $20 million in December 1986. The building was purchased by Savu Investments Pte Ltd for $33.1 million in 1987, paying a $3.3 million deposit. Both the Singapore Rubber House and the Winchester House were demolished following the closure of [Change Alley](/wiki/Change_Alley,_Singapore) in 1989.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:53:26.864033",
  "title": "Shell House, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Shell_House,_Singapore"
}