{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:53:32.304529"
  },
  "content": "Building in Central Area, Singapore **Shenton House** is a building on [Shenton Way](/wiki/Shenton_Way) in the [Central Area](/wiki/Central_Area,_Singapore) of Singapore featuring a shopping podium underneath a 20-storey commercial tower. It was among the first buildings in Singapore to feature such a design. ## History The complex, which was to be developed by joint-venture firm Kian Seng Realty Limited, was one of several in the area which intended to address the \"perennial shortage of office space in the [central business district](/wiki/Central_Area,_Singapore).\" The 24-storey complex, which was scheduled to be completed by early 1973, was to feature a tower block resting on a shopping podium, thus providing the tower with a \"floating look.\" The third and fourth floors were to contain a carpark with a capacity for 200 vehicles while the top two floors were reserved for a restaurant and a private penthouse. The complex would be fully air-conditioned via a central water tank and was to feature four automated lifts which could travel 700ft per minute with a capacity for 20 people, as well as two pairs of escalators between the ground and first floors and the first and second floors. The complex was designed by Tay Joo Teck Chartered Architects while Lian Hup Contractors served as the main building contractor for the project. The piling ceremony for the building, which was estimated to cost $14 million to construct, was held in December 1969. The building was completed in 1975, with most of its units having been sold off by May. Its design has been described as \"modern gothic\". Features of the building include its \"textured\" façade of vertical and horizontal bands, with windows that are set back and structural elements that double as [sun-breakers](/wiki/Brise_soleil). The building's shopping podium was linked to those of the [UIC Building](/wiki/UIC_Building) and Robina House, forming a \"connected, continuous urban podium with a shopping bridge that embodied prevailing ideas of megastructural urbanism.\" The complex was one of several skyscrapers featuring shopping podiums to have been completed in this period, along with Robina House, the UIC Building, the Shing Kwan House and the [DBS Building](/wiki/OUE_Downtown), as part of the [Urban Renewal Department](/wiki/Urban_Redevelopment_Authority)'s attempt to convert [Shenton Way](/wiki/Shenton_Way) into \"Singapore's [Wall Street](/wiki/Wall_Street)\". In 1977, a $2 million fully air-conditioned pedestrian and shopping overhead bridge over Shenton Way was completed. The bridge, which was named the Golden Bridge and was occupied by 18 shops and a snack bar, linked the Shenton House and the UIC Building to the DBS Building and the Shing Kwang House. Before the completion of the [Sim Lim Tower](/wiki/Sim_Lim_Tower) on [Jalan Besar](/wiki/Jalan_Besar) in 1981, the head offices of Sim Lim Finance Limited were located within the complex. In 1981, several of the building's tenants proposed a facelift for the building. However, several other tenants were not in favour of the plan as they had yet to obtain [strata titles](/wiki/Strata_title). The complex was one of several in the area to have undergone major facelifts in 1985. In December 1988, Sim Lim sold off the carpark, its offices on the highest office floor of the complex and a shop unit on the third floor for $2.4 million. In 2007, The Robina House was demolished to make way for [One Shenton Way](/wiki/One_Shenton_Way) while the UIC Building was demolished to make way for [V on Shenton](/wiki/V_on_Shenton) in 2013. The Golden Bridge was demolished in 2016. In March 2012, the building was put up for collective sale with an indicative price of $530 million. In February 2023, the complex was again put up for collective sale with a reserve price of $590 million. However, after receiving no bids, the tender closed on 11 April. The building was again put up for en block sale in October with a reserve price of $538 million instead. It was sold to Shenton 101 Pte Ltd. The complex has been placed on [Docomomo Singapore](/wiki/Docomomo_International)'s \"Modernist 100\" list of \"significant modernist buildings in Singapore.\" 1°16′43″N 103°51′00″E﻿ / ﻿1.2787°N 103.8501°E﻿ / 1.2787; 103.8501\n",
  "language": "en",
  "processed_at": "2026-01-12T11:53:32.304235",
  "title": "Shenton House, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Shenton_House,_Singapore"
}