{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:53:30.014686"
  },
  "content": "Chain of supermarkets in Singapore **Sheng Siong Group Ltd**. ([Chinese](/wiki/Simplified_Chinese_Characters): 昇菘集团 Shēng Sōng Jítuán) is the parent company of **Sheng Siong Supermarket Pte Ltd**, commonly known as **Sheng Siong**, the third largest chain of [supermarkets](/wiki/Supermarket) in [Singapore](/wiki/Singapore). The supermarket chain also airs its own television variety programmes named \"The Sheng Siong Show\". ## History Sheng Siong is a chain of supermarkets in Singapore founded by Mr Lim Hock Chee and his two brothers, Mr Lim Hock Eng and Mr Lim Hock Leng. Mr Lim Hock Chee is also the current [CEO](/wiki/Chief_Executive_Officer) of Sheng Siong. The Lim family moved to another [farm](/wiki/Farm) in [Punggol](/wiki/Punggol) in the 1970s. Years later, the farm experienced an excess supply of [pigs](/wiki/Pigs), thus Lim Hock Chee and his wife rented a small section within a Savewell provision store in [Ang Mo Kio](/wiki/Ang_Mo_Kio) to sell the chilled [pork](/wiki/Pork) from their pig farm in 1984. In 1985, following the move to phase out pig farming by the Singapore Government, the Lim brothers ventured into the retail business by launching Sheng Siong's foremost operation in a single [shophouse](/wiki/Shophouse) unit, (in the same Savewell store premises in which Lim Hock Chee was selling pork, after the Savewell chain faced financial trouble and had to let go of its stores) together with an ex-Savewell managerial staff. Sheng Siong has since evolved into a chain of 37 stores, mainly [supermarkets](/wiki/Supermarket), in Singapore. The store initially focused on providing a wide range of no-frills products and increased sales by accepting lower profit margins. Other cost-saving measures included employing less staff and avoiding the use of in-house plastic bags. Sheng Siong has been awarded top 500 retail enterprises in 2007 and became the third-largest retailer in Singapore. The company has also been awarded as [Superbrands Singapore](/wiki/Superbrands) from 2008 to 2014. Sheng Siong Group Ltd. is publicly listed at the [SGX](/wiki/Singapore_Exchange) (code: OV8) since 17 August 2011. As of July 2014, the Lim brothers have a net worth of $545 million and are ranked 45th on the Forbes Singapore's 50 Richest list. In October 2013, Sheng Siong received the Solar Pioneer Award for its efforts to become a more environmentally-friendly business. ## Publicity The supermarket chain has also launched its own television variety programmes named \"The Sheng Siong Show\" on [Channel 8](/wiki/Channel_8_(Singapore)) (first premiered on 13 May 2007) and \"Sheng Siong Live!\" on [Suria](/wiki/Suria_(TV_channel)) (since 2009) broadcast in Singapore, usually on weekends during prime time. \"The Sheng Siong Show\" is hosted by [Dasmond Koh](/wiki/Dasmond_Koh) and [Kym Ng](/wiki/Kym_Ng), and both shows aims to generate publicity and sales promotion for Sheng Siong. The show first premiered on 13 May 2007 and ongoing for its 14th year with 28 seasons airing since. During the show's run, over $15 million was awarded through various game segments, such as in-studio games, karaoke competitions, outdoor cooking (hosted by a correspondent[a] with one shopper winning $888), [phone-in](/wiki/Phone-in) hundredfold (contestants have a chance to win 50, 60, 80 or 100 times of the receipt's purchase) and the weekly thousandfold cash reward (300, 400, 500 or 1,000 times the purchase).[b] On an episode aired 12 January 2019, the show recorded the programme's largest winning in the show history after a shopper won $193,400 during the thousandfold cash reward segment,[*unreliable source?*] and was the third known largest winner in any Singaporean game show's history,[*citation needed*] behind the contestants from the game shows *[Don't Forget The Lyrics](/wiki/Don%27t_Forget_the_Lyrics!_(Singaporean_game_show))* and *[Who Wants to Be a Millionaire?](/wiki/Who_Wants_to_Be_a_Millionaire%3F)*, who respectively won $200,000 and $250,000. ## Philanthropy In 2012, Sheng Siong received the Merit Award from the [People's Association](/wiki/People%27s_Association) Community Spirits Award in recognition of its committed efforts in reaching out and contributing to the community. From 2009 to 2014, Sheng Siong was a benefactor for [Singapore Red Cross Society](/wiki/Singapore_Red_Cross_Society)'s Project R.I.C.E which reaches out to underprivileged families by gifting them with rice during Chinese New Year. The public could buy rice vouchers at a reduced price at any Sheng Siong outlet to support this initiative. Sheng Siong raised the most rice at 111,813 kg in 2013. On the episode of *The Sheng Siong Show* that aired 28 December 2019, Sheng Siong donated $121,700 to the SPD organization during the *Thousandfold Cash Reward* game segment after a contestant withdrew from participation prior to the live episode. Sheng Siong became a supporter for SPD since 2012. ## Milestones and awards Some of Sheng Siong's milestones are listed below: 1985First Sheng Siong outlet was launched in Ang Mo Kio 1988A second outlet was opened in Bedok 1995Expanded to a third outlet at Woodlands – the first supermarket to offer both \"wet and dry\" shopping options 2003Three-in-one wet/dry market, supermarket and food court opened at Tekka Mall (now known as [The Verge](/wiki/The_Verge_(shopping_mall)))2007 - Launched the \"Sheng Siong Show\" on Mediacorp Channel 8 & Toggle Live. - Third-largest retailer in Singapore based on annual sales revenue from 2007 to 2013, according to the Retail Asia-Pacific Top 500 survey by Euromonitor International. 2011 - Sheng Siong's new Headquarters cum Distribution Centre officially opened at Mandai Link. - Sheng Siong Group Limited was listed on the Mainboard of the Singapore Exchange. Selected awards achieved: 2008Achieved the \"Superbrands\" status award from 2008 to 2014.2011Received the \"Most Transparent Company Award under the New Issues Category at the Securities Investors Association Singapore (SIAS) Investors’ 12th Choice Awards.2012 - Received the \"Most Transparent Company Award\" under the Retail and Household Goods category at the SIAS 13th Investors’ Choice Awards. - Merit Award from the People's Association Community Spirit Awards. - Awarded \"Best of the Best\" Retailer in Singapore for the Retail Asia Top 500 Awards from 2012 to 2013. 2013 - Achieved the Solar Pioneer Award for the largest single solar panel installation in Singapore at their Mandai Distribution Centre. - Runner-up for the \"Most Transparent Company Award\" under the Retail and Household Goods category at the SIAS 14th Investors’ Choice Awards. 2014Winner of the Singapore Productivity Award - [List of supermarket chains in Singapore](/wiki/List_of_supermarket_chains_in_Singapore) Portals: - Supermarkets - Companies ## Notes - Official online store - Corporate website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:53:30.014324",
  "title": "Sheng Siong",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sheng_Siong"
}