{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:53:34.624022"
  },
  "content": "Road in Central Area, Singapore **Shenton Way** is a major trunk [road](/wiki/Road) serving [Singapore](/wiki/Singapore)'s [Central Area](/wiki/Central_Area,_Singapore) and is most commonly known for the commercial [skyscrapers](/wiki/Skyscraper) flanking both sides of the road. The road is a one-way street that starts at the junction of [Boon Tat Street](/wiki/Boon_Tat_Street), Raffles Quay and Commerce Street before ending at Keppel Road. ## History ### Planning and construction In January 1948, the British colonial government announced a development scheme in the Telok Ayer reclamation area, consisting of the development of 250,000 square feet (23,000 m2) of state land and the extension of Raffles Quay from Boon Tat Street to Prince Edward Road. The construction of the Raffles Quay extension was also recommended to the government in a special committee's report in September 1948, to improve connectivity between the central area and [the harbour](/wiki/Port_of_Singapore) and to allow for the development of reclaimed land between Tanjong Pagar and Finalyson Green. Work on the extension's first phase between Raffles Quay and Prince Edward Road had commenced by December 1950, while construction of the second phase linking Prince Edward Road to Singapore Harbour was expected to commence in 1951. The first section of the road was opened to traffic in August 1951 by the then-Governor of Singapore Franklin Gibson. Consisting of two 27 feet (8.2 m) carriageways, the road was named \"Shenton Way\" after [Shenton Thomas](/wiki/Shenton_Thomas), to show appreciation for his service to Singapore during his tenure as Governor. Plans for the second phase of construction, connecting the initial section with the harbour, were submitted for approval in July 1951, and it was completed in 1952. ### Initial development plans In February 1952, the colonial government initiated a development scheme in the area, offering 17 plots of land along Shenton Way and Robinson Road for sale on 99-year leases. These plots were leased out on the condition that ten-storey buildings with a uniform exterior design and finish, and conforming to government regulations on their construction and use, were built on them within a four-year window. The plots were auctioned off to developers in March 1952 at over $3,900,000, in what the *Straits Times* described as a \"record auction\". Nevertheless, problems soon arose with the scheme, as several developers were unable to have their building plans approved since the minimum building cost of $1,000,000 set by the lease conditions exceeded the $50,000 limit under the Control of Building Ordinance. Development resumed after the government announced the loosening of most restrictions set by the ordinance, but hit another snag when developers were unable to find solid rock for foundations. A diamond-headed drill from Britain and a specialist from Australia was brought in by a developer to assist in the process, finding solid rock and underground water under the site. The depth of the rock, along with the underground water, necessitated the use of more expensive precast piles, driving up building cost. By September 1953, only two developers had started construction, while several others were contemplating abandoning development, owing to the onset of a recession, and high construction costs. Subsequently, in June 1954, the government took back 11 of the auctioned plots from the developers, as the developers had not commenced construction within the stipulated two-year period. New development plans for the area were announced by the government in January 1956, comprising the construction of the [Singapore Polytechnic](/wiki/Singapore_Polytechnic) and of government offices. Work on the polytechnic commenced on in August 1956, and it started classes in November 1958, but the government office project was cancelled by the government in April 1958, due to a trade recession. In addition, the Trade Union House, the [National Trades Union Congress](/wiki/National_Trades_Union_Congress)'s headquarters, was built along Shenton Way from 1962 to 1965. ### Subsequent development By 1963, much of the land in Singapore's central business district, between Raffles Place, High Street, and North Bridge Road, had been developed, and according to *The Straits Times*, property developers had asked the Singapore government about development of the Shenton Way area. In response, in October 1963, the government announced plans to allow private interests to develop a site along Shenton Way, beside the [Trade Union House](/wiki/Singapore_Conference_Hall), for \"administrative uses\". The site, subdivided into four plots, was let out on 99-year leases in 1964. Since the 1950s, Shenton Way has become known as Singapore's [Wall Street](/wiki/Wall_Street), especially after commercial developments and government offices were built there from the 1970s onwards and continues to be a prime commercial address on par with that of [Raffles Place](/wiki/Raffles_Place) today. ## Public transport ### Buses The [Shenton Way Bus Terminal](/wiki/Shenton_Way_Bus_Terminal) is located at 31 Shenton Way. ### Mass Rapid Transit (MRT) The road is directly served by its namesake [Shenton Way station](/wiki/Shenton_Way_MRT_station) on the [Thomson–East Coast line](/wiki/Thomson%E2%80%93East_Coast_Line) (TEL), located on Park Street next to the [Asia Square](/wiki/Asia_Square) building. Other stations within the vicinity include [Downtown station](/wiki/Downtown_MRT_station) on the [Downtown line](/wiki/Downtown_Line) (DTL) and the upcoming [Prince Edward Road station](/wiki/Prince_Edward_Road_MRT_station) on the [Circle line](/wiki/Circle_Line_(Singapore)) (CCL), located at the end of the road towards Keppel. ## Buildings along Shenton Way - [One Shenton Way](/wiki/One_Shenton_Way) - [AXA Tower](/wiki/AXA_Tower) (also known as [8 Shenton Way](/wiki/8_Shenton_Way)) - [SGX Centre](/wiki/SGX_Centre) - [OUE Downtown](/wiki/OUE_Downtown) (formerly DBS Building) - [Singapore Conference Hall](/wiki/Singapore_Conference_Hall) - MAS Building - [Shenton House](/wiki/Shenton_House,_Singapore) - Eon Shenton - 76 Shenton Way - 78 Shenton Way - [V on Shenton](/wiki/V_on_Shenton) (formerly [UIC Building](/wiki/UIC_Building)) - Hock Teck See, which was built in 1844 - [Shenton Way Bus Terminal](/wiki/Shenton_Way_Bus_Terminal) ### Bibliography - Peter K G Dunlop (2000) *Street Names of Singapore* Who's Who Publishing [ISBN](/wiki/ISBN_(identifier)) 981-4062-11-1 - Savage, Victor R.; S. A. Yeoh, Brenda (10 January 2022). *Singapore Street Names: A Study of Toponymics*. Singapore: Marshall Cavendish Singapore. [ISBN](/wiki/ISBN_(identifier)) 978-9814928809. Retrieved 26 January 2022.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:53:34.623672",
  "title": "Shenton Way",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Shenton_Way"
}