{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:53:37.933463"
  },
  "content": "Chinese-language newspaper in Singapore ***Shin Min Daily News*** ([Chinese](/wiki/Simplified_Chinese_characters): 新明日报; [pinyin](/wiki/Pinyin): *Xīnmíng Rìbào*; lit. 'New [Ming Pao](/wiki/Ming_Pao) Daily') is a [Singapore](/wiki/Singapore) [Chinese-language](/wiki/Chinese-language) afternoon newspaper published by [SPH Media](/wiki/SPH_Media). It was founded on 18 March 1967, by Singapore businessman and [Axe Brand Universal Oil](/wiki/Axe_Brand_Universal_Oil) founder Leung Yun Chee or Liang Ruzhi (梁潤之) together with [Hong Kong](/wiki/Hong_Kong) writer [Louis Cha or Jin Yong](/wiki/Louis_Cha). *Shin Min* is a [tabloid](/wiki/Tabloid_journalism)-style paper focused on entertainment and local news with sensationalized headlines, although it is printed on [broadsheets](/wiki/Broadsheet). Its main competitor was *[Lianhe Wanbao](/wiki/Lianhe_Wanbao)*, which was also published by the SPH; *Lianhe Wanbao* ceased publication on 24 December 2021 and merged into *Shin Min*. ## History Cha co-founded Hongkong daily newspaper *[Ming Pao](/wiki/Ming_Pao)* *(*明报) in 1959, serving as president and editor-in-chief, after the success of his first novel *The Book and the Sword* which gave him the financial wherewithal to do other things besides fiction-writing. *Ming Pao* was established to tackle pirated copies of Cha's novels, but later became a vessel for Cha to express his anti-Communist stance, which eventually attracted the fury of pro-Communist left-wing elements who wanted to assassinate him. In 1966, he took refuge in Singapore and became a permanent resident. He decided to start *Shin Min* together with Leung who had experience in starting publishing firms like *Xin Sheng Ri Bao* (新生日报) and the requisite start-up capital from owning Leung Kai Fook Medical, manufacturer of Axe Brand Universal Oil. Cha and Leung contributed equally and started the paper with S$1 million, a princely sum at the time.**** During a trip to look for [Lee Khoon Choy](/wiki/Lee_Khoon_Choy), then [Minister of State for Culture](/wiki/Ministry_of_Culture,_Community_and_Youth), to get his approval for the licensing, Leung also asked for Lee's opinion on the newspaper's name. While Lee was thinking, one of the officers, Lu Fu Ru (陆富如), suggested to use *Shin Min Daily News*. \"Shin\" represented Leung's *Xin Sheng Ri Bao*, while \"Min\" represented Cha's *Ming Pao*. Lee agreed to the suggestion and approved the publishing license for *Shin Min*. The two existing publications back then, *Nan Yang Business Daily* (南洋商报) and [*Sin Chew Jit Poh* (星洲日报)](/wiki/Sin_Chew_Jit_Poh_(Singapore)), focused heavily on international news, and there was little entertainment beat. Instead, *Shin Min's* layout was made to be more eye-catching with lighthearted content. Unlike other publishers, there was a full page of entertainment beat on *Shin Min*, with a Malaysian edition on weekends. What popularised *Shin Min* was also having local news on its front page. Cha also exclusively published his serialised [wuxia](/wiki/Wuxia) novel, *The Smiling Proud Wanderer* in *Shin Min*. He later published *The Deer and the Cauldron* too, which boosted the readership and made *Shin Min* one of the most popular local newspapers. *Shin Min* started earning profits in its third year, two years earlier than expected. In the early 1980s, Cha sold his shares in the paper after the Singapore government ruled that foreigners could only hold up to 3% of shares in locally based papers. *Shin Min* was also published in Malaysia until 1994, and it was the first Chinese language newspaper to be published in tabloid. - https://www.shinmin.sg/ - Shin Min Blog - Omy Shin Min News Source - Shin Min Daily News Facebook - [List of newspapers in Singapore](/wiki/List_of_newspapers_in_Singapore) - [List of newspapers](/wiki/List_of_newspapers)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:53:37.933143",
  "title": "Shin Min Daily News",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Shin_Min_Daily_News"
}