{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:53:46.055966"
  },
  "content": "2015 shooting at a checkpoint in Singapore On 31 May 2015, **Mohamed Taufik Zahar** was shot by the police manning a high security checkpoint located near the [Shangri-La Hotel](/wiki/Shangri-La_Hotel_Singapore) in [Singapore](/wiki/Singapore) where the [Shangri-La Dialogue](/wiki/Shangri-La_Dialogue) was being held. Taufik was driving a car when he accelerated towards police officers at a roadblock. Taufik died after being shot and his two passengers were subsequently convicted of drug offences. ## Incident Just after midnight on 31 May 2015, Mohamed Taufik Zahar, a 34-year-old logistics mover, drove a red [Subaru Impreza](/wiki/Subaru_Impreza) his wife had rented, without a valid driving license, after having an argument with his wife Nassida Nasir. He went to pick up two persons, Mohamed Ismail, and Muhammad Syahid Mohamed Yasin. With Mohamed Ismail and Syahid having consumed drugs earlier, and Taufik and Mohamed Ismail having open arrests for past offences, they agreed on Taufik's suggestion to flee if they encountered a police road block. The three decided to look for prostitutes in Geylang, but decided to go to [Orchard Towers](/wiki/Orchard_Towers) after not able to find what they were looking for. At about 4:17 am, while on the way to Orchard Towers, Taufik missed a turn and encountered a security checkpoint that was set up along Ardmore Park. The security checkpoint was part of the security perimeter established since 2004 for the annual [Shangri-La Dialogue](/wiki/Shangri-La_Dialogue) that is hosted at the nearby [Shangri-La Hotel](/wiki/Shangri-La_Hotel_Singapore). Police staff sergeant Wang Zhenxiong and a colleague stopped Taufik's vehicle at the vehicle check station within the checkpoint. Before they could make their intentions known, Syahid was agitated and shouted to Taufik to drive off. Ignoring multiple knocks on the car and shouts by various police officers signalling him to stop, Taufik sped through the checkpoint, crashing through concrete barriers, and was approaching the final line of concrete barriers at Anderson Road where two Gurkha police officers were stationed. Having given multiple verbal warnings to stop, the Gurkha officers responded in accordance to their training and shot at Taufik to stop the vehicle. The first four bullets did not stop the vehicle, with the fifth bullet causing an injury to Taufik's head and an almost instantaneous death, causing the vehicle to slow to a crawl. Mohamed Ismail and Syahid fled on foot but were subsequently arrested at the hotel and the nearby Shangri-La Apartments. Drugs were found on Mohamed Ismail and in the rear passenger seat area. It was revealed that prior to the shooting, Mohamed Taufik was wanted by the police for having failed to turn up in court for a criminal intimidation offence. He had also spent time in prison previously for an unknown offence. ## Aftermath After the incident, the two passengers, Mohamed Ismail and Muhammad Syahid Mohamed Yasin, were convicted of [drug offences](/wiki/Drug-related_crime) and sentenced to 8 and 7 years' [jail](/wiki/Jail), respectively, and 3 strokes of [the cane](/wiki/Caning_in_Singapore) each. Taufik was survived by his wife Nassida Nasir and a daughter. ### Reactions This was the fourth police shooting in Singapore in 15 years. Taufik's wife, Nassida Nasir, opined that death was a disproportionate punishment for Taufik, but the public was generally supportive of the actions of the police. Retired and former police officers commented that typical police roadblocks would radio ahead to other police officers stationed to chase after road block runners. However, they acknowledged the heightened state of security would have resulted in the police opening fire at Taufik. The [Singapore government](/wiki/Government_of_Singapore) has also defended and commended the actions of the police officers. ### Coroner's inquiry Hearings for a coroner's inquiry into the death of Taufik were held from January 2016 to March 2016. Testimonies from the police were heard, with the Gurkha officer who shot the fatal bullet re-enacting his actions in January. Syahid would testify as well in March 2016. State Counsel Kwek Mean Luck contended that the police did not have the time or opportunity to find out why Taufik crashed through the barriers and if they were threats to the security summit. Taufik's blood was found to contain quantities of controlled drugs, Erimin-5 and amphetamine, and 30 times above the prescription limit of methamphetamine. The bullet entering Taufik's head fragmented upon impact and caused a severe brain injury. On 22 April 2016, it was ruled that Taufik's death was a \"lawful killing\". The state coroner, Marvin Bay, stated that the officers used their weapons as a last resort and had \"reasonable grounds to assume hostile intent and that the car was carrying a vehicle-borne explosive device\".\n",
  "language": "en",
  "processed_at": "2026-01-12T11:53:46.055592",
  "title": "Shooting of Mohamed Taufik Zahar",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Shooting_of_Mohamed_Taufik_Zahar"
}