{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:53:48.042938"
  },
  "content": "Singaporean e-commerce company **Shopee Pte. Ltd.**, trading as **Shopee**, is a Singaporean [multinational](/wiki/Multinational_corporation) [technology company](/wiki/Technology_company) that specialises in e-commerce and operates mainly in Southeast Asia. As of 2023, Shopee is recognized as the largest e-commerce platform in [Southeast Asia](/wiki/Southeast_Asia), with a total gross merchandise volume (GMV) of $47.9 billion. This figure represents nearly half of the total GMV of Southeast Asian market. The platform also facilitates online buying and selling for consumers and sellers in [East Asia](/wiki/East_Asia) and [Latin America](/wiki/Latin_America). ## History Shopee was established in [Singapore](/wiki/Singapore) in February 2015 as a mobile-focused marketplace that enables users to browse, shop, and sell products. The platform integrates logistical and payment support to facilitate transactions and is designed to operate with minimal physical assets. To enhance its competitive stance against other e-commerce companies, Shopee also launched a website. A notable feature of Shopee is its escrow service, *Shopee Guarantee*, which withholds payments from sellers until the buyers confirm receipt of their orders, thus securing transactions. In 2016, the company launched its seller education platform called *Shopee University*, which aims to help train local entrepreneurs and businesses in setting up their online businesses. In 2017, Shopee launched *Shopee Mall* with 200 brands in Singapore and the Philippines. On 3 September 2019, Shopee officially opened its six-story regional headquarters at [Singapore Science Park](/wiki/Singapore_Science_Park). The new building spans 244,000 square feet (22,700 m2) of space, which can accommodate 3,000 employees and is six times larger than Shopee's previous headquarters at Ascent Building. The building was leased by [WeWork](/wiki/WeWork) before it was relinquished to Shopee. Shopee has yet to turn profitable despite increasing its gross profit margin year-on-year in the first half of 2022 which is attributed to faster growth in transaction-based fees and advertising income. Coupled with rising inflation and interest rates as well as setbacks in its internationalisation plans, Shopee laid off staff across multiple markets in June 2022, including employees from [Indonesia](/wiki/Indonesia), [Thailand](/wiki/Thailand), and [Vietnam](/wiki/Vietnam). *ShopeePay* and *ShopeeFood* were also reported to be facing cuts. On 15 September 2022, Sea's CEO, [Forrest Li](/wiki/Forrest_Li), issued a memo to all employees detailing cost-cutting measures aimed at achieving \"self-sufficiency\" for the company. These measures involved restrictions on business expenses and a temporary suspension of compensation for Shopee's top executives. Another round of job cuts was also announced, which affected employees in Singapore, Indonesia, and China. In the fourth quarter of 2022, Shopee achieved a positive adjusted [EBITDA](/wiki/Earnings_before_interest,_taxes,_depreciation_and_amortization) for the first time, amounting to $196.1 million, indicating improvements in revenue and operating costs. ## Business model Shopee started as a [consumer-to-consumer](/wiki/Consumer-to-consumer) (C2C) [marketplace](/wiki/Marketplace) but it pivoted into a C2C and [business-to-consumer](/wiki/Business-to-consumer) (B2C) hybrid model. The company partners with over 70 courier service providers across markets it serves to provide logistical support for users. In [Singapore](/wiki/Singapore), Shopee collaborates with logistics startup [Ninja Van](/wiki/Ninja_Van) for item pickup and delivery. Other delivery partners in the region include [Pos Malaysia](/wiki/Pos_Malaysia) and [Pos Indonesia](/wiki/Pos_Indonesia). Shopee also partnered with [Delhivery](/wiki/Delhivery) and Ecom Express for deliveries in India before it exited the domestic market. In its early phases of growth, Shopee offered subsidies and free shipping to its users although delivery services were still expensive in the areas it serves. Shopee had also received extreme international attention in 2019 after signing [Portuguese](/wiki/Portugal_national_football_team) [football](/wiki/Association_football) superstar [Cristiano Ronaldo](/wiki/Cristiano_Ronaldo) to be the ambassador for the company. That same year, Shopee's 9.9 Super Shopping Day campaign featured a video of Ronaldo dancing to \"[Baby Shark](/wiki/Baby_Shark)\" in an advert for the company. The video went [viral](/wiki/Viral_video) and became a [meme](/wiki/Meme) in the football community, reaching 19 million people. The campaign resulted in a doubling of Shopee's gross orders and a more than tripling of its e-commerce sales. ## Market share In Q4 2017, Shopee became the third most visited e-commerce portal in [Malaysia](/wiki/Malaysia), overtaking Lelong, and became the top app on iOS and Google Play app stores. A December 2017 survey revealed that Shopee was the top shopping platform for Indonesian mothers, with 73% preferring it over other platforms. Despite Shopee's reported GMV growth, these claims faced criticism. Lazada's former CEO, Max Bittner, asserted that GMV numbers could be inflated through subsidy schemes and that GMV tends to decline once such subsidies are removed. Shopee was recognized as top shopping app in Q2 2019 based on monthly active users, total downloads, and website visits, as per a report by iPrice. During this period, gross orders grew by 92.7% to 246.3 million, compared to 127.8 million in the previous year, and the gross merchandise value (GMV) surged by 72.7% to US$3.8 billion from US$2.2 billion. Shopee expanded its operations to Brazil in 2019, marking its first venture into Latin America. By 2023, Shopee reported engaging with over three million local merchants in Brazil, who contributed to more than 90% of its national sales. In September 2021, Shopee introduced its marketplace in Poland, followed by launches in Spain and France. However, by early 2022, Shopee exited the European markets of France and Spain, retaining only its operations in Poland. In 2020, Shopee started operations in South Korea to help local merchants reach customers in its existing markets, although it did not establish a consumer-facing platform in [South Korea](/wiki/South_Korea). The following year, the company extended its reach within [Latin America](/wiki/Latin_America) by commencing operations in [Mexico](/wiki/Mexico), [Chile](/wiki/Chile), and [Colombia](/wiki/Colombia). In November 2021, Shopee entered the Indian market with a soft launch, achieving over one million app installations on the [Google Play Store](/wiki/Google_Play_Store) and handling 100,000 orders a day. However, Shopee ceased its operations in India in March 2022, just five months after the launch. As of 2022, Shopee's app recorded 203 million downloads globally. For Q2 of that year, Shopee recorded US$1.7 billion in quarterly revenue. In September 2022, Shopee ended its local operations in Chile, Colombia, and Mexico, shifting to a cross-border model, and exited Argentina entirely. However, Shopee re-entered Argentina in October 2025, operating a cross-border model to support regional growth, a move reinforced by Argentine media in November 2025. In January 2023, the company announced the closure of its Polish operations. By Q2 2023, Shopee remained the largest online marketplace in Southeast Asia, with a traffic share ranging from 30% to 50% across the region, and also ranked as the leading online shopping platform in Taiwan. In the fourth quarter of 2023, Shopee reported a 46% year-on-year increase in gross orders, reaching 2.5 billion. The gross merchandise value (GMV) for the quarter also rose by 28.6% to US $23.1 billion. ## Controversies ### Meet-and-greet with Blackpink In June 2019, #ShopeeScam trended on Twitter after Shopee released a promotion in the Philippines that offered passes to a meet-and-greet with [Blackpink](/wiki/Blackpink) for the top 568 spenders in their online store. Several fans reported receiving notifications that they had won tickets, but which were unilaterally retracted afterward by Shopee.[*citation needed*] Others posted screenshots that showed Shopee changing their contest mechanics the day before the event. Shopee was investigated by the [Department of Trade and Industry](/wiki/Department_of_Trade_and_Industry_(Philippines)) for the incident.[*needs update*] ### Underpaid couriers in Indonesia In April 2021, Shopee faced allegations that it was underpaying its couriers in Indonesia after some riders claimed publicly that their pay per delivered package was reduced by the company to US$0.10 per package, down from US$0.34 in the previous year. Couriers that serve Shopee Express deliveries were also not paid basic monthly salaries, though there is a US$7.90 bonus if they can deliver 40 or more packages in a single workday. There is also no compensation for fuel or parking fees. Shopee responded to the allegations that it has a fair incentive scheme that is in line with Indonesia's market and regulations, and what they offer is \"highly competitive\" within the industry. ### Rescinded job offers In late August 2022, a user of the Chinese social networking platform Maimai uploaded a post stating that he had relocated as part of a job offer from Shopee to work at the company's headquarters in Singapore. However, the offer was revoked after he disembarked from the plane in Singapore with his family. Multiple job offers were allegedly affected, as other users claimed they had similarly resigned from current positions and terminated housing contracts to join Shopee, only for their offers to be rescinded. ### Toni Gonzaga endorsement On September 28, 2022, Shopee Philippines received backlash when rumors started spreading that the platform would introduce [Toni Gonzaga](/wiki/Toni_Gonzaga) as its brand ambassador a day after the company's reported massive layoff. This was confirmed the following day at a press conference. While various reasons were pointed for the backlash from the ethical issues with getting a highly-paid endorser to the endorsers' political activities, Gonzaga only appeared on the company's platform for a total of ten days before introducing another endorser for their 11.11 campaign, businessman and singer [Jose Mari Chan](/wiki/Jose_Mari_Chan). ### Scams and company response In 2023, scammers pretending to be Shopee employees caused over S$750,000 in losses through an online job scam. Shopee and the Singapore Police Force (SPF) issues a joint announcement to alert the public. In April 2024, Singapore's Inter-Ministry Committee on Scams gave Shopee a favorable rating for its anti-scam measures, including user verification, transaction security and loss remediation. Also in 2024, Shopee customers lost $399,000 after paying scammers outside the app, based on 179 scam cases reported to police.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:53:48.042501",
  "title": "Shopee",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Shopee"
}