{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:49:37.509671"
  },
  "content": "Singaporean aircraft maintenance company**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **may need to be rewritten** to comply with Wikipedia's quality standards. Relevant discussion may be found on the talk page. You can help. The talk page may contain suggestions. *(October 2023)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(October 2023)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **SIA Engineering Company Limited** (commonly abbreviated as **SIAEC**) ([SGX](/wiki/Singapore_Exchange): S59 ) is a Singaporean company specializing in [aircraft](/wiki/Aircraft) maintenance, repair, and overhaul ([MRO](/wiki/Aircraft_maintenance)) services in the Asia-Pacific. It is a wholly owned subsidiary of the [Singapore Airlines Group](/wiki/Singapore_Airlines) (SIA), formed in 1992 by separating SIA's engineering division. The company has a client base of over 80 international carriers and aerospace equipment manufacturers. It provides line maintenance services at 35 airports in 8 different countries for more than 50 international carriers and airframe and component overhauls on some of the most widely used aircraft in service. It is the first [MRO](/wiki/Maintenance,_Repair_and_Overhaul) provider in the world to maintain the super-jumbo [Airbus A380](/wiki/Airbus_A380). ## Joint ventures SIA Engineering is involved in twenty-five joint ventures and subsidiaries with original equipment manufacturers and airlines in [Singapore](/wiki/Singapore), [Hong Kong](/wiki/Hong_Kong), [Indonesia](/wiki/Indonesia), [Japan](/wiki/Japan), [the Philippines](/wiki/Philippines), [the United States](/wiki/United_States_of_America), [Vietnam](/wiki/Vietnam), and [Thailand](/wiki/Thailand). ### Engine & engine component repair & overhaul joint venture **Asian Surface Technologies** (AST) is a 29/51/20 joint venture between SIA Engineering Company (SIAEC), [PAS Technologies](/wiki/StandardAero), and [United Technologies International Corporation (UTC)](/wiki/Pratt_%26_Whitney). AST's core focus is the repair and overhaul of [PW4000](/wiki/Pratt_%26_Whitney_PW4000) engines, as well as plasma-coating facilities for aerospace. **Component Aerospace Singapore Pte Ltd** (CAS) is a 46/54 joint venture between SIA Engineering Company (SIAEC) and Pratt & Whitney (P&W). CAS' core focus is the overhaul, repair, and modification of aircraft jet turbine engine components such as combustor, fuel nozzles, tube repair, and ducting, for various engines, namely: PW4000, [PW2000](/wiki/Pratt_%26_Whitney_PW2000), [V2500](/wiki/IAE_V2500), and [CFM56](/wiki/CFM_International_CFM56). **Eagle Service ASIA Pte Ltd** (ESA) is a 49/51 joint venture between SIA Engineering Company (SIAEC) and Pratt & Whitney (P&W). ESA is a P&W engine center specialising in the overhaul repair of the PW4000 and [GE90](/wiki/General_Electric_GE90) engines. The facility was modernised in 2019, to handle simultaneous overhaul of newer engines, namely: [PW1000G GTF](/wiki/Pratt_%26_Whitney_PW1000G) and [GP7200](/wiki/Engine_Alliance_GP7200). **Singapore Aero Engine Service Pte Ltd** (SAESL) is a 50/50 joint venture between SIA Engineering Company (SIAEC) and [Rolls-Royce (RR)](/wiki/Rolls-Royce_Holdings). Formed in 2001, SAESL is a Trent Centre of Excellence, with its core business being the maintenance, repair and overhaul (MRO) support operation of the full range of [Trent](/wiki/Rolls-Royce_Trent) engines as well as [RB211](/wiki/Rolls-Royce_RB211) engines. SAESL is the world's largest Trent engine MRO facility. **Turbine Coating Services Pte Ltd** (TCS) is a 24.5/51/24.5 joint venture between SIA Engineering Company (SIAEC), Pratt & Whitney (P&W) and [Singapore Technologies Aerospace (STA)](/wiki/ST_Aerospace). TCS' core business is the repair of PW4000 high pressure turbine blades using advanced coating technologies. ### Component repair & overhaul, manufacturing and engineering services joint venture **Additive Flight Solutions Pte Ltd** (AFS) is a 60/40 joint venture between SIA Engineering Company (SIAEC) and [Stratasys](/wiki/Stratasys). AFS specializes in [additive manufacturing](/wiki/Additive_manufacturing) of aerospace components and parts, by utilizing Stratasys expertise in additive manufacturing and SIAEC know-how in aircraft maintenance, repair, and overhaul (MRO) operations. **Aerospace Component Engineering Services Pte Ltd** (ACE Services) is a 51/49 joint venture between SIA Engineering Company (SIAEC) and [Parker Hannifin Corporation](/wiki/Parker_Hannifin). ACE Service's core focus is in the repair, overhaul test, and recertification of aircraft hydro-mechanical components, such as the 5000 psi hydraulic system of the [Boeing 787](/wiki/Boeing_787) and [Airbus A350](/wiki/Airbus_A350). As it is Parker's Aerospace Centre of Excellence in [APAC](/wiki/Asia_Pacific), it is capable of handling repair and overhaul of other [OEM](/wiki/Original_Equipment_Manufacturer) hydro-mechanical components. **Fuel Accessory Service Technologies Pte Ltd** (FAST) is a 49/51 joint venture between SIA Engineering Company (SIAEC) and [Collins Aerospace (formerly UTAS)](/wiki/Collins_Aerospace). FAST's core focus is fuel control and engine accessory repair services to APAC customers. It provides repair, overhaul, and modification for a wide range of [Hamilton Sundstrand](/wiki/Hamilton_Sundstrand) fuel components and [Auxiliary Power Units](/wiki/Auxiliary_Power_Unit) as well as Supplemental Cooling Units (SCU) and Cargo Refrigeration Units (CRU). **Goodrich Aerostructures Service Centre - Asia Pte Ltd** (GASCA) is a 40/60 joint venture between SIA Engineering Company (SIAEC) and Collins Aerospace. GASCA's core focus is the maintenance, repair, and overhaul (MRO) of nacelle systems and airframe composite components to APAC customers, for aircraft such as the Boeing 787 and Airbus A350. Having implemented a supply chain program with Boeing, GASCA is also the first non-Boeing facility to be accredited as Boeing's Network Service Centre (NSC). **JAMCO Aero Design & Engineering Pte Ltd** (JADE) is a 45/5/50 joint venture between SIA Engineering Company (SIAEC), JAMCO America, and JAMCO Corporation. JADE's core focus is the complete refurbishment of aircraft interiors, from the structure to the furnishings. offering support and services for cabin modifications. **MOOG Aircraft Service Asia Pte Ltd** is a 49/51 joint venture between SIA Engineering Company (SIAEC) and [Moog Inc.](/wiki/Moog_Inc.) Its core focus is the maintenance, repair, and overhaul (MRO) of Moog flight control systems fitted to aircraft such as the Boeing 787 and Airbus A350. **Panasonic Avionics Service Singapore Pte Ltd** (PACSS) is a 42.5/57.5 joint venture between SIA Engineering Company (SIAEC) and [Panasonic Avionics Corporation](/wiki/Panasonic_Avionics_Corporation). PACSS is Panasonic Avionics Corporation Centre of Excellence in the APAC region, and its core focus is the maintenance and repair of [in-flight entertainment](/wiki/In-flight_entertainment) systems, such as the new and highly advanced GCS, eX2, and eX3 systems. **Safran Electronics & Defense Service Asia Pte Ltd** is a 40/60 joint venture between SIA Engineering Company (SIAEC) and [Safran Electronics & Defense](/wiki/Safran_Electronics_%26_Defense). It is Safran's first avionics Centre of Excellence in the APAC region. It provides support, repair, and overhaul services for Safran's avionics and electronics equipment, as well as for other [OEMs](/wiki/Original_Equipment_Manufacturer), namely Airbus, Honeywell, Hamilton-Sundstrand, Thales, Rockwell-Collins, BAE Systems, etc. **Safran Landing Systems Services Singapore Pte Ltd** (SLSSS) is a 40/60 joint venture between SIA Engineering Company (SIAEC) and [Safran Landing Systems](/wiki/Safran_Landing_Systems). SLSSS' core focus is the repair and overhaul of aircraft landing gear that covers the full range of Airbus and Boeing aircraft, as well as component & accessory repair and overhaul for a variety of landing systems components and accessories, such as electrical and hydro-mechanical systems of civil and regional aircraft. ### Fleet management services joint venture **Boeing Asia Pacific Aviation Service Pte. Ltd.** (BAPAS) is a 49/51 joint venture between SIA Engineering Company (SIAEC) and [Boeing Singapore Pte. Ltd.](/wiki/Boeing) BAPAS offers integration between aircraft manufacturers and an MRO, incorporating various maintenance services. ### Line maintenance services joint venture **Pan Asia Pacific Aviation Services Ltd** (PAPAS) is a joint venture between SIA Engineering Company (SIAEC) (40%), [Malaysia Airlines](/wiki/Malaysia_Airlines) (20%), [Hong Kong Airlines](/wiki/Hong_Kong_Airlines) (15%), [PT Garuda Indonesia](/wiki/PT_Garuda_Indonesia) (15%) and [Royal Brunei Airlines](/wiki/Royal_Brunei_Airlines) (10%). PAPAS' core business is a full suite of line maintenance services at [Hong Kong International Airport](/wiki/Hong_Kong_International_Airport), from aircraft certification to ramp handling. **PT JAS Aero-Engineering Service** is a 49/51 joint venture between SIA Engineering Company (SIAEC) and PT Cardig Aero Services. Its core focus is the provision of line maintenance and ramp handling services at 16 major Indonesian airports, including [Cengkareng](/wiki/Soekarno%E2%80%93Hatta_International_Airport), [Surabaya](/wiki/Juanda_International_Airport), [Denpasar](/wiki/Ngurah_Rai_International_Airport), and [Medan](/wiki/Kualanamu_International_Airport), serving more than 43 airlines and cargo operators. **Southern Airports Aircraft Maintenance Services Co. Ltd** (SAAM) is a 49/51 joint venture between SIA Engineering Company (SIAEC) and [Airports Corporation of Vietnam](/wiki/Airports_Corporation_of_Vietnam). SAAM's core business is the provision of technical and non-technical handling of aircraft such as non-destructive testing, cleaning, and defect rectification, at airports in [Ho Chi Minh City](/wiki/Tan_Son_Nhat_International_Airport), [Hanoi](/wiki/Noi_Bai_International_Airport), [Nha Trang](/wiki/Cam_Ranh_International_Airport), and [Da Nang](/wiki/Da_Nang_International_Airport). ### Airframe maintenance services joint venture **Heavy Maintenance Singapore Service Pte Ltd** (HMS Services) is a 65/35 joint venture between SIA Engineering Company (SIAEC) and [Airbus Service Asia Pacific](/wiki/Airbus). HMS Services' core business is airframe maintenance, cabin upgrade, and modification service to Airbus A380 and A350 aircraft in the APAC region. ## Subsidiaries **SIA Engineering Japan Corporation** (SIAEJ) is SIAEC's third overseas maintenance facility. It is based in [Osaka](/wiki/Kansai_International_Airport) and offers a full suite of line maintenance services at Chitose and Narita, with services including aircraft certification, mechanics assistance, defect rectification AOG support, etc. **SIA Engineering (USA) Inc** is SIAEC's second overseas maintenance facility. It is based in [Los Angeles](/wiki/Los_Angeles_International_Airport) and offers a full suite of line maintenance services in San Francisco, Seattle, and New York, with services including aircraft certification, defect rectification, ramp handling, cabin maintenance, maintenance checks, cleaning, and AOG support, etc. **Singapore Aero Support Service Pte Ltd** is based in [Singapore](/wiki/Changi_International_Airport) and offers a full suite of line maintenance services, with services including aircraft certification, defect rectification, ramp handling, cabin maintenance, maintenance checks, cleaning AOG support, etc. **SIA Engineering (Philippines) Corporation** (SIAEP) is a wholly owned subsidiary of SIA Engineering Company (SIAEC). Located at Clark International Airport, it provides aircraft certification and heavy maintenance checks, airframe structural inspections, repairs, modifications, paint-stripping, painting, and non-destructive testing checks. - [Singapore Airlines](/wiki/Singapore_Airlines)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:49:37.509366",
  "title": "SIA Engineering Company",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/SIA_Engineering_Company"
}