{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:53:55.853319"
  },
  "content": "Place in East Region, Singapore **Siglap** ([IPA](/wiki/International_Phonetic_Alphabet): /ˈsɪɡlɑːp, -ʌp/ *SIH-glahp* or *SIH-glup*) is a neighbourhood located south-west of [Bedok](/wiki/Bedok) in the [East Region](/wiki/East_Region,_Singapore) of Singapore. The area encompasses the Frankel and Opera Estates and their names have sometimes been used interchangeably to refer to the approximate same area. The planning subzone area of Siglap, as defined by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA), is confusingly and inaccurately referred to as the small strip of land between [Victoria Junior College](/wiki/Victoria_Junior_College) and Bedok South Avenue 1. Siglap is a residential area where a majority live in landed homes such as freehold terrace houses, semi-detached houses, and bungalows. Some of the land parcels near Siglap Centre have been redeveloped into serviced apartments and condominiums. There are also other apartments and condominiums in the Siglap area. The few [Housing and Development Board](/wiki/Housing_and_Development_Board) flats in Siglap have earmarked since 2015 under the [Selective En bloc Redevelopment Scheme](/wiki/Selective_En_bloc_Redevelopment_Scheme) for redevelopment. The [East Coast Park](/wiki/East_Coast_Park) is also located nearby, across the [East Coast Parkway](/wiki/East_Coast_Parkway). The area is served by [Siglap MRT](/wiki/Siglap_MRT_station) station on the [Thomson-East Coast MRT](/wiki/Thomson%E2%80%93East_Coast_Line) line, which opened in June 2024. ## Etymology The present area of Siglap was founded by [Tok Lasam](/wiki/Tok_Lasam), the penghulu (chieftain) of Siglap. It is believed that he sailed to Singapore to escape the Dutch attack on his [Sultanate of Gowa](/wiki/Sultanate_of_Gowa) in the 1660s. According to legend, it was said that dark thunder clouds had appeared when he first landed in the area which led to the name \"**Si-Gelap**\", derived from the Malay word 'gelap', meaning \"*darkness that conceals*\". Other versions of his arrival include him as a [Minangkabau](/wiki/Minangkabau_people) prince arriving from Sumatra to visit the Bugis settlements in the [Tanjong Rhu](/wiki/Tanjong_Rhu) area and ultimately establishing Siglap in 1809. According to historians, his arrival might have coincided with a rare full solar eclipse on 4 March 1821 and hence the darkness might have referred to the eclipse, rather than the dark clouds. Today the graves of Tok Lasam, his wife and his panglima (commander) can be found near Jalan Sempadan off Upper East Coast Road. ## History Siglap in its early days had four kampongs, side by side each other along the coastline, they were from east to west starting from Jalan Hajijah, Kampong Hajijah, Kampong Goh Choo, Kampong Siglap and Kampong Lim Choo which ended near Siglap Road. There were also a small community of Japanese fishermen living in the area, although by the end of World War II (WWII) they had mostly vanished. The inland areas of Siglap consisted mostly of coconut and nutmeg plantations and in 1912 the Frankels bought over these plantations. The Frankels were wealthy Jewish business people originating from [Lithuania](/wiki/Lithuania) and had decided to settle in Singapore after accumulating considerable wealth from their sale of rubber, bread and even furniture in Singapore and around the region. They settled in the estate and developed the area by building roads named after famous Operas of their time including [Carmen](/wiki/Carmen) and [Aida](/wiki/Aida), which gave rise to the name of Opera Estate as it is known today. They were influential people that welcomed distinguished guests like [Albert Einstein](/wiki/Albert_Einstein) to visit and tour the area. At the onset of WWII the Frankels left for the United States. The area as well as along the wider East Coast Stretch saw machine gun pillbox being installed by the British in anticipation of a sea-bound attack by the Japanese that never materialise. During the Japanese Occupation, the coasts of Siglap and several of the nearby hills were used as execution sites in the [Sook Ching](/wiki/Sook_Ching) operation carried out by the Japanese to clear out anti-Japanese personnel, the operation mostly targeted the Chinese population. At the end of the war many mass graves had been found in the area, one of such place was near the junction of Bedok South Avenue 1 and Upper East Coast Road. In 1953 during the heydays of Singapore film making, Cathay-Keris Studio, one of two major film companies in Singapore, set up its studio along Jalan Keris and the surrounding area was commonly used for shooting scenes in the films. In 1962 a huge fire broke out at Kampong Siglap when firecrackers were burnt out of control and set the village ablaze. The few HDB flats built in the area were built in the aftermath of the fire to house the homeless victims. Starting from the mid-1960s, the Government embarked on an ambitious land reclamation project that saw the coastline of the entire East Coast Region shift outwards. As a result, many villagers in the area could not depend on fishing as a form of livelihood and many eventually settled away or were relocated to the neighbouring estates. The reclaimed land was then redeveloped with numerous high rise flats built and the East Coast Parkway was also constructed. The area has throughout history been home to several of Singapore's Presidents, including the first President of Singapore, [Yusof Bin Ishak](/wiki/Yusof_Ishak). ## Geography The terrain of Siglap can be divided into two, the inland and the outer coastal areas, with the former considerably hilly while the latter because it had mostly been reclaimed generally flat. The uneven terrain inland can be seen with the steep descent of Fidelio Street into the lower lying areas of Opera Estate at the Fidelio Circus. This has caused frequent flooding in Opera Estate in the past whenever it rained. The Government has since, starting from 1996, improved drainage and installed Singapore's first underground water detention tank to store excess rain water from the estate that would be discharged after the rain has stopped. ## Amenities Siglap is served by amenities like the Siglap Centre, Fairprice Siglap New Market, and Siglap V which are found at the junction of Siglap Road and East Coast Road. East Coast Road and Upper East Coast Road are also lined with restaurants, food courts and shops. Additionally the estate has shophouses for the convenience of residents. The Siglap Park Connector that leads to either the [Bedok Reservoir Park](/wiki/Bedok_Reservoir#Bedok_Reservoir_Park) or the [East Coast Park](/wiki/East_Coast_Park) runs west of the estate along the Siglap Canal. The Siglap Linear Park which is similar to a park connector cuts through the area too, running from Opera Estate to East Coast Park. Siglap is part of the [Marine Parade Group Representation Constituency](/wiki/Marine_Parade_Group_Representation_Constituency) and has one community centre, the Siglap South Community Centre, it is not to be confused with the Siglap Community Centre that serves the Bedok South Estate which is part of the [East Coast Group Representation Constituency](/wiki/East_Coast_Group_Representation_Constituency). Before 2025, Siglap served as a political division and was later split into Bedok, Changi-Simei, Fengshan and Joo Chiat divisions. The Wisma Mendaki Headquarters is another social facility located in the estate and serves the Malay community of the greater [Geylang](/wiki/Geylang) area too. There are various places of worship like the [Bethany Evangelical Free Church](/wiki/Evangelical_Free_Church_of_Singapore), Bethesda Frankel Estate Church, Church of Our Lady of Perpetual Succour, Ean Keng Si Buddhist Temple (延庆寺), Kim San Temple (金山寺斗山宫), Masjid Kampong Siglap and The Emmanuel Assembly of God Church. The area falls under the jurisdiction of the Siglap Neighbourhood Police Post (NPP), which is part of the [Bedok Police Division](/wiki/Bedok_Police_Division), and the 2nd [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) DIV HQ. ### Education There are currently several schools in the area namely (4 of which are public government schools): - [Global Indian International School](/wiki/Global_Indian_International_School) (GIIS) - Opera Estate Primary School (OEPS) - Rosemount International School/ Kindergarten - Sekolah Indonesia Singapura - St. Andrew's Autism School - St. Stephen's School - [Victoria Junior College](/wiki/Victoria_Junior_College) - [Victoria School](/wiki/Victoria_School) Despite the lower population density of the estate because it contains mostly landed houses, as opposed to HDB flats, the area still has a rich history of having numerous schools. Excluding the schools that have operated from the holding site campus due to [PRIME](/wiki/Programme_for_Rebuilding_and_IMproving_Existing_schools) initiatives by the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) at the junction of New Upper Changi Road and Bedok South Road, these are the schools which no longer operate in the estate and all but one of which are defunct: - APSN Katong School, occupied the former Siglap Primary School premises from 1992 to 2006, it is now located at New Upper Changi Road - Cheong Nam School, from 1931 to 1982, first set up at 79/ 123 Joo Chiat Place before moving in 1945 to 397A Jalan Tua Kong - CHIJ Opera Estate, from 1959 to 1989, the Red Cross Campsite now occupies the site - Opera Estate Boys' School, from 1959 to 1985, merged to form OEPS - Opera Estate Girls' School, from 1959 to 1985, merged to form OEPS - Siglap Malay School/ Siglap Indah Primary School, from 1903 to 1983, the Wisma Mendaki now occupies the site - Siglap Primary School, from 1956 to 1990, located formerly opposite St. Stephen's School - Siglap Secondary School, from 1955 to 1997, GIIS now occupies the site, it was subsequently merged with Coral Secondary School in Pasir Ris in 2017 These are the schools that have operated from the PRIME holding site campus chronologically: - Temasek Primary School, original occupants of the holding site from 1980 to 2000, stands today along Upper East Coast Road - [Temasek Secondary School](/wiki/Temasek_Secondary_School), original occupants of the holding site from 1980 to 1999, stands today along Upper East Coast Road - Bedok North Secondary School, original occupants of the holding site to 1981 to 1982, it has now merged with [Damai Secondary School](/wiki/Damai_Secondary_School) - Opera Estate Primary School, from 2001 to 2003 - Ping Yi Secondary School, from 2004 to 2005 - [Pasir Ris Secondary School](/wiki/Pasir_Ris_Secondary_School), from 2006 to 2007 - [Tampines Secondary School](/wiki/Tampines_Secondary_School), from 2008 to 2009 - [St. Anthony's Canossian Secondary School](/wiki/St._Anthony%27s_Canossian_Secondary_School), from 2011 to 2012 - [Tao Nan School](/wiki/Tao_Nan_School), from 2014 to 2015 - Tanjong Katong Girls' School, from 2017 to 2018 ### Transportation #### Bus [Marine Parade Bus Terminal](/wiki/List_of_former_bus_stations_in_Singapore#Marine_Parade_Bus_Terminal) was operational from 5 July 1981 till 16 September 2001 when it was closed to make way for the construction of Victoria School. Most of the bus services that originated from the terminal were subsequently extended to [Bedok Bus Interchange](/wiki/Bedok_Bus_Interchange) or Upper East Coast Bus Terminal further east, while other routes were cut short. Today, there are still many bus services that ply along Upper East Coast Road and Marine Parade Road that run through the south of Siglap. In contrast, bus services cutting through the Frankel and Opera Estate areas are limited and these services are 32, 40, 42 and 135 as well as service 401; a route with limited operating hours of weekends (excluding Saturday mornings) and public holidays, and which, provides a connection to East Coast Park. #### MRT Siglap is currently served by three MRT stations - [Bedok](/wiki/Bedok_MRT_station) and [Kembangan](/wiki/Kembangan_MRT_station) stations on the [East West Line](/wiki/East%E2%80%93West_Line_(Singapore)), and [Siglap](/wiki/Siglap_MRT_station) station on the [Thomson–East Coast Line](/wiki/Thomson%E2%80%93East_Coast_Line). The latter station opened in June 2024, and is located near Victoria School on Marine Parade Road. #### Road The [East Coast Parkway](/wiki/East_Coast_Parkway) (ECP) is an expressway that lies south of Siglap. Exit 7 and 8 of the expressway lead directly into the estate. The streets in Siglap (First to Fourth Street) off Siglap Road, were numerically named in 1958. ## Places of Historic Significance The historic site of [Kubur Kassim](/wiki/Kubur_Kassim) (also known to contain Keramat Sheikh Ali), an old Malay Cemetery that is nestled in the heart of Siglap is the final resting place of many Muslims in the area in the past. Several prominent people buried there include Dr Hafeezudin Sirajuddin Moonshi founder of the first Muslim Clinic in Singapore. There are even graves allocated for the mythological [Orang Bunian](/wiki/Orang_Bunian) inside. This site coupled with Masjid Kassim located in Telok Kurau originally belonged to Ahna Mohamed Kassim bin Ally Mohamed who was endowed with it in 1921. Today the 2.02 hectares cemetery contains a distinctive yellow gate and is at least 90 over years old. Despite it being a cemetery it is entirely surrounded by landed houses and condominiums. ## Incidents - On 6 October 2009, Masjid Kampong Siglap was set on fire by a 14 year old boy, he was charged in the Juvenile Court with mischief by fire and two other charges of criminal trespass and fraudulent possession of another student's [EZ-Link](/wiki/EZ-Link) card were later added. About 150 people including the mosque preschoolers were evacuated from the mosque. The mosque sustained more than $4.5 million worth of damages as the roof and prayer room were completely gutted and the mosque had to be closed for renovations. - On 2 December 2016, two houses at Siglap Plain were damaged when a construction crane toppled on them. It was said to be lifting concrete when it toppled. No injuries were reported but a full stop work order has been issued by the [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)) for investigations to be carried out. - Victor R Savage, Brenda S A Yeoh (2003), *Toponymics – A Study of Singapore Street Names*, Eastern Universities Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-205-1. 1°18′50″N 103°56′10″E﻿ / ﻿1.314°N 103.936°E﻿ / 1.314; 103.936\n",
  "language": "en",
  "processed_at": "2026-01-12T11:53:55.852977",
  "title": "Siglap",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Siglap"
}