{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:53:59.136102"
  },
  "content": "This article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)* **Siglap Post Office** is a post office serving the [Siglap](/wiki/Siglap) residential area of Singapore. ## Description The two-storey building \"features a clear delineation between the upper and lower floors\", separated by a ledge running around the building, similar to several other post office buildings across Singapore completed in the same period. The ground floor features \"asymmetrically positioned\" glass showcase windows. Ventilating blocks were placed in front of the second storey, to allow for privacy as the floor was where the living quarters for the office's postmaster were located. According to *Roots*, which is published by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)), the building's design was \"inspired by the appearance of industrial machinery — a deliberate move to proclaim a new era of local governance.\" ## History In February 1965, it was announced that the post office was to be built by the [Public Works Department](/wiki/Public_Works_Department_(Singapore)) for $90,000, along with the similarly-designed Still Road Post Office. Tenders were to be called in March and construction was to last nine months. The post office was to be operational by early 1966, with various amenities being located on the ground floor, including a public office, a serving counter, a postmaster's room, a staff room, a mail store room, a parcel enclosure and a strong room. The post office was completed in 1965. It was officially opened by then-Minister of State for Education [Abdul Rahim Ishak](/wiki/Abdul_Rahim_Ishak) several months after [Singapore's split from Malaysia](/wiki/Proclamation_of_Singapore) in August of that year. According to *Roots*, the building \"stood in stark contrast to its earlier neighbours — mostly village houses constructed of attap and wood.\" In February 1967, it was announced that the Siglap Post Office had won the \"best maintained post office\" award for 1966, with the Still Road Post Office coming in second and the Thomson Road Post Office coming in third. Then-[postmaster-general](/wiki/Postmaster-general) [M. Bala Subramanion](/wiki/M._Bala_Subramanion) presented the post office's postmaster, V. Panchaiharam, with a trophy. From 26 November 1979 to 1 February 1980, the post office was closed for renovations. It reopened with a larger lobby, a newer service counter and more post office boxes. In March 2013, the My First Classroom preschool opened a branch in the second storey of the post office. By October, it was among seven preschools housed within a post office building. 1°18′48″N 103°55′48″E﻿ / ﻿1.31327°N 103.92998°E﻿ / 1.31327; 103.92998\n",
  "language": "en",
  "processed_at": "2026-01-12T11:53:59.135689",
  "title": "Siglap Post Office",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Siglap_Post_Office"
}