{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:54:00.812478"
  },
  "content": "Malay martial art **Silat Melayu** ([Jawi](/wiki/Jawi_script): سيلت ملايو‎), also known as *Seni Persilatan Melayu* ('art of Malay Silat') or simply *Silat*, is a combative art of self-defence from the [Malay world](/wiki/Malay_world), that employs *langkah* ('steps') and *jurus* ('movements') to ward off or to strike assaults, either with or without weapons. Silat traced its origin to the early days of [Malay civilisation](/wiki/Malays_(ethnic_group)#History), and has since developed into a fine tradition of physical and spiritual training that embodies aspects of traditional Malay attire, performing art and *[adat](/wiki/Adat)*. The philosophical foundation of modern Malay Silat is largely based on the Islamic spirituality. Its moves and shapes are rooted from the basis of Silat movements called *Bunga Silat*, and Silat performances are normally accompanied with Malay drum assembles. The term [Silat](/wiki/Silat) is also employed to refer to similar fighting styles in areas with significant [Malay cultural influence](/wiki/Malayisation), in modern-day [Brunei](/wiki/Brunei), [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore), [Thailand](/wiki/Thailand), [Philippines](/wiki/Philippines), and [Vietnam](/wiki/Vietnam). In Indonesia, the term [Pencak Silat](/wiki/Pencak_Silat), a composite term introduced in the late 1940s, deriving from the Sundanese/Javanese word *Penca(k)* and Malay/Sumatran word *Silat*, has been used officially since 1973 as an umbrella term of traditional [martial arts of Indonesia](/wiki/Indonesian_martial_arts). In Malay terminology, the term 'Pencak Silat' is also used, but more in referring to the exoteric aspect of the fighting style, in contrast to the esoteric aspect of Silat called *Seni Silat* ('the art of Silat'). In other words, 'pencak' (fighting) can be regarded as the *zahir* (outer/exoteric knowledge), whilst *seni* pertains to the whole of Silat including *batin* (inner/esoteric knowledge) and *zahir*. *Seni Silat* is thus considered to be a deeper level of understanding. Therefore, it is said that each aspect of Silat emanates from *seni* (art), including both the fighting and the dance aspects. Regionally, Silat is governed by PERSIB (National Pencak Silat Federation of Brunei Darussalam) in Brunei, PESAKA (National Silat Federation of Malaysia) in Malaysia and PERSISI (Singapore Silat Federation) in Singapore. These governing bodies, together with IPSI (Indonesian Pencak Silat Association), are the founding members of International Pencak Silat Federation (PERSILAT). The sport version of Silat is one of the sports included in the [Southeast Asian Games](/wiki/Southeast_Asian_Games) and other region-wide competitions, under the name '[Pencak Silat](/wiki/Pencak_Silat)'. Pencak silat first made its debut in [1987 Southeast Asian Games](/wiki/1987_Southeast_Asian_Games) and [2018 Asian Games](/wiki/2018_Asian_Games), both were held in Indonesia. Silat was recognized as a piece of [Intangible Cultural Heritage](/wiki/Intangible_Cultural_Heritage) by [UNESCO](/wiki/UNESCO) in 2019. ## Etymology Owing to lack of written records, the origin of the word 'silat' remains uncertain. The use of the term 'silat' in referring to Malay martial arts was somewhat absent from contemporary writings from the 15th to 16th centuries. The *[Hikayat Hang Tuah](/wiki/Hikayat_Hang_Tuah)* that was written by the end of the 17th century, with warrior stories form its main repertoire, does not employ the word ‘silat’, but uses other terms like *ilmu perang* ('military knowledge'), *ilmu hulubalang* ('knowledge of [Hulubalang](/wiki/Hulubalang)'), *ilmu prajurit* ('knowledge of soldiers’), in referring to the Malay martial arts. The earliest known mention of ‘silat’ in *[Misa Melayu](/wiki/Misa_Melayu)*, written sometimes between 1720 and 1786, was rather generic in nature and not specifically referring to the Malay martial arts. It was used as a generic term in describing the movements of [kuntao](/wiki/Kuntao) as performed by Chinese folks. In this regard, the word 'silat' is thought to originate from the composite of two words 'si' and 'elat'. 'Si' is a Malay [article](/wiki/Article_(grammar)) used with [adjectives](/wiki/Adjective) to describe people, and normally found in names and nicknames. While 'elat' is a verb means 'to trick', 'to confuse' or 'to deceive'. The derivative transitive verb 'menyilat' or 'menyilap' carries the meaning of an action to evade, to trick or to take an assault, together with a counterattack. This implies that the term 'silat' is a generic term in origin, referring to any forms of martial arts that involve such movements, before it began to specifically refers to Malay martial arts. In the 19th century literary texts, reference to 'silat' as a specific martial art of Malay people began to appear, for example in *Hikayat Pahang*, *[Hikayat Awang Sulung Merah Muda](/wiki/Hikayat_Awang_Sulung_Merah_Muda)*, Hikayat Malim Deman and many others. Alternative views from oral literature point the word to Arabic origin. 'Silat' is said to derive from the Arabic word 'silah' (سِلَاح) meaning 'weapon' or 'silah' (صِلَةُ) meaning 'connection'. Over the time, the word is believed to has been malayised into 'Silat' in similar way the word *[karamah](/wiki/Karamah_(disambiguation))* (كرامة) was malayised into *[keramat](/wiki/Datuk_Keramat)* (کرامت) ('sacred') and the word '[hikmah](/wiki/Hikmah)' (حكمة) was malayised into *hikmat* (حکمت) ('supernatural power'). This etymological root suggests that Silat is philosophically based on the teaching of Islam, which over the centuries, have become the source of a [Malay identity](/wiki/Malayness). The use of the Arabic word serves as a tool in elaborating the philosophy of both Malay culture and art itself. The 'connection' in the etymology suggests that Silat covers aspects in the relationship between humans, between humans and their enemies, and between human and nature, and ultimately attaining the spirituality, that is the relationship between human and their creator. Other etymological root suggests that the word is said to derive from 'silap' (to make a mistake). This means that using the opponent's strength against them—in their strength lies their weakness. This strength could be physical or psychological. Others suggested that it originated from the word *sekilat* meaning \"as fast as lightning\" derived from *kilat* (lightning); *sila* (as in silsilah or chain) indicating the transmission of Silat from guru to murid (disciple of Silat or other religious or secular knowledge); and more mysteriously, from the Arabic *[solat](/wiki/Salah)* (prayer), although linguists regard solat as an unlikely candidate for the etymological root of 'Silat'. Other contenders for the etymological root of 'Silat' include the '[Orang Selat](/wiki/Orang_Seletar)' (an indigenous Malay people of Singapore), and selat as in *Selat Melaka* (the [Straits of Malacca](/wiki/Straits_of_Malacca)). English-language publications are sometimes mistakenly refer to Silat Melayu as *bersilat* but this is actually a verb form of the noun Silat, literally meaning \"to perform Silat\". ## History ### Early period The genesis of traditional Malay martial arts has been attributed to the need for [self-defense](/wiki/Self-defense), hunting techniques and military training in ancient [Malay world](/wiki/Malay_world). [Hand-to-hand combat](/wiki/Hand-to-hand_combat) and [weapons](/wiki/Weapon) practice were important in training warriors for combat in human warfare. Early traditional fighting styles believed to have been developed among various Malayic tribes from the dawn of the Malayic civilisation, 2000 years ago. Movements of these early fighting styles epitomize the movements of various animals such as the crocodile, tiger and eagle, and deeply influenced by [ancient Malay animism](/wiki/Malaysian_folk_religion). As the expanding [Iron Age](/wiki/Iron_Age) civilisations on the [Mainland Southeast Asia](/wiki/Mainland_Southeast_Asia) engaged in wars and diplomacy, it led to the advancement of the art of war, weaponry and martial arts skills. Early Malays and the related [Chams](/wiki/Chams), were the only sizable [Austronesians](/wiki/Austronesian_peoples) that had established themselves since the Iron Age on the Mainland Southeast Asia among the Austroasiatic inhabitants. Some scholars like [Hall](/wiki/D._G._E._Hall) and [Blust](/wiki/Robert_Blust) argued that even the earlier [Funanese](/wiki/Funan) were Austronesians, and by the early centuries of Christiann era, a single dialect chain of Austronesian languages would have extended almost unbroken from the [Malay Peninsula](/wiki/Malay_Peninsula) to Champa. The expansion of the [Khmers](/wiki/Khmer_people) into the region of the [Mekong Delta](/wiki/Mekong_Delta) would then have divided an earlier language continuum into two separate and smaller dialects. By the 2nd century CE, the early Austronesian settlements that centered around present day Southern Vietnam and the [Kra Isthmus](/wiki/Kra_Isthmus) region of the Malay Peninsula and its peripheries, had developed into strong kingdoms like [Champa](/wiki/Champa), [Langkasuka](/wiki/Langkasuka) and [Kedah](/wiki/History_of_Kedah). The Chams were particularly known as formidable warriors who were great exponents of martial arts. Their exceptional skills in warfare were gained through their long intermittent conflicts with neighbouring kingdoms. The discovery of prototypes of [bronze](/wiki/Bronze) [kris](/wiki/Kris) in Southern Vietnam, with [hilt](/wiki/Hilt) decorated by human figure, dating back to more than 2000 years ago, further indicated that the Chams had developed an advanced martial arts tradition. Even centuries later, their martial prowess were still held in high regards among people in Malay Peninsula and Sumatra, as the legends of prominent Cham warriors made its way in the [Malay Annals](/wiki/Malay_Annals) and *Tambo* of [Minangkabau people](/wiki/Minangkabau_people). *Tambo* for example, recounts the legend of a Cham warrior who goes by the name Harimau Campo ('tiger of Champa’). Together with Kuciang Siam, Kambiang Hutan and Anjiang Mualim, they developed the early Minangkabau *silek*. The early fighting styles are also thought to have been developed in Langkasuka, another important Austronesian polity of Mainland Southeast Asia. Langkasuka that is widely regarded as the progenitor of [Pattani Kingdom](/wiki/Pattani_Kingdom), along with the culturally-related [Kedah](/wiki/History_of_Kedah), are earliest kingdoms of the Malay Peninsula. The martial prowess of people in the Pattani region is well recounted in many Malay legends, an indication of a long established martial arts tradition since the ancient times. *[Hikayat Hang Tuah](/wiki/Hikayat_Hang_Tuah)* narrates that the people of Pattani were known for their advanced martial art skills and their army were not easily subdued by the Melakan forces. The oldest form of silat still in existence, *[Silat Tua](/wiki/Silat_Pattani)* ('ancient silat') which is strongly rooted in animism, is originated from Pattani and according to the local legends, was once practiced by [Hang Tuah](/wiki/Hang_Tuah) himself. An important development of martial arts of the Malay world is also attributed to the foreign influence. The infusion of foreign elements were not only obtained through wars and conquests, but also through trade and diplomacy. The growth in trade relations brought in foreign influence throughout the early primordial Austronesian ancient states, most importantly in cultural traits including the combative arts. The influence from both [Chinese](/wiki/Chinese_martial_arts) and [Indian martial arts](/wiki/Indian_martial_arts) can be observed from the use of weapons such as the Indian mace and the Chinese sword. During this period, formalised combat arts were believed to have been practiced in the Champa, Malay Peninsula and Sumatra. From the 12th century, the martial arts were further developed in [Langkasuka](/wiki/Langkasuka) under [Srivijaya](/wiki/Srivijaya) after [Chola Empire](/wiki/Chola_dynasty) was expelled from Sumatra and Malay Peninsula.The [Riau Archipelago](/wiki/Riau_Archipelago) is particularly noted in its role in the development of Malay martial arts. Its people [Orang Laut](/wiki/Orang_Laut) also called Orang Selat are stereotyped as [sea pirates](/wiki/Sea_pirate), but historically played major roles in the times of [Srivijaya](/wiki/Srivijaya) and later sultanates of [Melaka](/wiki/Melaka_Sultanate), and [Johor](/wiki/Johor_Sultanate). The fighting styles developed in this area are described by different writers as a crude prototype of Malay martial arts and one of the progenitors of modern Malay Silat. ### Islamic era The Malay martial arts reached its historical peak with the rise of Islam during the 15th century under the [Melaka Sultanate](/wiki/Melaka_Sultanate). The era is known for the infusions of Islamic philosophy and elements of [sufism](/wiki/Sufism), or Islamic mysticism, in silat. Literary texts mentioned some notable sufis like Makhdum Sadar Jahan who was a teacher for Sultan [Ahmad Shah](/wiki/Ahmad_Shah_of_Malacca), as well as Sheikh Mansur who taught [Hang Tuah](/wiki/Hang_Tuah) the knowledge of *tasawuf*. The era also saw the introduction of [Baju Melayu](/wiki/Baju_Melayu) that became the common uniform of silat practitioners until today. The Melakan era that lasted until the early 16th century is also a popular setting for the stories and legends in classical Malay literature. Numerous exploits of warriors are recounted in famous literary texts like the *[Malay Annals](/wiki/Malay_Annals)* and *[Hikayat Hang Tuah](/wiki/Hikayat_Hang_Tuah)*. In the *[Malay Annals](/wiki/Malay_Annals)*, the martial prowess of the Malay rulers and nobility is dramatically recounted in many colourful vignettes, for example, that of Sultan [Alauddin](/wiki/Alauddin_Riayat_Shah_of_Malacca) personally apprehending thieves in flight. These legends are important because they establish the principle of the divine rule of kings, kings who are said to be the shadow of god on earth, and because they firmly tie divine right to the war machine, silat. The *Hikayat Hang Tuah* narrates the life of the legendary [Laksamana](/wiki/Laksamana) [Hang Tuah](/wiki/Hang_Tuah), a renowned formidable exponent of martial arts, whose exploits are still recounted today as an integral part of the cultural legacy of silat. His [duel](/wiki/Duel) with one of his companions, [Hang Jebat](/wiki/Hang_Jebat) is the famous depiction of a silat duel in literature and art, and has also become the most controversial subject in Malay culture, concerning on the questions of unconditional loyalty and justice. In early literature, the Malay martial arts were generally known as *ilmu perang* ('military knowledge'), *ilmu hulubalang* ('knowledge of [Hulubalang](/wiki/Hulubalang)'), *ilmu prajurit* ('knowledge of soldiers') in literature. Foreign influences, like in pre-Islamic era Malay Peninsula, plays important role in shaping various cultural aspects in Melakan society. The Malay Annals recorded an enclave of [Chams](/wiki/Chams) among many foreign enclaves in the city of Melaka. The Chams who arrived after the sack of [Champa](/wiki/Champa)’s capital [Vijaya](/wiki/Vijaya_(Champa)) in 1471, were said to be instrumental in the development of martial arts in Melakan era. They were known to have been held in high esteem by the Malay kings for their knowledge in martial arts and for being highly skilled in the [art of war](/wiki/Art_of_war). Since it was common back then for prominent fighters to be elevated to head war troops and received ranks or bestowals from the [raja](/wiki/Raja), Chams also rose in ranks, filling important positions within the sultanate. During the reign of Sultan [Mansur Shah](/wiki/Mansur_Shah_of_Malacca), a Cham prince named Indera Brama was appointed as a senior minister in Melakan court, an indication of their importance. From the 15th century onwards, [Malayisation](/wiki/Malayisation) spread many Malay traditions including language, literature, martial arts, and other cultural values throughout [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia). Historical accounts note close relationship between Melaka and Brunei Sultanates, leading to the spread of Silat through the region from as early as the 15th century. Brunei's national epic poem, the *Syair Awang Semaun*, recounts the legend of a strong and brave warrior Awang Semaun who contributed extensively to the development of Brunei, and who is also said to be the younger brother of Awang Alak Betatar or [Muhammad Shah](/wiki/Muhammad_Shah_of_Brunei) (1405–1415), the first Sultan of Brunei. The fifth Sultan, [Bolkiah](/wiki/Bolkiah), who ruled between 1485 and 1524, excelled both in martial art and diplomacy. Under the seventh Sultan, [Saiful Rijal](/wiki/Saiful_Rijal) (1575–1600), the sultanate was involved in the [Castilian War](/wiki/Castilian_War) against the [Spanish Empire](/wiki/Spanish_Empire) in 1578, and they would have used Silat and invulnerability practices. Thereafter, several patriots excelled as warriors, including [Pengiran Bendahara Sakam](/wiki/Bendahara_Sakam) under the reign of [Sultan Abdul Mubin](/wiki/Abdul_Hakkul_Mubin) (1600–1673). As Brunei rose to the status of a maritime power at the crossroads of Southeast Asia, it built the unity of the kingdom through war and conquest, and managed to extend its control over the coastal regions of modern-day [Sarawak](/wiki/Sarawak) and [Sabah](/wiki/Sabah) and the Philippines Islands, which were under the Sultanate's control for more than two centuries. ### Colonial and modern era In the 16th century, [conquistadors](/wiki/Conquistadors) from [Portugal](/wiki/Portugal) attacked [Malacca](/wiki/Malacca) in an attempt to monopolise the spice trade. The [Malay](/wiki/Malay_people) warriors managed to hold back the better-equipped [Europeans](/wiki/Europe) for over 40 days before [Malacca](/wiki/Malacca) was eventually defeated. The [Portuguese](/wiki/Portuguese_people) hunted and killed anyone with knowledge of martial arts so that the remaining practitioners fled to more isolated areas. Even today, the best silat masters are said to come from rural villages that have had the least contact with outsiders. For the next few hundred years, the [Malay Archipelago](/wiki/Malay_Archipelago) would be contested by a string of foreign rulers, namely the [Portuguese](/wiki/Portuguese_people), [Dutch](/wiki/Dutch_people), and finally the [British](/wiki/British_people). The 17th century saw an influx of [Minangkabau](/wiki/Minangkabau_people) and [Bugis](/wiki/Buginese_people) people into the [peninsula](/wiki/Malay_Peninsula) from [Sumatra](/wiki/Sumatra) and [south Sulawesi](/wiki/South_Sulawesi) respectively. [Bugis](/wiki/Buginese_people) sailors were particularly famous for their martial prowess and were feared even by the [European](/wiki/Demographics_of_Europe) colonists. Between 1666 and 1673, Bugis [mercenaries](/wiki/Mercenaries) were employed by the [Johor Empire](/wiki/Johor_Empire) when a civil war erupted with [Jambi](/wiki/Jambi), an event that marked the beginning of [Bugis](/wiki/Buginese_people) influences in local conflicts for succeeding centuries. By the 1780s the [Bugis](/wiki/Buginese_people) had control of [Johor](/wiki/Johor) and established a kingdom in [Selangor](/wiki/Selangor). With the consent of the [Johor](/wiki/Johor) ruler, the [Minangkabau people](/wiki/Minangkabau_people) formed their own federation of nine states called [Negeri Sembilan](/wiki/Negeri_Sembilan) in the hinterland. Today, some of [Malaysia](/wiki/Malaysia)'s silat schools can trace their lineage directly back to the [Minangkabau](/wiki/Minangkabau_people) and [Bugis](/wiki/Buginese_people) settlers of this period. After [Malaysia](/wiki/Malaysia) achieved independence, [Tuan Haji Anuar bin Haji Abd. Wahab](/wiki/Tuan_Haji_Anuar_bin_Haji_Abd._Wahab) was given the responsibility of developing the nation's national silat curriculum which would be taught to secondary and primary school students all over the country. On 28 March 2002, his Seni Silat Malaysia was recognised by the Ministry of Heritage and Culture, the Ministry of Education and PESAKA as [Malaysia](/wiki/Malaysia)'s national silat. It is now conveyed to the community by means of the *gelanggang bangsal* meaning the martial arts training institution carried out by silat instructors. Malaysian Silat by December 2019, received recognition from [UNESCO](/wiki/UNESCO) as part of Malaysian [Intangible Cultural Heritage](/wiki/Intangible_Cultural_Heritage). ## Styles ### Brunei Silat in Brunei shares characteristics common in the Malay world, but it has also developed specific techniques and practices of its own. Silat as a performing art is traditionally accompanied by an orchestra called *gulintangan* or *gulingtangan* (literally: ‘rolling hands’), often composed of a drum (*gandang labik*) and eight gongs, including a thin gong (*canang tiga*) and a thick gong (*tawak-tawak*). There are several styles being practiced in Brunei, and some are influenced by a range of elements from Malaysia, Indonesia and the Philippines. The most widespread is Gerak 4 1, created by H. Ibrahim, and consisting of the four styles learnt from his masters: Panca Sunda, Silat Cahaya, Silat Kuntau and Silat Cakak Asli. Some of the other styles include Kembang Goyang, Kuntau Iban, Lintau Pelangi (originally from Belait), Pampang Mayat, Pancasukma, Perisai Putih (originally from the East Javanese school Setia Hati), Persatuan Perkasa, Persatuan Basikap, Selendang Merah (‘the red scarf’), Silat Sendi, Tambong, Teipi Campaka Puteh, Gayong Kicih or Kiceh, Gayong Tiga or Permainan Tiga (which includes Gayong, Cimande and Fattani), and Cengkaman Harimau Ghaib. The different styles of Silat are often practiced among different nationalities, and not according to specific territorial borders. Nevertheless, the foreign influences are rarely clearly expressed by the practitioners. There are many Filipinos and Indonesians in Brunei as migrant workers, but due to their significantly lower social status, the influence of the styles developed in their original countries are not that clearly visible among local styles. This is contributed in part, by the royal and aristocratic status of Silat itself in Malay society, in contrast to its peasant martial arts status in other society. At the same time, a variety of local styles fell under the nationalisation drive for a common tradition of Bruneian Silat, bringing other styles of different indigenous groups that occupied the territories that were formerly part of Brunei, into isolation. This led to the abandonment of many details of the Silat practices in favor of a national homogeneity. In the end, two most widespread styles were established as national ones; *Silat Cakak Asli* and *Silat Kuntau*, which both be seen as complementing each other. *Cakak Asli* focuses more on relaxed moves but sticky-hand techniques in a close combat, to ultimately unbalance the opponent, and hit with the knees, elbows and forehead. Kuntau prioritizes various forms of punches and kicking, and normally done in fast and harsh movements, therefore making it hard to perform lock in a close range combat. These two styles have been patronized in the sultanate for many generation of rulers, but with lack of written records, it is hard to trace their origins and development in Brunei. The 29th sultan, [Omar Ali Saifuddien III](/wiki/Omar_Ali_Saifuddien_III), was known for having learnt both *Silat Cakak Asli* and *Silat Kuntau* and he promoted local Silat in the 1950s, notably by organizing tournaments at the palace. ### Malaysia Silat practiced in Malaysia are diverse, with vast differences in training tools, methods and philosophy across different schools and styles. The variety of styles not only demonstrated many different combat skills, but also the ability of the martial art itself in manifesting different personages and community in warrior traditions. Some forms of Silat also exist especially in the very remote villages, with members consisting of a few students. The modern law and regulations require that the Silat bodies need to be registered as an association or club. Therefore, we find that those silat forms with very few members are those which are being practiced in a secretive way in remote areas and are taught only by invitation of the master. Based on the data from 1975, there were 265 styles of Silat in Malaysia, which in turn grouped into 464 different Silat associations throughout the country. Today, there are 548 associations or communities which actively practicing Silat in Malaysia. Out of these, four associations are the most prominent and became the founding members of *Majlis Silat Negara* ('National Silat Council') in 1978, later renamed *Persekutuan Silat Kebangsaan Malaysia* or PESAKA (The National Silat Federation of Malaysia). The first two associations are *[Seni Gayung Fatani Malaysia](/wiki/Seni_Gayung_Fatani)* and *[Silat Seni Gayung Malaysia](/wiki/Seni_gayong)* that represent a style called *seni gayong* (modern spelling *seni gayung*). The word *gayung* in Malay literally means to assault using blades like [parang](/wiki/Parang_(knife)) or [sword](/wiki/Sword), or it can also mean 'martial art' and synonymous to Silat itself. *Gayung* also means \"single-stick,\" a weapon that is associated with magical powers in Malay literature. For the Malay martial artist, *gayung* is a verb that describes the action of dipping into the well of the unseen, to draw out mystical power for use in this world. Seni Gayung is a composite style, incorporating both Malay Silat and elements from Bugis fighting styles. It is visually distinctive from other Malay styles of Silat due to its emphasis upon performance acrobatics, including flips, diving rolls, somersaults, and handsprings. The student learns to competently handle several weapons, notably the *parang*, *lembing* (spear), *sarung* and the *kris*. The next association is *Seni Silat Cekak Malaysia* that represents a style called *Silat Cekak*. *Silat cekak* was originally developed in the [Kedah Court](/wiki/Kedah), and has been practiced by senior commanders of Kedah army in wars fought against the Siamese. The style is said to has been developed specifically to counter the Thai fighting style, [Muay Thai](/wiki/Muay_Thai) or known locally as *tomoi*. It is one of the most popular Silat styles in Malaysia, first registered as an association in Kedah in 1904, and for Malaysia generally in 1965. *Cekak* in Malay means to 'claw' or to seize the opponent. It is renowned for its series of *buah* (combat strategy) which have been influential in the development of more recent silat styles in [Malay Peninsula](/wiki/Malay_Peninsula), including *seni gayung*. Unlike most of styles of Silat, *Silat Cekak* is known for its non-ceremonious nature with no emphasis in graceful dance-like movements. It is a defensive-type of Silat that applies 99% defending techniques and only 1% attacking techniques. The style has no *kuda-kuda* stances commonly found in other Silat styles, and it does not utilize any evading nor side stepping techniques in mortal combat. As a result, it is hard to predict movements and counter-attacks of this style. The last association is *Seni Silat Lincah Malaysia* that represents a style called *Silat Lincah*. *Silat Lincah* is said to originate from another older style of Melaka called *Silat Tarah*, allegedly practiced by [Hang Jebat](/wiki/Hang_Jebat) himself, one of the companions of [Hang Tuah](/wiki/Hang_Tuah). The word *tarah* in Malay means to sever as in cut off, and the term was considered too aggressive for the use of masses, thus it was changed to *Lincah*. *Lincah* means fast and aggressive which is the principle of the style, that emphasise aggressive movements both in defense and attacking techniques in punches and kicks. The style favors evasion with follow up sweeps, locks and chokes that do not relate to dueling techniques used with a [kris](/wiki/Kris). Similar to *Silat Cekak*, *Silat Lincah* put little emphasis to graceful dance-like movements. ### Singapore Despite its status as a [global city](/wiki/Global_city), Singapore still retains a large part of its cultural heritage including Silat. Historically, Silat development in Singapore is closely related to the mainland Malay Peninsula, owing to its status as an important city in Malay history from [classical](/wiki/Kingdom_of_Singapura) to modern era. There are styles being practiced are influenced by a range of elements from both Malaysia and Indonesia, and there are also styles that locally developed and spread to other neighboring countries especially Malaysia. [Seni Gayong](/wiki/Seni_Gayong), one of the biggest Silat styles in Malaysia, was founded in the early 1940s by Mahaguru Datuk Meor Abdul Rahman on [Pulau Sudong](/wiki/Pulau_Sudong) seven kilometres south of Singapore. Having inherited the art from his maternal grandfather, Syed Zainal Abidin Al-Attas, a prominent [pendekar](/wiki/Pendekar) from [Pahang](/wiki/Pahang), he transformed the style from a parochial past time to a regimented and highly organised form of self defense during the troubled years of the [Japanese occupation](/wiki/Japanese_occupation_of_Singapore). Another notable style originated from Singapore is called *Silat Harimau* established by Mahaguru Haji Hosni Bin Ahmad in 1974. The styles that inspired by the movements of tiger began to gain popularity in 1975 not only in Singapore but also in Malaysia. It was recognised by the Malaysian Martial Arts Federation, as a native Silat of Singapore that represents the city state in various competitions and demonstrations. Haji Hosni went on to establish another style called *Seni Silat Al-Haq*. It is a style that derives its *buah* (combat strategy) from both *Seni gayung* and *Silat Cekak*, and considered as a more aesthetically polished (*halus*) style of Seni gayung. There are many other styles of Silat currently found in Singapore but nearly a third of the styles are the result from Haji Rosni's adaptations and innovations. For example, where there was *Silat Kuntao Melaka*, he created *Silat Kuntao Asli*, and in the place of *Silat Cekak*, he created *Cekak Serantau*. ### Thailand The southernmost provinces of Thailand, located on the Malay Peninsula, are culturally and historically related to the states of Malaysia. Similarities are not only found in the spoken language, but also in a variety of Malay cultural aspects including Silat. Despite being suppressed and subjected to [Thaification](/wiki/Thaification) by the central government, the practice of Silat still finds its widespread currency in those provinces. Many different forms of Silat can be found in the Malay Muslim communities in Pattani, Yala, and Narathiwat as well as Saba-yoy and Thebha districts from the Songkhla province at its northern reaches, and with southern form s down through Malaysia. Historically, the Thai part of the peninsula and the Malaysian side, have been influencing each other's styles of Silat for centuries. Silat in Southern Thailand had also significant influence in the development of Thai martial art called [Krabi–krabong](/wiki/Krabi%E2%80%93krabong). *Silat Tua*, an important Silat style that has an intimate relationship with four elements of nature (earth, water, fire and wind) as understood from its roots in animism, is said to originate from [Pattani](/wiki/Pattani_Province) region. Silat Tua is directly translated as ‘old’ or ‘ancient’ Silat. Described as the 'Malay dance of life', *Silat Tua* does not has sets of rigid instructions as well as the endless pre-arranged movement patterns like most traditional martial arts, rather it is an art that begins with 'natural movement', focusing on the strengths and weaknesses of the exponent and the potential of the individual body. What is focused instead are basic principles and uses of imagery that are immortalised in freestyle movement known as a *tari* ('dance'). As Pattani was constantly at war with the neighbouring kingdom of Siam, many combative developments in the art were made in this region leading Silat Tua to take on another name, [Silat Pattani](/wiki/Silat_Pattani). ## Uniform The Silat uniform may varies according to different schools and locality but generally can be divided into three types; training, ceremonial, and formal dress. The most important dress is for the training, which commonly consist of a baggy black trousers and a black long sleeved [baju melayu](/wiki/Baju_melayu). Some schools require the practitioners to wear belts (*bengkung*) during training, with different colours signifying different rank, a practice adopted from the belt system of [Japanese martial arts](/wiki/Japanese_martial_arts), while some silat schools replace the bengkung with a modern buckled belt. Headdress is optional but donning a black [bandana](/wiki/Bandana) is popular. Female practitioners may replace the bandana with an Islamic veil ([tudong](/wiki/Tudong)), or left their hair uncovered except when uttering prayers at the beginning and end of the training sessions. A [sarong](/wiki/Sarong) can also be worn along with a roll of cloth which could be used as a bag, a blanket or a weapon. In Seni Gayong, a wide red cloth sash is wrapped several times around the waist and ribs of the practitioner as a type of supple armour to protect the body against spear thrusts. Generally, every part of the uniform has a special function, for example, the headdress or bandana doubles as a bandage, and the sash may be used as weapon as well. Nevertheless, some schools use a modern uniform consisting of a T-shirt and pants topped with a short [sarong](/wiki/Sarong). Others may not even have any official uniform and allow the students to dress as they normally would, so that they become accustomed to fighting in their daily attire. The ceremonial dress (*baju istiadat*) is more elaborate compared to the training dress and usually worn during special cultural events. This type of dress originated from the 15th century's full Malay costume, which was the trademark of warriors, [panglima](/wiki/Panglima) and [hulubalang](/wiki/Hulubalang). For female practitioners, the ceremonial dress is in the form of [baju kurung](/wiki/Baju_kurung). The dress consists of the normal [baju melayu](/wiki/Baju_melayu) for male, but its most distinctive feature is the inclusion of a headdress called [tengkolok](/wiki/Tengkolok) or *tanjak* and a waistcloth (*sampin* or *likat* in Thailand). The headdress is traditionally made from [songket](/wiki/Songket) cloth and they can be tied in many different styles depending on status and region. While the waistcloth is also commonly made from [songket](/wiki/Songket), some can be made from [batik](/wiki/Batik) and [sarong](/wiki/Sarong) cloth as well. There are a number of ways to tie it but the popular old style used by warriors was the *sampin silang* which allows for freedom of movement and easy access to weapons worn at the side. Full ceremonial dress also include the traditional short jacket (*baju sikap*), sandals (*capal*) and weapons. A poem from *[Hikayat Awang Sulung Merah Muda](/wiki/Hikayat_Awang_Sulung_Merah_Muda)* describe in details the full ceremonial dress of a Malay warrior. The final type of dress is the formal dress which commonly worn during religious functions. For male, the dress consists of the traditional [baju melayu](/wiki/Baju_melayu) worn together with sampin and a black hat called [songkok](/wiki/Songkok). This is considered the common style of Malay dress for male, which has been elevated to the national dress in Malaysia and Brunei. For female practitioners, the ceremonial dress is normally similar to the formal dress in the form of [baju kurung](/wiki/Baju_kurung). ## Training hall The formal training area of Silat is called *gelanggang* in Malay, or sometimes known as *bangsal Silat*. The term *gelanggang* literally means '[arena](/wiki/Arena)' or '[court](/wiki/Game_court)', and may also refer to any space used for competitive activities. The traditional *gelanggang* is located outdoors, in a specially built part of the village or a jungle clearing. It can be either in the form of sand or grass court, and would be enclosed by a simple fence made of [bamboo](/wiki/Bamboo) and covered in [nipah](/wiki/Nypa_fruticans) or coconut leaves to prevent outsiders from stealing secrets. The entrance of the traditional *gelanggang* commonly consists of two poles (*penjuru*) upon which wrapped layers of cloth which have been blessed (*jampi*) by the [guru](/wiki/Guru) or cikgu to prevent spirits from entering the arena. Each pole in the gelanggang is also blessed by the guru in order to 'fence in' or 'protect' (*pagar*) the area, and neutralize all evils or potentially evil influences in it. Practitioners are also expected to adhere to strict 'taboo' (*pantang larang*) whenever they are in the *gelanggang* to maintain discipline in training. Training start right after the night prayer or [Isha](/wiki/Isha_prayer) and can continue up until midnight everyday, except for the night before Friday. Before training can begin, the *gelanggang* must be prepared either by the guru or senior students in a ritual called \"opening of training\" (*upacara buka gelanggang* ). The purpose of this mandatory ritual is to clear the mind and to establish concentration and focus. In its traditional form, the ritual starts by cutting some [limes](/wiki/Lime_(fruit)) into water and then walking around the area while sprinkling the water onto the floor. The [guru](/wiki/Guru) walks in a pattern starting from the centre to the front-right corner, and then across to the front-left corner. They then walk backwards past the centre into the rear-right corner, across to the rear-left corner, and finally ends back in the centre. The purpose of walking backwards is to show respect to the *gelanggang*, and any guests that may be present, by never turning one's back to the front of the area. Once this has been done, the teacher sits in the centre and recites an invocation so the space is protected with positive energy. From the centre, the guru walks to the front-right corner and repeats the invocation while keeping the head bowed and hands crossed. The right hand is crossed over the left and they are kept at waist level. The [mantra](/wiki/Mantra) is repeated at each corner and in the same pattern as when the water was sprinkled. As a sign of humility, the guru maintains a bent posture while walking across the training area. After repeating the invocation in the centre once more, the teacher sits down and [meditates](/wiki/Meditate). Although most practitioners today train in modern indoor *gelanggang* and the invocations are often replaced with Islamic prayers, this ritual is still carried out in some form or another. Until the early 19th century, the teaching of Silat through the *gelanggang* system was largely informal and the methods may vary between different schools of Silat. In 1840, Syeikh Abd.Rahman Tohir, a Silat master hailing from [Pattani](/wiki/Pattani_Province) is said to had established a Silat education system called *Gelanggang Bangsal* in [Pendang](/wiki/Pendang), [Kedah](/wiki/Kedah). The system seek to embody the various aspects of Silat including the art, defense, music and spiritual into a standard Silat education for the masses. In 1976, Haji Anuar Abdul Wahab initiated the development of a Silat [curriculum](/wiki/Curriculum) based on the *gelannggang bangsal* system, which in turn became the basis of Seni Silat Malaysia curriculum. ## Music The silat performance, either in the form of competitive sport, or of highly stylized dance-like performance, are always accompanied by a type of music called 'martial arts drum' (*gendang silat*). Normally performed by a small orchestra, the music served to energize the performers and heighten the engagement of the audience in silat competitions and demonstrations for wedding receptions, official occasions, as well as for combat scenes in dramatic performances like [Bangsawan](/wiki/Bangsawan), [Mak yong](/wiki/Mak_yong) or [Mek Mulung](/wiki/Mek_Mulung) theaters. It is also increasingly performed on its own as music for festive occasions or casual gatherings. Gendang silat is predominant across the northern region of [Malay Peninsula](/wiki/Malay_Peninsula). The region prompted tunes and manners of playing that have been adopted as common practices by gendang silat performers elsewhere. There are two major ensemble styles originated from this region that differ in approaches to playing and musical repertoire; the west coast *lagu silat* style found in [Kedah](/wiki/Kedah) and its neighbours, and the east coast style of [Kelantan](/wiki/Kelantan), [Terengganu](/wiki/Terengganu) and [Pattani](/wiki/Pattani_province). In addition to these predominant styles, there are myriad vernacular styles, for example, upper [Pahang](/wiki/Pahang) two-drums and a gong ensembles that resemble those of their northern neighbours, but do not use a melodic instrument. Based on the instruments, the northern ensembles are relatively similar. Both include a pair of gendang barrel-shaped drums of two sizes, the larger of the pair is referred as the 'mother' drum (*pengibu* or just *ibu*) and the smaller one as the 'child' (*penganak* or *anak*). Included in the ensemble is a hanging knobbed gong that may vary in size, shape and material construction. The gendang play loud rhythms in interlocking style, accenting specific beats. On every other beat, the knobbed gong is struck with a padded beater. Melodies are played using a reef aerophone called *serunai*. It is generally blown using a circular or continuous breathing technique, and provides a lively melodic line in eighth- and sixteenth- note movement throughout the silat performance. The music is polyphonic and features a melodic line, percussive rhythmic patterns and a periodic gong unit played on the single gong. It begins in a slow tempo and accelerates until the performance climaxes. Gendang silat tunes are categorised into three separate repertoires depending on their performance context. The first being the martial art pieces (*lagu silat*, *paluan silat*), which accompany combat demonstrations of silat, and [muay thai](/wiki/Muay_thai) (*tomoi*) for wedding receptions, competitions, and other public events. They are usually named based on their origins; for example *Lagu Silat Kedah* ('Kedah martial arts piece') and *paluan Kelantan* ('Kelantan drumming'). Next are the processional tunes (*lagu berarak*) which are pieces played for short parades heralding the arrival of dignitaries such as newlyweds or government officials. They can be in the form of specific parade music or inspired from local folk tunes. There are also entertainment pieces (*lagu hiburan*) that are often played on the same occasions as the previous two categories, as well as in casual gatherings at private home and training centers (*gelanggang*). This large heterogeneous category includes among its sources folk tunes, old Malay pop songs as well as various interpretations of both global and regional tunes. Gendang silat music in general, functions to reflect and enliven the various phases of a silat demonstration and competition. A good example of how music and movement interrelate may be seen and heard in a piece known as *Lagu Silat Kedah* which is used as the current standard gendang silat competition piece. ## Performance Silat can be divided into a number of types, the ultimate form of which is duel silat. In this type, the opponents can be either one group against another or between individuals, performing either a real combat or an entertaining performance for the audience. Another type of silat is called ritual silat held upon commonly during the shamanic ritual rites and performances. For instance, the ritual silat is an integral part of the healing rite of *main puteri*, featuring an unarmed duel performed by a warrior shaman accompanied by war tune. A type of ritual silat also called *silat yawor* in Pattani, is a silat dance with a *[kris](/wiki/Kris)* performed within the [Burung Petala Processions](/wiki/Burung_Petala_Processions). Ritual silat is also performed during the ritual ceremony of paying homage to either martial or performing art masters, known as *adat sembah guru* or *[wai khru](/wiki/Wai_khru)* in Southern Thailand. Silat practitioners believe that by showing respect to their teacher during the ceremony, it will ensure their success during the performance. It is a traditional pre-performance rite that contributes to their confidence and safety that silat practitioners maintain no matter what type of silat they perform. The third type of silat is called silat dance that aims to highlight the dramatic features of the silat's movements, poses and its transitions. This type of silat includes both solo and pair performances and comes with elegant dance-like sequences, performed with the accompaniment silat music. It functions as a means of entertainment or celebration through dance and may sometimes used for light contact game. Silat dance is commonly incorporated in either highly choreographed performances like in traditional theatres and demonstrations, or in more spontaneous performances like in wedding silat. It is usually incorporated in dramatic performances like [Bangsawan](/wiki/Bangsawan), [Mak yong](/wiki/Mak_yong) or [Mek Mulung](/wiki/Mek_Mulung) theatres. An example of silat from this category is called *silat taghina* in Southern Thailand normally performed with slow tempo music. Other example which is the most prominent of this category is called *silat pulut*. Literally means 'sticky rice silat' in Malay, it was named after the [sticky rice](/wiki/Sticky_rice) or *pulut* which traditionally presented to players after performance. It goes by various other names such as *gayong pulut*, *silat tari* ('dance silat'), *silat sembah* ('obeisance silat'), *silat pengantin* ('wedding silat') and *silat bunga* ('flower silat'). ### Silat Pulut Silat pulut utilises agility in attacking and defending oneself. In this exercise, the two partners begin some distance apart and perform freestyle movements while trying to match each other's flow. One attacks when they notice an opening in the opponent's defences. Without interfering with the direction of force, the defender then parries and counterattacks. The other partner follows by parrying and attacking. This would go on with both partners disabling and counter-attacking their opponent with locking, grappling and other techniques. Contact between the partners is generally kept light but faster and stronger attacks may be agreed upon beforehand. In another variation which is also found in Chinese [qinna](/wiki/Qinna), the initial attack is parried and then the defender applies a lock on the attacker. The attacker follows the flow of the lock and escapes it while putting a lock on the opponent. Both partners go from lock to lock until one is incapable of escaping or countering. Silat pulut is held during leisure time, the completion of silat instruction, official events, weddings or festivals where it is accompanied by the rhythm of *gendang silat* (silat drums) or *tanji silat baku* (traditional silat music). As with a [tomoi](/wiki/Muay_Thai) match, the speed of the music adapts to the performer's pace. British colonists introduced western training systems by incorporating the police and [sepoys](/wiki/Sepoy) (soldiers who were local citizens) to handle the nation's defence forces which at that time were receiving opposition from former Malay fighters. Consequently, silat teachers were very cautious in letting their art become apparent because the colonists had experience in fighting Malay warriors. Thus silat pulut provided an avenue for exponents to hone their skills without giving themselves away. It could also be used as preliminary training before students are allowed to spar. Despite its satirical appearance, silat pulut actually enables students to learn moves and their applications without having to be taught set techniques. Partners who frequently practice together can exchange hard blows without injuring each other by adhering to the principle of not meeting force with force. What starts off as a matching of striking movements is usually followed by successions of locks and may end in groundwork, a pattern that is echoed in the modern [mixed martial arts](/wiki/Mixed_martial_arts). ### Others Silat performance in Southern Thailand can be categorised in a number of ways. Based on the tempo of movements, it can be divided into four types, *Silat Tari Yuema* consisting medium-paced movements, *Silat Tari Lagoh Galae* with its fast sequences, *Silat Tari Eena* with its slow, flowing and beautiful movement sets, and lastly *Silat Tari Sapaelae* with its very quick movements imitating a warrior in battle. Another categorisation is based on the mode of the performance and the type of movement featured, either with weapons or bare hand. *Silat Yatoh* is performed as a contest using the rules of attack and defense, in which a pair of combatants take turns attacking and defending. Secondly, *Silat Tari* refers to a silat featuring graceful bare-handed stances and movement sequences choreographed to the music's tempo, which traditionally performed for royalty and high dignitaries. The third type is *Silat Kayor* that features combat using *kris* usually performed at night for entertainment. ## Weapons WeaponDefinition[Kris](/wiki/Kris)A dagger which is often given a distinct wavy blade by folding different types of metal together and then washing it in acid.[Parang](/wiki/Parang_(knife))Machete/ broadsword, commonly used in daily tasks such as cutting through forest growth.[Golok](/wiki/Golok)TombakSpear/ javelin, made of wood, steel or bamboo that may have dyed horsehair near the blade.LembingTongkatStaff or walking stick made of [bamboo](/wiki/Bamboo), steel or wood.[Gedak](/wiki/Gada_(mace))A mace or club usually made of iron.KipasFolding fan preferably made of hardwood or iron.[Kerambit](/wiki/Kerambit)A concealable claw-like curved blade that can be tied in a woman's hair.[Sabit](/wiki/Kama_(weapon))Sickle commonly used in farming, harvesting and cultivation of crops.[Trisula](/wiki/Trisula)Trident, introduced from India[Tekpi](/wiki/Tekpi)Three-pronged truncheon thought to derive from the trident.ChindaiWearable [sarong](/wiki/Sarong) used to lock or defend attacks from bladed weapons.SampingRantaiChain used for whipping and seizing techniques ## In popular culture ### Literature The exploits of Malay warriors are prominently featured in many classical texts in Malay history. The [Malay Annals](/wiki/Malay_Annals) for example, contains stories of heroic struggles of a number of warrior figures like [Badang](/wiki/Badang), or even a female warrior like [Tun Fatimah](/wiki/Tun_Fatimah). Although not specifically mentioning the term 'silat', the annals did narrates the demonstration of *berlayam* (dancing with a sword and shield) of a Melakan warrior, an indication that the silat's dance-like and graceful movements have been in existence since the days of [Melaka Sultanate](/wiki/Melaka_Sultanate). In addition to the annals, accounts of the adventure of Malay warriors can also be found in another classical text, *[Hikayat Hang Tuah](/wiki/Hikayat_Hang_Tuah)*. The epic literature tells the stories of [Hang Tuah](/wiki/Hang_Tuah) and his four companions, who with their exceptional skill in martial art and warfare, rose in fame to become the Melaka's foremost *[Hulubalang](/wiki/Hulubalang)*. The text also recounts arguably the most famous silat duel in literature, that is the kris-fighting between Hang Tuah and one of his companions, [Hang Jebat](/wiki/Hang_Jebat). Various artistic genres have attempted to re-interpret and re-invent this epic over at least the last hundred years. The *Hikayat Hang Tuah*, in full or in part, has been recast as movies, short stories or novels, comics, plays, musicals, stories, novels and poems. Another notable literary text, the *[Hikayat Merong Mahawangsa](/wiki/Hikayat_Merong_Mahawangsa)* contains similar theme of the adventure of the warrior king [Merong Mahawangsa](/wiki/Merong_Mahawangsa) who founded the ancient [Kedah](/wiki/Kedah) state. In *Hikayat Malim Deman*, the detailed silat movements are mentioned in a [pantun](/wiki/Pantun) to describe the agility and powerful martial art skill of the main character in defeating his foes in his quest. By the 18th century, the term 'silat' was first mentioned in a literary text called *Misa Melayu*, though it tends to refer as ‘martial art’ in general. Silat movements or *bunga* and dance, are the main components of the tradition of *bersilat*, that became part of the repertoire of *[Hikayat Awang Sulung Merah Muda](/wiki/Hikayat_Awang_Sulung_Merah_Muda)*. The *Hikayat Pahang*, a historical literature that covers the period of the 19th century, is concerned on several wars fought by the state of [Pahang](/wiki/Pahang) like [Pahang Civil War](/wiki/Pahang_Civil_War) and [Klang War](/wiki/Klang_War), and also contain the exploits of famous silat masters in Pahang history, like [Tok Gajah](/wiki/Tok_Gajah), [Dato' Bahaman](/wiki/Dato%27_Bahaman) and [Mat Kilau](/wiki/Mat_Kilau). Malay [oral literature](/wiki/Oral_literature) also contains stories of prominent warriors, some of which are associated with real historical figures, while others are considered folk tales. The legend of [Siti Wan Kembang](/wiki/Siti_Wan_Kembang) is one of such stories, that recounts the life of a Queen thought to have ruled [Kelantan](/wiki/Kelantan) in the 17th century. She was described as an expert sword fighter and horse rider who lead and won various battles. The legend of [Walinong Sari](/wiki/Walinong_Sari) on the other hand, tells the story of a princess of [Pahang](/wiki/Old_Pahang_Kingdom) renowned for her mastery in silat who had defeated a celestial king. ### Film Silat have been present in Malay cinema since the 1950s. Major studios centred in [Singapore](/wiki/Singapore), [Shaw Brothers](/wiki/Shaw_Brothers) and [Cathay-Keris](/wiki/Cathay_Organisation), have produced a number of well-known classics in a genre known as *purba* ('ancient') films, that features the traditional Malay warriors and silat, and largely based on fictional stories, folklores or even history. One particularly famous title was *[Hang Tuah](/wiki/Hang_Tuah_(film))* released in 1956. It is based on the *[Hikayat Hang Tuah](/wiki/Hikayat_Hang_Tuah)* and recognised as the first Malay movie to be fully shot in [Eastman colour](/wiki/Eastman_colour) film. Other notable titles include *Semerah Padi* (1956), *[Musang Berjanggut](/wiki/Musang_Berjanggut)* (1959), *[Pendekar Bujang Lapok](/wiki/Pendekar_Bujang_Lapok)* (1959), *Seri Mersing* (1961), *Hang Jebat* (1961), *Panglima Besi* (1964), *Enam Jahanam* (1969) and *Serikandi* (1969). By the late 70s and throughout the 1980s, when the centre of Malay film productions was shifted to [Kuala Lumpur](/wiki/Kuala_Lumpur), the popularity of *purba* films began to wane when Malay cinema was dominated by more female-oriented genres such as women's films, family melodramas and romance. There were however still emerged a number of fully-fledged and better choreographed action-martial arts films like *Loceng Maut* (1976), *Pendekar* (1977) and *Anak Sulong Tujuh Keturunan* (1982). While purba films became increasingly rare on-screen in the 90s, two films revisited the story of Hang Tuah, but combining both *purba* and modern setting, *Tuah* (1990) and XX-Ray II (1995). Similar setting are also applied in an [animated movie](/wiki/Animated_movie), *Silat Legenda* (1998), again based on the legend of Hang Tuah. In the year 2000s, silat was featured to varying degrees of importance in popular Malay movies such as *Jiwa Taiko*, *Gong*, *[KL Gangster](/wiki/KL_Gangster)*, *[Pontianak Harum Sundal Malam](/wiki/Pontianak_Harum_Sundal_Malam)*, and the colour remake of *[Orang Minyak](/wiki/Orang_Minyak)*. In 2004, *[Puteri Gunung Ledang](/wiki/Puteri_Gunung_Ledang_(film))* was released, it was a remake of a *purba* film of 1961 of [the same title](/wiki/Puteri_Gunong_Ledang_(film)), and was promoted as an epic romance that draws on episodic tale of [Hang Tuah](/wiki/Hang_Tuah). It was Malaysia's first big-budget movie that featured two highly publicised fights choreographed by a silat exponent. By 2010s, fully-fledged action-martial arts films regained its popularity in Malaysia, which successfully embraced the modern setting for its plot, rather than the traditional *purba*-style. Films like *[Wira](/wiki/Wira_(film))* (2019) and *[Geran](/wiki/Geran_(film))* (2019) are among the examples. *[Queens of Langkasuka](/wiki/Queens_of_Langkasuka)*, released in 2008, is the first Thai film to prominently feature silat. Among the few other Thai movies to do so is 2008's *[Ong-Bak 2](/wiki/Ong-Bak_2)* which only briefly features a style of tiger silat. The 2014 Brunei movie *[Yasmine](/wiki/Yasmine_(film))* is about a teenage female protagonist who learns silat. ### Television *Purba* genre also made its way to the television and reached its peak during the 1990s when directors like Uwei Shaari strove to depict silat in its original form by casting martial artists rather than famous actors. Series from that period such as *Keris Lok Tujuh*, *Pendekar: Bayangan Harta* and *Keris Hitam Bersepuh Emas* are still regarded as the country's best costume dramas before the genre began to decline in Malaysia after the early 2000s. Various styles of silat are regularly showcased in martial arts-themed documentary serials like *Mahaguru*, *Gelanggang* and *Gerak Tangkas*. In 2019, Malaysia's very own '[Ultraman Ribut](/wiki/Ultraman_(character))' joins the ranks of the legendary 50-decade spanning Japanese giant superheroes in the *[Ultra Galaxy Fight: The Absolute Conspiracy](/wiki/Ultra_Galaxy_Fight)* mini-series. Ultraman Ribut uses a unique fighting style which is a mix of acrobatics and silat martial arts techniques to fight off monsters. - [Silat](/wiki/Silat) - [Pencak Silat](/wiki/Pencak_Silat) - [Silambam](/wiki/Silambam) - [Arnis](/wiki/Arnis) - [Lethwei](/wiki/Lethwei) - [Kun Bokator](/wiki/Kun_Bokator) ## Bibliography - Silat Melayu News Martial Arts Community Malaysia - Culture Silat (French)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:54:00.812152",
  "title": "Silat Melayu",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Silat_Melayu"
}