{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:54:04.001624"
  },
  "content": "Defunct regional airline of Singapore (1989–2021) **SilkAir Singapore Private Limited**, operating as **SilkAir**, was a Singaporean [regional airline](/wiki/Regional_airline) with its head office in Changi, [Singapore](/wiki/Singapore). It was a wholly owned [subsidiary](/wiki/Subsidiary) of [Singapore Airlines](/wiki/Singapore_Airlines) and in 2017, operated scheduled passenger services from Singapore to 54 cities in [Southeast Asia](/wiki/Southeast_Asia), the [Indian subcontinent](/wiki/Indian_subcontinent), [East Asia](/wiki/East_Asia), and [Northern Australia](/wiki/Northern_Australia). As the regional wing of Singapore Airlines, it served the short to medium-haul destinations in the Singapore Airlines Group network. By the end of 2021, SilkAir ceased operations, with all flights transferred to its parent company [Singapore Airlines](/wiki/Singapore_Airlines) or its low-cost affiliate [Scoot](/wiki/Scoot). ## History The airline had its roots as a regional air-charter company as **Tradewinds Charters** formed in 1975, serving leisure destinations using planes predominantly leased from parent airline [Singapore Airlines](/wiki/Singapore_Airlines). Scheduled services were introduced as **Tradewinds Airlines** on 21 February 1989, when it leased [McDonnell Douglas MD-87](/wiki/McDonnell_Douglas_MD-87) aeroplanes for services to 5 destinations: [Pattaya](/wiki/U-Tapao_International_Airport), [Phuket](/wiki/Phuket_International_Airport), [Hat Yai](/wiki/Hat_Yai_International_Airport), and [Kuantan](/wiki/Kuantan) from Singapore's [Changi Airport](/wiki/Changi_Airport), and [Tioman](/wiki/Tioman) from Singapore's [Seletar Airport](/wiki/Seletar_Airport). As the carrier matured, regional business destinations such as [Jakarta](/wiki/Jakarta), [Phnom Penh](/wiki/Phnom_Penh), and [Yangon](/wiki/Yangon) were added to its network, thereby broadening the airline's appeal beyond the holiday-maker to include the business traveller. A major marketing overhaul was started in 1991, culminating on 1 April 1992, by giving the airline its present name and logo as a new corporate identity. The re-branded airline utilised up to six of the new [Boeing 737-300s](/wiki/Boeing_737#737-300) introduced just a year earlier. The mid-1990s saw two [Airbus A310-200](/wiki/Airbus_A310) aircraft in use and the expansion of services to [India](/wiki/India) as well as mainland China. It was the first Asian carrier to offer handheld portable video-on-demand (VOD) [in-flight entertainment](/wiki/In-flight_entertainment) in the form of the *DigEplayer* 5500, available on flights to selected countries. On 10 April 2015, SilkAir launched a new collection of uniforms, the fourth uniform change in over 26 years. There are two variations of the uniform - aqua-blue for junior crew and a plum-red version for senior crew. Both variations are accompanied by a dark blue skirt. For the year ending 31 March 2015, the airline flew over 3.5 million passengers and made an operating profit of [S$](/wiki/S$)40.8 million. SilkAir announced the appointment of Foo Chai Woo as Chief Executive as of 18 May 2016, succeeding Mr Leslie Thng. On 29 October 2017, SilkAir took over [Scoot](/wiki/Scoot)'s services to [Yangon](/wiki/Yangon). With the transfer, the airline boosted its Yangon operations to 15 non-stop services a week. On 30 October 2017, SilkAir launched its inaugural flight to [Hiroshima](/wiki/Hiroshima), marking the first Japanese destination that SilkAir has added to its network. On 22 November 2018, SilkAir announced plans to transfer 17 routes to [Scoot](/wiki/Scoot) including [Luang Prabang](/wiki/Luang_Prabang), [Chiang Mai](/wiki/Chiang_Mai), [Kota Kinabalu](/wiki/Kota_Kinabalu), [Yogyakarta](/wiki/Yogyakarta) and [Wuhan](/wiki/Wuhan) over the months of April 2019 to July 2020, ahead of its merger with [Singapore Airlines](/wiki/Singapore_Airlines) in the late 2020 or early 2021. By the end of 2021, SilkAir had ceased operations and gradually finished integration into its parent company, [Singapore Airlines](/wiki/Singapore_Airlines). ## Corporate affairs ### Business trends The key business trends for SilkAir are shown in the following table (as at year ending 31 March): 200920102011201220132014201520162017201820192020Revenue ([S$m](/wiki/Singapore_dollar))546.3538.5670.3750.8846.0856.6902.5965.7990.31,020.31,030.9906.0Operating profit (S$m)33.649.2121.4104.696.734.540.890.6100.842.515.2−112.3Number of employees8769441,1161,1921,3601,4621,4521,5731,6321,5741,4841,389Number of passengers (000s)1,9542,3562,7643,0323,2953,4113,5533,8364,1064,6874,9024,440Passenger load factor (%)72.577.176.475.773.669.670.271.570.873.476.277.3Number of aircraft (at year end)161818202224272930323331*Sources* ## Destinations At the end of April 2021, SilkAir's network covered three destinations – Cebu, Kathmandu and Singapore. ### Codeshare agreements SilkAir had [codeshare agreements](/wiki/Codeshare_agreement) with the following airlines: - [Air China](/wiki/Air_China) - [Air France](/wiki/Air_France) - [Air New Zealand](/wiki/Air_New_Zealand) - [Bangkok Airways](/wiki/Bangkok_Airways) - [Fiji Airways](/wiki/Fiji_Airways) - [Garuda Indonesia](/wiki/Garuda_Indonesia) - [KLM](/wiki/KLM) - [Lao Airlines](/wiki/Lao_Airlines) - [Malaysia Airlines](/wiki/Malaysia_Airlines) - [Scoot](/wiki/Scoot) - [Shenzhen Airlines](/wiki/Shenzhen_Airlines) - [Virgin Australia](/wiki/Virgin_Australia) - [Vistara](/wiki/Vistara) ## Fleet Throughout its existence, SilkAir operated the following aircraft: SilkAir former fleet AircraftTotalIntroducedRetiredReplacementNotes/references[Boeing 737-300](/wiki/Boeing_737-300)619902000Airbus A320-2009V-TRF crashed as [Flight 185](/wiki/SilkAir_Flight_185).[Airbus A310-200](/wiki/Airbus_A310-200)219931995None[Airbus A319-100](/wiki/Airbus_A319-100)819992020Boeing 737-800[Airbus A320-200](/wiki/Airbus_A320-200)1919982020Boeing 737-800 Boeing 737 MAX 8[Boeing 737-800](/wiki/Boeing_737-800)1720142021NoneTransferred to [Singapore Airlines](/wiki/Singapore_Airlines) and [Virgin Australia](/wiki/Virgin_Australia).[*citation needed*][Boeing 737 MAX 8](/wiki/Boeing_737_MAX_8)620172021NoneAll aircraft and remaining orders transferred to [Singapore Airlines](/wiki/Singapore_Airlines).[Fokker 70](/wiki/Fokker_70)219952000Airbus A319-100[McDonnell Douglas MD-87](/wiki/McDonnell_Douglas_MD-87)119891991Boeing 737-300 ### Fleet development SilkAir began operations with one leased [McDonnell Douglas MD-87](/wiki/McDonnell_Douglas_MD-80) aircraft in 1989, before investing in its own fleet of six [Boeing 737-300s](/wiki/Boeing_737_Classic), the first of which began operations in 1990. It operated two [Airbus A310-200s](/wiki/Airbus_A310) for a brief period from 1993 to 1995 before they were transferred to Singapore Airlines, and two [Fokker 70s](/wiki/Fokker_70) from 1995 to 2000. It began replacing its Boeing fleet with Airbus aircraft when the first [Airbus A320-200](/wiki/Airbus_A320_family) arrived on 18 September 1998, and retired all Boeing aircraft a year later.[*citation needed*] Soon after its first A320 was delivered, SilkAir took delivery of its first A319-100 aircraft on 3 September 1999. The A319 was utilised on certain routes within Southeast Asia, and to some cities in India, while the larger A320 was used on most of the airline's major routes. On 20 December 2006, SilkAir signed an agreement to purchase 11 Airbus A320-200 aircraft with nine more on option. These aircraft were delivered between 2009–2012. On 3 August 2012, SilkAir had signed a [letter of intent](/wiki/Letter_of_intent) with [Boeing](/wiki/Boeing) for a purchase of 68 aircraft. The agreement includes a firm order for 23 [Boeing 737-800s](/wiki/Boeing_737_Next_Generation) and 31 [Boeing 737 MAX 8](/wiki/Boeing_737_MAX) aircraft, and purchase rights for another 14 aircraft. On 14 November 2012, the commitment was then converted to a firm order. The 737 aircraft will be used to replace the older A320 fleet and for the expansion of the airline. On 4 February 2014, SilkAir received its first Boeing 737-800 aircraft. On 4 October 2017, SilkAir received its first Boeing 737 MAX 8 aircraft. On 21 June 2018, [Singapore Airlines](/wiki/Singapore_Airlines) announced that it plans to transfer a number of [Boeing 737-800](/wiki/Boeing_737-800) to [Scoot](/wiki/Scoot) between late-2018 to early-2019 to better optimise the overall group's network. Following the [events of the Boeing 737 MAX](/wiki/Boeing_737_MAX_groundings), plans to transfer the Boeing 737-800 were suspended in April 2019. ## Services ### Cabins There were two classes of cabins available on all SilkAir flights — Business class and Economy class. In 2020, there were new lie-flat seats in Business class, and the installation of seat-back in-flight entertainment systems in both Business and Economy classes. Business class cabins consisted of leather seats with a seat pitch of between 39 and 40 inches and seat width between 20-22 inches. On [Boeing 737 MAX 8](/wiki/Boeing_737_MAX) aircraft, the seat pitch was increased significantly to 49 inches in Business Class with additional seat recline. Economy class cabins had a seat pitch of 31 inches and seat width between 17-18 inches. On [Boeing 737 MAX 8](/wiki/Boeing_737_MAX) aircraft there were seat-back tablet and phone holders, and personal in-seat USB charging ports. ### In-flight entertainment SilkAir offered a selection of newspapers and magazine titles on board and screened a series of short features on its 11-inch overhead dropdown screens. The *Silkwinds* inflight magazine was complimentary for all passengers. In-seat audio and power supply were available exclusively on its Boeing aircraft. 2014 saw the launch of SilkAir Studio as a complimentary wireless streaming service for its passengers. It was first available on its Boeing 737-800 aircraft before being progressively rolled out to its Airbus fleet. This system complemented the existing overhead systems. SilkAir Studio was introduced in 2014 where passengers were able to stream blockbuster hits, short features, and music, to their personal laptops and handheld devices via Wi-Fi. This system complemented the existing overhead systems. Passengers in Business Class on flights more than two hours were offered a tablet. In May 2017, the service was enhanced and upgraded to offer more than 150 international blockbuster movies and TV sitcom shows available on SilkAir Studio. For Apple users, the SilkAir Studio app had to be downloaded prior to flight in order to enjoy the in-flight entertainment. ### Dining SilkAir offered [Oriental](/wiki/Singaporean_cuisine) and [Western](/wiki/Western_cuisine) menus. Light snacks were also available on selected flights of less than one and a half hours. SilkAir launched their *All-Time Favourites* dishes in July 2016 where they served a selection of Asian, Western and local cuisine such as [Nasi Lemak](/wiki/Nasi_Lemak), [Hainanese Chicken Rice](/wiki/Hainanese_Chicken_Rice), Beef Tenderloin, etc. that Business Class passengers could pre-book meals before their flight. ### Frequent-flyer programs SilkAir shared the [KrisFlyer](/wiki/KrisFlyer) frequent flyer program with its parent company, Singapore Airlines. However, unlike Singapore Airlines, SilkAir is not a member of [Star Alliance](/wiki/Star_Alliance), so frequent flyer miles on SilkAir flights may only be credited on the KrisFlyer programme, but not on other Star Alliance frequent flyer programs. ## Tradewinds Tours and Travel Tradewinds Tours and Travel Private Limited was a wholly owned subsidiary of SilkAir, providing [package tours](/wiki/Package_tour) to destinations flown by the airline, as well as chartered flights within the [Asia](/wiki/Asia) region. The company was incorporated in 1975, and became a fully licensed tour operator in 1984. SilkAir, the regional wing of Singapore Airlines, was once known as Tradewinds Charters at its founding in 1976, before earning its present name in 1991. The chartered operations hence continued to be handled by Tradewinds Tours and Travel. ## Accidents and incidents ### SilkAir Flight 185 On 19 December 1997, [SilkAir Flight 185](/wiki/SilkAir_Flight_185) registered as 9V-TRF, operated on a [Boeing 737-300](/wiki/Boeing_737_Classic) and piloted by Captain Tsu Way Ming, plunged into the [Musi River](/wiki/Musi_River,_Indonesia) in [Palembang](/wiki/Palembang), [South Sumatra](/wiki/South_Sumatra) during a routine flight from [Jakarta](/wiki/Jakarta) ,[Soekarno Hatta International Airport](/wiki/Soekarno_Hatta_International_Airport) [CGK](/wiki/CGK) to [Singapore](/wiki/Singapore) ,[Changi International Airport](/wiki/Changi_International_Airport) [SIN](/wiki/SIN), killing all 104 people on board. The crash was investigated by various groups, with different results. The Indonesian [NTSC](/wiki/National_Transportation_Safety_Committee) , who were lead investigators, stated that they were unable to determine the cause, while the U.S. [NTSB](/wiki/National_Transportation_Safety_Board) concluded that the crash resulted from an intentional act by a pilot, most likely the [captain](/wiki/Pilot_in_command). A civil lawsuit case against Parker Hannifin, the manufacturer of the PCU-dual servo unit essential in the 737's rudder control—and also suspected in causing the crashes of [United Airlines Flight 585](/wiki/United_Airlines_Flight_585) and [USAir Flight 427](/wiki/USAir_Flight_427) under [similar flight-event parameters](/wiki/Boeing_737_rudder_issues), had provided the NTSB the initial test results of the recovered PCU-dual servo unit from Flight 185 in 1997, but was later further independently investigated for litigation on behalf some families of Flight 185 passengers in a civil lawsuit against [Parker Hannifin](/wiki/Parker_Hannifin). The jury under the Superior Court in Los Angeles in 2004, which was not allowed to hear or consider the NTSB conclusions, decided that the crash was caused by a prominent issue inherent in other 737 crashes: a defective servo valve inside the Power Control Unit (PCU) which controls the aircraft's rudder, causing a rudder hard-over and a subsequent uncontrollable crash. The manufacturer of the aircraft's rudder controls and the families later reached an out of court settlement. It is the only fatal hull loss for SilkAir in its history. Media related to SilkAir at Wikimedia Commons - Singapore Airlines website - SilkAir at the [Wayback Machine](/wiki/Wayback_Machine) (archive index) - SilkAir aircraft Portals: - Singapore - Companies - Aviation\n",
  "language": "en",
  "processed_at": "2026-01-12T11:54:04.001343",
  "title": "SilkAir",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/SilkAir"
}