{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:49:41.522451"
  },
  "content": "Private university in Singapore (2005–2017)‹ The template *Infobox university* is being considered for merging. › **SIM University** (**UniSIM**) was a private university in [Singapore](/wiki/Singapore) that opened in 2005 before shutting down in 2017. The university was established and managed under the [Singapore Institute of Management](/wiki/Singapore_Institute_of_Management) (SIM) Group. It was the only private university in Singapore after [Nanyang University](/wiki/Nanyang_University). The university practiced an [open-door academic policy](/wiki/Open-door_academic_policy) towards working adults and offered only part-time programmes. Between 2010 and 2017, UniSIM was registered under the [Committee for Private Education](/wiki/Committee_for_Private_Education) (CPE). In 2016, UniSIM became the sixth autonomous university in Singapore after an invitation from Singapore's [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) (MOE). The university was restructured into an autonomous university, [Singapore University of Social Sciences](/wiki/Singapore_University_of_Social_Sciences) (SUSS) in 2017. ## History ### Open University Degree Programme (1994–2005) In 1992, SIM was selected by MOE to run the Open University Degree Programme (OUDP), in collaboration with [The Open University](/wiki/The_Open_University), United Kingdom (OUUK). In 1994, the first batch of SIM OUDP's 900 students studied only among three degree programmes. In 1998, the first graduation ceremony with 334 was graced by former Deputy Prime Minister of Singapore [Tony Tan](/wiki/Tony_Tan). In 2002, OUDP attained accreditation status and was renamed Singapore Institute of Management's Open University Centre (SIM-OUC) as one of SIM's autonomous entities. ### Establishment In 2005, SIM received the mandate from MOE to form SIM University (UniSIM) to forge upgrading opportunities for working adults from diverse academic qualifications and work experiences. Established on the foundation SIM-OUC, UniSIM took over more than 6,500 students from SIM-OUC studying in over 40 programmes. SIM-OUC students who graduated from 2006 and onwards were given a choice between a UniSIM or OUUK degree. UniSIM provides an avenue for working adults who have previously missed education opportunities to upgrade their qualifications and skills. The university also provides opportunities for working adult to pursue their passion or chart a different career course. The quality of the programmes is high, flexible and made accessible through e-learning to working adults. Many continuous education courses were made scalable to suit different organisations. ### Restructuring On 12 October 2016, Acting Minister for Education (Higher Education and Skills) [Ong Ye Kung](/wiki/Ong_Ye_Kung) announced that the Government invited UniSIM to become Singapore's sixth autonomous university. Subsequently, on 11 November 2016, the SIM governing council voted in favour of bringing the university under the ambit of MOE. In 2017, UniSIM was restructured into the [Singapore University of Social Sciences](/wiki/Singapore_University_of_Social_Sciences) and became Singapore's sixth autonomous university under the ambit of the MOE. It is no longer a member of the SIM Group. ## Wings by Yeo Chee Keong This sculpture was donated by Yeo Chee Keong and Anthony Teo to UniSIM. Mounted on a soft hue of Volga blue Ukrainian igneous granite pedestal, the work is meant to inspire UniSIM graduates to soar. ## UniSIM and SIM GE Generally, UniSIM and [SIM Global Education](/wiki/SIM_Global_Education) (SIM GE) are each recognized as SIM students despite the schools being different business units of the SIM Group. UniSIM was a private university which offered government subsidized programmes whereas SIM GE partners with the [University of London International Programmes](/wiki/University_of_London_International_Programmes), [RMIT University](/wiki/RMIT_University) etc. to offer their programmes in Singapore. ## Admission The university adopted open-door admission criteria. Requirements for prospective applicants to the undergraduate programmes were to have at least two GCE 'A' level passes or a polytechnic diploma, at least two years' work experience and to be a minimum of 21 years old. ## Notable alumni - [Adrian Tan](/wiki/Adrian_Tan) - Singaporean litigator and president of the [Law Society of Singapore](/wiki/Law_Society_of_Singapore). - [Aloysius Pang](/wiki/Aloysius_Pang) - Singaporean actor.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:49:41.522083",
  "title": "SIM University",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/SIM_University"
}