{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:54:15.321457"
  },
  "content": "Singaporean artist **Simryn Gill** (born 1959) is a [Singapore](/wiki/Singapore)-born artist who specializes in sculpture, photography, drawing, printmaking, writing, and publishing. Throughout her career, Gill has presented her art at several significant events, including Germany's [Documenta](/wiki/Documenta) art show and the [Venice Biennale](/wiki/Venice_Biennale), and is one of Australia's most famous contemporary artists. Gill lives between [Sydney, Australia](/wiki/Sydney,_Australia), and [Port Dickson, Malaysia](/wiki/Port_Dickson_(town)). ## Early life and career Although she was born in Singapore, throughout her childhood her family moved to Malaysia, India, and the United Kingdom, the latter being where she remained throughout her young adulthood. There, she met her future husband, a social anthropologist named Souchou Yao, with whom she would go on to have two children with. In 1987, the family settled in Australia, where she would attend the South Australian School of Art to pursue her interest in artistic expression. However, a few months into her degree, Gill dropped out of her courses, both as a result of her pressing responsibilities to help raise two young children and her increasing dissatisfaction with the lack of novelty in her studies. Despite these setbacks, Gill's art continued to gain respect and renown within the contemporary art community, with early collections of photographs such as *May 2006* and *Dalam* in particular receiving notable recognition. In 2007 and 2012, she was invited to [Kassel, Germany](/wiki/Kassel) to showcase her work at the quinquennial Documenta, one of the most well-known art shows in Europe. A year later, she was selected to represent Australia in the 55th Venice Biennale. Since these events, Gill's art has been exhibited in many cities worldwide, such as the [Museum of Modern Art](/wiki/Museum_of_Modern_Art) and the [Guggenheim](/wiki/Solomon_R._Guggenheim_Museum), both in [New York](/wiki/New_York_(state)). In 2015, Gill hosted her first major solo exhibition, *Hugging the Shore*, at the Centre of Contemporary Art in [Gillman Barracks](/wiki/Gillman_Barracks), Singapore. ## Style and works Gill's work is said to embody a sense of \"in-between-ness\", with pieces inspired by her various homes and the influence of place. She acknowledged the irony this brought to her 2013 feature in the Australian pavilion at the [Venice Biennale](/wiki/Venice_Biennale), saying \"mine is not a representative voice—in fact, it's entirely the opposite of that possibility … Representation is a very strange notion.\" Her work has been said to occupy a space of transition and compromise, taking small mementos and fleeting moments of everyday life to construct a sense of belonging. *Red Hot* (1992), a [Native American](/wiki/Native_Americans_in_the_United_States) headdress made from dried chilies, was made from Gill's homegrown chilies while she was completing projects from a 1950s boy scout manual with her son. This gentle incursion of the everyday into Gill's art is acknowledged in the foreword to the publication accompanying Gill's exhibition at the [Museum of Contemporary Art](/wiki/Museum_of_Contemporary_Art,_Sydney), Sydney, in 2008–09. Director [Elizabeth Ann Macgregor](/wiki/Elizabeth_Ann_Macgregor) characterizes her as \"an artist whose approach is rigorous yet sensual, conceptual yet tactile.\" Gill is a systematic collector, \"especially of books as objects of reverence and dispute\". *Roadkill* (1999–2000) features hundreds of items collected from the side of the road, including flattened plastic and discarded rubbish. In many of these works, audiences are invited to play with and reposition the items, leaving interpretation of meaning to the viewer. In addition to this, Gill often allows these subjects of her art to be openly exposed to the degrading forces of the environment, demonstrating the inherently ephemeral nature of man-made objects. Her photographic works often come in series. *My Own Private Angkor*, 2007–2009, spans 90 photographs taken in an abandoned and decaying housing development in Malaysia. The estate, once the fringe of Port Dickson, had been ransacked for anything of value and left to the elements. The name of the series alludes to \"the ruins of a civilization that had been suddenly curtailed\", that of the ancient city of [Angkor](/wiki/Angkor) in Cambodia. Similarly, the series *Standing Still* (2000) examines deserted and ruined architecture across the Malaysian peninsula following the country's [economic decline](/wiki/Economic_history_of_Malaysia). Books and words themselves are recurring themes and mediums in Gill's work. *Pearls* (2008) is a sparse publication full of images of strings of beads. On inspection, the reader discovers each bead is made from tightly wound strips of paper, cut from canonical texts like [Mao](/wiki/Mao_Zedong)'s 'Four Essays On Philosophy' and more mundane books, such as a tome on highland dress.[*page needed*] The exhibition variation of *Pearls, 9 Volumes of the Collected Works of Mahatma Gandhi* (2008–09), again invited visitors to touch and play with the volumes, now turned into boules-style balls. This preoccupation with words and the dismantling of the constraints they place on us is revisited in *Where to Draw the Line* (2011–2012), now housed in the collection of the [Museum of Modern Art](/wiki/Museum_of_Modern_Art). *[ArtAsiaPacific](/wiki/ArtAsiaPacific)* sees in these works a continual process of negotiation with words, a desire to reduce their impact and to make them physical and tactile: \"of course the real keepers and foot soldiers in this world of words are books, and Gill has employed an arsenal of them for her quietly revolutionary purposes\". ## Influences As a consequence of her experiences with travel throughout her life, Gill's art is inherently influenced by the landscapes, cultures, and communities that she has encountered, utilizing these experiences to incorporate evocative imagery and the associated emotion into her art. In particular, the empty spaces she deliberately places within many of her photographs and drawings manage to capture the dual fascination and apprehension that humanity holds towards the unknown. Connected with this, Gill tackles complex topics such as cultural exchange, globalization, the interactions of culture and nature, and the transformation of knowledge in a postcolonial society, demonstrating the impacts of those inherent feelings of fascination and apprehension on indigenous cultures and the environment as a whole. ## *Hugging the Shore* Gill's first solo exhibition *Hugging the Shore* marked a return from Malaysia to Singapore. The pieces featured in the exhibition dealt with subjects including migration, the passage of time, life, death, and the decay of things. *Like Leaves* from the \"Like Leaves\" (2015) series was the most recent addition to the show. Leaves of the sea apple tree were pinned to the wall in a grid format, each cropped into a 6 centimeter wide square. ## 55th Venice Biennale Gill represented Australia in the 2013 Venice Biennale, with the exhibition entitled *Here Art Grows on Trees*. Her exhibit replaced that of famous architect [Philip Cox](/wiki/Philip_Cox)’s Australian Pavilion, which had represented Australia at the Venice Biennale since 1988, with the structure scheduled to be removed the following December. Working with curator [Catherine de Zegher](/wiki/Catherine_de_Zegher), Gill produced three unique works for the festival. De Zegher described the inspiration for the exhibition as \"a space of negotiation between the small and the global, between nature and industry, as it reveals an understanding of the interconnectedness of all in a world in flux\". One displayed art piece consisted of Gill's traditional style of carefully collecting specific words to display them in a massive collage spanning twelve white panels. Another was a series of large cibachrome photographs taken of an open, abandoned mine system at dusk and dawn. Her most famous work produced for the event was the unconventional use of the Australian Pavilion itself. Challenging her audience to see her work as impermanent and transitory, Gill removed sections of the roof of the Australian pavilion, \"allowing each moment of the six month exhibition to be a unique snapshot.\" This exposure of the work changed it over time, both the beach house and the art stored within it slowly being altered by the surrounding environment, emphasizing nature's ability to reclaim structures and objects constructed by humans. ## Collections - [Solomon R. Guggenheim Museum](/wiki/Solomon_R._Guggenheim_Museum), New York City - [Museum of Modern Art](/wiki/Museum_of_Modern_Art), New York City - [San Francisco Museum of Modern Art](/wiki/San_Francisco_Museum_of_Modern_Art), San Francisco - [Tate](/wiki/Tate), London - [Art Gallery of New South Wales](/wiki/Art_Gallery_of_New_South_Wales), Sydney - [Queensland Art Gallery](/wiki/Queensland_Art_Gallery) & [Gallery of Modern Art](/wiki/Queensland_Gallery_of_Modern_Art), Brisbane ## Solo exhibitions Source: Gill is represented by Tracy Williams Ltd in New York City, and has held four solo exhibitions in the gallery: *Blue* (2014), *Simryn Gill | Nicole Cherubini* (2012), *Holding Patterns* (2010) and *Interiors* (2009). - *Simryn Gill: Stormy Days*, Jhaveri Contemporary, Mumbai (2015) - *Hugging the Shore,* NTU Centre for Contemporary Art, Singapore (2015) - *Here art grows on trees*, Australian Pavilion, 55th Venice Biennale (2013) - *Simryn Gill: Inland,* [Centre for Contemporary Photography](/wiki/Centre_for_Contemporary_Photography), Melbourne (2009) - *Simryn Gill: Gathering*, [Museum of Contemporary Art](/wiki/Museum_of_Contemporary_Art_Australia), Sydney (2008) - [Tate Modern](/wiki/Tate_Modern), London (2006) - Shiseido Gallery, Tokyo (2004) - [Art Gallery of New South Wales](/wiki/Art_Gallery_of_New_South_Wales), Sydney (2002) ## Group exhibitions Source: - *Storylines: Contemporary Art at the Guggenheim*, Solomon R. Guggenheim Museum, New York (2015) - *Apparitions: Frottages and Rubbings from 1860 to Now*, [Hammer Museum](/wiki/Hammer_Museum), Los Angeles (2015) - *Alluvial Constructs*, Octavia Art Gallery, New Orleans (2014) - *Sites of Reason: A Selection of Recent Acquisitions*, [Museum of Modern Art](/wiki/Museum_of_Modern_Art), New York (2014) - *Lasting Images*, [Solomon R. Guggenheim Museum](/wiki/Solomon_R._Guggenheim_Museum), New York (2013) - *5th [Moscow Biennale](/wiki/Moscow_Biennale) of Contemporary Art*, Moscow (2013) - *Considering Collage*, Jhaveri Contemporary, Mumbai (2013) - *Untitled* (12th [Istanbul Biennial](/wiki/Istanbul_Biennial)), Istanbul, Turkey (2011) - *Animism*, [Kunsthalle Bern](/wiki/Kunsthalle_Bern), Bern, Switzerland (2010) - *Provisions for the Future*, [Sharjah Biennial](/wiki/Sharjah_Biennial), UAE (2010) - *Transmission Interrupted*, [Modern Art Oxford](/wiki/Modern_Art_Oxford), Oxford, UK (2010) - *Revolutions – Forms That Turn*, [Biennale of Sydney](/wiki/Biennale_of_Sydney) (2008) - *News From Islands*, [Campbelltown Arts Centre](/wiki/Campbelltown_Arts_Centre), Campbelltown (2007) - documenta 12, Kassel, Germany (2007) - Living in the Material World, National Arts Centre, Tokyo, Japan (2007) - [Singapore Biennale](/wiki/Singapore_Biennale) (2006) - VIDEO: The controversy that’s gripped Australia’s arts industry (19 February 2025) Gill talks to [Sarah Ferguson](/wiki/Sarah_Ferguson_(journalist)) on *[7.30](/wiki/7.30)*, about the withdrawal of the commission of [Khaled Sabsabi](/wiki/Khaled_Sabsabi) to represent Australia in 2026, a week after his selection in February 2025\n",
  "language": "en",
  "processed_at": "2026-01-12T11:54:15.321182",
  "title": "Simryn Gill",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Simryn_Gill"
}