{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:54:23.869223"
  },
  "content": "Place in Singapore **Sin Ming** ([Chinese](/wiki/Chinese_language): 新民) is a housing estate located in the subzone of [Upper Thomson](/wiki/Upper_Thomson) in the town of [Bishan](/wiki/Bishan,_Singapore), Singapore. It is roughly situated between [MacRitchie Nature Reserve](/wiki/MacRitchie_Reservoir) and [Bishan-Ang Mo Kio Park](/wiki/Bishan-Ang_Mo_Kio_Park). It consists of both residential and industrial areas. Singapore's largest [Chinese Buddhist](/wiki/Chinese_Buddhist) temple, [Kong Meng San Phor Kark See Monastery](/wiki/Kong_Meng_San_Phor_Kark_See_Monastery), is located in the vicinity of Sin Ming. Residential homes includes a mixture of landed properties, condominiums and [Housing Development Board](/wiki/Housing_Development_Board) (HDB) blocks. Sin Ming Avenue HDB is part of [Bishan-Toa Payoh Group Representation Constituency](/wiki/Bishan-Toa_Payoh_Group_Representation_Constituency), while Sin Ming Road HDB is part of [Marymount Single Member Constituency](/wiki/Marymount_Single_Member_Constituency). ## Transportation Sin Ming got its own [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) (MRT) stations when [Bright Hill MRT station](/wiki/Bright_Hill_MRT_station) and [Upper Thomson MRT station](/wiki/Upper_Thomson_MRT_station) on the [Thomson–East Coast MRT line](/wiki/Thomson%E2%80%93East_Coast_Line) opened on 28 August 2021. This line links Sin Ming with the [Central Business District](/wiki/Central_Area,_Singapore) (CBD) of Singapore. ## Education The campus of [Ai Tong School](/wiki/Ai_Tong_School), a [Special Assistance Plan](/wiki/Special_Assistance_Plan) [primary school](/wiki/Education_in_Singapore#Primary_education) established in 1912 and affiliate to [Singapore Hokkien Huay Kuan](/wiki/Singapore_Hokkien_Huay_Kuan), is located in the Bright Hill Drive area of Sin Ming. It relocated its campus from its previous campus in [Ang Mo Kio](/wiki/Ang_Mo_Kio) to its current location in Sin Ming in 1992 to cope with rising student enrollment. The permanent campus of [Eunoia Junior College](/wiki/Eunoia_Junior_College), the 20th junior college in Singapore, is located in Sin Ming. ## Amenities Sin Ming is home to many companies related to the automotive industry. Examples include the Vicom Vehicle Inspection Centre, one of the authorized vehicle testing and inspection centres in Singapore, and an Independent Damage Assessment Centre (IDAC), an independent centre that assesses vehicles that were damaged in accidents for insurance purposes. The [Land Transport Authority of Singapore](/wiki/Land_Transport_Authority) (LTA) has a branch office in Sin Ming which houses its Vehicle and Transit Licensing division. The offices of Citicab and Comfort taxi companies, both under [ComfortDelGro](/wiki/ComfortDelGro) group, are also located in Sin Ming. It also has an NEA North East Office. Thomson Combined Temple and Tian Leong Keng are two united temples that also located in Sin Ming. Sin Ming is one of the few places where funeral-related services are available. The Bright Hill Crematorium and Columbarium, located within [Kong Meng San Phor Kark See Monastery](/wiki/Kong_Meng_San_Phor_Kark_See_Monastery), provides crematoria services and facilities to store ashes of the deceased. The other crematorium and columbarium are located in Tse Tho Aum Temple, another [Buddhist temple](/wiki/Buddhist_temple) along Sin Ming Drive. In 2007, the government announced that it would construct a purpose-built funeral parlour in Sin Ming. This plan was met with fierce opposition by nearby residents, since local superstitions associate death and dying with bad luck. Residents were also concerned that the value of their properties will decrease as a result of the funeral parlour. In response, the government promised that the area would not become a \"funeral parlour hub\" and that the parlour would be located in the industrial area and thus away from the residential estates. Despite the negative associations of living near a columbarium, a study of property prices of properties in Sin Ming by the Singapore Real Estate Exchange found that a flat near the columbarium fetched a higher price as compared to a larger flat of similar age that was further away from the columbarium. The study concluded that the effects of the columbarium on housing prices in the area was offset by the presence of amenities like popular schools. ## Controversy Sin Ming is home to many free-ranging chickens. A National Parks Board investigation in March 2022 showed there were 69 chickens in the area, up from 50 in 2017. A task force was created to control the chicken population, using strategies like relocation to avoid culling the chickens, which led to outcry when conducted in 2017.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:54:23.868952",
  "title": "Sin Ming",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sin_Ming"
}