{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:54:16.114392"
  },
  "content": "Singaporean politician **Sin Boon Ann** ([Chinese](/wiki/Simplified_Chinese_characters): 陈文安; [pinyin](/wiki/Pinyin): *Chén Wén-ān*; born 19 March 1958) is a Singaporean former politician. He was the [Member of Parliament](/wiki/List_of_Singapore_MPs) for [Tampines Group Representation Constituency](/wiki/Tampines_Group_Representation_Constituency) from 1997 to 2011, where he was replaced by then Minister of Education [Heng Swee Keat](/wiki/Heng_Swee_Keat). Sin is currently the deputy managing director of the Corporate & Finance Department at [Drew & Napier](/wiki/Drew_%26_Napier), and used to serve as a lecturer at the [law faculty of the National University of Singapore](/wiki/National_University_of_Singapore_Faculty_of_Law) between 1988 and 1992. ## Education Sin received his primary, secondary, and pre-university education at [Anglo-Chinese School](/wiki/Anglo-Chinese_School). He graduated with a Bachelor of Arts from the National University of Singapore in 1982, followed by a Bachelor of Laws from the same institution in 1986. Sin subsequently attained the Master of Laws at the University of London in 1988, through a university scholarship. ## Career Sin has been the deputy managing director of the Corporate & Finance Department at Drew & Napier LLC since 2009, where he is principally engaged in corporate finance and mergers and acquisitions. He was a Member of Parliament for Tampines GRC from 1996 to 2011. During his tenure in Parliament, Sin was a member of the Government Parliamentary Committee for Health and Defence and Foreign Affairs from 2009 to 2011. Prior to his career in politics and private practice, Sin taught Public Law at the Faculty of Law of National University of Singapore from 1987 to 1992. Sin was a member of the Infocomm Development Authority of Singapore's Legal Panel on Convergence Issues Committee. In 1999, he was also a member of the government appointed Company Legislation and Regulatory Framework Committee to review Singapore's company law and regulatory framework, and make recommendations for achieving global standards and promoting a competitive economy. ## Directorships ### Present - [Rex International Holding Limited](/wiki/Rex_International_Holding_Limited) - SE Hub Ltd - OSIM International - OUE Limited - Tampines Central Community Foundation Limited - Courage Marine Group Limited (Incorporated in Bermuda) - Transview Holdings Limited - The Farrer Park Company - CSE Global Limited - DrewCorp Services Pte Ltd - Drew & Napier LLC ### Past - [HRnetGroup Limited](/wiki/HRnetGroup) - MFS Technology Ltd - HealthSTATS International Pte Ltd - Japan Land Ltd - Freshfields Drew & Napier Pte Ltd - Overseas Union Enterprise Limited - Auric Pacific Group Limited - China Coke & Chemicals Pte Ltd - Singapore Totalisator Board (Statutory Board) ## Personal life Sin is married with three children. He is a Methodist. - Parliament of Singapore CV of MPs This article about a politician from Singapore is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:54:16.114072",
  "title": "Sin Boon Ann",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sin_Boon_Ann"
}