{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:59.795410"
  },
  "content": "Government agency**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore Customs\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2008)* *(Learn how and when to remove this message)*This article **possibly contains original research**. Please improve it by verifying the claims made and adding inline citations. Statements consisting only of original research should be removed. *(March 2008)* *(Learn how and when to remove this message)*This article **may rely excessively on sources too closely associated with the subject**, potentially preventing the article from being verifiable and neutral. Please help improve it by replacing them with more appropriate citations to reliable, independent sources. *(August 2018)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Law enforcement agency The **Singapore Customs** is a [department](/wiki/Organisation_of_the_Government_of_Singapore) under the [Ministry of Finance](/wiki/Ministry_of_Finance_(Singapore)) of the [Government of Singapore](/wiki/Government_of_Singapore). Singapore Customs was reconstituted on 1 April 2003, after the Customs and Excise Department and the Trade Facilitation Division and Statistics Audit Unit of [International Enterprise Singapore](/wiki/International_Enterprise_Singapore) (IE Singapore) were merged. The border function's at the land, air and sea checkpoints were also simultaneously transferred to [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority) (ICA). Singapore Customs serves as the lead agency for trade facilitation and revenue enforcement. It is also responsible for implementing customs and trade-related enforcement measures, including those pertaining to Free Trade Agreements and strategic goods. The headquarters is located in Revenue House along Newton Road, [Novena](/wiki/Novena,_Singapore). ## Goods and Services Tax (GST) Refund for Tourists The Tourist Refund Scheme (TRS) is administered by Singapore Customs on behalf of the [Inland Revenue Authority of Singapore](/wiki/Inland_Revenue_Authority_of_Singapore) (IRAS). The scheme allows tourists to claim a refund of the Goods and Services Tax (GST) paid on goods purchased from participating retailers if the goods are brought out of Singapore via Changi International Airport or Seletar Airport. ## History The Customs Department was founded when Singapore was the British Empire's [Straits Settlements](/wiki/Straits_Settlements) and later [Crown Colony](/wiki/Crown_Colony). Established in 1910 under the name Government Monopolies Department, Customs is one of the oldest tax-collecting organisations in modern Singapore to increase the country's state coffers to help fund national programmes. Revenue collection began in December 1909 when the first import duty was imposed on hard liquors. In 1916, the tariff was extended to include tobacco and cigarettes. The collection of duty on petroleum was introduced in 1934. Motor vehicles are also subject to tax and excise duties. Effective 1 January 2012, [compressed natural gas](/wiki/Compressed_natural_gas) (CNG) for motor vehicles is subject to tax and excise duty. The department has gone through many transitions, mergers, and re-organizations in the last century under the government of Singapore. The department's responsibilities in securing Singapore's future are affected by worldwide globalization, market forces and changes in laws, tariffs, trading and traveling trends. On 1 April 2003, the department was re-constituted as Singapore Customs - a government agency transferred to the Ministry of Finance of Singapore - providing essential services for revenue collection and enforcement, trade documentation, trade facilitation, and security functions as Singapore’s single authority on customs and trade regulatory matters. On 15 November 2019, the new Customs Operations Command building was officially opened at Bulim Drive off [Jalan Bahar](/wiki/Jalan_Bahar) in [Jurong West](/wiki/Jurong_West). This will allow for intelligence, investigation and compliance-related functions to come under the command. On 1 January 2025, Singapore Customs unveiled a refreshed logo. ## Primary roles and functions Singapore Customs' primary roles and functions are: - collection of customs revenue; - protection of customs revenue by preventing the evasion of duties and taxes; - provision of one-stop service for trade and customs matters, including issuance of permits, licenses and Certificates of Origin, and provision of classification and valuation advice; - facilitation of trade through simplification of customs procedures and administration of tax break schemes; - enforcement of trade requirements under the various Free Trade Agreements (FTAs); - regulation of trade in strategic goods and strategic goods technology; and - enforcement against the illegal buying and selling of all types of duty-unpaid tobacco and liquors. ## Organisational structure Singapore Customs is headed by a Director-General, who is supported by a Deputy Director-General, four Senior Assistant Directors-General, three Assistant Directors-General, two Directors (Data Division and Networked Trade Platform Office), a [Chief Human Resource Officer](/wiki/Chief_Human_Resource_Officer) and a [Chief Information Technology Officer](/wiki/Chief_Information_Technology_Officer). The functions of Singapore Customs are carried out by the following divisions and directorates: - Checkpoints Division - Compliance Division - Data Division - Human Resource Directorate - Information Technology Directorate - Intelligence & Investigation Division - Ops-Tech & Management Division - Planning, Communication & International Division - Trade Division Each branch within a division is typically headed by a Chief Superintendent of Customs or the non-uniformed equivalent. The Internal Audit Branch reports directly to the Director-General of Customs. Senior Management AppointmentRankAbbreviationNameDirector-General (Customs)Director-GeneralDGTan Hung HooiDeputy Director-General (Policy & Facilitation)Deputy Director-GeneralDDG (P&F)Lim Teck LeongChief Human Resource OfficerSenior Assistant Director-GeneralCHROKaren Lim Shu WenSenior Assistant Director-General (Checkpoints)Senior Assistant Director-GeneralSADG (CP)Sung Pik WanSenior Assistant Director-General (Compliance)Senior Assistant Director-GeneralSADG (C)Winston Tay Wee HuaSenior Assistant Director-General (Ops-Tech & Management)Senior Assistant Director-GeneralSADG (OTM)Teh Thiam SiongSenior Assistant Director-General (Intelligence & Investigation)Senior Assistant Director-GeneralSADG (I&I)Lee Boon ChongAssistant Director-General (Trade)Assistant Director-GeneralADG (T)Raine NgAssistant Director-General (Planning, Communication & International)Assistant Director-GeneralADG (PCI)Teo AngieAssistant Director-General (Intelligence & Investigation)Assistant Director-GeneralADG (I&I)Goh Hoon LipChief Information OfficerN.A.CIOCheryl Sim Hwee LengDirector, Data DivisionN.A.D(Data)Chong Soo YuenDirector, Networked Trade Platform OfficeN.A.D(NTPO)Choo Wai Yee ## Rank structure The rank structure of Singapore Customs is as such, in order of ascending seniority: RankAbbreviationRank InsigniaHigher Customs Officer IIHCO IIHigher Customs Officer IHCO ISenior Customs OfficerSCOChief Customs OfficerCCOSuperintendent of CustomsSCHigher Superintendent of CustomsHSCSenior Superintendent of CustomsSSCDeputy Chief Superintendent of CustomsDCSCChief Superintendent of Customs Senior Chief Superintendent of CustomsCSC SCSCAssistant Director-General of CustomsADGSenior Assistant Director-General of CustomsSADGDeputy Director-General of CustomsDDGDirector-General of CustomsDG - [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority) - [Inland Revenue Authority of Singapore](/wiki/Inland_Revenue_Authority_of_Singapore) - [Ministry of Finance (Singapore)](/wiki/Ministry_of_Finance_(Singapore)) - Singapore Customs Official Website - Secure Trade Partnership - Strategic Trade Scheme - National Authority (Chemical Weapons Convention) - TradeNet\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:59.795087",
  "title": "Singapore Customs",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Customs"
}