{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:59.282314"
  },
  "content": "Cruise terminal in Singapore The **Singapore Cruise Centre** ([abbrev](/wiki/Abbreviation): **SCC**; [Chinese](/wiki/Simplified_Chinese): 新加坡邮轮中心) is a [cruise](/wiki/Cruising_(maritime)) [terminal](/wiki/Berth_(moorings)) located in the south of [Singapore](/wiki/Singapore) next to [HarbourFront Centre](/wiki/HarbourFront_Centre) in the vicinity of [HarbourFront](/wiki/HarbourFront) and in [Keppel Harbour](/wiki/Keppel_Harbour), near [HarbourFront MRT station](/wiki/HarbourFront_MRT_station). ## History SCC was built in 1991 by the [Port of Singapore Authority](/wiki/PSA_International) (PSA). In 1998, it was upgraded at the cost of $23 million. It comprises two terminals, namely the International Passenger Terminal (IPT), and the Regional Ferry Terminal (RFT).[*citation needed*] The Singapore Cruise Centre Pte Ltd, which is owned by PSA, took over management of the centre on 1 April 2003 when PSA Corporation divested its non-core businesses. Additionally, SCC manages 2 other ferry terminals; [Tanah Merah Ferry Terminal](/wiki/Tanah_Merah_Ferry_Terminal) and Pasir Panjang Ferry Terminal. In total, SCC handles a throughput of over 7 million cruise and ferry passengers a year, of which about 950,000 are cruise passengers. The existing terminals at HarbourFront were renovated in 2008 to optimize the use of available space. The entire level 2 is a restricted area, for the exclusive use of cruise and [ferry](/wiki/Ferry) passengers who have cleared immigration and security.[*citation needed*] In 2013, [SATS](/wiki/SATS_Ltd) planned to buy over SCC for S$110 million. The acquisition plan was terminated in 2014. In 2016, fully owned subsidiary SCC Travel Services Pte Ltd (STS) was formed to inspire travel to the destinations connected to its terminal network. STS is a [B2C](/wiki/Direct-to-consumer) online [travel agent](/wiki/Travel_agency) retailing travel products from Bintan, Batam, Karimun and Singapore through its portal WOW Getaways. In 2024, it was announced that SCC would be closed and merged with the expanded [Marina Bay Cruise Centre](/wiki/Marina_Bay_Cruise_Centre_Singapore) to free up space along the [Greater Southern Waterfront](/wiki/Greater_Southern_Waterfront). ## Facilities The regional terminal at HarbourFront has six berths for ferries to various ports on the island of [Batam](/wiki/Batam), Indonesia, as well as [Tanjung Balai](/wiki/Tanjung_Balai_Karimun) on the [Karimun Islands](/wiki/Karimun_Islands).[*citation needed*] The terminal at Tanah Merah has four berths for ferries to the island of [Bintan](/wiki/Bintan), Indonesia, and the secondary [Batam](/wiki/Batam) port of Nongsapura.[*citation needed*] The terminal at Pasir Panjang has 4 berths for ferries that give passage to Singapore's industrial islands of [Bukom](/wiki/Pulau_Bukom) and [Semakau](/wiki/Pulau_Semakau).[*citation needed*] The IPT handles international [cruise ships](/wiki/Cruise_ship), and has two berths of 310 and 270 meters (1,020 and 890 feet) with a height limit of 52 meters (171 feet). It has a draft of 12 meters (39 feet). It underwent an upgrade in 2005 to improve its passenger handling facilities.[*citation needed*] ## Awards - Travel Weekly Asia - Best Cruise Port - 2016, 2017 - Singapore river cruise guide - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:59.281931",
  "title": "Singapore Cruise Centre",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Cruise_Centre"
}