{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:58:01.600904"
  },
  "content": "Holding company in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(September 2024)*This article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"Singapore Press Holdings\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2011)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore Press Holdings\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2024)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Singapore Press Holdings Limited** (**SPH**) was one of [Singapore](/wiki/Singapore)'s two [state media](/wiki/State_media) companies, which published *[The Straits Times](/wiki/The_Straits_Times)*, numerous other newspapers and operated radio, television and digital media. In 2021, the media division was spun off as [SPH Media](/wiki/SPH_Media), leaving behind the property and aged care businesses. Since its takeover by Cuscaden Peak in 2022, it has been renamed **Cuscaden Peak Investments**. At its peak, SPH had over 4,000 employees. Its team of approximately 1,000 journalists included [correspondents](/wiki/Correspondent) operating around the world. 2,500 of the staff, including the journalists and its media business were subsequently transferred to [SPH Media](/wiki/SPH_Media). The company was one of the country's \"blue-chip\" counters on the [Singapore Exchange](/wiki/Singapore_Exchange) Securities Trading Limited (SGX) until its delisting on 13 May 2022 following its acquisition by Cuscaden Peak. It was also a constituent of the [Straits Times Index](/wiki/Straits_Times_Index) until its removal on 22 June 2020. ## History This section's **factual accuracy may be compromised due to out-of-date information**. The reason given is: a general information gap between 2009 and 2021. Please help update this article to reflect recent events or newly available information. *(April 2022)* ### 1984: Formation of Singapore Press Holdings Singapore Press Holdings Limited was formed on 4 August 1984 through a merger of three organisations, The Straits Times Press Group, Singapore News and Publications Limited and Times Publishing Berhad. On 8 June 2000, [SPH MediaWorks](/wiki/SPH_MediaWorks) was set up with the aim of breaking into the broadcasting business, and received Singapore's second nationwide free-to-air terrestrial television broadcasting service licence on 26 April 2001. SPH soon afterwards launched two channels, [*Channel U*](/wiki/Channel_U_(Singaporean_TV_channel)) ([Mandarin](/wiki/Standard_Chinese)) on 6 May 2001 and [*TVWorks*](/wiki/Channel_i_(Singaporean_TV_channel)) (English) on 20 May 2001. On 3 March 2002, *TVWorks* was renamed to [*Channel i*](/wiki/Channel_i_(Singaporean_TV_channel)) with a new programming belt. On 31 December 2004, SPH sold its television operation to [Mediacorp](/wiki/Mediacorp), restoring Mediacorp's former monopoly status. *Channel i* was shut down on 1 January 2005, but *Channel U* continues to operate. Through a [merger](/wiki/Singapore_media_merger_of_2004), SPH retained a 20% stake in [Mediacorp](/wiki/Mediacorp)'s television operational, as well as 40% stake in [Today](/wiki/Today_(Singapore_newspaper)) newspaper. The [National Library Board](/wiki/National_Library_Board) and SPH signed an agreement in 2007 to make digitised articles of *[The Straits Times](/wiki/The_Straits_Times)* available for public access at NLB libraries. The digitised articles were made available at [NewspaperSG](/wiki/NewspaperSG) and was launched on 28 January 2010. In 2009, SPH celebrated its 25th anniversary and for the first time, changed its corporate logo. The new logo was launched on 30 March that year by former president [S. R. Nathan](/wiki/S._R._Nathan) and chairman [Tony Tan Keng Yam](/wiki/Tony_Tan_(Singaporean_president)). In 2013, SPH acquired sgCarMart. On 1 September 2017, former Chief of Defence Force and CEO of [Neptune Orient Lines Limited](/wiki/Neptune_Orient_Lines_Limited) [Ng Yat Chung](/wiki/Ng_Yat_Chung) became the CEO of SPH, replacing [Alan Chan](/wiki/Alan_Chan). On 29 September 2017, SPH completed its sale of its stakes in [Mediacorp](/wiki/Mediacorp)'s television operational, and *[Today](/wiki/Today_(Singapore_newspaper)).* Mediacorp Press and Mediacorp TV Holdings ceased to be associated companies of SPH. In November 2019, SPH stopped publishing *Torque*, a motoring publication, and moved its operation digital while parking it under its subsidiary, sgCarMart. On 27 April 2020, SPH divested Buzz, a modern retail convenience chain, to Thai-Pore Enterprise for an undisclosed sum. Buzz was previously a wholly owned subsidiary under SPH. On 22 June 2020, SPH was removed from the [Straits Times Index](/wiki/Straits_Times_Index) (STI), which tracks 30 of the largest companies by market capitalisation listed on the mainboard of the [Singapore Exchange](/wiki/Singapore_Exchange) after a quarterly review of the constituents of the STI announced on 5 June that year. It was replaced by Mapletree Industrial Trust. On 13 October 2020, SPH, which published *[The Straits Times](/wiki/The_Straits_Times)* and *[The Business Times](/wiki/The_Business_Times_(Singapore))*, posted a net loss of $83.7 million for the full year. The loss was attributed to [COVID-19](/wiki/COVID-19_pandemic) which affected all major business segments. On 1 February 2021, SPH's events subsidiary Sphere Exhibits merged with Temasek's SingEx Holdings. ### 2021: Hiving off the media business SPH's readership has stagnated since the early-2000s, as Singaporeans increasingly turned to online media for their news consumption. On 6 May 2021, SPH in response to shareholder pressures, had proposed that it would restructure itself and transfer its media business into a [company limited by guarantee](/wiki/Company_limited_by_guarantee) (CLG), which would be privately managed. The new CLG would initially be managed by SPH management shareholders at the time, while still having to issue new management shares of the media business under the CLG as required by Newspaper and Printing Presses Act. The [government](/wiki/Government_of_Singapore) would also lift the shareholder limits on the currently listed SPH entity. [Khaw Boon Wan](/wiki/Khaw_Boon_Wan), a retired politician, was appointed as the chairman of the CLG. On 10 September 2021, an [extraordinary general meeting](/wiki/Extraordinary_general_meeting) was convened over the restructuring proposal to transfer all media business-related assets and staff to [SPH Media Trust](/wiki/SPH_Media_Trust). Approximately 97.55% of the 300 shareholders present voted in favour of the proposal. The transfer was completed on 1 December 2021. The assets transferred included its headquarters, the News Center, and its press, the Print Center, as well as all intellectual property and information technology assets. Along with the assets transfer, 2,500 staff were transferred to SPH Media Trust as well. ### 2022: Acquisition and delisting On 28 February 2022, consortium led by Toyota Financial Services Singapore acquired sgCarMart for S$150 million. Following its acquisition by Cuscaden Peak, SPH was delisted from the [Singapore Exchange](/wiki/Singapore_Exchange) on 13 May 2022. ## Ownership Prior to 1 December 2021, like all newspaper companies in Singapore, SPH was regulated by the Newspaper and Printing Presses Act (NPPA) of 1974 and issues both management and ordinary shares. As specified by the NPPA, all issues and transfers of management shares have to be approved by the [Ministry of Communications and Information](/wiki/Ministry_of_Communications_and_Information), and in \"any resolution relating to the appointment or dismissal of a director or any member of the staff\" the vote of one management share is equivalent to 200 ordinary shares. There were close ties between the directors of SPH and the Singapore Government. [S. R. Nathan](/wiki/S._R._Nathan), Director of the [Security and Intelligence Division](/wiki/Security_and_Intelligence_Division) and later President of Singapore served as SPH's Executive chairman from 1982 to 1988 and the first president (1994–2002) of SPH was Tjong Yik Min, former chief of the [Internal Security Department](/wiki/Internal_Security_Department_(Singapore)). The immediate former chairman of SPH, [Tony Tan](/wiki/Tony_Tan_(Singaporean_president)) was [Deputy Prime Minister of Singapore](/wiki/Deputy_Prime_Minister_of_Singapore) from 1994 to 2005 and [President of Singapore](/wiki/President_of_Singapore) from 2011 to 2017. After 1 December 2021, the regulations have been lifted due to the completion of the transfer of its media business into SPH Media Trust. ## Businesses ### Properties SPH owns retail properties [Paragon](/wiki/Paragon,_Singapore), [The Clementi Mall](/wiki/Clementi_Mall) and The [Seletar Mall](/wiki/Seletar_Mall). SPH's wholly owned subsidiary, Times Development Pte Ltd, has also developed a 43-storey upmarket residential condominium, Sky@eleven, at [Thomson](/wiki/Thomson,_Singapore) Road. ### Paragon REIT Paragon REIT (previously SPH REIT) is a Singapore-based [REIT](/wiki/REIT) established to invest in a portfolio of income-producing real estate primarily for retail purposes. Paragon REIT comprises three retail malls and one strip mall, [The Paragon](/wiki/The_Paragon,_Singapore), The [Clementi Mall](/wiki/Clementi_Mall), [The Rail Mall](/wiki/The_Rail_Mall), and [Westfield Marion](/wiki/Westfield_Marion). Paragon is a prime retail and office complex in the heart of [Orchard Road](/wiki/Orchard_Road), Singapore's main shopping belt. The Clementi Mall is a mid-market suburban mall in the centre of [Clementi](/wiki/Clementi,_Singapore) town. In December 2019, then SPH REIT acquired 50% ownership in Westfield Marion from [Scentre Group](/wiki/Scentre_Group). SPH REIT was renamed Paragon REIT in January 2023. ### Orange Valley SPH owns Orange Valley which operates nursing homes. ### M1 Limited In February 2019, it was announced that [Keppel Corporation](/wiki/Keppel_Corporation) and Singapore Press Holdings (SPH) had together obtained majority control of telco [M1](/wiki/M1_Limited), after Axiata accepted their joint offer of $2.06 a share for a 28.6 per cent stake. Later in March 2019, the telco said that Konnectivity, a company owned jointly by the two companies, would buy all of its remaining shares. - [Media Prima](/wiki/Media_Prima) - [New Straits Times Press](/wiki/New_Straits_Times_Press) - [Media Chinese International](/wiki/Media_Chinese_International) Library resources about **Singapore Press Holdings** - Resources in your library - Resources in other libraries **By Singapore Press Holdings** - Resources in your library - Resources in other libraries\n",
  "language": "en",
  "processed_at": "2026-01-12T11:58:01.600452",
  "title": "Singapore Press Holdings",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Press_Holdings"
}