{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:20.154024"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore Government Enterprise Architecture\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2009)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* The **Singapore Government Enterprise Architecture (SGEA)** programme was established to support and enable the [business strategies](/wiki/Business_strategy), [objectives](/wiki/Business_objectives), and a vision of a 'Networked Government'. It adopted a federated architecture approach similar to the [United States government](/wiki/United_States_government). It is a set of blueprints: the [Business Architecture](/wiki/Business_architecture) (BA), [Information Architecture](/wiki/Information_architecture) (IA), [Solution Architecture](/wiki/Solution_architecture) (SA) and [Technical Architecture](/wiki/Technical_architecture) (TA) of the [Singapore Government](/wiki/Singapore_Government). It provides a holistic view of business functions, common data standards, and shared ICT systems and infrastructure. This programme facilitates the identification of opportunities for [collaboration](/wiki/Collaboration) among agencies, encouraging greater sharing of data, systems and processes across agencies. ## History The SGEA is an offshoot of the Civil Service Computerization Programme (CSCP), which the Singaporean government launched in the 1980s to turn Singapore's public sector as a world-class exploiter of IT. The initial goal was the improvement of internal operational efficiencies through the automation of traditional work functions in the bureaucracy. Within twenty years, the Internet was integrated into the framework so that IT became a tool for public service delivery. By the year 2000, Singapore launched its own [e-government](/wiki/E-government) platform. The SGEA was adopted to drive the e-government initiative. The expectation for its adoption was that it will transform the public sector by optimizing end-to-end business processes and system capabilities so that they are aligned with the Singaporean government's needs, missions, and strategies. This is demonstrated in the way the government adopted frameworks that are customized according to its structure and components as well as the nature of its economy, socio-economic status, infrastructure status, and business status. This is the reason why the SGEA is analogous to a \"city plan that details policies and standards for the design of infrastructure technologies, databases, and applications.\" ## Reference Models The SGEA has four developed [reference models](/wiki/Reference_model): - Business Reference Model (BRM) - The BRM addresses the BA, and describes the Lines of Businesses and Business Functions performed by different [government agencies](/wiki/Government_agency). - Data Reference Model (DRM) - The DRM addresses the IA. It specifies the data definitions for data elements that are commonly used across government. - Solution Reference Model (SRM) - The SRM addresses the SA, and describes the systems and service components that can be shared across government. - Technical Reference Model (TRM) - The TRM is addressed by the Service-wide Technical Architecture (SWTA) established since 2002. - Government Enterprise Architecture in Singapore: Issues, Practices and Trends - Government Enterprise Architecture (SGEA)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:20.153710",
  "title": "Singapore Government Enterprise Architecture",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Government_Enterprise_Architecture"
}