{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:35.842665"
  },
  "content": "Former government organisation in Singapore The **Singapore Improvement Trust** (**SIT**) is a former [government organisation](/wiki/Government_organisation) that was responsible for [urban planning](/wiki/Urban_planning) and [urban renewal](/wiki/Urban_renewal) in Singapore. Formally established in 1927 under the Singapore Improvement Ordinance, it was modelled after similar organisations in India. The SIT initially carried out [back lane](/wiki/Back_lane) improvement schemes and marking out unsanitary buildings for demolition, but began constructing [public housing](/wiki/Public_housing) from 1935. After [World War II](/wiki/World_War_II), the SIT initially focused its efforts on the repair of residential developments damaged by the war. It resumed constructing public housing in 1947 but was unable to keep up with demand. The SIT was also involved in the development of a \"Master Plan\", which set out Singapore's developmental direction, from 1952 to 1958. In the late 1950s, plans were set out to replace the SIT with two departments—housing and planning—culminating in two bills that were passed in 1959. The following year, the SIT was dissolved with the establishment of the successor organisations by the [government of Singapore](/wiki/Government_of_Singapore), the [Housing and Development Authority](/wiki/Housing_and_Development_Board) and the Planning Authority. The SIT consisted of a Board of Trustees, two staff, and additional workers to conduct maintenance work, along with an Estates Department, established in 1947, which handled the land and developments of the organisation. A [property tax](/wiki/Property_tax) known as the Improvement Rate, rent revenue and government loans financed the SIT's projects. SIT assigned flats to applicants using a points system. ## History ### Background In the early 20th century, Singapore was experiencing rapid expansion and development, and the local government was unable to handle significant town improvement schemes. A 1907 report by a public health commissioner called for the construction of back lanes to facilitate the removal of human waste. The municipal authorities subsequently took up such work. A report by a housing commission in 1918 recommended that Singapore's urban planning be handled by a trust, similar to what had been done in India. In light of these developments, the Singapore Improvement Trust was established as a department of the [Municipal Commission](/wiki/Municipal_Commission_of_Singapore) in 1920, and was intended to control housing and planning in Singapore. Initially, the SIT carried out surveys of partially developed and undeveloped plots, surveys for road widening, and work on back lanes. Planning for urban renewal and housing schemes commenced in 1925. Nevertheless, the resources and powers provided to the SIT proved insufficient for it to carry out urban renewal. Moreover, a draft Town Improvement and Development bill that was to facilitate the SIT's work in town planning was rejected by the Singapore colonial government in 1924, leaving the position of the SIT unclear. After a committee report noted the SIT's necessity a bill to form the SIT as an independent organisation was prepared from June 1924. The resulting bill, the Singapore Town Improvement Bill, was introduced to the [Legislative Council](/wiki/Legislative_Council_of_the_Straits_Settlements) in February 1927. ### Establishment The Singapore Improvement Ordinance, signed into law on 1 July 1927, formally established the SIT. Its purpose was \"to provide for the Improvement of the Town and Island of Singapore\". The Ordinance applied to both the town and island of Singapore except for areas occupied by the British military. Upon its establishment, the SIT was tasked to prepare the \"General Town Plan\", using survey data to produce plans for different parts of Singapore; it was frequently amended and updated. The SIT soon started work on what *[The Straits Times](/wiki/The_Straits_Times)* claimed was to be a model housing scheme at the Lavender Street—Serangoon Road intersection, and land clearance in [Tiong Bahru](/wiki/Tiong_Bahru). In addition, the SIT constructed parks and open spaces near densely populated areas, carried out planning for the expansion and construction of roads and back lanes, and marked out buildings that were unsuitable to house people for demolition without compensating the owners. In 1931, the SIT carried out a scheme to construct houses for artisans in the Balestier Road area, thereby providing workers with sanitary and affordable residential facilities. ### The 1930s and 1940s In 1935, the SIT declared several buildings on Bugis Street too unsanitary for people to live in and ordered them razed. The owners of the buildings disputed the order, bringing the case to the Supreme Court in January 1935, and to the Privy Council in 1937. The SIT lost the case, so such declarations were no longer carried out as they were regarded as too difficult. In February 1935, the SIT started work on public housing in Tiong Bahru. The first flats were completed and occupied by December 1936, with additional buildings constructed through 1937. Additional flat construction schemes on New Bridge Road and Banda Street were initiated by 1937. The SIT had completed around 2,000 flats by the time of the [Japanese invasion](/wiki/Battle_of_Singapore). During the [Japanese Occupation](/wiki/Japanese_occupation_of_Singapore), the SIT's functions were handled by the Japanese authorities, who conducted negligible upkeep on the SIT's properties. Thus, these properties were in extremely poor condition by the end of Japanese rule, and the SIT spent the first few years after the Occupation refurbishing them. Checks were also conducted on the SIT flats to verify whether they were still occupied by their actual owners and to survey the damage to the buildings. Work on new housing was only initiated in April 1947, with the construction of a block of flats at Owen Road. The SIT also announced a $7 million plan to build new housing in October 1947. Nevertheless, the SIT's provision of housing had issues. In March 1948, a *Malaya Tribune* reporter claimed the rents for flats were unaffordable for the working class. The construction of flats proceeded far too slowly to keep up with demand, as noted by the SIT's acting manager in 1949. In addition, the Singapore Housing Committee's report, released in 1948, called for the government to take over the SIT to justify its spending of government monies, and for the production of a \"Master Plan\" setting out the path of Singapore's future development. ### The Master Plan and further public housing works In 1952, the SIT began work on a Master Plan for Singapore, which was submitted to the Singapore government for approval in 1955. This plan made several recommendations regarding the zoning and transport infrastructure in Singapore, such as an improved road network and the construction of new towns that could function separately from the city. The Master Plan was shown to the public in 1956, and implemented from 1958, guiding land use and development in Singapore over the following years. With the SIT's focus on housing, it could no longer carry out significant urban renewal. Moreover, the opposition of the [kampong](/wiki/Kampung_(village)) residents hampered the clearance of kampongs on SIT land to facilitate the construction of housing. The reasons for this included the high rental cost or the undesirable location of flats offered by the SIT as compensation, along with more aggressive opposition by secret society members. This resulted in the failure of clearance efforts at Kampong Henderson and Covent Garden in the mid- and late-1950s respectively. The flats built by the SIT were expensive to build, so it started constructing cheaper \"emergency\" flats from 1953. Intended to house kampong dwellers displaced by fires, these flats were initially poorly received, so the SIT did not engage in large-scale \"emergency\" flat construction until 1958. The \"emergency\" flat programme only succeeded after the [Kampong Tiong Bahru](/wiki/Kampong_Tiong_Bahru) fire in 1959. The SIT acquired the fire site and instead of selling the flats as it had previously done, rented the flats out to displaced kampong residents. ### Dissolution In 1955, the Committee on Local Government recommended that the SIT be scrapped, and housing be handled by an agency managed by a government-appointed board. Consequently, by June 1956, plans had been set in motion to transfer the SIT's housing and planning responsibilities to a dedicated agency and the Ministry of Local Government Lands and Housing respectively. Two bills, the Housing and Development Bill and the Planning Bill, regarding the formation of a [Housing and Development Authority](/wiki/Housing_and_Development_Board) and a Planning Authority in place of the SIT, were read to the [Legislative Assembly](/wiki/Legislative_Assembly_of_Singapore) in 1958, and were passed by January 1959. With the passing of the two bills, two ordinances, the Planning Ordinance and the Housing and Development Ordinance, took effect in February 1960, establishing the two successor authorities, and the SIT ceased operations on 1 February 1960. ## Organisational structure As of 1952, the SIT was composed of a Board of Trustees, a Senior Staff with 24 officers, a Subordinate Staff with over 200 personnel, as well as around 300 workers who acted as supervisors or carried out maintenance. Initially, the Board had nine trustees, four of which were appointed either by the governor or from the Rural Board or [City Council](/wiki/City_Council_of_Singapore) to three-year terms, while the other five were *[ex officio](/wiki/Ex_officio_member)* trustees. In order to provoke more interest in housing issues, an additional two nominated trustees were added in 1938, bringing the total number of trustees to eleven. With the expansion of the SIT's housing schemes in the late 1940s, an Estates Department was set up in 1947 to take care of the organisation's properties. Initially made up of eleven staff, the department experienced yearly expansion to cope with the increase in housing construction, and had 70 personnel by 1952. The department's responsibilities included the management of land owned by the SIT and tenancies, in addition to property management. The SIT was reorganised into three departments, the Buildings, Planning and Management departments, in November 1959. A housing register was also set up in 1947 to handle the allocation of new flats, but owing to overwhelming demand, allocation was shifted to a points system by the end of 1947. This points system took into account factors such as overcrowding and family size. For funding, the SIT initially relied mainly on the Improvement Rate, funds from the government, and rental incomes. The Improvement Rate was a fee imposed on all properties in Singapore as part of the Improvement Ordinance, and has a value equivalent to a percentage of the property's annual value. The funds provided by the government to the SIT were of equivalent value to the SIT's earnings from the Improvement Rate. Nevertheless, by the late 1940s, the funds from these sources did not cover the costs of the housing projects that the SIT was undertaking, so loans were taken from the government to cover the increased expenditure. - [Public housing in Singapore](/wiki/Public_housing_in_Singapore) - [Urban planning in Singapore](/wiki/Urban_planning_in_Singapore) - [Urban renewal in Singapore](/wiki/Urban_renewal_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:35.842312",
  "title": "Singapore Improvement Trust",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Improvement_Trust"
}