{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:34.128706"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore Ice Hockey Association\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2016)* *(Learn how and when to remove this message)* The **Singapore Ice Hockey Association** (AIHA Singapore) is a [non-profit organisation](/wiki/Non-profit_organisation) that has been running the National Ice Hockey League of Singapore (NIHL Singapore) since 2000, hosting ice hockey tournaments in Asia since 2001, and funding several developmental activities over this time. The association is funded by player fees and private sponsorship. ## History In 1988, an ice skating rink was built in [Singapore](/wiki/Singapore) by a private investor; Fuji Ice Palace in the outskirts of the City Central. In the mid-1990s the Fuji Ice Palace> found a new location at Jurong East Entertainment Center (near the [Jurong East MRT station](/wiki/Jurong_East_MRT_station)) where it has operated until 2008. By 16 October 2008, Fuji Ice Palace had ceased its operations. By the year 2012, three more ice skating rinks have been built. Namely, Kallang Ice World, Marina Bay Sands and The Rink @ Jcube, in which The Rink @ JCube stands on the previous location of the Fuji Ice Palace. In 1997 a local league was started at Fuji, organized by the Ice Hockey Association, Singapore (IHAS)) with six teams. Due to the high costs for individual players, the league shut down after one year of operation. Between that time and the formation of the AIHA and NIHL in late 2000, \"pick-up\" sessions of informal games were organized by various local and expatriate players. The Canadian Association of Singapore has also run various hockey activities over the years, most recently a comprehensive youth hockey program since at least 1997. The National Ice Hockey League of Singapore and its parent body, the Amateur Ice Hockey Association (Singapore) were the brainchild of Greg Blakney, a longtime Asian and Singaporean resident. Greg had a vision of creating a comprehensive infrastructure for developing hockey in Singapore, from bringing together the top players on the island (locals and expats) to play in the NIHL, to helping recruit and develop local talent. The league has grown steadily since inception, spending many thousands of dollars on developing the sport of hockey in Singapore along the way. It has only been since the creation of the AIHA and NIHL, that Singapore has had the foundation on which to build a meaningful national ice hockey body. - Amateur Ice Hockey Association of Singapore - Singapore at IIHF.com - National Ice Hockey League of Singapore official website This ice hockey organization article is a stub. You can help Wikipedia by expanding it. - v - t - e This article about sports in Singapore is a stub. You can help Wikipedia by expanding it.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:34.128369",
  "title": "Singapore Ice Hockey Association",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Ice_Hockey_Association"
}