{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:54:47.791187"
  },
  "content": "Flag carrier of Singapore **Singapore Airlines** ([abbreviation](/wiki/Abbreviation): **SIA** or **SQ**) is the [flag carrier](/wiki/Flag_carrier) of [Singapore](/wiki/Singapore) with its [hub](/wiki/Airline_hub) located at [Changi Airport](/wiki/Changi_Airport). The airline is ranked as a 5-star airline and has been ranked as the world's best airline by [Skytrax](/wiki/Skytrax) five times. Singapore Airlines operates a variety of [Airbus](/wiki/Airbus) and [Boeing](/wiki/Boeing) aircraft, namely the [Airbus A350-900](/wiki/Airbus_A350-900), [Airbus A380](/wiki/Airbus_A380), [Boeing 737 MAX 8](/wiki/Boeing_737_MAX_8), [Boeing 747-400 Freighter](/wiki/Boeing_747-400F), [Boeing 777-300ER](/wiki/Boeing_777-300ER) and [Boeing 787-10](/wiki/Boeing_787-10). The airline has been a member of [Star Alliance](/wiki/Star_Alliance) since April 2000. Singapore Airlines Group has more than 20 subsidiaries, including numerous airline-related subsidiaries. [SIA Engineering Company](/wiki/SIA_Engineering_Company) handles maintenance, repair and overhaul (MRO) business across nine countries with a portfolio of 27 joint ventures including with [Boeing](/wiki/Boeing) and [Rolls-Royce](/wiki/Rolls-Royce_Holdings). [Singapore Airlines Cargo](/wiki/Singapore_Airlines_Cargo) operates SIA's freighter fleet and manages the cargo-hold capacity in SIA's passenger aircraft. [Scoot](/wiki/Scoot), a wholly owned subsidiary, operates as a [low-cost carrier](/wiki/Low-cost_carrier). The airline is also notable for highlighting the [Singapore Girl](/wiki/Singapore_Girl) as its central figure in the corporate branding segment and not significantly changing its livery throughout its history. Singapore Airlines was the first to put the [Airbus A380](/wiki/Airbus_A380)—the world's largest passenger aircraft—as well as the [Boeing 787-10](/wiki/Boeing_787) into service, and is the only operator of the ultra-long-range (ULR) version of the [Airbus A350-900](/wiki/Airbus_A350). It ranks amongst the top 15 carriers worldwide in terms of [revenue](/wiki/Revenue) passenger kilometres and is ranked tenth in the world for international passengers carried. Singapore Airlines was voted as the Skytrax World's Best Airline Cabin Crew 2019. The airline has also won the second and fourth positions as the World's Best Airlines and World's Cleanest Airlines respectively in 2019. In 2023, the airline for the fifth time took the prize of \"Best Airline\" as well as the \"Best First Class Airline\" by Skytrax. On 1 February 2025, [Fortune](/wiki/Fortune_(magazine)) magazine published the annual World’s Most Admired Companies with Singapore Airlines ranked 28th. In the airline category, Singapore Airlines was the world's second most admired airline, behind [Delta Air Lines](/wiki/Delta_Air_Lines), and ahead of [KLM](/wiki/KLM) and [Lufthansa](/wiki/Lufthansa). ## History ## Corporate affairs Singapore Airlines is majority-owned by the [Singapore government](/wiki/Government_of_Singapore)'s investment and [holding company](/wiki/Holding_company) [Temasek Holdings](/wiki/Temasek_Holdings), which holds 55% of voting stock as of 31 March 2020. Nevertheless, while the government holds a [golden share](/wiki/Golden_share) via the country's [Ministry of Finance](/wiki/Ministry_of_Finance_(Singapore)), it stressed its non-interference in the management of the company, a point emphasised by [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) when he said the Singapore Changi Airport's front-runner status as an aviation hub is more important than SIA. However, he was personally involved in easing tensions between the company and its pilots in the early 2000s, warned the airline to cut costs, and made public his advice to the airline to divest from its subsidiary companies. Singapore Airlines is headquartered at Airline House, a former hangar at the [Changi Airport](/wiki/Changi_Airport) in Singapore. In November 2022, [Tata Group](/wiki/Tata_Group) reached an agreement with Singapore Airlines, in which the joint-venture Indian full-service carrier Vistara merged with Tata-owned Air India to form a single entity with an expanded network and broader fleet. The merger officially took place on 12 November 2024, with Air India as the surviving company. Singapore Airlines now holds a 25.1% stake in the company. In November 2024, Singapore Airlines said it was feeling the impact of the aviation industry’s widespread supply-chain issues, estimating it is likely to have five fewer aircraft than planned by the end of the 2024 fiscal year, with 204 jets in fleet, due to delivery delays. ### Business trends The key trends for Singapore Airlines are (as of the financial year ending 31 March):[a] Revenue (S$ m)[Net profit](/wiki/Net_income) (S$ m)Number of employeesNumber of passengers (m)Passenger load factor (%)Number of destinations[b]Fleet size[b]References201111,7391,01113,58816.678.564108201212,07039013,89317.177.463100201312,387−69414,15618.279.363101201412,47953814,24018.678.963103201512,41854014,04018.778.560105201611,68667213,98319.079.660102201711,09451414,42318.979.061106201812,8071,32415,62019.581.162107201913,14477915,94320.783.163121202013,012−28316,76020.981.96612220213,478−3,18315,7900.413.44711320227,068−31414,5263.332.669123202315,5902,21814,80318.185.874133 ### Branding Branding and publicity efforts have revolved primarily around flight crew, in contrast to most other airlines, who tend to emphasise aircraft and services in general. In particular, the promotion of its female flight attendants known as [Singapore Girls](/wiki/Singapore_Girl) has been widely successful and is a common feature in most of the airline's advertisements and publications. The Singapore Airlines logo is a stylised bird, which has no relation to the Keris. The keris which originated in Malayan Airways days is a legacy central in Singapore Airlines' branding, such as the SilverKris lounge, Krisflyer and the KrisWorld entertainment system. The logo has remained unchanged since Singapore Airlines' inception from the split of [Malaysia–Singapore Airlines](/wiki/Malaysia%E2%80%93Singapore_Airlines), except for a minor tweak in 1987. ### Corporate livery #### Original MSA livery (1966–1972) In May 1966, Malaysian Airways (MAL) became [Malaysia–Singapore Airlines](/wiki/Malaysia%E2%80%93Singapore_Airlines) (MSA). The original MSA livery features a yellow MSA logo on the vertical stabiliser and a black nose, with a white and grey [fuselage](/wiki/Fuselage). All aircraft in this original livery have been repainted or retired.[*citation needed*] #### Second-generation livery (1972–1987) Following the spinoff of [Malaysia-Singapore Airlines](/wiki/Malaysia-Singapore_Airlines), Singapore Airlines introduced a second-generation livery features a blue and yellow strip on the windows on the white fuselage, with the stylised bird logo in yellow. The word \"Singapore Airlines\" was stylised in italics. #### Third-generation livery (1987–present) The current livery has only some minor changes, and the gold-blue colour scheme and the bird logo have been retained. In the change to the current livery, the yellow rear fuselage was changed to metallic gold with a new orange line added above it. The same orange line was also added behind the bird logo. The font typeface of the word \"Singapore Airlines\" was modified.[*citation needed*] However, in 2005, the livery received a minor update where the \"Singapore Airlines\" wording was enlarged and shifted closer towards the front of the aircraft, and the bird logo was also enlarged. The blue/gold sections of the tail is cut horizontally. The first set of windows are also no longer left out from the blue/gold/yellow strip. The engine logos were also subsequently removed since October 2007. ## Destinations Singapore Airlines flies on five continents from its primary hub in Singapore. After the Asian financial crisis in 1997, Singapore Airlines discontinued its routes to [Berlin](/wiki/Berlin), [Darwin](/wiki/Darwin,_Northern_Territory), [Cairns](/wiki/Cairns), [Hangzhou](/wiki/Hangzhou), [Kagoshima](/wiki/Kagoshima), and [Sendai](/wiki/Sendai). [Toronto](/wiki/Toronto) was discontinued earlier, in 1992, due to a petition from [Air Canada](/wiki/Air_Canada). During the SARS outbreak in 2003–04, Singapore Airlines ceased flights to [Brussels](/wiki/Brussels), [Chicago](/wiki/Chicago), [Las Vegas](/wiki/Las_Vegas), [Hiroshima](/wiki/Hiroshima), [Kaohsiung](/wiki/Kaohsiung), [Madrid](/wiki/Madrid), [Mauritius](/wiki/Mauritius), [Shenzhen](/wiki/Shenzhen), [Surabaya](/wiki/Surabaya), and [Vienna](/wiki/Vienna). Singapore Airlines discontinued flights to [Vancouver](/wiki/Vancouver) and [Amritsar](/wiki/Amritsar) in 2009, and [São Paulo](/wiki/S%C3%A3o_Paulo) in 2016. The airline has a key role in the [Kangaroo Route](/wiki/Kangaroo_Route), operating flights between Australia and the United Kingdom via Singapore. It flew 11.0% of all international traffic into and out of Australia in the month ended March 2008. As of summer 2023, it operated more flights to Australia than any other country.[*citation needed*] Singapore Airlines also operated flights between [Singapore](/wiki/Singapore) and [Wellington](/wiki/Wellington), New Zealand via [Canberra](/wiki/Canberra) until May 2018, when the intermediate stop was changed to [Melbourne](/wiki/Melbourne). This route was known as the Capital Express. The route was suspended in 2020 due to the COVID-19 pandemic. Singapore Airlines has taken advantage of liberal bilateral aviation agreements between Singapore and Thailand, and with the United Arab Emirates, to offer more onward connections from Bangkok and Dubai, respectively.[*citation needed*] In 2005, [AirAsia](/wiki/AirAsia), a [low-cost carrier](/wiki/Low-cost_carrier) (LCC) based in Malaysia, accused Singapore Airlines of double standards, when it claimed that the [Government of Singapore](/wiki/Government_of_Singapore) attempted to keep it out of the Singapore market, despite desiring to fly routes out of Australia itself. In 2007, Singapore Airlines welcomed the liberalisation of the Singapore-Kuala Lumpur route, previously restricted to Singapore Airlines and [Malaysia Airlines](/wiki/Malaysia_Airlines) under rules designed to protect the state-run airlines from competition for over three decades, accounting for about 85% of the over 200 flight frequencies then operated. A highly lucrative route for LCCs due to its short distance and heavy traffic as the fourth-busiest in Asia, bringing Singapore Airline's capacity share on the route down to about 46.7%, Malaysia Airlines' down to 25.3%, and increase to 17.3% to the three LCCs now permitted on the route, and the remainder shared by three other airlines as of 22 September 2008. Until 1 December 2008, Singapore Airlines operated six flights per day. Singapore Airlines operated four flights per day plans from 1 December 2008 when the route was completely opened, while its sister airline [SilkAir](/wiki/SilkAir) also operated four flights per day. Malaysia Airlines, the main opponent to the liberalisation of the route and deemed to be the party that stands to lose the most, continued to codeshare with both Singapore Airlines and SilkAir on the route. Singapore Airlines operated two of the [longest flights in the world](/wiki/Longest_flights), both nonstop flights from Singapore to [Los Angeles](/wiki/Los_Angeles) and [Newark](/wiki/Newark,_New_Jersey) with [Airbus A340-500](/wiki/Airbus_A340) aircraft. All A340-500s were phased out in 2013 and nonstop flights to both destinations were terminated. Nonstop service to Los Angeles was terminated on 20 October 2013 (the airline continues to serve Los Angeles from Singapore via [Tokyo-Narita](/wiki/Narita_International_Airport)), and the nonstop service to Newark was terminated on 23 November 2013 in favour of a Singapore-New York JFK route via [Frankfurt](/wiki/Frankfurt_Airport). From 23 October 2016, Singapore Airlines resumed non-stop flights from Singapore to the United States, beginning with [San Francisco](/wiki/San_Francisco). The route is flown by the A350-900 aircraft and includes Business, Premium Economy, and Economy classes. This was followed by the resumption of non-stop flights to Newark and Los Angeles from 11 October 2018 and 2 November 2018, respectively, with the delivery of the Airbus A350-900ULRs, allowing the airline to operate two of the world's longest non-stop flights again. ### World's longest non-stop scheduled flight routes On 14 October 2015, Singapore Airlines announced plans to resume the world's longest non-stop flight between Singapore and New York – a 15,300 km (9,500 mi), 19-hour route that the airline had dropped in 2013. A340-500 aircraft were formerly employed to serve this route until their retirement in 2013. SIA resumed the route following the acquisition of new Airbus [A350-900ULR](/wiki/Airbus_A350_XWB#A350-900ULR) aircraft on 18 October 2018. At the time, [Singapore Airlines Flights 21 and 22](/wiki/Singapore_Airlines_Flights_21_and_22) was the longest scheduled route in the world. It was suspended again in March 2020 due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic), and resumed in March 2022. On 9 November 2020, SIA relaunched the nonstop flights between Changi Airport and New York, but this time to [John F. Kennedy International Airport](/wiki/John_F._Kennedy_International_Airport), three times a week. The route, [Singapore Airlines Flights 23 and 24](/wiki/Singapore_Airlines_Flights_23_and_24), is the longest scheduled flight in the world. ### Joint ventures Singapore Airlines have established joint ventures with the following airlines: - [Air New Zealand](/wiki/Air_New_Zealand) - [All Nippon Airways](/wiki/All_Nippon_Airways) - [Garuda Indonesia](/wiki/Garuda_Indonesia) - [Lufthansa](/wiki/Lufthansa) - [Malaysia Airlines](/wiki/Malaysia_Airlines) - [Scandinavian Airlines](/wiki/Scandinavian_Airlines) ### Codeshare agreements Singapore Airlines [codeshares](/wiki/Codeshare_agreement) with the following airlines: - [Aegean Airlines](/wiki/Aegean_Airlines) - [Air Canada](/wiki/Air_Canada) - [Air China](/wiki/Air_China) - [Air France](/wiki/Air_France) - [Air India](/wiki/Air_India) - [Air Mauritius](/wiki/Air_Mauritius) - [Aircalin](/wiki/Aircalin) - [Air New Zealand](/wiki/Air_New_Zealand) - [Asiana Airlines](/wiki/Asiana_Airlines) - [Austrian Airlines](/wiki/Austrian_Airlines) - [All Nippon Airways](/wiki/All_Nippon_Airways) - [Avianca](/wiki/Avianca) - [Bangkok Airways](/wiki/Bangkok_Airways) - [Brussels Airlines](/wiki/Brussels_Airlines) - [Copa Airlines](/wiki/Copa_Airlines) - [Croatia Airlines](/wiki/Croatia_Airlines) - [Egyptair](/wiki/Egyptair) - [Ethiopian Airlines](/wiki/Ethiopian_Airlines) - [EVA Air](/wiki/EVA_Air) - [Eurowings](/wiki/Eurowings) - [Fiji Airways](/wiki/Fiji_Airways) - [Garuda Indonesia](/wiki/Garuda_Indonesia) - [Jeju Air](/wiki/Jeju_Air) - [JetBlue Airways](/wiki/JetBlue_Airways) - [Juneyao Airlines](/wiki/Juneyao_Airlines) - [Lufthansa](/wiki/Lufthansa) - [Malaysia Airlines](/wiki/Malaysia_Airlines) - [Olympic Air](/wiki/Olympic_Air) - [Philippine Airlines](/wiki/Philippine_Airlines) - [Royal Brunei Airlines](/wiki/Royal_Brunei_Airlines) - [Scoot](/wiki/Scoot) (Subsidiary) - [Scandinavian Airlines](/wiki/Scandinavian_Airlines) - [Shenzhen Airlines](/wiki/Shenzhen_Airlines) - [South African Airways](/wiki/South_African_Airways) - [SriLankan Airlines](/wiki/SriLankan_Airlines) - [Swiss International Air Lines](/wiki/Swiss_International_Air_Lines) - [TAP Air Portugal](/wiki/TAP_Air_Portugal) - [Thai Airways International](/wiki/Thai_Airways_International) - [Turkish Airlines](/wiki/Turkish_Airlines) - [United Airlines](/wiki/United_Airlines) - [Virgin Atlantic](/wiki/Virgin_Atlantic) - [Virgin Australia](/wiki/Virgin_Australia) - [Vietnam Airlines](/wiki/Vietnam_Airlines) ### Interline agreements Singapore Airlines [interlines](/wiki/Interlining) with the following airlines: - [Air Astana](/wiki/Air_Astana) - [Airlink](/wiki/Airlink) - [Air Niugini](/wiki/Air_Niugini) - [Alaska Airlines](/wiki/Alaska_Airlines) - [Chu Kong Passenger Transport](/wiki/Chu_Kong_Passenger_Transport) (Ferry) - [Delta Air Lines](/wiki/Delta_Air_Lines) - [EVA Air](/wiki/EVA_Air) - [Flydubai](/wiki/Flydubai) - [Kuwait Airways](/wiki/Kuwait_Airways) - [Lao Airlines](/wiki/Lao_Airlines) - [Loganair](/wiki/Loganair) - [Porter Airlines](/wiki/Porter_Airlines) - [Scoot](/wiki/Scoot) (subsidiary) - [Uzbekistan Airways](/wiki/Uzbekistan_Airways) ### In-Town Check-In Services Singapore Airlines passengers departing from [Hong Kong](/wiki/Hong_Kong) and arriving in [Singapore](/wiki/Singapore) as the final destination are allowed to use the in-town check-in service at either [Hong Kong Station](/wiki/Hong_Kong_Station) or [Kowloon Station](/wiki/Kowloon_Station_(MTR)). This includes receiving boarding passes, and checking in luggage from 24 hours to 90 mins before departure. This allows travellers to spend time in the city without having to carry their luggage before travelling to the airport bags-free. Each train has a special baggage container car and the checked baggage is scanned in bulk by a mechanised automatic explosive detection system. Upon reaching the airport, baggage is automatically transferred from the airport express to the traveller's flight. ## Fleet Singapore Airlines historically operated an almost entirely widebody fleet. Following its merger with [SilkAir](/wiki/SilkAir), it reintroduced the [Boeing 737](/wiki/Boeing_737) to mainline service in March 2021. The airline also operates [Boeing 747-400F](/wiki/Boeing_747-400F) and [Boeing 777F](/wiki/Boeing_777F) freighters. As of September 2025[update], there were 163 aircraft registered in the Singapore Airlines fleet, comprising 151 passenger aircraft and 12 freighters. ## Services ### Cabins Singapore Airlines offers five classes of service – Suites, first class, business class, premium economy class, and economy class. Major upgrades to its cabin and in-flight service were announced on 17 October 2006, constituting the first major overhaul in over eight years and costing the airline approximately [S$](/wiki/S$)570 million. Initially planned for the Airbus A380-800's introduction into service in 2006, and subsequently on the [Boeing 777-300ER](/wiki/777-300ER), the postponement of the first A380-800 delivery meant it had to be introduced with the launch of the first Boeing 777-300ER with the airline on 5 December 2006 between Singapore and Paris. On 9 July 2013, Singapore Airlines, in collaboration with design firms James Park Associates and [DesignworksUSA](/wiki/DesignworksUSA), released new cabin products for the first, business, and economy classes. They debuted on the carrier's new Boeing 777-300ERs delivered from 2013 onwards, with London's [Heathrow Airport](/wiki/Heathrow_Airport) being their maiden route. The product was later introduced on its Airbus A350s and extended to all its older Boeing 777-300ERs. On 2 November 2017, Singapore Airlines released new cabin products for the [Airbus A380-800](/wiki/Airbus_A380). These new changes cost roughly S$1.16 billion and were rolled out in response to growing competition from Middle Eastern carriers such as Emirates, Etihad Airways and Qatar Airways. The seating configuration in the new design consists of 6 suites and 78 business class seats on the upper deck, with 44 Premium Economy Class seats and 3-4-3 Economy Class seats on the lower deck. The new changes were rolled out on the five new Airbus A380 aircraft that were delivered to Singapore Airlines, while the existing A380 fleet had these new products retrofitted until 2020. Sydney was the first city served with the new product on 18 December 2017. #### Business class The current version of the Business Class was unveiled on 9 July 2013 and is available on refitted [Boeing B777-300ERs](/wiki/Boeing_777-300ER) and the [Airbus A350-900](/wiki/Airbus_A350-900). Features include a power socket and ports all in one panel, stowage beside the seat, two new seating positions, arranged in a 1-2-1 configuration and an 18-inch in-flight entertainment screen. The seat has a recline of 132 degrees and can be folded into a 78 in (198.1 cm) length bed. [Long haul](/wiki/Long_haul_flight) business class is available on [Airbus A380](/wiki/Airbus_A380) and refitted [Boeing 777-200ER](/wiki/Boeing_777-200ER) aircraft, where a fully flat bed is available in a 1-2-1 configuration featuring 30 in (76 cm) of seat width. These seats are forward-facing, in contrast to the herring-bone configuration used by several other airlines offering flat beds in business class. The leather seats feature a 15.4 in (39.1 cm) diagonal screen-size personal television, in-seat power supply and two [USB](/wiki/USB) ports. On eight [Airbus A380](/wiki/Airbus_A380) aircraft, the first of which entered service in October 2011, Singapore Airlines dedicated the entire upper deck to the Business class cabin, unlike the original configuration's upper deck shared by 16 rows of business class and 11 rows of economy at the rear. Medium and short haul business class layouts are available on [Airbus A330-300](/wiki/Airbus_A330-300), [Boeing 777-300](/wiki/Boeing_777-300) and all unrefitted [Boeing 777-200](/wiki/Boeing_777-200) aircraft, configured in 2-2-2 layout and with [iPod](/wiki/IPod) connectivity, only available in the A330. The Business Class seat is lie-flat at an eight-degree incline, featuring Krisworld on a 15.4-inch (39 cm) screen. On 28 March 2018, the new regional business class was unveiled following the delivery of the first [Boeing 787-10](/wiki/Boeing_787-10). These new seats manufactured by Stelia Aerospace are arranged in a forward-facing 1-2-1 staggered configuration, providing every passenger direct aisle access. Each seat measures up to 26 in (66.0 cm) in width and can be reclined into a 76-inch (193.0 cm) fully flat bed. There are also adjustable dividers at the centre seats to provide passengers with a \"customised level of privacy\". Unveiled on 2 November 2017, the new A380 business-class seats were being progressively rolled out on the Airbus A380-800 fleet. There are 78 Business class seats on the aircraft, offered in a 1-2-1 configuration behind the Singapore Airlines Suites on the upper deck. The seats, designed by JPA Design and upholstered with Poltrona Frau grain leather, can be reclined into a fully flat bed. There are also adjustable dividers between the centre seats that can either be fully raised, half raised or fully lowered. When the centre divider is fully lowered, the pair of centre seats directly behind each bulkhead can form double beds. There is also an 18-inch (46 cm) touchscreen LCD TV and a panel containing power and USB port, as well as an [NFC](/wiki/Near-field_communication) reader for contactless payments. In November 2024, Singapore Airlines pledged to invest S$1.1 billion ($828 million) to overhaul the seats in its long-haul aircraft, including all-new first- and business-class product. #### Economy class A new seat with slight changes was announced to be retrofitted on Singapore Airlines's A380 and eventually become available on newer versions of their A350 and 787 aircraft. Features include more legroom and back support, a six-way adjustable headrest, and foldable wings. The Economy Class seat also features a more contemporary fabric seat cover design. The screen size remains the same, yet handsets from the previous iteration of seats have been removed. A redesign of the economy class seat was unveiled on 9 July 2013 alongside new first and business class products. Features include 32-inch (81 cm) of legroom, slimmer seats, an adjustable [headrest](/wiki/Headrest), and an 11.1-inch (28 cm) touch-screen [inflight entertainment](/wiki/Inflight_entertainment) system which is also controllable with a video touch-screen handset as well as brand new KrisWorld software. The new seats were originally announced to be available exclusively onboard factory-fresh Airbus A350-900 and refitted Boeing 777-300ER. The previous generation economy class seats on unrefitted [Airbus A380-800](/wiki/Airbus_A380), and [Airbus A330-300](/wiki/Airbus_A330-300) are 19 in (48 cm) wide, have in-seat power and have a 10.6-inch (27 cm) personal television screen which has a non-intrusive reading light under it, which can be used by folding the screen outwards. These are configured 3-4-3 on the lower deck of the Airbus A380, 3-3-3 on the Boeing 777, and 2-4-2 on the Airbus A330, as well as the upper deck of the Airbus A380. Other features include an independent cup-holder (separate from the fold-out table), a [USB](/wiki/USB) port, and a power socket, as well as an [iPod](/wiki/IPod) port exclusively on board the [Airbus A330](/wiki/Airbus_A330). Singapore Airlines introduced a similar design on board the Boeing 777 aircraft through its ongoing cabin retrofit program. The [Boeing 777–300](/wiki/Boeing_777) was the first model to undergo refit and had introduced the product on the Singapore–Sydney route on 22 July 2009. They are equipped with slightly smaller 9-inch screens (which are, however, larger than the 6.1-inch VGA screens on unrefitted aircraft) and AVOD in each seat. The seats are installed onboard all B777-200ERs and all but one B777-200. ### Catering Singapore Airlines offers a wide array of food options on each flight. Regional dishes are often served on their respective flights, such as the *Kyo-Kaiseki*, *Shi Quan Shi Mei*, and *Shahi Thali* meals, available for first-class passengers on flights to Japan, China and India, respectively. SIA has also introduced the Popular Local Fare culinary programme offering local favourites to passengers in all classes flying from selected destinations. The dishes featured in this programme include Singaporean \"hawker\" fare such as *[Teochew porridge](/wiki/Teochew_porridge)*, *[bak chor mee](/wiki/Mee_pok)*, *[Hainanese chicken rice](/wiki/Hainanese_chicken_rice)*, and *[Satay](/wiki/Satay)* (meat skewers) on certain routes. They published a cookbook in 2010 titled *Above & Beyond: A Collection of Recipes from the Singapore Airlines Culinary Panel*. Passengers in Suites, First and Business class may choose to use the \"Book the Cook\" service, where specific dishes may be selected in advance from a more extensive menu. Premium Economy class passengers may also choose to use the \"Premium Economy Book the Cook\". This service is only available on selected flights. ### In-flight entertainment KrisWorld is Singapore Airlines' [in-flight entertainment](/wiki/In-flight_entertainment) system, introduced in 1997 on Boeing 747–400, Airbus A310-300, Airbus A340-300 and Boeing 777–200 aircraft. KrisWorld overhauled Singapore Airlines' in-flight experience with a new, cheaper entertainment solution that would supersede the primitive Thales entertainment systems on offer at that time by [Virgin Atlantic](/wiki/Virgin_Atlantic) and [Emirates](/wiki/Emirates_(airline)). The original KrisWorld provided 14 movies, 36 television programmes, and five cartoons, as well as many [Super NES](/wiki/Super_NES) games, KrisFone and fax, text news and flight path in all classes. The original KrisWorld was subsequently upgraded to feature Wisemen 3000, an audio and video-on-demand version of the KrisWorld system featured exclusively in First and Raffles Class cabins, then progressively introduced into Economy Class in 747 cabins and selected 777 cabins. In 2002, Singapore Airlines introduced a re-branding of the KrisWorld system. Named Enhanced KrisWorld, it featured additional movies, television programming, music and games, and was installed on [Boeing 747-400](/wiki/Boeing_747-400) and selected [Boeing 777-200](/wiki/Boeing_777-200) aircraft. [Connexion by Boeing](/wiki/Connexion_by_Boeing), an in-flight Internet service, was introduced in 2005. Live television streaming was proposed on Connexion, but this service was discontinued in December 2006. Since October 2005, Singapore Airlines has offered complimentary language lessons by Berlitz. and, starting December 2005, live text-news feeds. In 2007, a new KrisWorld based on [Red Hat Enterprise Linux](/wiki/Red_Hat_Enterprise_Linux) was introduced, featuring a new interface, additional programming and audio and video on demand as standard. Widescreen personal video systems were installed in all cabins, including 23-inch LCD monitors in First Class, 15-inch monitors in Business Class, and 10.6-inch monitors in Economy Class. The new KrisWorld is available on Airbus A330, Airbus A380 and [Boeing 777-300ER](/wiki/777-300ER). Features include: - Widescreen LCD TV with 1280 × 768 resolution - A range of movies, TV, music, [games](/wiki/Games) and interactive programs - Built-in [office software](/wiki/Office_software), based on the [StarOffice Productivity Suite](/wiki/StarOffice) for use with the [USB](/wiki/USB) port - In-seat AC power ports A $400 million new KrisWorld entertainment system was unveiled in 2012. This comes from a major deal with Panasonic Avionics, which will provide the latest Panasonic eX3 systems. The eX3 system features a larger screen with much higher resolution, wide touch-screen controllers, new software, and, above all, in-flight connectivity. Singapore Airlines launched its in-flight connectivity in August 2012. Passengers are now able to make phone calls, send text messages and access the Internet for a fee. The new eX3 systems are unveiled alongside the new cabin product and are available on the Airbus A350-900 and refitted B777-300ER aircraft. In-flight connectivity is offered on the aforementioned two aircraft as well as select Airbus A380s. ## Award and recognition On 24 June 2024, Singapore Airlines was voted 2024 *Best Airline in the World* by [Skytrax](/wiki/Skytrax) for the second consecutive time, having won the same award in 2023. Apart for winning the best airline, Singapore Airlines also scooped the top awards for *Best Cabin Staff* and *Best First Class in World*. They also won the *Best Airline in Asia* in the same award ceremony. On 29 January 2025, SIA was named the top airline, securing the 28th position on *Fortune*'s list of the world’s most admired companies. ## Controversies In February 2019, [TechCrunch](/wiki/TechCrunch) reported that the Singapore Airlines mobile app in the [iOS App Store](/wiki/App_Store_(iOS)) was using [session-replay](/wiki/Session_replay) functionality to record users' activities and send the data to Israeli firm [Glassbox](/wiki/Glassbox) without the users' informed consent, compromising users' privacy and contravening the rules of the iOS App Store. ## Accidents and incidents Singapore Airlines has experienced the following [incidents and accidents](/wiki/Aircraft_accidents_and_incidents): - 13 July 1982 – A Boeing 747 operating as Singapore Airlines flight SQ21A between Singapore and Melbourne flew into volcanic ash from erupting [Galunggung volcano](/wiki/Galunggung) and experienced multiple engine failures. A two-engine emergency landing was made at [Jakarta](/wiki/Jakarta) and all four engines were replaced. - 26 March 1991 – [Singapore Airlines Flight 117](/wiki/Singapore_Airlines_Flight_117), an [Airbus A310-300](/wiki/Airbus_A310-300) registered as 9V-STP, was [hijacked](/wiki/Aircraft_hijacking) by [militants](/wiki/Terrorist) en route from [Sultan Abdul Aziz Shah Airport](/wiki/Sultan_Abdul_Aziz_Shah_Airport) to [Singapore Changi International Airport](/wiki/Singapore_Changi_International_Airport), where it was stormed by the [Singapore Special Operations Force](/wiki/Singapore_Special_Operations_Force). All [hijackers](/wiki/Aircraft_hijacking) were killed in the operation, with no fatalities amongst the passengers and crew. - 21 July 1997 – A [Learjet 31](/wiki/Learjet_31), registered as 9V-ATD, and operating a training flight for Singapore Airlines, crashed in southern [Thailand](/wiki/Thailand). Both pilots were killed. The crash was caused by the crew descending below the minimum altitude for that region. - 31 October 2000 – [Flight 006](/wiki/Singapore_Airlines_Flight_006), a [Boeing 747-400](/wiki/Boeing_747-400) registered as 9V-SPK, attempted to take off on the wrong runway at [Taiwan Taoyuan International Airport](/wiki/Taiwan_Taoyuan_International_Airport) (previously Chiang Kai-shek International Airport) while departing for [Los Angeles International Airport](/wiki/Los_Angeles_International_Airport). It collided with the construction equipment that was parked on a closed runway, killing 83 of the 179 on board and injuring a further 71 people. This was the first fatal accident involving a Singapore Airlines aircraft. The aircraft 9V-SPK was painted in a \"Tropical\" promotional livery at the time of the accident. The only other aircraft painted with the promotional [livery](/wiki/Livery), another 747-400 registered 9V-SPL, was immediately repainted with standard Singapore Airlines livery. - 12 March 2003 – A [Boeing 747-400](/wiki/Boeing_747-400) operating as Singapore Airlines Flight 286 from [Auckland International Airport](/wiki/Auckland_International_Airport) to [Changi Airport](/wiki/Changi_Airport) was involved in a tailstrike while taking off from Auckland's Runway 23L, causing severe damage to the aircraft's tail and damaging the APU (Auxiliary Power Unit), causing in-flight APU fire warnings. The flight returned to Auckland with no fatalities or serious injuries on board. The cause was later determined to be an error in the pilots' calculations of the aircraft's takeoff weight and reference speeds, which caused the pilots to [rotate](/wiki/Rotation_(aeronautics)) the aircraft prematurely. - 27 June 2016 – Singapore Airlines Flight 368, a [Boeing 777-300ER](/wiki/Boeing_777-300ER) registered as 9V-SWB with 222 passengers and 19 crew on board, suffered an engine oil leak during a flight from Singapore to Milan. The oil-leak alarm was sounded above Malaysia, two hours into the flight. During the emergency landing at the point of origin, [Singapore Changi Airport](/wiki/Singapore_Changi_Airport), the right engine caught fire, leading to the right-wing being engulfed in flames. The fire was extinguished within five minutes after the plane landed. No injuries were reported. The aircraft, which received substantial damage, was repaired. - 6 May 2022 – Singapore Airlines Flight 439, a [Boeing 737-800](/wiki/Boeing_737-800), sustained a [tailstrike](/wiki/Tailstrike) during takeoff from runway 20 at [Tribhuvan International Airport](/wiki/Tribhuvan_International_Airport). The resulting incident depressurised the aircraft and forced it to divert to [Kolkata](/wiki/Kolkata), India. There were no injuries among the 165 passengers and eight crew members on board. The tailstrike occurred during the takeoff at the airport was due to over-rotation by the PF, coupled with a likely tailwind with a component of about 10 knots along the runway. The rotation pitch rate was, at times, greater than 5° per second as recorded by the FDR. The pitch angle of 11.07° recorded also exceeded the 7° – 9° normal pitch angle range. - 25 October 2022 – A [Boeing 777-300ER](/wiki/Boeing_777-300ER) registered as 9V-SWH and operating as SQ 319 from [London Heathrow Airport](/wiki/London_Heathrow_Airport) to [Changi Airport](/wiki/Changi_Airport) in [Singapore](/wiki/Singapore) with 280 occupants on board, diverted to [Hang Nadim Airport](/wiki/Hang_Nadim_International_Airport) in [Batam](/wiki/Batam) due to adverse surface wind conditions and poor visibility caused by a thunderstorm over Singapore. As the aircraft approached Batam, the weather conditions had similarly deteriorated due to a thunderstorm over Batam and after three unsuccessful attempts at landing, the aircraft landed with a fuel quantity that was \"significantly below\" the final reserve fuel requirement of 3,024 kg.[c] There were no injuries on board or any damage to the aircraft. - 21 May 2024 – [Singapore Airlines Flight 321](/wiki/Singapore_Airlines_Flight_321), a [Boeing 777-300ER](/wiki/Boeing_777-300ER) with 211 passengers and 18 crew members on board from London to [Singapore](/wiki/Singapore), was diverted to Bangkok after encountering severe turbulence over the [Irrawaddy Basin](/wiki/Irrawaddy_River) in Myanmar. Of the 229 people aboard, 1 passenger died, and 104 passengers and crew members required hospitalisation. - Aviation portal - Companies portal - Singapore portal - [List of airlines of Singapore](/wiki/List_of_airlines_of_Singapore) - [Transport in Singapore](/wiki/Transport_in_Singapore) ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T11:54:47.790786",
  "title": "Singapore Airlines",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Airlines"
}