{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:15.839921"
  },
  "content": "Former newspaper in Singapore ***The Singapore Free Press*** was an English-language daily broadsheet newspaper based in [Singapore](/wiki/Singapore). ## History The paper was founded on 1 October 1835 as the ***Singapore Free Press & Mercantile Advertiser*** in response to the sale of *[The Singapore Chronicle](/wiki/The_Singapore_Chronicle)* from William Renshaw George to James Fairlie Carnegy. It is \"not clear\" who all of its founders were. [William Napier](/wiki/William_Napier_(lawyer)) and [Edward Boustead](/wiki/Edward_Boustead) are known to have been founders while [John Henry Moor](/wiki/John_Henry_Moor), formerly the editor of the *Chronicle*, was the founding editor. [Charles Burton Buckley](/wiki/Charles_Burton_Buckley) named Napier, Boustead, merchant Walter Scott Lorrain and Superintendent of Public Works [George Drumgoole Coleman](/wiki/George_Drumgoole_Coleman) as founders. However, [Carl Alexander Gibson-Hill](/wiki/Carl_Alexander_Gibson-Hill) argued that Buckley's \"observations should be viewed with suspicion when they cannot be confirmed from other sources.\" Gibson-Hill argued that Lorrain was \"definitely\" not a founder as he was still the proprietor of the *Chronicle* when the first issue of the *Free Press* was published. Napier edited the paper from foundation until 1846 when he returned to Scotland. [Abraham Logan](/wiki/Abraham_Logan) took over the paper in 1846 running the *Free Press* for the next twenty years. His brother, [James Richardson Logan](/wiki/James_Richardson_Logan), ran the *Penang Gazette* which produced cross-pollination of copy between the two papers and a mutual dislike of the [East India Company](/wiki/East_India_Company). The *Free Press*, by then edited by Jonas Daniel Vaughan, remained in circulation until 1869 when increased competition from *[The Straits Times](/wiki/The_Straits_Times)* led to its closure. In 1884 the paper went back into circulation under the editorship of Charles Buckley. The Singapore Free Press was bought over by *The Straits Times* and was revived with its first publication on 15 May 1946, it was published as a daily. The takeover was mainly to fend off competition from *[Malaya Tribune](/wiki/Malaya_Tribune)*, which was launched in 1914. The paper merged with the *[Malay Mail](/wiki/Malay_Mail)* in on 28 February 1962. - The *Singapore Free Press* article on National Library Board Singapore website - Search digitised copies of Singapore newspapers from 1831–2009 This article related to newspapers in Singapore is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:15.839564",
  "title": "Singapore Free Press",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Free_Press"
}