{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:18.218852"
  },
  "content": "Digital arrival card required for most visitors to Singapore The **SG Arrival Card** (**SGAC**) is a digital entry requirement used by most travellers arriving in Singapore. Administered by the [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority) (ICA), it replaced the former paper-based disembarkation/embarkation card system. ## Background Introduced in 2019 for selected transport operators, the SG Arrival Card became mandatory in 2020 as part of Singapore’s pandemic-related border controls. It replaced the paper-based “white card” and introduced digital submission of personal, travel, and health information. In 2023, [Health Minister](/wiki/Ministry_of_Health_(Singapore)) [Ong Ye Kung](/wiki/Ong_Ye_Kung) announced that the SG Arrival Card would remain a permanent feature to support ongoing surveillance and reduce the risk of importing infectious diseases. ## Usage and scope The SG Arrival Card must be submitted within three days prior to entering Singapore by air, sea, or land. Travellers typically provide information such as passport details, travel itinerary, and a health declaration. The system applies to the majority of visitors, with some exceptions. Individuals transiting without clearing immigration and Singapore citizens, permanent residents, or long-term pass holders entering by land through Woodlands or Tuas are not required to submit the form. Submissions can be made via the ICA website or through the MyICA mobile application. No fees are charged for using the official channels. - [Visa policy of Singapore](/wiki/Visa_policy_of_Singapore) - [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:18.218439",
  "title": "Singapore Arrival Card",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Arrival_Card"
}