{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:00:37.927526"
  },
  "content": "Re-invention of the game with very different rulesThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singaporean bridge\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2008)* *(Learn how and when to remove this message)* **Singaporean bridge** (also known as **floating bridge**) is a re-invention of the traditional game of [contract bridge](/wiki/Contract_bridge) deriving its name from where it is believed to have been invented, [Singapore](/wiki/Singapore). There are many variations to the game which is primarily social, has no official book of rules and no formal organizing authority. ## Introduction Players assume fixed seats, but unlike contract bridge, the [partners](/wiki/Contract_bridge_glossary#partner) are not determined at the outset by virtue of prior pairing — they are determined at the end of the bidding. Using a [standard 52-card deck](/wiki/Standard_52-card_deck), each player is dealt thirteen [cards](/wiki/Playing_card). There is a round of bidding to establish who is declarer, the trump suit, if any, and the number of tricks to be taken by declarer. Declarer then announces the rank and suit of a card and the holder of that card becomes declarer's undisclosed partner. Either declarer or the player on his left makes the first lead and normal trick-taking play ensues. Although declarer and his partner cooperate to take the most tricks, the partner does not immediately identify himself, strategically playing to tricks to assist declarer and revealing himself only by inference from the play. There are no pre-determined number of deals or games to be played and hands are not [duplicated](/wiki/Duplicate_bridge) for subsequent players, if any. Scoring may be by deals-won totals or the total of tricks won in successful contracts. Since partnerships change, players accumulate their individual scores to determine an overall winner. ## Bidding Bidding is initiated by the dealer or the player on his left. Suits are ranked as in contract bridge and the level of bidding is based on a 'book of six, i.e. a bid of '1' commits a contract to take seven tricks. Player make calls in clockwise fashion but there are no calls of 'double' or 'redouble'. The declarer is the player making the highest bid which is followed by three 'pass' calls. In some game variants, bidding will only commence if every player has a sufficiently 'playable' hand to make the game meaningful. Hands are determined to be playable through a point system where aces are valued at 4 points, kings at 3, queens at 2 and jacks at 1. Further, every card after the 4th in each suit is also worth an additional 1 point. A playable hand must contains at least four points, or as may otherwise be agreed. If any one player does not have a playable hand, the deal may be abandoned (referred to as a 'wash') and the cards shuffled and redealt. ## Playing ### General The player to the left of declarer makes the opening lead and normal trick-taking play ensues with the optional inclusion of some local rules, such as: - in notrump games, declarer makes the opening lead - the drawing of trumps can only begin when trump has been broken (i.e. a trump card has already been played) - the drawing of trump can be done at any point in the game - partnerships are determined at the onset and remain fixed ### Strategy Once the bidding has concluded, declarer establishes his partner by calling for the holder of a particular card - the 'called card'. It is known only to the card holder who the partner is and this fact remains undisclosed when the play to the first trick starts. By way of strategy, if declarer has a strong trick-taking hand but lacks a key ace in one suit, he may call for the holder of that ace to be his partner. Or, if holding a very long suit lacking the ace, it may be better to call the holder of the ace of another suit in which he holds a singleton so that he can later [ruff](/wiki/Ruff_(cards)). The partner can choose to \"reveal\" himself at any point in the game but only through his card play, or when forced to play the called card. Until then, declarer does not know who his partner is and can only infer it from the play of the cards. Partners usually try to reveal themselves early so as not to have their side-suit winners [trumped](/wiki/Trump_(card_games)) by declarer. Alternatively, partner can pretend not to be the partner in order to mislead the opponents. However, partner is obliged to reveal himself by verbal declaration should the opponents be one trick away from winning. Most of the time, the called card is one that declarer does not hold. However, it is legal for declarer to call a card he holds if he is confident that his hand is strong enough to make the contract unassisted and so he opts not to share any victory points with a partner. This may be strategically advantageous if the three opponents are unable to coordinate their defensive play until the farce is revealed and it is too late. The foregoing contrasts with contract bridge where the dummy, his hand and the partnerships are known at the start. ## Ethics and scoring Singaporean bridge is a social game with a friendly informality. Players voice their bids and conversation during games is common. There is no single or official point-scoring system but two concepts prevail: 1. the winner is the player or pair who has won the most successful contracts or conversely who has defeated the most contracts, or 2. the winner is the player or pair who accumulates the most points where points are scored according to the contracts bid and made where: - 1, 2, 4, 8, 16, 32, 64 points are scored for contracts of 7, 8, 9, 10, 11, 12, 13 tricks respectively - both partners score the same points when contracts are fulfilled - each defending player scores the same points when contracts are defeated - there are no extra points for overtricks and so players should try to bid to their full potential - there is a penalty for undertricks to discourage reckless pre-emptive bidding; defenders score 1, 2, 4, 8, 16, 32, 64 points depending on the number of undertricks. The points for each game are recorded in four columns for four players. In each game, only the columns of the winning players have scores entered. Points are summed at the end of a gaming session to determine the overall winner.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:00:37.927251",
  "title": "Singaporean bridge",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singaporean_bridge"
}