{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:09.669268"
  },
  "content": "Award The **Singapore Armed Forces National Service Medal** is an [award](/wiki/Awards_and_decorations_of_the_Singapore_Armed_Forces) conferred on a [National Serviceman](/wiki/NSmen) (NSman) of the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF) who has completed an equivalent 10 years of active service. This is achieved by meaningfully and satisfactorily completed 7 High-Key In-Camp Trainings over 10 ORNS (Operationally Ready National Service) cycles. Regular members of the SAF qualify for an equivalent medal, the [Singapore Armed Forces Long Service and Good Conduct (10 Years) Medal](/wiki/Singapore_Armed_Forces_Long_Service_and_Good_Conduct_(10_Years)_Medal). A clasp is awarded for an additional equivalent 5 years of service, for a total of 15 years. This is met by the full NSTS - 8 High-Key In-Camp Trainings and 5 Low-Key In-Camp Trainings. ## Description - The ribbon is red, with three central white stripes. ## Service medals In the SAF National Service, the medals for service are: - 5 years - [Singapore Armed Forces Good Service Medal](/wiki/Singapore_Armed_Forces_Good_Service_Medal) - 10 years - Singapore Armed Forces National Service Medal - 15 years - Singapore Armed Forces National Service Medal with 15 year clasp - 20 years - [Singapore Armed Forces Long Service and Good Conduct (20 Years) Medal](/wiki/Singapore_Armed_Forces_Long_Service_and_Good_Conduct_(20_Years)_Medal) - 25 years - [Long Service Medal (Military)](/wiki/Long_Service_Medal_(Military)_(Singapore)) - 30 years - [Singapore Armed Forces Long Service and Good Conduct (20 Years) Medal](/wiki/Singapore_Armed_Forces_Long_Service_and_Good_Conduct_(20_Years)_Medal) with 30 year clasp - Singapore MINDEF Factsheet: Review of SAF medals - Singaporean Army Medals Factsheet This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This article related to [orders](/wiki/Order_(distinction)), [decorations](/wiki/Award), and [medals](/wiki/Medal) is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:09.668853",
  "title": "Singapore Armed Forces National Service Medal",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Armed_Forces_National_Service_Medal"
}