{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:59:58.299322"
  },
  "content": "National handball team of SingaporeThis article **may rely excessively on sources too closely associated with the subject**, potentially preventing the article from being verifiable and neutral. Please help improve it by replacing them with more appropriate citations to reliable, independent sources. *(February 2017)* *(Learn how and when to remove this message)*This article **relies largely or entirely on a single source**. Relevant discussion may be found on the talk page. Please help improve this article by introducing citations to additional sources. *Find sources:* \"Singapore men's national handball team\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2024)*National handball team The **Singapore men's national handball team** is the national [handball](/wiki/Handball) team of [Singapore](/wiki/Singapore). It is governed by the [Handball Federation Singapore](/wiki/Handball_Federation_Singapore). ## Tournament history ### Asian Championship - (/wiki/2022_Asian_Men%27s_Handball_Championship) – 14th place ## Men's team NamePositionBoo YongfengPivotViswanath SingaravelloPivotAnwaar AnwaarulhaaqCenterAudrey HoCenterTan Bok SimGoalkeeperImranRight BackSyn Jun Hao LewisRight WingSean NishimuraCenterLeo Chong SingRight WingJonathan Chuang Kwong TzeLeft WingKoh Jing LiLeft BackDarius Tan Zhi JieCenterEdwin Chew Jin DaRight WingGoh Aik LangCenterMohd ZulfaqarRight WingJade Chong Yao HuiRight Back ## Men's Youth Team NamePositionHeng Wei Ming KendrickPivotJordan Tan Hou JunGoalkeeperRyan TohLeft WingNg Yi KaiPivotMuhammad ZunnurainRight WingWong Hong WeiLeft WingIsaac Koh VernGoalkeeperEugene Low Zheng XiangRight BackNur Aziman Bin RostamCenter BackMuhammad LuthfiLeft WingYeen JinghaoPivotJavier Low Jia HengLeft BackOng Zheng FengPivotJeremiah Ang Kai JieRight BackHia Juay Tiak AlexanderGoalkeeperJavier Liew Jun YongLeft WingDexter Tew Zhi YongRight WingAhmad TarishGoalkeeperLim Zi EnLeft BackOng Xiang KaiPivotAdam HizkilLeft BackCheng Chen JunLeft WingToh Yu Jie GaltonGoalkeeperNicholas Kon Yi-EnCenter This article about sports in Singapore is a stub. You can help Wikipedia by expanding it. - v - t - e This article about a national handball team is a stub. You can help Wikipedia by expanding it.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:59:58.299059",
  "title": "Singapore men's national handball team",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_men%27s_national_handball_team"
}