{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:43.887163"
  },
  "content": "Chinese orchestra in Singapore **Singapore Chinese Orchestra** (**SCO**; [Chinese](/wiki/Chinese_language): 新加坡华乐团; [pinyin](/wiki/Pinyin): *Xīnjiāpō huá yuètuán*) is Singapore's only professional [Chinese orchestra](/wiki/Chinese_orchestra). Inaugurated in 1997, the 85-musician orchestra took on the twin role of preserving traditional arts and culture and establishing new frontiers through the incorporation of Nanyang music elements in its repertoire. ## History In 1968, an amateur Chinese orchestra was established as part of the [National Theatre](/wiki/Singapore_National_Theatre) under the auspices of the Minister of Culture. This is quickly followed by a performing unit formed by the [People's Association](/wiki/People%27s_Association) Cultural Troupe, the People's Association Chinese Orchestra (PACO) on 1 July 1968 as part of the government's effort to cultivate racial harmony. Ma Wen was the first conductor of PACO in 1971, followed by Li Xueling in 1973. This became a semi-professional orchestra in 1975 when Ng Tai Kong, the new conductor, introduced 6 professional musicians. Ng left in 1977 to direct the newly formed [Hong Kong Chinese Orchestra](/wiki/Hong_Kong_Chinese_Orchestra), and he was followed by Lim Tiap Guan in 1977 and Ku Lap Man in 1980. The number of professionals gradually increased, and the orchestra had 32 full-time members by 1984. In 1992, People's Association Chinese Orchestra changed its name to Singapore Chinese Orchestra. Qu Chun Quan took over as conductor after Ku retired in 1995. In May 1996, at the initiative of then-Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong), this orchestra became independent of People's Association to operate as a private company, and was inaugurated as a fully-professional national orchestra. The [Singapore Conference Hall](/wiki/Singapore_Conference_Hall) was provided as its venue for performances and rehearsals. [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), who later became Prime Minister, was appointed patron of the orchestra. Hu Bingxu was appointed the new music director in 1996, with Qu the deputy music director, and the orchestra expanded to 45 members. It came under the [Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Communications_and_Information) in 1999. On 1 January 2000, it staged a it most ambitious project yet, a Millennium concert featuring 1,000 performers. Later mega concerts featured 2,000 performers in 2004 and over 4,000 in 2014. Hu left in 2000, and [Tsung Yeh](/wiki/Tsung_Yeh) was appointed its music director in 2002, serving till 2023, when he stepped down and was appointed Conductor Emeritus. Quek Ling Kiong was promoted to Principal Conductor in the same year, being the first principal conductor of the Singapore Chinese Orchestra to have been born and bred in Singapore. ## Singapore National Youth Chinese Orchestra The Singapore National Youth Chinese Orchestra (SNYCO) is a group of young musicians between the ages of 10 and 26 years old. It has been under the management of Singapore Chinese Orchestra (SCO) since 2003 and held its premiere concert in 2004. Until January 2017, it was named the Singapore Youth Chinese Orchestra (SYCO). - [Guoyue](/wiki/Guoyue) (國樂) - [Yayue](/wiki/Yayue) (雅樂) - [Nanguan music](/wiki/Nanguan_music) (南管) - [Beiguan music](/wiki/Beiguan_music) (北管) - [Taoist music](/wiki/Taoist_music) - [Chinese orchestra](/wiki/Chinese_orchestra) - [Siong Leng Musical Association](/wiki/Siong_Leng_Musical_Association) - [The TENG Company](/wiki/The_TENG_Company) - Singapore Chinese Orchestra's Official Website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:43.886725",
  "title": "Singapore Chinese Orchestra",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Chinese_Orchestra"
}