{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:57:53.838708"
  },
  "content": "1990 murder of a lecturer at Singapore Polytechnic On 22 November 1990, 20-year-old [National Serviceman](/wiki/National_service_in_Singapore) **Lee Teck Sang** (李德生 Lǐ Déshēng), who deserted from his army and hid himself at the campus of [Singapore Polytechnic](/wiki/Singapore_Polytechnic) (where Lee was an alumnus) for 17 days, used a knife to murder a 45-year-old lecturer during a robbery. The victim, **Tan Chin Liong** (陈振隆 Chén Zhènlóng), died as a result of being stabbed three times. Although Lee claimed that he only meant to rob and the stabbing was meant to incapacitate Tan, the High Court rejected Lee's defence and found Lee guilty of murdering Tan, and [sentenced him to death](/wiki/Capital_punishment_in_Singapore). Lee's appeal was dismissed and he was hanged on 29 July 1994. ## Murder On the morning of 22 November 1990, at 7:15 a.m., a lecturer discovered one of his senior colleagues lying dead on the seventh floor corridor outside his office at the Dover Road campus of [Singapore Polytechnic](/wiki/Singapore_Polytechnic). The victim was identified as 45-year-old Tan Chin Liong, a lecturer from the Electronics and Communication Engineering department of the polytechnic. He sustained a total of three stab wounds, with one on his abdomen and two on his chest. Preliminary investigations by the [Singapore Police Force](/wiki/Singapore_Police_Force) also determined that the possible motive behind Tan's death was robbery and Tan was possibly attacked at around 5:00 a.m. to 7:00 a.m., at most a couple of hours before the body was discovered. The police also noticed a blood trail coming from the victim's body, and followed the bloodstains to the female toilet on the sixth floor. Inside, they arrested a man who was hiding inside one of the cubicles. The young bespectacled man was wearing only a pair of white shorts, and two bags were seized from the toilet; one of them contained a bloodstained shirt and a knife. The suspect was also identified as a former student of the polytechnic, having graduated early in 1990, and he was also a deserter of [National Service](/wiki/National_Service_in_Singapore). The brutal killing of Tan brought shock to his brother and many people present at the campus, and it disrupted the lessons of many students at the polytechnic. Reportedly, they showed outrage at the suspect's brutal conduct and sadness for Tan, who was known to be a good teacher and kind-hearted person. The school staff of the polytechnic also stated that they would introduce the necessary measures to tighten the security on the campus to prevent similar incidents from happening. The bespectacled suspect, 20-year-old Lee Teck Sang, was charged with murder on 23 November 1990, a day after his arrest. Lee's case was later transferred to the High Court in June 1991, with a trial pending to be scheduled to take place on a later date. ## Background Tan Chin Liong was a [Malaysian](/wiki/Malaysians) who came from [Johor Bahru](/wiki/Johor_Bahru). He was born in a family of ten brothers and sisters. He finished his secondary school education in Malaysia before furthering his studies at England, obtaining a master's degree in engineering. Tan worked at [Singapore Polytechnic](/wiki/Singapore_Polytechnic) as a lecturer for more than ten years before his murder. According to his students, Tan was a well-mannered, approachable and unassuming person who treated his students well and helped them in their school work. Many of his pupils were reportedly shocked and saddened to hear about his death. Tan was also single and did not have a girlfriend due to him spending most of his time on research and work, and he was extremely thrifty. As for the suspect Lee Teck Sang, who was born in Singapore in 1970, he used to study at Qi Hua Primary School and also completed his secondary school education at Yuan Ching Secondary, where he graduated with a GCE O-level certificate. Lee enrolled in Singapore Polytechnic, where he studied before he graduated with a diploma on electronics and communication in early 1990, a few months before he allegedly killed Tan. Lee, who lived in [Boon Lay](/wiki/Boon_Lay), was the seventh child out of eight children, and he had two older brothers, four older sisters and one younger brother. His father died as of 1994 and his mother (aged 50 in 1990) worked as a cleaner. Lee was said to have a good student-teacher relationship with Tan, who often showed concern for his welfare and school work. ## Trial of Lee Teck Sang Two years after Tan Chin Liong was murdered, his killer Lee Teck Sang was officially brought to trial at the [High Court](/wiki/High_Court_of_Singapore) on 5 October 1992. Lee was represented by Ram Goswami, and the prosecution led by Han Cher Kwang, and the trial was presided by veteran judge [T S Sinnathuray](/wiki/T_S_Sinnathuray), who was best known for sentencing [Adrian Lim](/wiki/Adrian_Lim) and his two accomplices to the gallows for the ritual killings of two children at [Toa Payoh](/wiki/Toa_Payoh). Several prosecution witnesses came to court to give evidence. One of them, Corporal Azman Abdul Aziz of the [Singapore Police Force](/wiki/Singapore_Police_Force), testified that he was the first to discover the blood trail that started from the location of Tan's dead body and led to the toilet where they found Lee, who surrendered to the officers upon their arrival. Another was Professor [Chao Tzee Cheng](/wiki/Chao_Tzee_Cheng), a senior forensic pathologist who conducted the autopsy on the victim. Professor Chao testified that out of the three stab wounds, one of them was inflicted on the chest and had penetrated the heart, and this injury resulted into an excessive loss of blood, which was sufficient to cause the death of Tan within minutes. The court was also told that Lee, who was then serving his National Service, was scheduled to go to [Pulau Tekong](/wiki/Pulau_Tekong) in early November 1990 to start a three-month [N.C.O](/wiki/Non-commissioned_officer) course, and Lee, who was unable to face the stress of military training, decided to desert from his National Service, and he fled to Singapore Polytechnic, where he hid for the next 17 days. Lee spent the daytime reading books in the campus library while spent his nights inside a classroom during the 17 days he spent at the campus. Eventually, Lee ran out of money, and he could not ask his mother or siblings for help since they were notified of his desertion and attempted to get information from him about his whereabouts each time he contacted his family. Therefore, Lee decided to commit robbery. He also targeted the victim Tan Chin Liong since he observed Tan for some time and noticed the lecturer often came very early in the morning everyday for work. Lee's account further revealed that after he formulated the plan to rob Tan, he went to a nearby store to procure a knife, and waited for Tan on that morning of 22 November 1990. From this point on, according to Lee's version of what happened, he spotted Tan and proceeded to attack the lecturer, stabbing him in the stomach first in order to incapacitate the man so as to rob Tan, but Tan put up a fierce physical resistance and tried to disarm Lee. Lee said that during the scuffle, the knife had somehow penetrated Tan's chest without his knowledge, and he stated that the death of 45-year-old Tan Chin Liong was not within his calculations, and he only intend to rob the victim and stab him only once in the stomach to incapacitate him. From the robbery, Lee managed to steal [SGD$](/wiki/SGD$)48 in cash from the fallen victim before he fled to the toilet where he was eventually caught. In rebuttal, the prosecution argued that Lee had intentionally stabbed Tan in the heart instead of accidentally, and he had committed murder by intentionally inflicting a fatal injury upon Tan, with pursuant to Section 300(c) of the [Penal Code](/wiki/Penal_Code_(Singapore)). They pointed out that Lee's use of a knife was for the purpose of committing armed robbery and also for the intention to cause hurt if necessary. The stabbing of Tan was also done in furtherance of Lee's original intent to rob Tan and one of the knife wounds to the chest was sufficient to cause death in the ordinary course of nature. As such, the prosecution argued that the elements of proving a murder charge had been satisfied and there were sufficient grounds to warrant a guilty verdict of murder in Lee's case. On 7 October 1992, merely two days after Lee stood trial, Justice Sinnathuray delivered his judgement. In his verdict, Justice Sinnathuray found that based on the evidence, Lee had intentionally caused the three knife wounds on Tan, and one of these wounds, which was intentionally directed at the chest and cut through the heart, was fatal and resulted in the death of the victim by massive blood loss from the wound, and the decision by Lee to arm himself with a knife also corroborated the fact that he had the intention to use the weapon to cause harm if necessary. On behalf of these findings, Justice Sinnathuray found 22-year-old Lee Teck Sang guilty of murder, and [sentenced him to death](/wiki/Capital_punishment_in_Singapore). Under Section 302 of the Penal Code, the death penalty was [mandatory](/wiki/Mandatory_sentencing) for offenders guilty of murder, and judges had no discretion to sentence the murder offenders to any other punishment aside from death. ## Appeal On 17 January 1994, during his second year on [death row](/wiki/Death_row), Lee Teck Sang's [appeal](/wiki/Appeal) against his conviction and sentence was rejected by the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore). In their verdict, the three judges – two Judges of Appeal M Karthigesu and L P Thean, and [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Yong Pung How](/wiki/Yong_Pung_How) – stated that based on the findings of the trial judge and evidence, it was abundantly clear that Lee had intended to stab the victim Tan Chin Liong on the chest, such that the injury was sufficient in the ordinary course of nature to cause death, which satisfied the basic elements of a murder charge on the grounds of intentionally causing a fatal injury to the victim. Therefore, the three appellate judges upheld Lee's death sentence and murder conviction, and accordingly dismissed his appeal. ## Execution On 29 July 1994, six months after losing his appeal, 24-year-old Lee Teck Sang was hanged in [Changi Prison](/wiki/Changi_Prison) at dawn. Lee did not petition for presidential clemency during the final months before he was put to death. On the same date of Lee's execution, four other inmates were also executed at the same prison: [Ibrahim Masod](/wiki/Ibrahim_Masod) who kidnapped and killed a goldsmith, [Goh Hong Choon](/wiki/Goh_Hong_Choon) who strangled a ten-year-old schoolgirl during a robbery, and two people convicted of drug trafficking in two separate cases. The Singapore Polytechnic murder case was known to be one of the rare few cases of murders happening in the school compounds of certain educational institutions in Singapore. - [Capital punishment in Singapore](/wiki/Capital_punishment_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:57:53.838390",
  "title": "Singapore Polytechnic stabbing",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Polytechnic_stabbing"
}