{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:41.823285"
  },
  "content": "Singaporean autonomous university‹ The template *Infobox university* is being considered for merging. › The **Singapore Institute of Technology** (**SIT** or **Singaporetech**) is a [public](/wiki/Public_university) [autonomous university](/wiki/Autonomous_university) in [Singapore](/wiki/Singapore). The university offers industry-focused, applied degree programmes; it confers its own degree programmes as well as specialised degree programmes with overseas universities. The university's degree programmes are grouped into five clusters: Engineering (ENG), Food, Chemical and Biotechnology (FCB), Infocomm Technology (ICT), Health and Social Sciences (HSS), and Business, Communication and Design (BCD). The university's campus is located at 1 Punggol Coast Road in [Punggol](/wiki/Punggol), within the [North-East Region](/wiki/North-East_Region,_Singapore) of the country. The campus is next to the [Punggol Coast MRT station](/wiki/Punggol_Coast_MRT_station) and is part of the [Punggol Digital District](/wiki/Punggol_Digital_District) in the Punggol Downtown and Northshore district. ## History ### Beginnings In 2005, the Polytechnic-Foreign Specialised Institutions (Poly-FSI) initiative was introduced by the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)). Its aim was to encourage polytechnics to partner with overseas universities to offer degree programmes in niche areas that also supported Singapore's economic development. Their findings supported the establishment of a dedicated publicly funded institute that would bring in overseas university partners to Singapore. ### Establishment In 2009, the university was founded by then SIT president Tan Chin Tiong. He was previously a deputy president at the [Singapore Management University](/wiki/Singapore_Management_University). In 2013, Tan stepped down as SIT president and returned to the Singapore Management University as an advisor and Professor. Tan Thiam Soon took over the reins from him, and was subsequently succeeded by Professor Chua Kee Chaing in 2022. ### Singapore Institute of Technology Bill In 2014, a bill was passed in the [Parliament of Singapore](/wiki/Parliament_of_Singapore) conferring the university autonomous status and allowing it to confer its own degrees. SIT will partner with overseas universities to build upon their capabilities while offering new applied degrees in SIT's name. SIT is also required to constantly refresh its programmes in accordance with Singapore's developments, economy and society. ### Punggol Campus Classes at the new Punggol campus started in September 2024. The Punggol Campus comprises two plots known as ‘SIT Campus Heart’ and ‘SIT Campus Court’. - Campus Heart - SIT Visitor Gallery, Makerspace, The Forum - Campus Court - Ho Bee Auditorium, Foodcourt The campus incorporates sustainability-focused design features, like energy-efficient systems, to reduce the university's environmental footprint. ## Admission SIT accepts applicants with diplomas from the 5 local Polytechnics, NUS High School, 2 local Arts Institutions, A levels and International Baccalaureate (IB) Qualifications. [SAT](/wiki/SAT) scores are also considered. Adult learners may also apply for admission. Beside grades, applicants are admitted based on experiences, co-curricula activities and passion for the degree programmes. In 2023, 13,053 applicants competed for 3,328 places in 39 degree programmes. 93 per cent of the intake were polytechnic diploma holders and 5 per cent were A-level holders. ## SIT academic clusters SIT has five academic clusters: - Business, Communication and Design cluster offers six undergraduate programmes. - Engineering cluster offers 13 undergraduate programmes. - Food, Chemical and Biotechnology cluster offers three undergraduate programmes. - Health and Social Sciences cluster offers seven undergraduate programmes. - Infocomm Technology offers 10 undergraduate programmes. SIT also offers four postgraduate programmes by research and four postgraduate programmes By coursework. ## Overseas university partners SIT engages with overseas universities to jointly offer the following programmes: Partner universityPartner university countryProgrammesFull nameAbbrev.[DigiPen Institute of Technology](/wiki/DigiPen_Institute_of_Technology)DigiPenUSAComputer Science and Interactive Media and Game Development, BS Computer Science in Real-Time Interactive Simulation, BS Mechatronics System, BEng (Hons), Digital Art and Animation, BA [Newcastle University](/wiki/Newcastle_University)NUEnglandElectrical Power Engineering, BEng (Hons) Mechanical Design and Manufacturing Engineering, BEng (Hons) Naval Architecture and Marine Engineering, BEng (Hons) Chemical Engineering, BEng (Hons) [Technical University of Munich](/wiki/Technical_University_of_Munich)TUMGermanyElectronics and Data Engineering, BEng (Hons) Chemical Engineering, BEng (Hons) [The Culinary Institute of America](/wiki/The_Culinary_Institute_of_America)CIAUSAFood Business Management (Baking and Pastry Arts), BBA Food Business Management (Culinary Arts), BBA [University of Glasgow](/wiki/University_of_Glasgow)GlasScotland Civil Engineering, BEng (Hons) Computing Science, BSc (Hons) Mechanical Engineering, BEng (Hons) Nursing, BSc (Hons) ## Research SIT currently has six applied research centres, and four innovation centres: Research centres: - Centre for Infrastructure and Tunnel Engineering - Construction Technology Innovation Laboratory - Energy Efficiency Technology Centre - Innovation Hub - FoodPlant - Future Communications Translation Lab Innovation centres: - Design Factory@SIT - NAMIC Hub@SIT - Rapid Product Innovation and Development Centre - SIT-Polytechnic Innovation Centre of Excellence ## Campus buildings SIT is located at 1 Punggol Coast Road, Singapore 828608. This centralised campus in [Punggol](/wiki/Punggol) is next to the new [Punggol Coast MRT station](/wiki/Punggol_Coast_MRT_station). This Punggol Campus will be able to house 12,000 students. and consists of 2 main plots - the Campus Heart and Campus Court, which has a total of 10 buildings. All students started classes at the new Punggol campus in May 2025. Besides the Punggol Campus, SIT used to have other campuses in Singapore before 5 May 2025. All clusters have been moved to Punggol, with the exception of CIA SG in the TP campus. - Singapore Institute of Technology\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:41.822971",
  "title": "Singapore Institute of Technology",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Institute_of_Technology"
}