{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:37.783439"
  },
  "content": "* *Singapore Calligraphy Centre**, also known as **48 Waterloo Street**, is a bungalow on [Waterloo Street](/wiki/Waterloo_Street) in [downtown Singapore](/wiki/Central_Area,_Singapore) which currently houses the Chinese Calligraphy Society Of Singapore. ## Description The building is architecturally symmetrical. It features high ceilings and tall windows. It is surrounded by an ornate brick and plaster wall with a wrought iron gate. ## History In 1899, 20 Russian Jews were reported to have been arrested at the bungalow on gambling-related charges. However, the charges was dismissed, with the defence's lawyer arguing that the arrested had only been playing cards without gambling. In 1908, 19 Chinese men were fined $3 each for gambling at the building, while its owner was fined $75. Beginning in 1994, the building underwent a $1.31 million renovation under the [National Arts Council](/wiki/National_Arts_Council,_Singapore) Arts Housing Scheme. The renovation took 15 months. In November 1995, the building reopened as the first home of the Chinese Calligraphy Society Of Singapore, with a conference room, and audio-visual room, an exhibition hall which was available for rental and five classrooms. It was officially opened by then-[Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) [Wong Kan Seng](/wiki/Wong_Kan_Seng) on 27 May 1996. The building is one of several on Waterloo Street to have been renovated under the scheme, along with the [Stamford Arts Centre](/wiki/Stamford_Arts_Centre), [42 Waterloo Street](/wiki/42_Waterloo_Street), [54-58 Waterloo Street](/wiki/54-58_Waterloo_Street), which currently houses The Theatre Practice, and [60 Waterloo Street](/wiki/60_Waterloo_Street), which currently houses Dance Ensemble Singapore. 1°17′55″N 103°51′03″E﻿ / ﻿1.29855°N 103.85093°E﻿ / 1.29855; 103.85093\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:37.783065",
  "title": "Singapore Calligraphy Centre",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Calligraphy_Centre"
}