{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:57:39.140968"
  },
  "content": "Singaporean political party The **Singapore People's Party** ([abbreviation](/wiki/Abbreviation): **SPP**) is a [political party](/wiki/List_of_political_parties_in_Singapore) in [Singapore](/wiki/Singapore). SPP was founded in 1994 by [Sin Kek Tong](/wiki/Sin_Kek_Tong) who left the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) (SDP) with various SDP members after internal conflicts in SDP. The leadership was held by Sin until [Chiam See Tong](/wiki/Chiam_See_Tong) left SDP in December 1996 and Chiam assumed leadership. ## History ### 1994 - 2000 : Formation SPP was founded on 21 November 1994 by [Sin Kek Tong](/wiki/Sin_Kek_Tong), who led a pro-[Chiam See Tong](/wiki/Chiam_See_Tong) faction out of the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) (SDP). Over two years, Sin stood as the pro-tem leader until Chiam joined the party and assumed leadership in December 1996, at the time the Parliament was dissolved ahead of the [1997 general election](/wiki/1997_Singaporean_general_election). Chiam then became the party's first [Member of Parliament](/wiki/Parliament_of_Singapore) (MP) when he won the constituency of [Potong Pasir](/wiki/Potong_Pasir_Single_Member_Constituency) at the election, where he also did under the SDP banner. ### 2001 - 2008 : As part of Singapore Democratic Alliance In 2001, the SPP became a founding member of the [Singapore Democratic Alliance](/wiki/Singapore_Democratic_Alliance) (SDA), along with the [National Solidarity Party](/wiki/National_Solidarity_Party_(Singapore)) (NSP), the [Singapore Justice Party](/wiki/Singapore_Justice_Party) (SJP) and the [Singapore Malay National Organisation](/wiki/Singapore_Malay_National_Organisation) (PKMS). Chiam became the founding Chairman of SDA, which aimed to provide a common grouping under which different opposition parties could stand as a political coalition in elections against the ruling [People's Action Party](/wiki/People%27s_Action_Party) (PAP). At the [2001 general election](/wiki/2001_Singapore_general_election), Chiam was returned to Parliament as MP for Potong Pasir. Though Chiam was the only SDA member to win an elected seat in Parliament, he was joined in Parliament by SDA member [Steve Chia](/wiki/Steve_Chia) (leader of the National Solidarity Party) who became a [non-constituency MP](/wiki/Non-constituency_Member_of_Parliament) after securing 34.6% of the votes in the constituency of [Chua Chu Kang](/wiki/Chua_Chu_Kang_Single_Member_Constituency), which was the highest percentage of the vote secured by a losing opposition candidate at the election. The result made Chiam the *de facto* leader of the opposition in Parliament, as the SDA had two representatives (Chiam and Chia), whereas the only other opposition party represented in Parliament (the [Workers' Party](/wiki/Workers%27_Party_of_Singapore)) had only one ([Hougang](/wiki/Hougang_Single_Member_Constituency) MP [Low Thia Khiang](/wiki/Low_Thia_Khiang)). At the [2006 general election](/wiki/2006_Singapore_general_election), Chiam was again re-elected as MP for Potong Pasir. However, the SDA did not win any other seats. Though Chia increased his share of the vote in Chua Chu Kang to 39.63%, this was lower than the 43.9% gained by the Workers' Party in [Aljunied GRC](/wiki/Aljunied_Group_Representation_Constituency). The role of *de facto* leader of the opposition in Parliament therefore passed from Chiam to Low, the Workers' Party leader. ### 2009 - 2018 : Leaving the SDA and electoral defeats In 2009 and 2010, Chiam spoke of the possibility of having [Reform Party](/wiki/Reform_Party_(Singapore)) (RP) to join the SDA and attempted to bring RP into SDA. However, the rest of the leadership of SDA voted not to make a decision on the list of conditions. In October 2010, Chiam replaced SDA's secretary general, [Desmond Lim](/wiki/Desmond_Lim), with [Mohamad Hamim Aliyas](/wiki/Mohamad_Hamim_bin_Aliyas) during a central executive committee meeting of SPP. SPP founder and chairman [Sin Kek Tong](/wiki/Sin_Kek_Tong) said Chiam's move is due to Lim opposing RP joining the SDA. However, in a SDA council meeting held shortly after, the council rejected the decision of Chiam and Lim remained as the secretary general of the SDA. On 2 March 2011, SPP withdrew from the coalition due to a few reasons. Prior to exiting the coalition, the SDA Council voted to relieve Chiam as chairman three days earlier due to his health reasons and voted not decide on a list of conditions for RP, which Chiam had invited, to join the SDA. At the [2011 general election](/wiki/2011_Singaporean_general_election), Chiam announced his intention to lead his team to contest the [Bishan-Toa Payoh Group Representation Constituency](/wiki/Bishan-Toa_Payoh_Group_Representation_Constituency) (GRC), leaving his Potong Pasir ward to his wife, [Lina Loh Woon Lee](/wiki/Lina_Loh) (Lina Chiam). This was Loh's debut in politics, despite supporting Chiam and campaigning with Chiam over his many years in politics. Chairman Sin was also fielded to contest the newly-formed [Hong Kah North SMC](/wiki/Hong_Kah_North_SMC), a ward which was formerly part of the [Hong Kah GRC](/wiki/Hong_Kah_GRC). After polling day, the party was defeated in all of the contested constituencies, including Potong Pasir which was reclaimed by the PAP for the first time since 1984; consequently, Chiam's defeat ended his 27-year tenure in Parliament. However, Loh was offered a post for the [Non-Constituency Member of Parliament](/wiki/Non-Constituency_Member_of_Parliament) (NCMP) as a result of being the best performing opposition candidate (amongst unelected candidates) after narrowly losing the election by 49.64% to the PAP's [Sitoh Yih Pin](/wiki/Sitoh_Yih_Pin)'s 50.36% (a margin of 114 votes). Overall, the SPP managed to clinch 41.42% (62,504 votes) of the total number of votes in the constituencies that it had contested. Ahead of the [2015 elections](/wiki/2015_Singaporean_general_election) (due to be held on 11 September), Chiam announced that he would not stand as a candidate for the elections, for the first time since his debut in 1976. Another opposition party, the [Democratic Progressive Party](/wiki/Democratic_Progressive_Party_(Singapore)), that was led by [Benjamin Pwee](/wiki/Benjamin_Pwee) and Hamin Aliyas, joined the SPP to strengthen its team contesting Bishan–Toa Payoh GRC. New candidate [Ravi Philemon](/wiki/Ravi_Philemon) replaced Sin as candidate for Hong Kah North, while Lina Chiam contested again in Potong Pasir. Former NSP member [Jeannette Chong-Aruldoss](/wiki/Jeannette_Chong-Aruldoss) joined the party prior, and contested [Mountbatten SMC](/wiki/Mountbatten_SMC) just as Chong did in the 2011 elections. However, the absence of Chiam in the election saw their party suffer another major setback, not only did the party fail to win a parliamentary seat, their scores were overseen by large swings towards the PAP, one of which was Potong Pasir, where Lina Chiam managed to secure only 33.59% (down from the previous election's 49.64%) of the valid votes. Compared to the Workers' Party's performances (of [East Coast GRC](/wiki/East_Coast_GRC), [Fengshan SMC](/wiki/Fengshan_SMC) and [Punggol East SMC](/wiki/Punggol_East_SMC)), it was not enough for Lina Chiam to secure her NCMP seat for a second term, thus ending their party's presence in Parliament since the party foundation. In terms of the party's overall vote, they garnered only 27.08% of the votes cast, a swing of -14.34% from the previous election. On 1 March 2017, the party reported that former party's chairman Sin had died from [prostate cancer](/wiki/Prostate_cancer) two days earlier. In January 2018, it was reported that Jose Raymond, a former Press Secretary to [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan) (who also served as Chief Executive of the Singapore Environment Council and current [Minister of Foreign Affairs](/wiki/Ministry_of_Foreign_Affairs_(Singapore))), had joined the SPP. ### 2019 - Present: Leadership of Steve Chia On 4 September 2019, Chiam announced that he would be stepping down from the secretary-general position due to declining health, while Lina Chiam would be stepping down from the chairman position. The party's Facebook announced that they would be electing new leadership. On 16 October 2019, during the party's biennial Ordinary Party Conference, Chiam and Chong-Aruldoss stepped down from the party's Central Executive Committee (CEC). Four new faces were elected into the CEC. On 5 November 2019, Chia was elected as the new Secretary-General of the Singapore People's Party, along with Raymond as Chairman. #### 2020 General Election Following the general election on 10 July 2020, the party lost to the PAP for the third consecutive election, on both of the contested constituencies (Bishan-Toa Payoh GRC and Potong Pasir SMC), despite seeing a small vote swing against the PAP. Their party improved their vote share in the contested wards to 33.83%. On 22 December 2020, Chairman Raymond announced that he would be retiring from politics, while revealing that the Assistant Secretary-General, Ariffin Sha, had resigned from the party in August. Vice-Chairman Williiamson Lee became Acting Chairman, while Ariffin's position was not filled. The SPP CEC accepted the resignations on 17 January 2021 and co-opted Khan Osman Sulaiman and Melvyn Chiu. #### 2025 General Election The SPP contested five seats in GE2025. Steve Chia led a four-man team in Bishan-Toa Payoh GRC, consisting of himself, Melvyn Chiu, Lim Rui Xian and Muhammad Norhakim; ultimately securing 24.82% of the vote (21,944 votes) against the incumbent PAP team led by then-Minister for Transport [Chee Hong Tat](/wiki/Chee_Hong_Tat). Williiamson Lee also contested Potong Pasir SMC, securing 22.46% of the vote (6,261 votes) against the incumbent PAP's [Alex Yeo](/wiki/Alex_Yeo) and PAR's [Lim Tean](/wiki/Lim_Tean). Following the release of the election results, Secretary-General Steve Chia was notably disappointed with the outcome. In an interview with the Straits Times, he was said to have \"mulled over deregistering the party\", having described the results as being \"very bleak\". ## Organisation ### Central Executive Committee TitleNameChairpersonMelvyn ChiuVice-Chairperson[Lina Chiam](/wiki/Lina_Chiam)Secretary-General[Steve Chia](/wiki/Steve_Chia)Assistant Secretary-General[Chiam See Tong](/wiki/Chiam_See_Tong)TreasurerWilliiamson LeeAssistant TreasurerEddy TanOrganising SecretaryYen Kim KhooiAssistant Organising SecretaryRicky TohSocial Media SecretaryKathleen CheongMembersYong Seng FattShah ShafieJalil Wari ## Former elected members ### Former Members of Parliament of Singapore (1965–present) NoNameConstituencyLength of service (cumulative)1[Chiam See Tong](/wiki/Chiam_See_Tong)[Potong Pasir SMC](/wiki/Potong_Pasir_Single_Member_Constituency)1984 - 20112[Lina Chiam](/wiki/Lina_Chiam)[Non-Constituency Member of Parliament](/wiki/Non-Constituency_Member_of_Parliament)2011 - 2015 ## Electoral performance ### Parliament Due to a merger with the [Singapore Democratic Alliance](/wiki/Singapore_Democratic_Alliance) (SDA) in the 2001 and 2006 elections, collective figures represent the SDA total inclusive of the SPP, while figures in parenthesis/brackets refer to the SPP only. ElectionLeaderVotes%SeatsNCMPsPositionResultContestedTotal+/–SeatsWonLost(/wiki/1997_Singaporean_general_election)Chiam See Tong16,7462.3%3121 / 83 10 / 1 5thOpposition(/wiki/2001_Singaporean_general_election)75,24812.03%13 (4)1 (1)12 (3)1 / 841 / 1 2ndOpposition(/wiki/2006_Singaporean_general_election)145,62812.96%20 (8)1 (1)19 (7)1 / 840 / 1 3rdOpposition(/wiki/2011_Singaporean_general_election)62,6393.11%7071 / 871 / 3 5thOpposition(/wiki/2015_Singaporean_general_election)[Lina Chiam](/wiki/Lina_Loh)49,1072.17%8080 / 89 10 / 3 7thNo seats(/wiki/2020_Singaporean_general_election)[Steve Chia](/wiki/Steve_Chia)37,9981.52%5050 / 930 / 2 8thNo seats(/wiki/2025_Singaporean_general_election)28,0291.17%5050 / 970 / 2 8thNo seats #### Seats contested ElectionConstituencies contestedContested vote %+/–(/wiki/1997_Singaporean_general_election)[SMC](/wiki/Constituencies_of_Singapore): [Ayer Rajah](/wiki/Ayer_Rajah_Single_Member_Constituency), [Bukit Gombak](/wiki/Bukit_Gombak_Single_Member_Constituency), **[Potong Pasir](/wiki/Potong_Pasir_Single_Member_Constituency)**27.2%—N/a(/wiki/2001_Singaporean_general_election)[5-member GRC](/wiki/Group_representation_constituency): [Jalan Besar](/wiki/Jalan_Besar_Group_Representation_Constituency), [Tampines](/wiki/Tampines_Group_Representation_Constituency); [SMC](/wiki/Constituencies_of_Singapore): [Bukit Timah](/wiki/Bukit_Timah_Single_Member_Constituency), [Chua Chu Kang](/wiki/Chua_Chu_Kang_Single_Member_Constituency), **Potong Pasir**27.6%—N/a(/wiki/2006_Singaporean_general_election)6-member GRC: [Pasir Ris-Punggol](/wiki/Pasir_Ris%E2%80%93Punggol_Group_Representation_Constituency); 5-member GRC: Jalan Besar, Tampines; SMC: Chua Chu Kang, [MacPherson](/wiki/MacPherson_Single_Member_Constituency), **Potong Pasir**, [Yio Chu Kang](/wiki/Yio_Chu_Kang_Single_Member_Constituency)32.5% 4.9%(/wiki/2011_Singaporean_general_election)5-member GRC: [Bishan-Toa Payoh](/wiki/Bishan-Toa_Payoh_Group_Representation_Constituency); SMC: [Hong Kah North](/wiki/Hong_Kah_North_Single_Member_Constituency), **Potong Pasir**41.1%—N/a(/wiki/2015_Singaporean_general_election)5-member GRC: Bishan-Toa Payoh; SMC: Hong Kah North, [Mountbatten](/wiki/Mountbatten_Single_Member_Constituency), Potong Pasir27.1% 14.0%(/wiki/2020_Singaporean_general_election)4-member GRC: Bishan-Toa Payoh; SMC: Potong Pasir33.9% 6.8%(/wiki/2025_Singaporean_general_election)4-member GRC: Bishan-Toa Payoh; SMC: Potong Pasir - Official website - Singapore People's Party (SPP) party symbol, explained by SADeafSG - ChannelNewsAsia 1 May 2011 on SPP candidate for Potong Pasir in GE 2011\n",
  "language": "en",
  "processed_at": "2026-01-12T11:57:39.140540",
  "title": "Singapore People's Party",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_People%27s_Party"
}