{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:57:36.207932"
  },
  "content": "Former Political party in Singapore The **Singapore People's Alliance** (abbreviation: **SPA**) was a political alliance in Singapore founded in 1958, consisting of the [Liberal Socialist Party](/wiki/Liberal_Socialist_Party_(Singapore)) (LSP) and former members of the [Labour Front](/wiki/Labour_Front) (LF). It contested the [1959 general election](/wiki/1959_Singapore_general_election) and became the opposition; and the [1963 general election](/wiki/1963_Singapore_general_election) under the [Singapore Alliance Party](/wiki/Singapore_Alliance_Party) (SAP) in which it failed to win any seats. ## History SPA was led by the former [Chief Minister](/wiki/Chief_Minister_of_Singapore) [Lim Yew Hock](/wiki/Lim_Yew_Hock) to contest the 1959 general election. SPA wanted to promote the standard of living for workers through socialist and welfare programmes. The 1959 general election was won by the [People's Action Party](/wiki/People%27s_Action_Party) (PAP). SPA had fielded 39 candidates and won only four seats, Lim was relegated to the [leader-of-the-opposition](/wiki/Leader_of_the_Opposition_(Singapore)) in the legislative assembly. SPA did not play any significant role in the [national referendum](/wiki/1962_Singaporean_integration_referendum) in September 1962, which approved the terms of Singapore's merger into [Malaya](/wiki/Federation_of_Malaya). The merger was executed on 9 July 1963. SPA contested the subsequent 1963 general election under the SAP, which was a branch of the federal [Alliance Party](/wiki/Alliance_Party_(Malaysia)). SPA's presence within the alliance sparked friction with elements of the [Singapore branch](/wiki/Pertubuhan_Kebangsaan_Melayu_Singapura) of the [United Malay National Organisation](/wiki/United_Malay_National_Organisation) (UMNO). During the 1963 election, SAP fared poorly against the PAP, losing all four seats held by its constituent parties. This was partly attributed by [historian](/wiki/Historian) Albert Lau to the failure of Lim to stand in the elections. Meanwhile, the political focus had shifted to [PAP's rivalries, with UNMO](/wiki/PAP-UMNO_relations) at the federal level, and [Barisan Sosialis](/wiki/Barisan_Sosialis) (BS) at the national level. SPA was eventually dissolved on 16 May 1965. ## Election results ### Legislative Assembly ElectionLeaderVotes%SeatsPositionResultContestedTotal+/–SeatsWonLost(/wiki/1959_Singaporean_general_election)[Lim Yew Hock](/wiki/Lim_Yew_Hock)107,75520.67%394354 / 51 4 2ndOpposition #### Seats Contested ElectionConstituencies contestedContested vote %(/wiki/1959_Singaporean_general_election)Anson, Bras Basah, Bukit Merah, Bukit Panjang, **Cairnhill**, Chua Chu Kang, Crawford, Delta, Geylang East, Geylang West, Havelock, Hong Lim, Jalan Besar, Jalan Kayu, **Joo Chiat**, Jurong, Kallang, Kampong Glam, Kampong Kapor, Kampong Kembangan, Moulmein, **Mountbatten**, Nee Soon, Punggol, Queenstown, River Valley, Rochore, Sembawang, Sepoy Lines, Serangoon Gardens, Stamford, Tampines, **Tanglin**, Telok Ayer, Thomson, Tiong Bahru, Toa Payoh, Ulu Pandan, Upper Serangoon27.0% - Background of Singapore People's Alliance - Labour Front This article about a Singaporean political party is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:57:36.207620",
  "title": "Singapore People's Alliance",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_People%27s_Alliance"
}