{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:58:17.920207"
  },
  "content": "Singaporean space organisation **Singapore Space and Technology Ltd** (**SSTL**; [Malay](/wiki/Malay_language): *Angkasa dan Teknologi Singapura Ltd*; [Chinese](/wiki/Simplified_Chinese_characters): 新加坡航天科技有限公司; [pinyin](/wiki/Pinyin): *Xīnjiāpō hángtiān kējì yǒuxiàn gōngsī*; [Tamil](/wiki/Tamil_language): சிங்கப்பூர் விண்வெளி மற்றும் தொழில்நுட்ப லிமிடெட், romanised: *Ciṅkappūr viṇveḷi maṟṟum toḻilnuṭpa limiṭeṭ*) is a [non-governmental](/wiki/Non-governmental_organization) space organisation based in [Singapore](/wiki/Singapore) within the [aerospace](/wiki/Aerospace) industry. SSTL is recognised by the [International Astronautical Federation](/wiki/International_Astronautical_Federation).[*citation needed*] ## Advisory Council The SSTL board of directors is currently led by Chairman, Jeremy Chan and Executive Director, Thomas Zhuo, and includes an advisory council composed of representatives of stakeholders in the Singapore space industry. Members of the Advisory Council (2024) NamePositionProf Lui Pao ChuenTemasek Defence Professor, Temasek Defence Systems Institute Board Member, Home Team Science & Technology Agency Cheong Chee HooChief Executive Officer, [DSO National Laboratories](/wiki/DSO_National_Laboratories)Colin LowChief Executive, Singapore Land Authority (SLA)Daniel E. HastingsAeronautics and Astronautics Department Head, Massachusetts Institute of Technology (MIT) Former US Chief Air Force Chief Scientist Kwoh Leong KeongDirector, Centre for Remote Imaging, Sensing and Processing (CRISP)Roy ChanDeputy Chief Executive (Operations), Defence Science and Technology AgencySoh Leng WanAssistant Chief Executive Officer, Enterprise SGTan Boon KhaiChief Executive Officer, JTC Corporation ## Global Space Technology Conference & Exhibition (GSTCE) SSTL organises the Global Space Technology Conference & Exhibition (GSTCE) annually in February. The GSTCE is the Asia's premier space and technology event, facilitating trade and regional collaboration for space, satellite businesses and beyond. Speakers and Moderators for previous editions can be found here. ## Satellite launch program and experiment facilities ### SSTL-JAXA Kibo launch agreement On 15 November 2017, SSTL signed a contract with the [Japan Aerospace Exploration Agency](/wiki/JAXA) (JAXA) to launch the \"SpooQy - 1\" CubeSAT developed by the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS) via the Kibo Program on board the [International Space Station](/wiki/International_Space_Station). SpooQy-1 will attempt to demonstrate quantum entanglement using a CubeSat in Low Earth Orbit (LEO). ## Industry programs ### Asia Pacific Regional Space Agency Forum (APRSAF) SSTL co-organises the regional rotational APRSAF conference with [JAXA](/wiki/JAXA) whenever Singapore plays host to the annual conference. It co-organised the 18th and 25th edition of APRSAF in 2011 and 2018 respectively. ### SSTL Space Industry Awareness Talk SSTL works in collaboration with the [National Trade Union Council (NTUC)](/wiki/National_Trades_Union_Congress) Employment and Employability Institute to organise space exposure talks to bring the space industry to the general public. ## Educational programs and outreach ### Humanitarian Assistance and Disaster Relief Challenge Across the world, countries have recognised the need of utilising [remote sensing](/wiki/Remote_sensing) satellite technologies as a critical tool in real-time disaster management. SSTL launched the *Humanitarian Assistance and Disaster Relief* (HADR) challenge to invoice companies, start-ups, research groups or students and identify solutions to problems of coordination and technology usage within the context of HADR. Current and previous participating organisations have included World Bank, GISTDA, and National University of Singapore. ## Venture building programmes ### Space Accelerator Programme In 2020, SSTL began a space-based accelerator programme in Singapore to support space tech startups in the sector. The accelerator programme is supported by Enterprise Singapore (ESG). Through the programme, SSTL works with local and international startups of varying maturity levels from pre-seed up to Series B, who are working on space hardware products and services. It currently has over 30 international and local startups in its program[*citation needed*]. ### Project Cyclotron SSTL, in conjunction with Cap Vista, have developed a specialised track called Project Cyclotron, which supports early-stage high-risk space hardware startups that are developing deep[*clarification needed*] technologies.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:58:17.919827",
  "title": "Singapore Space and Technology Ltd",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Space_and_Technology_Ltd"
}