{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:58:33.882422"
  },
  "content": "Singaporean political party The **Singapore United Party** ([abbreviation](/wiki/Abbreviation): **SUP**) is a [political party](/wiki/List_of_political_parties_in_Singapore) in [Singapore](/wiki/Singapore) founded on 24 December 2020. ## Party Founding The party was formed out of former members of the [Reform Party](/wiki/Reform_Party_(Singapore)) in the aftermath of the [2020 Singaporean general election](/wiki/2020_Singaporean_general_election). Its secretary-general is Andy Zhu, the former chairman of the [Reform Party](/wiki/Reform_Party_(Singapore)). Following the 2020 general election, the Reform Party announced that its chairman Andy Zhu and treasurer Noraini Yunus had stepped down from the central executive committee. Reform Party secretary-general [Kenneth Jeyaretnam](/wiki/Kenneth_Jeyaretnam) alleged that Zhu had modified the party's payment policy without prior approval and the pair had been voted out unanimously. Zhu declined these allegations, claiming that he had been ousted via \"undemocratic” means, whilst also contesting Jeyaretnam's assertion that the vote against him had been unanimous. On 24 December 2020, the Singapore United Party was registered at the Registry of Societies, with Zhu becoming the party's secretary-general. Zhu sought to emphasise that the party was not a breakaway faction of his former party. However, analysts had noted that the party membership at the time of its founding consisted of a large number of former [Reform Party](/wiki/Reform_Party_(Singapore)) members. As the party is still relatively new to the electoral landscape of Singapore, it lacks a distinct manifesto or ideology, though it has pledged to work on \"bread-and-butter issues\" as well as women's rights. In 2024, the party would enter an informal political alliance with the [NSP](/wiki/National_Solidarity_Party_(Singapore)), [RDU](/wiki/Red_Dot_United) and [SPP](/wiki/Singapore_People%27s_Party) named [The Coalition](/wiki/The_Coalition_(Singapore)) where they agreed to avoid three cornered contests. During the [2025 general election](/wiki/2025_Singaporean_general_election), the party contested in the [Ang Mo Kio Group Representation Constituency](/wiki/Ang_Mo_Kio_Group_Representation_Constituency). On 3 May 2025, they won only 10.84% of the valid votes against the PAP team led by senior minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), as well as the PPP ([People's Power Party](/wiki/People%27s_Power_Party_(Singapore))) team led by William Lim. ## Leadership The following members are part of the Singapore United Party's central executive committee. Officer-holderNameSecretary-GeneralAndy ZhuDeputy Secretary-GeneralDarren Soh Guan SoonChairmanChandran S/O Sanmugam @ Muhammad RidhuanDeputy ChairmanN/ATreasurerNoraini YunusDeputy TreasurerTyeisha Syaquilla AyubOrganizing SecretaryKenneth ZhangPro-Term Committee MemberMohamad Affendy Abdul RahimPro-Term Committee MemberZhang GuoqiangPro-Term Committee MemberChoo Zin ChyePro-Term Committee MemberGurdev Singh ## Electoral performance ### Parliament ElectionLeaderVotes%SeatsNCMPsPositionResultContestedTotal+/–SeatsWonLost(/wiki/2025_Singaporean_general_election)Andy Zhu15,8110.66%5050 / 970 / 29thNo seats #### Seats contested ElectionConstituencies contestedContested vote %+/–(/wiki/2025_Singaporean_general_election)[5-member GRC](/wiki/Group_representation_constituency): [Ang Mo Kio](/wiki/Ang_Mo_Kio_Group_Representation_Constituency)110.8%—N/a 1. **^** : loss of candidate election deposit(s) in contested seat(s) This article about a Singaporean political party is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:58:33.882119",
  "title": "Singapore United Party",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_United_Party"
}