{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:24.511002"
  },
  "content": "The **Singapore Ballet** (formerly known as **Singapore Dance Theatre**) is Singapore's national [dance company](/wiki/Dance_company), founded in 1988 by [Anthony Then](/wiki/Tony_Then) and [Goh Soo Khim](/wiki/Goh_Soo_Khim). The Artistic Director of the company is Janek Schergen. ## History It made its debut in June 1988 at the Singapore Festival of The Arts as the Singapore Dance Theatre and received its first arts patronage by the then-Deputy Prime Minister, Mr. [Ong Teng Cheong](/wiki/Ong_Teng_Cheong). Initially, SDT started with a group of seven ballet dancers in a modest dance studio on the second story of a creaky colonial bungalow on Killiney Road. This studio space was shared by the Singapore Ballet Academy and the SDT's dancers could only train in between the Academy's rehearsal schedules on normal days. The building's condition was poor and dancers often had to be careful with their movements lest the floorboards gave way. On rainy days, the studio would experience leaking roofs and had to put buckets at the corner of the studio, to collect the rainwater. In 1991 SDT moved to the Fort Canning Centre in [Fort Canning Park](/wiki/Fort_Canning_Park). As of 2013, SDT moved to purpose-built headquarters on [Victoria Street](/wiki/Victoria_Street,_Singapore). The new premises have four large studios and better facilities for the dancers and staff. On 12 July 2013, the new SDT headquarters was officially opened with the Silver Legacy Gala by presided over by President Dr. [Tony Tan](/wiki/Tony_Tan). Singapore Ballet now consists of 38 dancers and six apprentices. It receives funding from both public and private sources such as the [National Arts Council](/wiki/National_Arts_Council,_Singapore), as well as corporate and private donations. On 10 December 2021, it was announced that Singapore Dance Theatre was renamed Singapore Ballet, in an effort to bridge the audience's expectations of their performances. This was done with its board of directors' approval and after a discussion with the [National Arts Council](/wiki/National_Arts_Council,_Singapore). It has six seasons in a year, including performances at the [Esplanade](/wiki/Esplanade_-_Theatres_on_the_Bay) Theatre and the Fort Canning Green, where its hugely popular Ballet Under The Stars (BUTS) series of outdoor performances are staged. BUTS has, to date, attracted over 180,000 spectators from all walks of life. ## Repertoire The company's repertoire ranges from [classical](/wiki/Classical_ballet) to [contemporary ballet](/wiki/Contemporary_ballet), from world-renowned choreographers. They have also done several full-length ballets in their history with [The Nutcracker](/wiki/The_Nutcracker), [Coppelia](/wiki/Copp%C3%A9lia), Cinderella, [Giselle](/wiki/Giselle), Madame Butterfly, [La Sylphide](/wiki/La_Sylphide), [Romeo and Juliet](/wiki/Romeo_and_Juliet_(Prokofiev)), [Swan Lake](/wiki/Swan_Lake), [Sleeping Beauty](/wiki/The_Sleeping_Beauty_(ballet)), [Don Quixote](/wiki/Don_Quixote_(ballet)) and the contemporary work Reminiscing the Moon, choreographed by Boi Sakti, commissioned for the opening of the [Esplanade](/wiki/Esplanade_%E2%80%93_Theatres_on_the_Bay) in 2002. In 2010 the company performed Giselle in Victoria Theatre and a new staging of Sleeping Beauty at the Esplanade Theatre in December. SDT adds four to six new works in each season coming from choreographers such as [Val Caniparoli](/wiki/Val_Caniparoli), [Edwaard Liang](/wiki/Edwaard_Liang), Nils Christe, Kinsun Chan, Timothy Harbour, Christina Chan, Timothy Rushton, Alice Topp, Ma Cong, Loughlan Prior, Natalie Weir, Paul Knobloch, as well as the children's ballet Peter and Blue's series created especially for young audiences by the company's Artistic Director, Janek Schergen. SDT presented company premieres of [George Balanchine](/wiki/George_Balanchine)'s ballets Concerto Barocco, Serenade, [Allegro Brillante](/wiki/Allegro_Brillante), Divertimento No. 15, Theme and Variations, Rubies, and The Four Temperaments between 2009 and 2017. The 2011 season began with Choo San Goh's Romeo and Juliet performed at The Esplanade in March. Masterpiece in Motion 2011 programme was Stanon Welch's Maninyas, Nils Christe's Fearful Symmetries and a new work made for SDT by Edwaard Laing entitled The Winds of Zephyrus. Ballet Under the Stars 2011 presented a Tchaikovsky Festival with Balanchine's Allegro Brillante, Serenade, and Swan Lake Act II. Passages Choreographic Workshop performances were presented at The National Museum at the end of October 2011. The season ended with a successful new staging of The Nutcracker. The 2012 season was framed with performances of Swan Lake in March and Sleeping Beauty in December at the Esplanade Theatre. There were several new additions to the repertoire-ZIN!/Nils Christe, Jabula/Natalie Weir, Age of Innocence/Edwaard Laing, Divertimento #15/ George Balanchine, and new works from Val Caniparoli (Chant), Nils Christe (Organ Concerto) and Toru Shimizaki (Absence of Story). The annual presentations of Masterpiece in Motion, Ballet Under the Stars, and Passages Contemporary Season continue. 2013 marked the 25th anniversary of the company's foundation. The company moved to its new headquarters in February 2013 at Bugis+ on the top floor of the building. The new home includes four studios, staff, meeting and production room. The performance season began in March, at The Esplanade Theatre, with Coppelia, featuring largely new sets and an expanded staging to present the full company. During the year new works were added from Christina Chan, Natalie Weir, and Kinsun Chan. The company premiere of Balanchine's Theme and Variations was in August. 2013 also featured performances of Giselle and The Nutcracker to mark their prominence in the company's history and repertoire. A gala performance to mark the 25th year took place on 31 May & 1 June 2013 at the Esplanade Theatre. It featured Edwaard Liang's world premiere of Opus 25 as the centerpiece, created for 32 dancers in the company, to the music of Michael Torke. In 2015 SDT's repertoire included Sleeping Beauty and Swan Lake, plus ten works from the company's established repertoire and new works from Kinsun Chan, Gigi Gianti, Max Chen and Francois Klaus, plus the company premiere of Bournonville Divertissements. The company tours Malaysia annually as well as other places in the Asia Pacific region. 2018 marked the 30th Anniversary of SDT, beginning with the Moon and the Stars Gala, held at Capitol Theatre in April 2018. The performance gala was held in July 2018 with a performance of Choo-San Goh's Double Contrasts, as well as the pas de deux from his ballet Configurations, plus the world premiere of Timothy's Harbour's Linea Adora and the company premiere of Nils Christe's SYNC. ## Choreography Besides developing its repertoire, its Ballet Under The Stars seasons at Fort Canning Green have become a viable working space for dance performances. Up-and-coming choreographers now present their creations through the Passages Contemporary Season as well as the Singapore Ballet choreographic workshop called Made in Singapore. Currently, the 38 Singapore Ballet's dancers and apprentices train under Artistic Director Janek Schergen, who was also the ballet master for Choo-San Goh from Washington Ballet. He has staged Mr. Goh's works for the repertoire through the years. In the company's history SDT has also groomed notable dancers and choreographers such as Kuik Swee Boon and Jeffery Tan, a Young Artist Award for Dance recipient in 2000. ## Education As a major grant recipient from the [Singapore Government](/wiki/Government_of_Singapore) and, in keeping with SDT's commitment to bringing the finest in dance to the public audience, on-going Education and Outreach programmes are organised to provide people with opportunities to appreciate dance. The SDT continues to make extensive school visits and offer special courses for non-dancers and adult students. Recently Singapore Ballet has launched several new initiatives. One @ the Ballet, which are open rehearsals in the company's Founder's studio, is held on Saturdays and dedicated to topics that show the inside working of a dance company. The Ballet Associate Course has been developed to offer master classes for young ballet students in a workshop format though the year. The Scholar's Programme is a pre-professional training outgrowth of Ballet Associates that gives students daily training in development towards careers in dance. Singapore Ballet has also launched a children's series with ballets made especially for very young audiences accompanied by a narrator. These efforts aim to make dance more accessible to the masses. Singapore Ballet hopes to spread the beauty, passion and discipline of dance to as many people as possible, and place Singapore in the minds of international dance aficionados. On 16 July 2008, Goh Soo Khim formally announced that she would step down from her position as [Artistic Director](/wiki/Artistic_Director) of the Singapore Dance Theatre, effective from 19 July 2008, as the company celebrated its 20th anniversary celebrations with a gala performance at [Victoria Theatre](/wiki/Victoria_Theatre_and_Concert_Hall). The gala performance presented a repertoire of dance excerpts of the SDT's landmark performances over the last two decades starting with three Singaporean choreographers represented, Choo San Goh's \"Beginnings\", *Living Greens* by Mohamed Noor Sarman and Jeffrey Tan's *Negro Y Blanco*. In 2008 the company's Assistant Artistic Director, Janek Schergen, was appointed the Artistic Director of the company. His involvement has stemmed from the initial SDT performances in 1988 with the staging of Choo San Goh's ballet Beginnings. Over the next 17 years he staged 11 of Choo San Goh's ballets for Singapore Ballet plus added full-length works (Swan Lake, Sleeping Beauty, The Nutcracker, Coppelia, Don Quixote Cinderella and Giselle) in new stagings. On 6 February 2009 the main rehearsal studio at SDT's home in Fort Canning was dedicated in Ms. Goh's honour as the Goh Soo Khim Founder's Studio with a performance and a celebration for family and friends following. On 26 February 2016, The Choo San Goh Studio was dedicated during SDT's Gala evening \"The Moon and the Stars\" in honour of the choreographer. During the 2024 season Singapore Ballet performed at The Kennedy Centre in Washington D.C. opening a Festival of Asian Choreographers called 10,000 Dreams with Choo-San Goh's ballet, Momentum.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:24.510685",
  "title": "Singapore Ballet",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Ballet"
}