{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:00:46.831273"
  },
  "content": "[Singapore in 2005](/wiki/2005_in_Singapore)Events - [117th IOC Session](/wiki/117th_IOC_Session) - Avian influenza preparedness - [Dengue outbreak](/wiki/2005_dengue_outbreak_in_Singapore) - [Murder of Huang Na](/wiki/Murder_of_Huang_Na) - [Hurricane Katrina relief effort](/wiki/Singaporean_response_to_Hurricane_Katrina) - [Kashmir earthquake relief effort](/wiki/Singaporean_response_to_2005_Kashmir_earthquake) - [NKF controversy](/wiki/National_Kidney_Foundation_Singapore_scandal) - [Police MRT Unit established](/wiki/Public_Transport_Security_Command) - [Presidential election](/wiki/2005_Singaporean_presidential_election) - [Execution of Van Tuong Nguyen](/wiki/Van_Tuong_Nguyen) Others - [Counter-terrorism in Singapore](/wiki/Counter-terrorism_in_Singapore) - [Integrated resorts proposal](/wiki/Integrated_resort) - [Singapore Flyer proposal](/wiki/Singapore_Flyer) - v - t - e **Singapore** has taken a series of **measures against avian influenza** and the potential threat of a [pandemic](/wiki/Influenza_pandemic). ## Status As of 17 October 2005, there were no cases of [H5N1](/wiki/H5N1) [avian influenza](/wiki/Avian_influenza) detected in Singapore, either in humans or poultry. ## Threat A major avian [influenza pandemic](/wiki/Influenza_pandemic) will be very costly in terms of human lives as well as economic losses, especially in the densely populated city-state of Singapore. Bird flu has infected poultry in large parts of Asia since 2003, killing at least 65 people, mostly in Vietnam and Thailand. Millions of birds have been culled to stop the spread of the disease. In October 2005, strain of the bird flu virus was detected in Turkey and Romania indicating that the avian flu was spreading from Asia to Europe. Most of the human deaths so far have been linked to contact with sick birds. But the [World Health Organization](/wiki/World_Health_Organization) has said that the virus could mutate into a form that is more easily transmitted from human to human and possibly triggering a pandemic reminiscent of the [1918 flu epidemic](/wiki/Spanish_flu) that killed tens of millions worldwide. In Thailand, a probable case of human-to-human transmission of [H5N1](/wiki/H5N1) virus was reported in the northern province of [Kamphaeng Phet](/wiki/Kamphaeng_Phet_Province). This is consistent with current knowledge of the behaviour of H5N1 virus that inefficient, limited human-to-human transmission may occur on rare occasions. As of 17 October 2005, evidence indicated that spread among humans has been limited to this cases, nonetheless, surveillance has been intensified in the province. ### Risk assumption When planning the response, it is assumed that the first local human case is likely to be imported from affected countries and is difficult to prevent. The virus, which is more [infectious](/wiki/Infectious_disease) than [SARS](/wiki/SARS), is likely to spread quickly and has a high [morbidity](/wiki/Morbidity) and [mortality](/wiki/Death). There will not be any vaccine initially, and the vaccine development will take at least 4 to 6 months. Even when developed, initial supply of the vaccine will be limited. ## Measures ### Health advisory On 24 October 2005, the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) issued a public advisory calling for several groups of people to get themselves vaccinated against [flu](/wiki/Flu). They include - elderly aged 65 years and above, - those with chronic heart and lung diseases, and diabetes or renal diseases, - children and teenagers aged six months to 18 years, who are receiving long-term aspirin therapy, and - women in the second or third trimester of pregnancy. Those planning to travel to the [Northern Hemisphere](/wiki/Northern_Hemisphere) over the next few months are also encouraged to get a flu vaccine at least a week or two before departure. The Ministry also advised extra precaution for travellers to areas affected by the [avian influenza](/wiki/Avian_influenza) outbreak including countries in Asia (Indonesia, Thailand, Vietnam and China) and Europe (Turkey, Romania, Greece, Russia). Travellers are advised avoid contact with poultry such as chickens, geese, ducks, pigeons and wild birds and not go to places such as commercial or backyard poultry farms and markets selling live birds. They are advised not to handle or eat raw or undercooked poultry or foods containing uncooked poultry, including eggs. Those who develop flu-like symptoms should seek medical help promptly, and inform the doctors of their travel history. ### Surveillance Surveillance for influenza involves monitoring for virus strains and disease activity. A nationwide reporting scheme for [acute respiratory infections](/wiki/Acute_respiratory_infection) has been established. The [National Influenza Centre](/wiki/National_Influenza_Centers) routinely carried out [virological](/wiki/Virological) testing of respiratory samples from hospitals and polyclinics. The [Agri-Food and Veterinary Authority of Singapore](/wiki/Agri-Food_and_Veterinary_Authority_of_Singapore) (AVA) also carries out routine surveillance on poultry. The [Jurong Bird Park](/wiki/Jurong_Bird_Park) has put 19 chickens, bred without any immunity, in all its [aviaries](/wiki/Aviary) to help detect the presence of any infectious disease. ### Ban on live poultry In June 2005, a ban was imposed on keeping live poultry in [Pulau Ubin](/wiki/Pulau_Ubin), this is to prevent infection on the livestock by [migratory birds](/wiki/Migratory_bird). ### Hospital and medicine To tackle a possible outbreak of bird flu, Singapore is increasing its resource such as isolation facilities in hospitals and stockpiling medicine. These medicines include [Tamiflu](/wiki/Tamiflu) and [Relenza](/wiki/Relenza). As of November 2005, the country has supplies to treat 430,000 people. By sometime in 2006, there will be enough stockpile anti-viral medication for one quarter of the population. A priority plan has been outlined as to who will get these anti-viral drugs first when a bird flu pandemic breaks out and the first people to receive the drugs would be health workers, and those involved in essential services like power and public order. ### Outbreak response plan In the event of an outbreak, Singapore will resume health screening of all visitors, as during the 2003 [SARS](/wiki/SARS) crisis and [quarantine](/wiki/Quarantine) suspected victims. Travel restrictions or advisories would be issued to restrict travel to and from countries which had outbreaks of bird flu. All persons presenting with the abrupt onset of signs and symptoms will be treated with anti-virals. Front-line healthcare workers in hospitals and polyclinics will also be given anti-viral [prophylaxis](/wiki/Prophylaxis) for the duration of the pandemic. ### Funding In January 2006, Singapore announced that it will contribute S$1 million over three years to the global fund-raising effort to fight bird flu, specifically for [ASEAN](/wiki/ASEAN) countries. ## Other sources - Haugan, Salomon *Avian Influenza: Etiology, Pathogenesis and Interventions* (Public Health in the 21st Century. Nova Science Pub Inc. 30 January 2010) [ISBN](/wiki/ISBN_(identifier)) 978-1-60741-846-7 - Singapore says ready to tackle birdflu pandemic – [Reuters](/wiki/Reuters), 17 October 2005. Retrieved 11 July 2020. - S'pore has rapid response system in place to tackle flu pandemic – [Channel NewsAsia](/wiki/Channel_NewsAsia), 17 October 2005\n",
  "language": "en",
  "processed_at": "2026-01-12T12:00:46.830990",
  "title": "Singaporean measures against avian influenza",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singaporean_measures_against_avian_influenza"
}