{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:57:50.915980"
  },
  "content": "You can help **expand this article with text translated from the corresponding article in Chinese**. *(December 2025)* Click [show] for important translation instructions. - Machine translation, like DeepL or Google Translate, is a useful starting point for translations, but translators must revise errors as necessary and confirm that the translation is accurate, rather than simply copy-pasting machine-translated text into the English Wikipedia. - Consider **adding a topic** to this template: there are already 415 articles in the main category, and specifying`|topic=` will aid in categorization. - Do not translate text that appears unreliable or low-quality. If possible, verify the text with references provided in the foreign-language article. - You **must** provide copyright attribution in the edit summary accompanying your translation by providing an interlanguage link to the source of your translation. A model attribution edit summary is `Content in this edit is translated from the existing Chinese Wikipedia article at [[:zh:危机谈判组]]; see its history for attribution.` - You may also add the template `{{Translated|zh|危机谈判组}}` to the talk page. - For more guidance, see Wikipedia:Translation. Law enforcement agency The **Crisis Negotiation Unit** (**CNU**) is a specialist unit of the [Singapore Police Force](/wiki/Singapore_Police_Force) under the umbrella of the [Special Operations Command](/wiki/Special_Operations_Command_(Singapore)). Its teams of specially trained police officers are called upon to defuse life-threatening situations through verbal crisis negotiation techniques for a non-violent resolution. Its precursor is the Negotiation Team which was involved in the [Singapore Airlines Flight 117](/wiki/Singapore_Airlines_Flight_117) ## History CNU was formed in 2002, under the [Special Operations Command (Singapore)](/wiki/Special_Operations_Command_(Singapore)), focusing on the terrorism negotiation before expanding to other fields involving hostage situations, barricaded incidents or stand off situations. The team is made up of police officers and psychologists who volunteer to join CNU as their secondary appointment on top of their duties. There are a total of 4 teams, where at least one team being on stand by at any one time. ## Notable Incidents In 2003, a foreign national threatened to jump of a seven-story high crane in Yio Chu Kang, members of CNU spent 21 hours convincing the foreign national to come down and was ultimately successful. Officers from the CNU were deployed overseas for the first time to aid in the handling of victims' families and relatives as a result of the [2004 Indian Ocean earthquake](/wiki/2004_Indian_Ocean_earthquake). In 2016, a man locked himself and his girlfriend's two-year old son in a flat in Sembawang. Members of CNU negotiated with him for over 17 hours before members of the Special Operations Command breached and entered the apartment. The man was arrested for wrongful confinement and drug-related charges. 1°17′42.41″N 103°48′01.76″E﻿ / ﻿1.2951139°N 103.8004889°E﻿ / 1.2951139; 103.8004889 This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This law enforcement agency article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:57:50.915588",
  "title": "Singapore Police Force Crisis Negotiation Unit",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Police_Force_Crisis_Negotiation_Unit"
}