{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:58:24.021670"
  },
  "content": "Fragment historical stone slab at the mouth of the Singapore River The **Singapore Stone** is a fragment of a large [sandstone](/wiki/Sandstone) slab which originally stood at the mouth of the [Singapore River](/wiki/Singapore_River). The large slab, which is believed to date back to at least the 13th century and possibly as early as the 10th or 11th century, bore an [undeciphered](/wiki/Decipherment) inscription. Recent theories suggest that the inscription is either in [Old Javanese](/wiki/Old_Javanese), [Sanskrit](/wiki/Sanskrit) or in [Tamil](/wiki/Tamil_language), which suggested a possibility that the island was an extension of the [Majapahit](/wiki/Majapahit) civilization in the past. It is likely that the person who commissioned the inscription was [Sumatran](/wiki/Sumatra). The slab may be linked to the legendary story of the 14th-century strongman [Badang](/wiki/Badang), who is said to have thrown a massive stone to the mouth of the Singapore River. On Badang's death, the [Rajah](/wiki/Raja) sent two stone pillars to be raised over his grave \"at the point of the straits of Singapura\". The slab was blown up in 1843 during British colonial rule to clear and widen the passageway at the river mouth to make space for a fort and the quarters of its commander D.H. Stevenson. The Stone, now displayed at the [National Museum of Singapore](/wiki/National_Museum_of_Singapore), was designated by the museum as one of 11 National Treasures of Singapore in January 2006, and by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) as one of the top 12 artefacts held in the collections of its museums. ## Sandstone slab Part of the [Early history of Singapore](/wiki/Early_history_of_Singapore)[Topynymy](/wiki/Names_of_Singapore)[Sabana](/wiki/Golden_Chersonese#Settlements)**[Temasek](/wiki/Temasek)** • [Long Ya Men](/wiki/Long_Ya_Men) • [Ban Zu](/wiki/Ban_Zu)*[Malay Annals](/wiki/Malay_Annals)***[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)** • [Sang Nila Utama](/wiki/Sang_Nila_Utama) • [Parameswara](/wiki/Parameswara_of_Malacca)[Badang](/wiki/Badang)[Hang Nadim](/wiki/Hang_Nadim#In_legend_and_popular_culture)**[Sack of Singapore](/wiki/Sack_of_Singapore)**[Archaeology in Singapore](/wiki/Archaeology_in_Singapore)Singapore Stone[Fort Canning Hill](/wiki/Fort_Canning_Hill) Singapore portal - v - t - e ### Discovery In June 1819, a few months after the arrival of Sir [Stamford Raffles](/wiki/Stamford_Raffles) (1781–1826) in Singapore, a [sandstone](/wiki/Sandstone) slab about 10 ft (3.0 m) high and 9 to 10 ft (2.7 to 3.0 m) long was found by labourers clearing jungle trees at the southeast side of the mouth of the [Singapore River](/wiki/Singapore_River). It stood at a [promontory](/wiki/Promontory) known as the Rocky Point, and later as Artillery Point, Fort Fullerton and the Master Attendant's Office. (In 1972, a short projection from the slab's site was constructed and a statue of an imaginary beast called the [Merlion](/wiki/Merlion) placed on it. The statue has since been relocated.) According to papers from the *Journal of the Asiatic Society of Bengal* which were collected by Sir William Edward Maxwell and republished in 1886, one Dr. D.W. Montgomerie said that the rock was brought to light by some [Bengal](/wiki/Bengali_people) sailors employed by Captain Flint, [R.N.](/wiki/Royal_Navy), the first Master Attendant: > You remember the situation of it [the sandstone slab] on the rocky point on the south [*sic*: southeast] side of the entrance of the Singapore Creek. That point was covered with forest trees and jungle in 1819, and the stone was brought to notice by some Bengal clashees who were employed by Capt. Flint, R.N. (the first Master Attendant); the men on discovering the inscription were very much frightened, and could not be induced to go on with the clearing, which, if I recollect right, was completed by Chinese under the stimulus of high wages. The slab was inscribed with 50 or 52 lines of script, but by the time of its discovery the meaning of the inscription was already a mystery to the island's inhabitants. ### Appearance [John Crawfurd](/wiki/John_Crawfurd) (1783–1868), who was [Resident](/wiki/Resident_(title)) of Singapore, described the slab in his journal on 3 February 1822 in these terms: > On the stony point which forms the western side of the entrance of the salt creek, on which the modern town of Singapore is building, there was discovered, two years ago, a tolerably hard block of sand-stone, with an inscription upon it. This I examined early this morning. The stone, in shape, is a rude mass, and formed of the one-half of a great nodule broken into two nearly equal parts by artificial means; for the two portions now face each other, separated at the base by a distance of not more than two feet and a half, and reclining opposite to each other at an angle of about forty degrees. It is upon the inner surface of the stone that the inscription is engraved. The workmanship is far ruder than any thing of the kind that I have seen in Java or India; and the writing, perhaps from time, in some degree, but more from the natural decomposition of the rock, so much obliterated as to be quite illegible as a composition. Here and there, however, a few letters seem distinct enough. The character is rather round than square. [James Prinsep](/wiki/James_Prinsep) (1799–1840), a scholar and [antiquary](/wiki/Antiquary) who started the *Journal of the Asiatic Society of Bengal*, published a paper in the *Journal* in 1837 by a Dr. William Bland of [H.M.S.](/wiki/Her_Majesty%27s_Ship) *Wolf*, which stated that he had made a facsimile of all that remained in any way perceptible on the slab. Dr. Bland described the slab thus: > On a tongue of land forming the termination of the right bank of the river at Singapore, now called Artillery Point, stands a stone or rock of coarse red sandstone about ten feet high, from two to five feet thick, and about nine or ten feet in length, somewhat wedge-shaped, with weather-worn cells. The face sloping to the south-east at an angle of 76° has been smoothed down in the form of an irregular square, presenting a space of about thirty-two square feet, having a raised edge all round. > On this surface an inscription has originally been cut, of about fifty lines, but the characters are so obliterated by the weather that the greater part of them are illegible. Still, there are many left which are plain enough, more particularly those at the lower right-hand corner, where the raised edge of the stone has in some measure protected them. The inscription was engraved in rounded letters about three-quarters of an inch (1.9 cm) wide. ### Destruction About January 1843, on the orders of the acting Settlement Engineer, Captain D.H. Stevenson, the slab was blown to pieces to clear and widen the passageway at the Singapore River mouth to make space for Fort Fullerton and the quarters of its commander. Some sources claim that the Superintendent of Public Works, [George Drumgoole Coleman](/wiki/George_Drumgoole_Coleman), was responsible for the Stone's destruction, but he was on leave and not in Singapore at the time of its blasting. Lieutenant-Colonel [James Low](/wiki/James_Low_(East_India_Company_officer)) had petitioned to have the sandstone slab spared, but had been told that it was in the way of a projected bungalow. On the explosion taking place, he crossed the river from his office and selected fragments that had letters on them. As the fragments were very bulky, he had them chiselled into small slabs by a Chinese man. He selected some of the smaller fragments bearing the most legible parts of the inscription and sent them to the [Royal Asiatic Society](/wiki/Royal_Asiatic_Society)'s museum in [Calcutta](/wiki/Kolkata) (now known as the [Indian Museum](/wiki/Indian_Museum)) for analysis, where they arrived in about June 1848. According to Maxwell's papers, when news of the destruction of the sandstone slab reached [Bengal](/wiki/Bengal_Presidency), James Prinsep asked the [Governor of the Straits Settlements](/wiki/List_of_Governors_of_the_Straits_Settlements), Colonel [William John Butterworth](/wiki/William_John_Butterworth), to secure any legible fragments that might still exist and to send them to the Royal Asiatic Society's museum. Butterworth replied: \"The only remaining portion of the stone you mention, except what Colonel Low may have, I have found lying in the verandah of the Treasury at Singapore, where it was used as a seat by the [Sepoys](/wiki/Sepoy) of the guard and persons in waiting to transact business. I lost no time in sending it to my house, but, alas! not before the inscription was nearly erased. Such as the fragment was then however – *i.e.*, in 1843 – it is now; for I have preserved the stone with much care, and shall have much pleasure in sending it for your museum, having failed to establish one, as I hoped to have done, in Singapore.\" A large block from the monument lay abandoned at [Government Hill](/wiki/Government_Hill,_Singapore) until finally being broken up and used as gravel for a road. According to one W.H. Read, who arrived in Singapore in 1841: > I remember a large block of the rock at the corner of [Government House](/wiki/Government_House,_Singapore), where [Fort Canning](/wiki/Fort_Canning) is now; but during the absence of the Governor at Penang on one occasion the convicts requiring stone to replace the road, chipped up the valuable relic of antiquity, and thus all trace of our past history was lost. > It was destroyed when the sea-wall was built around Fort Fullerton, where the Club, Post Office, and Master Attendant's Office now are. It used to be decorated with flags and offerings when at the entrance of the Singapore river. The immediate consequence of the removal of the stone, an act of vandalism, was the silting up of the river. I have been told that an inscription in similar characters, which I always understood were \"cuneiform,\" still exists (1884) in the [Carimon Islands](/wiki/Karimun_Regency). D. W. Montgomerie, recalling that the Bengal sailors who had discovered the slab while clearing the jungle could not be persuaded to continue the work, commented: \"What a pity it is that those who authorized the destruction of the ancient relic were not prevented by some such wholesome superstition!\" In 1918, the Raffles Museum and Library's Committee of Management asked the Royal Asiatic Society's museum in Calcutta to return the fragments of the sandstone slab, and the Calcutta museum agreed to send one fragment back to the museum. Archaeologist [John N. Miksic](/wiki/John_N._Miksic) has said that \"presumably the other pieces are still in Calcutta\". ## Inscription and attempts at decipherment Several scholars tried, over time, to better understand the extant text of the Singapore Stone and, ultimately, to decipher it. The sub-sections below provide a summary of those decipherment proposals. ### Sir Stamford Raffles Raffles himself tried to [decipher](/wiki/Decipherment) the inscriptions on the original sandstone slab. In his 1834 work, *The Malay Peninsula*, Captain Peter James Begbie of the Madras Artillery, part of the [Honourable East India Company](/wiki/Honourable_East_India_Company), wrote: > The principal curiosity of Singapore is a large stone at the point of the river, the one face of which has been sloped and smoothed, and upon which several lines of engraven characters are still visible. The rock being, however, of a [schistose](/wiki/Schist) and porous nature, the inscription is illegible. It is said that Sir Stamford Raffles endeavoured, by the application of powerful acids, to bring out the characters with the view of decyphering them, but the result was unsuccessful. In the *Hikayat Abdullah*, [Abdullah bin Abdul Kadir](/wiki/Abdullah_bin_Abdul_Kadir) (1796–1854), also known as [Munshi](/wiki/Munshi) Abdullah, recorded Raffles taking missionary Rev. Claudius Henry Thomsen and himself to see what Raffles described as a \"remarkable stone\" in October 1822. Raffles apparently took the view that the writing had to be [Hindu](/wiki/Linguistic_history_of_India) \"because the Hindus were the oldest of all immigrant races in the East, reaching Java and Bali and Siam, the inhabitants of which are all descended from them\". ### William Bland and James Prinsep (Pali) In his note published in the *Journal of the Asiatic Society of Bengal* of 1837, Dr. William Bland reported that he had \"frequently made pilgrimages\" to the Stone, \"determined, if it were possible, to save a few letters, could they be satisfactorily made out, to tell us something, however, small, of the language or the people who inscribed it, and hence eke out our limited and obscure knowledge of the Malayan Peninsula.\" With the assistance of a \"clever native writer\", Bland used \"well-made and soft dough\" to take impressions of the characters on the slab to copy them. After an impression of each character had been made, the character itself in the stone was painted over with [white lead](/wiki/White_lead), \"as far as the eye could make it out, ... and if the two agreed, it was considered as nearly correct as possible, and although this was done to all the characters, it was more particularly attended to in the more obscure ones, for the letters marked in the facsimile with more strength could readily be copied by the eye.\" Bland also discovered that when the Stone was viewed \"when the sun was descending in the west, [a palpable shadow](/wiki/Shadow_marks) was thrown into the letter, from which great assistance was derived.\" In Bland's view, \"speaking from a very limited knowledge of the subject\", the inscription was in \"the ancient Ceylonese, or [Pálí](/wiki/Pali)\". James Prinsep concurred, saying that although he could not venture to put together any connected sentences or even words, \"some of the letters – the *g*, *l*, *h*, *p*, *s*, *y*, &c. – can readily be recognised, as well as many of the vowel marks\". He expressed the opinion that the purpose of the inscription \"is most probably to record the extension of the [Buddhist faith](/wiki/Buddhism) to that remarkable point of the Malay Peninsula\". ### Peter James Begbie's speculative theory (Tamil) In *The Malay Peninsula* (1834), Captain Peter James Begbie made \"an attempt to throw some light upon a subject so confessedly obscure\". He referred to the legend of the 14th-century strongman [Badang](/wiki/Badang) in the *[Malay Annals](/wiki/Malay_Annals)* (1821), a posthumously published English translation of the *Sejarah Melayu* (1612) by the British [orientalist](/wiki/Orientalism) [John Leyden](/wiki/John_Leyden) (1775–1811). According to the *Malay Annals*, news of Badang's remarkable feats of strength reached the land of Kling (the [Coromandel Coast](/wiki/Coromandel_Coast)). The [Rajah](/wiki/Raja) of that country sent a champion named Nadi Vijaya Vicrama to try his strength with him, staking seven ships filled with treasures on the issue of the contest. After a few trials of their relative powers, Badang pointed to a huge stone lying before the Rajah's hall and asked his opponent to lift it, and to allow their claims to be decided by the greatest strength displayed in this feat. The Kling champion assented, and, after several failures, succeeded in raising it as high as his knee, after which he immediately let it fall. Badang took up the stone, poised it easily several times, and then threw it out into the mouth of the river, and this is the rock which is at this day visible at the point of Singhapura, or Tanjong Singhapura. The *Annals* go on to state that after a long time, Badang died and was buried at the point of the straits of Singhapura, and when the tidings of his death reached the land of Kling, the Rajah sent two stone pillars to be raised over his grave as a monument, and these were the pillars which were still at the point of the bay. Begbie went on to speculate that the monument installed over Badang's grave was the sandstone slab at the mouth of the Singapore River, and that the inscription contained a recital of Badang's feats. He identified the \"Rajah of Kling\" as Sri Rajah Vicrama who reigned from 1223 to 1236. In Begbie's view, the inscription was in an obsolete dialect of [Tamil](/wiki/Tamil_language): > At the period of the transaction [which Begbie put at about A.D. 1228], the Malays were destitute of a written language, as it was not until between forty and fifty years afterwards, when the [Mahommedan religion](/wiki/Islam) became the popular one, that the [Arabic character](/wiki/Arabic_alphabet) was introduced. It appears to be probable that the Kling Rajah, aware of this destitution of a written character, employed a sculptor of his own nation to cut the inscription on the rock, and that, from the epitaph being in an unknown language, the original story as therein related, being necessarily handed down by oral tradition, became corrupted in every thing but its leading features. This supposition is borne out by the form of the characters, which more resembles that of the [Malabar language](/wiki/Malayalam_script) than any other oriental tongue that I am acquainted with. I do not mean to say that the words are essentially Tamil, but merely to express an opinion that the inscription is couched in an obsolete dialect of that language. ### J.W. Laidlay, Iain Sinclair, Francesco Perono Cacciafoco, and I-Shiang Lee (Kawi) J.W. Laidlay examined fragments of the sandstone slab that had been donated to the Asiatic Society of Bengal by Colonel Butterworth and Lieutenant-Colonel James Low, strewing finely powdered animal charcoal over the surface of the stones and sweeping it gently with a feather so as to fill up all the depressions; in this way \"the very slightest of which was thus rendered remarkably distinct by the powerful contrast of colour. By this means, and by studying the characters in different lights\", Laidlay was able to make drawings of the inscriptions on three fragments. According to Laidlay, the fragment shown in the top drawing seemed to have been from the upper part of the inscription, but was omitted in Prinsep's [lithograph](/wiki/Lithography) as effaced. He could not identify the other two fragments with any portion of the lithograph. Laidlay felt that the square shape of the characters had misled Prinsep into concluding that the inscription was in Pali. In fact, the characters bore no resemblance whatsoever to Pali. Laidlay was unable to identify the characters with those of any published [Sinhala](/wiki/Sinhala_script) inscriptions, but found it identical with [Kawi](/wiki/Kawi_language), a literary language from the islands of [Java](/wiki/Java_(island)), [Bali](/wiki/Bali) and [Lombok](/wiki/Lombok) based on [Old Javanese](/wiki/Old_Javanese_language) with many [Sanskrit](/wiki/Sanskrit) [loanwords](/wiki/Loanword). He noted, \"With the alphabet of this language, ... I can identify all, or nearly all, of the characters; but of course no clue to the purport of the inscription can be obtained without some knowledge of the language itself.\" Relying on Begbie, he, too, \"conjectured with probability that the inscription is a record of some Javanese triumph at a period anterior to the conversion of the Malays to [Muhammadanism](/wiki/Islam)\". In December 2019, [ISEAS-Yusof Ishak Institute](/wiki/ISEAS%E2%80%93Yusof_Ishak_Institute) and the [Indian Heritage Centre](/wiki/Indian_Heritage_Centre) jointly published *From Sojourners To Settlers - Tamils in Southeast Asia and Singapore,* including research by Australian researcher Dr Iain Sinclair. Dr Sinclair, agreeing that the inscription was most likely Kawi, proceeded to identify the fragment \"kesariva\" in the inscriptions. Comparing this to a corpus of ancient Sanskrit writings, he suggested that the fragment was part of the word \"parakesarivarman\" – a title used by several kings of the Tamil [Chola dynasty](/wiki/Chola_dynasty) in India. This suggests [Tamil](/wiki/Tamils) connections with the Strait of Singapore as far back as 1,000 years ago, thus redefining the island's historical timeline. He suggests that the stone could have been created at the beginning of the 11th century, redefining Singapore's foundation over 300 years earlier than the currently accepted founding date of 1299. In August 2023, Francesco Perono Cacciafoco and I-Shiang Lee produced a comparison between the Singapore Stone and the [Calcutta Stone](/wiki/Calcutta_Stone) and further analyzed the possible link to the Kawi script. They found that while there are similarities, there is a noticeable difference in the usage of [diacritics](/wiki/Diacritics). ### Studies by Kern and other scholars (Old Javanese or Sanskrit) The first effectual study of the sandstone fragments was by the Dutch [epigrapher](/wiki/Epigraphy) [Johan Hendrik Caspar Kern](/wiki/Johan_Hendrik_Caspar_Kern). He succeeded in deciphering a few words, including *salāgalalasayanara*, *ya-āmānavana*, *kesarabharala* and *yadalama*, but was unable to identify the language in which they were written. He gave the probable date of the inscription as around 1230. Another Dutch [Indologist](/wiki/Indology), N.J. Krom, judged from a rubbing of the Stone published in 1848 that the script resembled that of the [Majapahit Empire](/wiki/Majapahit_Empire) but dated from a period somewhat earlier than 1360. Other scholars have taken different views. Dr. J.G. de Casparis, a scholar of ancient Indonesian writing, gave the preliminary judgment that the style of the script might date from an earlier period such as the 10th or 11th century. He was able to decipher one or two words, which seemed to be in the [Old Javanese language](/wiki/Old_Javanese_language). On the other hand, Drs. Boechari, epigraphical expert of the Indonesian National Research Centre for Archaeology and lecturer at the [University of Indonesia](/wiki/University_of_Indonesia), was of the opinion that the engraving dates from no later than the 12th century, has a closer affinity to the [Sumatran](/wiki/Sumatra) than the Javanese writing style, and that the language may not be Old Javanese but [Sanskrit](/wiki/Sanskrit), which was in common use in Sumatra at that era. John Miksic has commented that while it is impossible to determine whether de Casparis's or Boechari's theory is more correct on the basis of epigraphy alone, it is easier to accept the conclusion that the person who commissioned the inscription was culturally Sumatran rather than Javanese, because by the 10th century the linguistic influence of Java had reached the [Lampung](/wiki/Lampung) region in the south of Sumatra, but no such influence has been discovered as far north as Singapore and there is no evidence of Javanese colonisation in Sumatra or the offshore islands at that time. Miksic notes that most conclusions regarding the slab have been on the basis of rubbings or photographs, and thus there is a \"slight possibility\" that detailed analysis of fragments of the sandstone slab may provide more information about the age of the inscription or the nature of its contents. However, he also says that the script probably never will be fully deciphered. ## Singapore Stone today One of the fragments of the original sandstone slab that was saved by Lieutenant-Colonel Low, which was later returned to what was then the Raffles Museum in Singapore, is today known as the Singapore Stone. It is currently displayed in the [Singapore History Gallery](/wiki/Singapore_History_Gallery) of the [National Museum of Singapore](/wiki/National_Museum_of_Singapore). The Stone was designated by the Museum as one of 11 \"national treasures\" in January 2006, and by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) as one of the top 12 artefacts held in the collections of its museums. The Singapore Stone, along with its connection to the legend of [Badang](/wiki/Badang), was depicted during the 2016 [Singapore National Day Parade](/wiki/Singapore_National_Day_Parade). - [Archaeology in Singapore](/wiki/Archaeology_in_Singapore) - [Early history of Singapore](/wiki/Early_history_of_Singapore) - [National Museum of Singapore](/wiki/National_Museum_of_Singapore) ## Notes ### Articles - Bland, W. (William) (1837). \"Inscription on the Jetty at Singapore\". *Journal of the Asiatic Society of Bengal*. **6**: 680–682., reprinted in vol. 1 of Rost, Reinhold, ed. (1886). *Miscellaneous Papers Relating to Indo-China : Reprinted for the Straits Branch of the Royal Asiatic Society, from Dalrymple's 'Oriental Repertory' and the 'Asiatic Researches' and 'Journal' of the Asiatic Society of Bengal (Trübner's Oriental Series)*. Vol. 1. London: Kegan Paul, Trench, Trübner & Co. pp. 218–219. This two-volume work was reprinted by Routledge in 2000. - [Prinsep, James](/wiki/James_Prinsep) (1848). \"Inscription at Singapore\". *Journal of the Asiatic Society of Bengal*. **xvii**: 154 *f*., reprinted in *Miscellaneous Papers Relating to Indo-China*, above, vol. 1 at 222–223. - Low, James (1848). \"An Account of Several Inscriptions Found in Province Wellesley, on the Peninsula of Malacca\". *Journal of the Asiatic Society of Bengal*. **xvii** (ii): 62–66., reprinted in *Miscellaneous Papers Relating to Indo-China*, above, vol. 1 at 223–226. - Laidlay, J.W. (1848). \"Note on the Inscriptions from Singapore and Province Wellesley Forwarded by the Hon. Col Butterworth and Col J. Low\". *Journal of the Asiatic Society of Bengal*. **17** (2)., reprinted in *Miscellaneous Papers Relating to Indo-China*, above, vol. 1 at 227–232. - Rouffaer, G.P. (1921). \"Was Malakka emporium voor 1400 A.D. genaamd Malajoer? En waar lag Woerawari, Ma-Hasin, Langka, Batoesawar? [Was the Trading Post of Malacca Named Malajoer before 1400 A.D.? And where were Woerawari, Ma-Hasin, Langka, Batoesawar?]\". *Bijdragen tot de Taal-, Land- en Volkenkunde van Nederlandsch-Indië*. **77** (1): 58.. - Cornelius-Takahama, Vernon (30 March 2000). \"The Singapore Stone\". Singapore Infopedia, [National Library, Singapore](/wiki/National_Library,_Singapore). Archived from the original on 4 July 2007. Retrieved 13 July 2007. - \"Singapore Stone\". Singapore Paranormal Investigators. 2000–2005. Archived from the original on 23 June 2007. Retrieved 13 July 2007. - Kelvin Cahya Yap; Tony Wenyao Jiao; Francesco Perono Cacciafoco (2023). \"The Singapore Stone: Documenting the Origins, Destruction, Journey and Legacy of an Undeciphered Stone Monolith\". *Histories*. **3, 3**: 271–287. - I-Shiang Lee; Francesco Perono Cacciafoco (2023). \"Unravelling the Mystery of the Singapore Stone: A Comparative Analysis with the Calcutta Stone and the Possible Kawi Connection\". *Histories*. **3, 3**: 261–270. ### Books - [Abdullah bin Abdul Kadir](/wiki/Abdullah_bin_Abdul_Kadir); annotated transl. by A.H. Hill (1969). *The Hikayat Abdullah : The Autobiography of Abdullah bin Abdul Kadir (1797–1854)*. Singapore: [Oxford University Press](/wiki/Oxford_University_Press). - Miksic, John N. (Norman) (1985). *Archaeological Research on the 'Forbidden Hill' of Singapore : Excavations at Fort Canning, 1984*. Singapore: [National Museum](/wiki/National_Museum_of_Singapore). [ISBN](/wiki/ISBN_(identifier)) 9971-917-16-5. - Kelvin Cahya Yap; Tony Wenyao Jiao; Francesco Perono Cacciafoco (2023). \"The Singapore Stone: Documenting the Origins, Destruction, Journey and Legacy of an Undeciphered Stone Monolith\". *Histories*. **3, 3**: 271–287. - I-Shiang Lee; Francesco Perono Cacciafoco (2023). \"Unravelling the Mystery of the Singapore Stone: A Comparative Analysis with the Calcutta Stone and the Possible Kawi Connection\". *Histories*. **3, 3**: 261–270. - \"Our Top Twelve Artefacts\". [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)). Archived from the original on 14 June 2007. Retrieved 13 July 2007. - Tan, Noel Hidalgo (15 June 2007). \"The Ancient Script of Southeast Asia – Part 1\". SEAArch – The Southeast Asian Archaeology Newsblog. Retrieved 13 July 2007. - Tan, Noel Hidalgo (20 June 2007). \"The Ancient Script of Southeast Asia – Part 2\". SEAArch – The Southeast Asian Archaeology Newsblog. Retrieved 13 July 2007. - \"Inscribed sandstone known as the 'Singapore Stone', Singapore, 10th - 14th century\" Roots.gov.sg. Retrieved 12 July 2022. - Official website of the National Museum of Singapore Portals: - History - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:58:24.021308",
  "title": "Singapore Stone",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Stone"
}