{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:48.607066"
  },
  "content": "This article **may incorporate text from a large language model**. It may include [hallucinated](/wiki/Hallucination_(artificial_intelligence)) information, copyright violations, claims not verified in cited sources, original research, or fictitious references. Any such material should be removed and content with an unencyclopedic tone should be rewritten. *(November 2025)* *(Learn how and when to remove this message)*Islamic college in Singapore‹ The template *Infobox university* is being considered for merging. › **Singapore College of Islamic Studies** (SCIS) is an upcoming Islamic higher education institution in Singapore, owned and governed by the [Islamic Religious Council of Singapore](/wiki/Islamic_Religious_Council_of_Singapore) (MUIS), scheduled to commence operations in 2028. SCIS is a religious educational institution established by MUIS. ## History The establishment of the Singapore College of Islamic Studies was a strategic initiative by MUIS to enhance Islamic education in Singapore. Announced in August 2024, the college represents a significant milestone in the country's religious education landscape. Singapore's Mufti has described the institution as a crucial development, reflecting the nation's commitment to nurturing well-rounded religious leadership. The announcement garnered significant attention from national leadership. Prime Minister [Lawrence Wong](/wiki/Lawrence_Wong) highlighted the college's importance, emphasizing its potential to prepare students for leadership roles within religious and social sectors. To ensure comprehensive and global perspectives, the college will collaborate with several established international institutions. These partnerships include the [Singapore University of Social Sciences](/wiki/Singapore_University_of_Social_Sciences), Egypt's Islamic advisory body [Dar al-Ifta al-Misriyyah](/wiki/Dar_al-Ifta_al-Misriyyah), the [University of Jordan](/wiki/University_of_Jordan), and the [Al-Qarawiyyin](/wiki/Al-Qarawiyyin) in Morocco. Leaders from these institutions and other universities, such as [Al-Azhar](/wiki/Al-Azhar) in Egypt, will serve on the SCIS advisory panel, contributing their perspectives on contemporary issues impacting Muslim minorities. ## Academic programs The college will offer a comprehensive undergraduate degree program designed to provide students with a holistic educational experience. The curriculum will integrate traditional Islamic studies with contemporary disciplines, creating a unique academic approach. Students will receive a balanced education that combines deep religious understanding with practical skills relevant to modern society. ## Campus and infrastructure The college will be located at the Islamic Religious Council of Singapore's learning campus near [Masjid Bencoolen](/wiki/Masjid_Bencoolen). For its inaugural year in 2028, SCIS plans to admit an initial cohort of 60 students. This carefully planned approach allows for a focused and high-quality educational experience that can be gradually expanded in subsequent years.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:48.606668",
  "title": "Singapore College of Islamic Studies",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_College_of_Islamic_Studies"
}