{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:54:32.626600"
  },
  "content": "H1-B visa variant issued to citizens of Singapore and Chile, and 2003 American tariff law **The United States–Singapore Free Trade Agreement** was signed 6 May 2003 and ratified by the [US House of Representatives](/wiki/US_House_of_Representatives) on 24 July 2003 by a vote of 272-155. The [US Senate](/wiki/US_Senate) ratified the bill on 31 July 2003 by a vote of 66-32. President [George W. Bush](/wiki/George_W._Bush) signed into law the United States-Singapore Free Trade Agreement Implementation Act on 3 September 2003. The trade pact was implemented by both countries on 1 January 2004. In addition to lowering of tariffs, the agreement also allowed easier movement of citizens from both countries. With its implementation, it became possible for some Singaporean citizens to reside in the United States for extended periods of time. Business people and traders with E1 or E2 visa are now allowed a two-year stay period but an indefinite extension is allowed. Professionals with H-1B1 visa are allowed to stay for a maximum period of up to 18 months but indefinite extension can be applied for. There is an annual quota of 5,400 visa for Singaporeans, but this quota has yet to be reached to date. Any unused quota is transferred to the general pool for use by citizens of other countries. United States citizens coming to Singapore are allowed to work in most business occupations for 3 months without a visa or Professional Visit Pass. ## Competition chapter Chapter 12 of the agreement proscribes anti-competitive business conduct. The chapter broke new ground among U.S. FTAs for its obligations related to [government enterprises](/wiki/Government-owned_corporation). A government enterprise was a \"covered entity\" for purposes of the FTA if the Government of Singapore owned any special voting shares, with the exception of enterprises operating only for investing Singapore Government reserves. Even if the Singapore Government did not own any shares in an enterprise, enterprises with revenue over an adjusted threshold could still be a covered entity if there was *\"effective influence\"* from the Government. Effective influence exists where the government owns more than 50% of the voting rights, or can exercise substantial influence over the management. If the government owns less than 50% of the voting shares, but more than 20%, there is a presumption of effective influence that the Government of Singapore can rebut. Having broadly defined government enterprises, the chapter goes on to prescribe several obligations subject to the FTAs dispute settlement provisions. Singapore agreed to ensure that its government enterprises acted in accordance with commercial considerations and that they do not enter into anti-competitive dealings with competitors. Singapore also agreed to annually publish a report detailing its ownership and relationship with all covered entities, offer the names of any government officials serving as officers or directors, and the entity's annual revenue or total assets. Furthermore, Singapore is obligated to take no action or attempt at influencing decisions of its government enterprises, and at the same time continually reduce, with the goal of substantially eliminating, its ownership and other interests in enterprises. ## Views in favor of US-Singapore FTA Proponents of the US-Singapore FTA claim that the reduction of trade barriers between the two countries will lead to a growth in exports. - USTR Site on Singapore FTA ## Views opposed to the US-Singapore FTA In announcing the deal, President Bush hailed Singapore as \"a strong partner in the war on terrorism and a member of the coalition on Iraq.\" [Asia Times](/wiki/Asia_Times) columnist Jeffrey Robertson argued that the deal was a reward for Singapore's support of the Iraq invasion. The suggested *quid pro quo* may be dubious, since the FTA negotiations with Singapore were begun by President Clinton and concluded around the same time as the FTA with Chile (also started by Clinton), which was not a coalition partner. - Citizens' Trade Campaign Site on Singapore FTA ## See more - [Rules of Origin](/wiki/Rules_of_Origin) - [Market access](/wiki/Market_access) - [Free-trade area](/wiki/Free-trade_area) - [Tariffs](/wiki/Tariffs) ## Other references - Congressional Research Service Report on Singapore FTA - Congressional Research Service Report on \"Free Trade Agreements with Singapore and Chile: Labor Issues\" - U.S. Senate Finance Committee Hearing on US-Singapore FTA\n",
  "language": "en",
  "processed_at": "2026-01-12T11:54:32.626180",
  "title": "Singapore–United States Free Trade Agreement",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore%E2%80%93United_States_Free_Trade_Agreement"
}