{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:58:49.860397"
  },
  "content": "Zoo situated in Mandai, Singapore The **Singapore Zoo**, formerly known as the **Singapore Zoological Gardens** or **Mandai Zoo**, is a 28 hectares (69 acres) [zoo](/wiki/Zoo) located on the margins of [Upper Seletar Reservoir](/wiki/Upper_Seletar_Reservoir) within [Singapore](/wiki/Singapore)'s heavily forested [central catchment area](/wiki/Central_Water_Catchment). It is operated by the [Mandai Wildlife Group](/wiki/Mandai_Wildlife_Group), which also manages the neighbouring [Night Safari](/wiki/Night_Safari,_Singapore), [River Wonders](/wiki/River_Wonders), [Bird Paradise](/wiki/Bird_Paradise) as well as [Rainforest Wild](/wiki/Rainforest_Wild). All five wildlife parks makes up the Mandai Wildlife Reserve, which cares for more than 15,000 animals from 1,000 species. Opened in 1973, the zoo was built at a cost of $9 million that was granted by the [government of Singapore](/wiki/Government_of_Singapore). Within the zoo, there are about 315 species of animals, of which some 16 percent are considered to be a [threatened species](/wiki/Threatened_species). The zoo attracts about 2 million visitors every year. Singapore Zoo exhibits animals in naturalistic, 'open' exhibits with hidden barriers, [moats](/wiki/Moat), and glass between the animals and visitors. It houses the largest captive colony of [orangutans](/wiki/Orangutan) in the world. The Singapore Zoo has been highly ranked by various international metrics. ## History Prior to the establishment of Singapore Zoo, there were other short-lived zoos in Singapore's history, including the first recorded zoo founded in the early 1870s at the present-day [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens), a zoo opened in the 1920s in Ponggol (present-day [Punggol](/wiki/Punggol)) by animal trader William Lawrence Soma Basapa and two zoos run by two brothers by the surname of Chan during the 1960s. The conception of the Singapore Zoo dates from 1969. At the time, the [Public Utilities Board](/wiki/Public_Utilities_Board) (PUBG) decided to use some of its land holdings around [reservoirs](/wiki/Reservoir_(water)) for parks and open recreational facilities. The executive chairman of the PUB, Dr Ong Swee Law, set aside 88 ha (220 acres) of land for the construction of a [zoological garden](/wiki/Zoological_garden). In 1970, consultants and staff were hired, and in 1971, the construction of the basic 50 enclosures was started. Animals were collected from dealers and donated by sponsors. The director of the [National Zoological Gardens of Sri Lanka](/wiki/National_Zoological_Gardens_of_Sri_Lanka), Lyn de Alwis, was hired as a special consultant to work out the problems inherent in [tropical](/wiki/Tropics) zoos. On 27 June 1973, the Singapore Zoo opened its gates for the first time with a collection of 270 animals from over 72 [species](/wiki/Species), and a staff of 130. By 1990, 1,600 animals from more than 160 species lived in [social groups](/wiki/Social_group), housed in 65 [landscaped](/wiki/Landscape_architecture) exhibits with boundaries conceived to look as natural as possible. In 1987, the zoo began to display rare animals loaned by other zoos. The first animals displayed in this manner were the rare [golden snub-nosed monkeys](/wiki/Golden_snub-nosed_monkey) from China in 1987, which attracted more than half a million visitors. This was followed by [white tigers](/wiki/White_tiger) from [Cincinnati Zoo](/wiki/Cincinnati_Zoo_and_Botanical_Garden) in 1988 and [giant pandas](/wiki/Giant_panda) from [Wolong National Nature Reserve](/wiki/Wolong_National_Nature_Reserve) in 1990. On 1 August 2000, Singapore Zoological Gardens, [Jurong Bird Park](/wiki/Jurong_Bird_Park) and [Night Safari](/wiki/Night_Safari,_Singapore) were integrated under Wildlife Reserves Singapore, under the umbrella of [Temasek Holdings](/wiki/Temasek_(company)). The zoo underwent a restructuring to improve its efficiency and branding which included the merging of shared services and expansion of consultancy services overseas. Night Safari, which began under the zoo, became a separate branding entity.[*citation needed*] The restructuring of the zoo was not without controversy. Several key staff, including CEO Bernard Harrison, left as a result in 2002, citing differences in management style. In 2003, Wildlife Reserves Singapore launched a massive rebranding exercise, which was shelved due to widespread public disapproval. The name of the zoo was simplified to Singapore Zoo sometime by 2005.[*citation needed*] As a result of the restructuring, more facilities were launched, such as a S$3.6 million Wildlife Healthcare & Research Centre in 2005. Existing infrastructure was revamped to further enhance the experience of visitors. ## Animals and exhibits Treetops Trail From a [boardwalk](/wiki/Boardwalk), visitors can view [yellow-cheeked gibbons](/wiki/Yellow-cheeked_gibbon), [lar gibbons](/wiki/Lar_gibbon) and overlook [false gharials](/wiki/False_gharial) in the water. Near to the outdoor area of [Asian small-clawed otters](/wiki/Asian_small-clawed_otter), [proboscis monkeys](/wiki/Proboscis_monkey), [North Sulawesi babirusas](/wiki/North_Sulawesi_babirusa), [Sumatran bearded pigs](/wiki/Bornean_bearded_pig), and [pygmy hippos.](/wiki/Pygmy_hippopotamus) Tiger Trek You can see the [Malayan tigers](/wiki/Malayan_tiger) at the Tiger Trek enclosure. Their pair of [white tigers](/wiki/White_tiger) moved off since because they are being moved to [Night Safari](/wiki/Night_Safari,_Singapore). Gibbon Island The opposite of Treetops Trail exhibit using landscaping, trees, and moats to create a more natural habitat like [yellow-cheeked gibbons](/wiki/Yellow-cheeked_gibbon), [great white pelicans](/wiki/Great_white_pelican), and [red ruffed lemurs](/wiki/Red_ruffed_lemur). Orangutan Island Orangutans have been a major attraction of the Singapore Zoo since its opening. The zoo houses both [Bornean orangutans](/wiki/Bornean_orangutan) and [Sumatran orangutans](/wiki/Sumatran_orangutan). A female Sumatran orangutan named [Ah Meng](/wiki/Ah_Meng) became an icon for tourism, appearing in several tourism advertisements. She hosted the 'Breakfast with Orangutans' program, where visitors were allowed to take pictures and interact with her. Ah Meng died on 8 February 2008 of old age at 47 years old. Ishta, Ah Meng's granddaughter, was chosen to take over the namesake of Ah Meng. Other area home to [sun bears](/wiki/Sun_bear), [pileated gibbons](/wiki/Pileated_gibbon), and [asian small-clawed otters](/wiki/Asian_small-clawed_otter). Animal Breeding and Enrichment Centre This area houses animals like [African penguins](/wiki/African_penguin), [Asian water monitor](/wiki/Asian_water_monitor), [fennec fox](/wiki/Fennec_fox) and [Dalmatian pelicans](/wiki/Dalmatian_pelican). Wild Africa This area houses the zoo's African [savannah](/wiki/Savanna) animals including [southern white rhinos](/wiki/Southern_white_rhinoceros), [Grévy's zebras](/wiki/Gr%C3%A9vy%27s_zebra), [Marabou storks](/wiki/Marabou_stork), [African painted dogs](/wiki/African_painted_dog), [cheetahs](/wiki/Cheetah), [red river hogs](/wiki/Red_river_hog), [meerkats](/wiki/Meerkat), [African lions](/wiki/African_lion), [giraffes](/wiki/Giraffe), and [nyalas](/wiki/Nyala). Located past the lion exhibit are [Sri Lankan leopards](/wiki/Sri_Lankan_leopard), a den for [naked mole-rats](/wiki/Naked_mole-rat) and a [fossa](/wiki/Fossa_(animal)) exhibit opened in 2019. On August 2024, two [Nile lechwes](/wiki/Nile_lechwe) were brought to the zoo. Chimpanzee Exhibit It is a hillside forest clearing with a jungle gym like [chimpanzees](/wiki/Chimpanzee) and [red-capped mangabey](/wiki/Red-capped_mangabey). Reptile Kingdom The outdoor portion of the zoo's reptile complex which has enclosures for the zoo's larger reptiles such as [Aldabra giant tortoises](/wiki/Aldabra_giant_tortoise), [Komodo dragons](/wiki/Komodo_dragon), [saltwater crocodiles](/wiki/Saltwater_crocodile), [rhinoceros iguanas](/wiki/Rhinoceros_iguana), [African spurred tortoises](/wiki/African_spurred_tortoise), [Chinese alligators](/wiki/Chinese_alligator), [Siamese crocodiles](/wiki/Siamese_crocodile), [Philippine crocodiles](/wiki/Philippine_crocodile) and [gharials](/wiki/Gharial). RepTopia Opening on 16 August 2017, RepTopia was a renovation of the 35-year-old Snake House. Several species of reptiles and amphibians are housed in four different regions — Deserts of the World, Indo-Pacific, Tropical Africa and Neotropical Rainforests; among them are [crocodile monitors](/wiki/Varanus_salvadorii), [electric blue geckos](/wiki/Lygodactylus_williamsi), [Gaboon vipers](/wiki/Gaboon_viper), [golden poison frogs](/wiki/Golden_poison_frog), [king cobras](/wiki/King_cobra), [Madagascar giant day geckos](/wiki/Phelsuma_grandis), [plumed basilisks](/wiki/Plumed_basilisk), [reticulated pythons](/wiki/Reticulated_python), [veiled chameleons](/wiki/Veiled_chameleon) and [western diamondback rattlesnakes](/wiki/Western_diamondback_rattlesnake). A behind-the-scenes facility is visible to the guests, allowing them to view the hatchery. In January 2022, thirteen [Roti Island snake-necked turtles](/wiki/Roti_Island_snake-necked_turtle) were successfully repatriated to a breeding facility in [Kupang](/wiki/Kupang). Tortoise Shell-ter Formerly the Critters Longhouse, which housed small mammals, this building was transformed into the Tortoise Shell-ter in 2016, housing different species of tortoises such as [Burmese star tortoises](/wiki/Burmese_star_tortoise), [Indian star tortoises](/wiki/Indian_star_tortoise), [radiated tortoises](/wiki/Radiated_tortoise) and [angonoka tortoises](/wiki/Angonoka_tortoise), in seven enclosures, among other reptiles and birds. Each habitat is climate-controlled with special lighting, heating and humidity control. Fragile Forest A 20,000 cubic meter biodome that houses a wide variety of tropical birds, mammals, reptiles, fish and invertebrates. Species kept in the biodome include [black-casqued hornbills](/wiki/Black-casqued_hornbill), [great arguses](/wiki/Great_argus), [lesser mouse-deer](/wiki/Lesser_mouse-deer), [Linne's two-toed sloths](/wiki/Linne%27s_two-toed_sloth), [Malayan flying foxes](/wiki/Malayan_flying_fox), [Malayan peacock-pheasants](/wiki/Malayan_peacock-pheasant), [Nicobar pigeons](/wiki/Nicobar_pigeon), [pied imperial pigeons](/wiki/Pied_imperial_pigeon), [Prevost's squirrels](/wiki/Prevost%27s_squirrel), [red-sided eclectus parrots](/wiki/Moluccan_eclectus), [red ruffed lemurs](/wiki/Red_ruffed_lemur), [spotted whistling ducks](/wiki/Spotted_whistling_duck), [western crowned pigeons](/wiki/Western_crowned_pigeon), [white-faced sakis](/wiki/White-faced_saki) and [zebra doves](/wiki/Zebra_dove) with [golden lion tamarins](/wiki/Golden_lion_tamarin) housed in a small enclosure near the biodome. The area also has a [butterfly house](/wiki/Butterfly_house) consisting of 11 butterfly species, 8 of which are native to Singapore. SPH Foundation Conservation Centre The SPH Foundation Conservation Centre sponsors [Celebes crested macaques](/wiki/Celebes_crested_macaque), [emperor tamarins](/wiki/Emperor_tamarin), [pygmy marmosets](/wiki/Pygmy_marmoset), [silvery marmosets](/wiki/Silvery_marmoset), and [Azara's agoutis](/wiki/Azara%27s_agouti). The Great Rift Valley of Ethiopia Visitors first walk through a [Konso](/wiki/Konso) and [Amharic](/wiki/Amhara_people) village with several [waga sculptures](/wiki/Waga_sculpture) dotted around. A large troop of [hamadryas baboons](/wiki/Hamadryas_baboon) are mixed with a herd of [Nubian ibexes](/wiki/Nubian_ibex) in an enclosure recreating the rugged steppes of Ethiopia. [Meerkats](/wiki/Meerkat), [common kusimanses](/wiki/Common_kusimanse), [servals](/wiki/Serval), [rock hyraxes](/wiki/Rock_hyrax) and [South African ground squirrels](/wiki/South_African_ground_squirrel) are kept in smaller enclosures. A bridge from which you can view the baboons overlooks an enclosure with a pond, home to a pair of [spur-winged geese](/wiki/Spur-winged_goose) nearby. Australasia This zone features a walkthrough habitat with [eastern grey kangaroos](/wiki/Eastern_grey_kangaroo), [Bennett's wallabies](/wiki/Red-necked_wallaby) and [magpie geese](/wiki/Magpie_goose) along with a [southern cassowary](/wiki/Southern_cassowary) enclosure at the end of the zone. [Goodfellow's tree-kangaroos](/wiki/Goodfellow%27s_tree-kangaroo) are housed indoors but are able to access an outdoor enclosure. The zoo's male tree-kangaroo named Makaia was born in 2014 at [Adelaide Zoo](/wiki/Adelaide_Zoo) and orphaned at five weeks old when his mother, Kia, was crushed by a falling tree branch. He made headlines after he was adopted by a [yellow-footed rock wallaby](/wiki/Yellow-footed_rock_wallaby). Makaia arrived at the Singapore Zoo in 2016 to accompany the zoo's female tree-kangaroo, Nupela. On 4 February 2020, Nupela gave birth to a male joey. Four female [koalas](/wiki/Koala) named Paddle, Chan, Pellita and Idalia were on loan to the zoo from the [Lone Pine Koala Sanctuary](/wiki/Lone_Pine_Koala_Sanctuary) to celebrate Singapore's golden jubilee in April 2015 and returned to [Australia](/wiki/Australia) in February 2016. Primate Kingdom The Primate Kingdom consists of a large moat with several islands which house various monkeys and lemurs such as [black-and-gold howler monkeys](/wiki/Black_howler), [black-and-white ruffed lemurs](/wiki/Black-and-white_ruffed_lemur), [ring tailed lemurs](/wiki/Ring_tailed_lemur), [cotton-top tamarins](/wiki/Cotton-top_tamarin), [arapaimas](/wiki/Arapaima), [eastern black-and-white colobuses](/wiki/Mantled_guereza), [De Brazza's monkeys](/wiki/De_Brazza%27s_monkey), [white faced sakis](/wiki/White_faced_saki), [squirrel monkeys](/wiki/Squirrel_monkey) and some of the only [red-shanked doucs](/wiki/Red-shanked_douc) in captivity. Elephants of Asia A herd of five female [Asian elephants](/wiki/Asian_elephant) live in a 2.47 acre (1 ha) habitat with a large pool. Komali, the matriarch of the herd, is a [Sri Lankan elephant](/wiki/Sri_Lankan_elephant), Gambir and Jati are [Indian elephants](/wiki/Indian_elephant) and half-sisters Aprila and Intan are [Sumatran elephants](/wiki/Sumatran_elephant). KidzWorld Located at the very north of the zoo, KidzWorld is home to many domestic animals like [goats](/wiki/Goat), [rabbits](/wiki/Domestic_rabbit), [horses](/wiki/Horse), [pigs](/wiki/Pig), [dogs](/wiki/Dog), various domestic [galliformes](/wiki/Galliformes) and [African spurred tortoises](/wiki/African_spurred_tortoise), among others. There are other attractions in this area as well, such as a [carousel](/wiki/Carousel) and a [splash pad](/wiki/Splash_pad). Guests are allowed to closely interact with the animals and feed them. ## Education and conservation The Wildlife Healthcare & Research Centre was opened in March 2006 as part of the zoo's efforts in wildlife conservation. The centre further underscores Singapore Zoo and Night Safari's commitment to conservation research, providing the infrastructure for the wildlife parks and overseas zoological partners to better execute their research programmes. The Singapore Zoo is the first zoo in the world to breed a polar bear in the tropics. [Inuka](/wiki/Inuka) was born on 26 December 1990, died 25 April 2018 (aged 27). Animal activist and conservationist known as [Steve Irwin](/wiki/Steve_Irwin) admired the Singapore Zoo greatly, adopting it as the 'sister zoo' to [Australia Zoo](/wiki/Australia_Zoo). He was at the Singapore Zoo in 2006 to officiate the opening of the [Australian Outback](/wiki/Outback) exhibit. ## Presentations ### Current Presentations \"Breakfast in the Wild\" allows visitors to meet and interact closely with animals in the zoo, which has previously included [Ah Meng](/wiki/Ah_Meng) (died on 8 February 2008) who was an icon of the Singapore tourism industry. Animal presentations, as well as token feedings coupled with live commentaries by keepers, are also the daily staple in Singapore Zoo. The \"Into The Wild\" presentation in the Shaw Foundation Amphitheatre, which features many animals like [hog badgers](/wiki/Hog_badger), [ring-tailed lemurs](/wiki/Ring-tailed_lemur), [hornbills](/wiki/Hornbill), and [Indian Crested Porcupines](/wiki/Indian_crested_porcupine), highlights how their special adaptations that help them survive in the wild, even when faced with various anthropogenic challenges like [plastic waste](/wiki/Plastic_pollution), [habitat destruction](/wiki/Habitat_destruction), or the [wildlife trade](/wiki/Wildlife_trade). The \"Splash Safari\" presentation features the zoo's [sea lions](/wiki/Sea_lion) performing acts relating to their natural behaviours, and also playing frisbee with a lucky visitor. The \"Animal Friends\" presentation, housed in the Animal Buddies Theatre in the zoo's children's section, features mostly domesticated animals such as [dogs](/wiki/Dog) and [parrots](/wiki/Parrot) performing tricks with the aim of teaching young children about pet responsibility. ### Former Presentations The \"Rainforest Fights Back\" presentation is housed in the Shaw Foundation Amphitheatre, the main amphitheater in the zoo. Actors and performers act alongside the animals: in-show, a villainous poacher attempts to mow down a section of [tropical rainforest](/wiki/Tropical_rainforest) for land development, and is foiled by the native people and the animals of the rainforest — [orangutans](/wiki/Orangutan), [lemurs](/wiki/Lemur), [peacocks](/wiki/Peafowl), [otters](/wiki/Otter), [coatimumdis](/wiki/Coati) and [ara parrots](/wiki/Macaw). The \"Elephants at Work and Play\" presentation demonstrates how elephants are used as [beasts of burden](/wiki/Pack_animal) in south-east Asian countries. The animal caretakers are referred to as [mahouts](/wiki/Mahouts), and the show simulates how a mahout would instruct an elephant to transport logs or kneel so that they can be mounted. As of 2018, the show has been reworked as part of a shift in the care for the elephants to feature their natural behaviour instead of performing stunts. ## Organising events There are three events venues in the zoo: Forest Lodge, Pavilion-By-the-Lake and Garden Pavilion. There are also three cocktail venues: Elephants of Asia, Tiger Trek and Treetops Trail. The Singapore Zoo also caters for birthday parties and weddings. ## Notable Animals • [Inuka](/wiki/Inuka), the World’s only tropical polar bear, and Singapore Zoo’s last surviving polar bear (1990-2018) • [Ah Meng (orangutan)](/wiki/Ah_Meng), Singapore Zoo’s world-famous Sumatran orangutan, and the World’s Famous Orangutan (1960-2008) • Omar (white tiger), Singapore Zoo’s oldest white tiger (1999-2017) ## Incidents On 7 March 1973, a [black panther](/wiki/Black_leopard) escaped from the zoo before it had opened. In early 1974, a [hippopotamus](/wiki/Hippopotamus) named Congo escaped from the zoo and spent 47 days in the Seletar Reservoir. Other escapes in 1974 included an [eland](/wiki/Taurotragus) and a tiger. On 13 November 2008, three Bengal white tigers mauled a cleaner, 32-year-old Nordin Montong to death after he jumped into a moat surrounding their enclosure and taunted the animals. ## Awards Awarded to Singapore Zoo: - Bronze for Best Brand Engagement (Singapore Media Marketing Awards)—'Happy ZOObilee,' Singapore Zoo, 2023 - TripAdvisor Travelers' Choice, 2023 - Travellers' Choice Awards - Top 3 Zoos in the World, 2018 - Singapore Tourism Awards, 2017 - Traveller's Choice Awards - Zoos and Aquariums, 2017, 2015 and 2014 - Best Customer Service (Retail) Award, 2014 - Meritorious Defence Partner Award, 2013 - Singapore Experience Awards, 2013 - Singapore Service Award, 2013 - Singapore Service Excellence Medallion - Organisation, 2013 - Meritorious Defence Partner Award, 2012 - Most Popular Wildlife Park, Asian Attractions Awards, 2011 - [Michelin](/wiki/Michelin_Guide) 3-star rating, 2008 - Best Breakfast, 40 Jewels in [ASEAN](/wiki/ASEAN)'s Crown, 2007 - One of the World's Best Zoos, forbes-travel.com, 2007 - Bronze, Singapore H.E.A.L.T.H Awards, 2004 - Leisure Attraction of the Year, 6th, 7th, 8th, 13th, 16th, 17th, 20th and 22nd [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) Awards - Best New Attraction for the hamadryas baboons exhibit, ASEAN Tourism Association, 2002 - Cleanest Toilet, [Ministry of Environment](/wiki/Ministry_of_the_Environment_and_Water_Resources), 1997 and 1998 ## Gallery ## Transportation ### Public transportation Two public bus services, 138 and 927, call at the bus stop near to the Zoo. 138 connects with the nearest [MRT station](/wiki/Mass_Rapid_Transit_(Singapore)) at [Springleaf MRT station](/wiki/Springleaf_MRT_station) as well as [Ang Mo Kio MRT station](/wiki/Ang_Mo_Kio_MRT_station), while 927 connects with [Choa Chu Kang MRT station](/wiki/Choa_Chu_Kang_MRT/LRT_station). ### Bus A shuttle service, known as the *Mandai Khatib Bus*, plies daily between [Khatib MRT station](/wiki/Khatib_MRT_station) and the Zoo. A one-way trip costs $2.50 for everyone above the age of three. ## Notes ## Bibliography - Singapore portal - Animals portal - Véronique Sanson (1992). *Gardens and Parks of Singapore*. Oxford University Press. [ISBN](/wiki/ISBN_(identifier)) 0-19-588588-0 - Ilsa Sharp (1994). *The First 21 Years: The Singapore Zoological Gardens Story*. Singapore Zoological Gardens. [ISBN](/wiki/ISBN_(identifier)) 981-00-5674-5 - Official website - Geographic data related to Singapore Zoo at [OpenStreetMap](/wiki/OpenStreetMap) - Map of Singapore Zoo - Singapore Zoo on the Singapore Government National Library Board\n",
  "language": "en",
  "processed_at": "2026-01-12T11:58:49.859968",
  "title": "Singapore Zoo",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Zoo"
}