{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:58:13.966097"
  },
  "content": "Research, development and technologies hub in Singapore **Singapore Science Park**[a] is a research, development and technologies hub in Queenstown, [Singapore](/wiki/Singapore). Managed by Ascendas, a subsidiary of [Capitaland](/wiki/Capitaland), it was set up under a government initiative in 1980 to provide the necessary infrastructure for local retail and development companies to flourish in the country. One of the most prominent local tenants headquartered within the parks is Singaporean multinational technology company [Shopee](/wiki/Shopee). ## Milestones ### Singapore Science Park I In 1980, the Government gave its seal of approval to proceed with the construction of the Singapore Science Park on a 30-hectare plot of land. In 1982, Singapore Science Park I welcomed its first tenant, [Det Norske Veritas](/wiki/Det_Norske_Veritas) (DNV). On 3 September 2019, Shopee officially opened its new six-storey regional headquarters at Singapore Science Park I. The new building has 244,000 square feet (22,700 m2) of space, which can accommodate 3,000 employees and is six times larger than the previous headquarters at Ascent Building, also located within the park. ### Singapore Science Park II In 1993, construction of Singapore Science Park II began on a 20-hectare plot of land, the first building constructed was the Institute of Microelectronics (IME). The Alpha, a multi-tenant building was the next building constructed in Singapore Science Park II. In 2000, Arcasia would expand and develop a 15-hectare plot of land next to the Singapore Science Park II into a Singapore Science Park III at a cost of about $600 million. However, it was revealed that the latter was an expansion of Singapore Science Park II. Galen, the first building on the Singapore Science Park II's expanded plot was completed on 29 June 2003. - [Biopolis](/wiki/Biopolis) ## Notes - Singapore Science Park Portal: - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:58:13.965716",
  "title": "Singapore Science Park",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Science_Park"
}