{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:57:59.831192"
  },
  "content": "Singaporean electricity and gas distributor and managerThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore Power Group\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2018)* *(Learn how and when to remove this message)* **SP Group** is a [state-owned](/wiki/State-owned_enterprise) electricity and gas distribution company in [Singapore](/wiki/Singapore). SP Group is the corporatised entity of the former electricity and gas departments of the [Public Utilities Board](/wiki/Public_Utilities_Board_(Singapore)) (PUB). SP Group was first incorporated as a commercial entity on 1 October 1995 as Singapore Power and Gas to take over the electricity and gas businesses of the state provider, PUB. Through its subsidiaries, the company is the sole [electrical grid](/wiki/Electrical_grid) and [gas grid](/wiki/Gas_grid) operator in the country, and provides electricity and [gas](/wiki/Liquefied_Petroleum_Gas) transmission, distribution services, and market support services to more than a million households in the country. ## History PUB was initially located at [City Hall](/wiki/City_Hall,_Singapore). After outgrowing its office space in City Hall, the PUB Building, located near Singapore's main shopping belt of [Orchard Road](/wiki/Orchard_Road), was built to accommodate several departments of the PUB. The PUB Building was completed in 1977; construction cost [S$](/wiki/S$)32 million. It was renamed as the Singapore Power Building, after PUB's electricity and [gas](/wiki/Liquefied_petroleum_gas) operations were [corporatised](/wiki/Corporatization) to Singapore Power on 1 October 1995. The Singapore Power Building was renovated in 2006, when Singapore Power chose not to redevelop its corporate headquarters. Instead, it opted to refurbish and [reclad](/wiki/Cladding_(construction)) the building in silvery metal. Since 1995, SP Group has been wholly owned by Singapore investment fund [Temasek](/wiki/Temasek_Holdings) which in turn is wholly owned by the [Singapore government](/wiki/Singapore_government). On 29 January 2007, PUB moved out of the building to join its parent ministry, [Ministry of the Environment and Water Resources](/wiki/Ministry_of_the_Environment_and_Water_Resources), at the Environment Building on [Scotts Road](/wiki/Scotts_Road). The company was renamed \"SP Group\" from 28 February 2017 onwards. SP Group relocated its main office building to Kallang in 2017. It operates a single Customer Service Centre in Toa Payoh. ## Structure ### Subsidiaries This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(December 2025)* *(Learn how and when to remove this message)* - **SP PowerGrid** – Manages the nation’s electricity transmission and distribution networks through continuous monitoring. The Grid Digital Twin, a digital replica of Singapore’s future electricity grid, is currently being developed with the Energy Market Authority, to improve the reliability of Singapore’s electricity supply and support the deployment of cleaner energy sources. (as at 27 Oct 2021) - **SP Services** – Provides integrated customer billing services for electricity, water and piped gas supplies in Singapore. It holds the nation's Market Support Services License to provide meter reading services, meter data management, and facilitates customers' transfer from the regulated tariff to the Open Electricity Market retailers, or to the wholesale electricity market. SP Services leverages its digital team to provide customers with self-help e-services through the SP app, enabling users to manage utilities accounts and perform transactions online. In 2021, PUB awarded SP Services to supply, install and manage smart water meters island wide. - **SP Sustainable Energy Solutions** – Provides sustainable solutions such as centralised cooling and heating, electric mobility, renewable energy certificates, urban micro-grid and rooftop solar energy for commercial and residential customers. It owns and operates the world’s largest underground district cooling network at Marina Bay, producing chilled water to provide air-conditioning to buildings in the Marina Bay district. The company collaborated with the Housing and Development Board (HDB) to deploy Singapore’s first residential centralised cooling system at Tengah housing estate. - **SP Digital –** The digital arm of SP Group has developed the SP app and Green Energy Tech solutions for customers to improve energy efficiency and reduce environmental footprint. The app enables users to monitor their energy consumption and access a suite of sustainability tips and features, including tools to track environmental impact, earn rewards for completing green tasks (GreenUP) and offset emissions by purchasing renewable energy certificates (My Green Credits). - **SP PowerGas** – The sole licensed gas transporter and gas system operator, transporting both natural gas and town gas. It owns and operates all the gas pipelines in Singapore and is responsible for delivering gas to users through its gas pipe network. It operates a town gas system as well as a natural gas system which is transmitted from Sumatra. - **SP PowerAssets** – The sole provider of electricity transmission and distribution services in Singapore. It holds the Transmission License and owns the electricity transmission and distribution Network of Singapore including major transmission and distribution assets like substations and underground cables with an approximate network value of S$6.5billion (as at 31 Mar 6) ### Major joint ventures - **Power Automation** – a joint-venture company set up by SP Group with Siemens in July 1995 to offer engineering services in protection systems, substation control and energy management and information systems across Asia Pacific. - **Singapore District Cooling** – a joint-venture company set up by SP Group with Dalkia in September 2000 as a partner to implement the pilot District Cooling project at Marina South New Downtown. [District Cooling](/wiki/District_cooling) is an urban utility service involving the centralised production of chilled water for distribution to commercial buildings for air-conditioning purposes. ### Other investments - **AusNet Services** – Through its wholly owned subsidiary Singapore Power International Pte Ltd, SP Group owned a 31.1% stake in [AusNet Services](/wiki/AusNet_Services). AusNet Services's assets include electricity transmission and distribution networks, and gas distribution assets in Victoria, Australia. AusNet Services was listed on the [Australian Securities Exchange](/wiki/Australian_Securities_Exchange) (ASX) and the [Singapore Exchange](/wiki/Singapore_Exchange) (SGX). In 2022, the company was sold in its entirety to [Brookfield Asset Management](/wiki/Brookfield_Asset_Management). - **Jemena** - The company currently owns 40% of [Jemena](/wiki/Jemena) (a trading name of **SGSP (Australia) Assets Pty Ltd**) which owns gas and electricity assets and management services in Australia. Former AusNet partner [State Grid Corporation of China](/wiki/State_Grid_Corporation_of_China) owns the remainder after selling it in 2014. - **SPI Seosan Co-generation and Water Treatment** – SP Group's investment in South Korea provides electricity, steam and water treatment services to Samsung Total Petrochemicals Co Ltd, one of the largest petrochemical companies in Korea. - **EverPower IPP** – SP Group's investment in Taiwan comprises a 25% stake in Ever Power IPP Company, an independent power producer, which supplies electricity to Taiwan Power Company. ## Incidents Following the 2009 [Black Saturday bushfires](/wiki/Black_Saturday_bushfires) in Australia, over 600 victims signed a class action lawsuit against SPI Electricity Pty Ltd, the electricity distribution company of SP AusNet, an Australian energy company that was 51% owned by then Singapore Power. The lawsuit alleged negligence and breach of duty in the service and maintenance of powerlines controlled by them in the state of Victoria. In particular, the lawsuit alleged the power company negligently failed to fit a protective device on the power line, alleging that it contributed to it breaking and starting a bushfire in the Kilmore East area on 7 February 2009. - [Singapore Power Building](/wiki/Singapore_Power_Building) - Official website - SP AusNet Website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:57:59.830854",
  "title": "Singapore Power Group",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Power_Group"
}