{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:02.505966"
  },
  "content": "Informal social collective The **Singapore Dark Alternative Movement** (S.D.A.M.) is an informal, social collective catering to the needs of the Singaporean gothic and [alternative lifestyle](/wiki/Alternative_lifestyle) community. It also functions as a support/help group for members within the latter regarding issues such as suicide, gender and sexuality. Although cited by their official webpage as having the date of their creation as 1998, the name of the collective only surfaced in 2005 with the return of former leader [Saito Nagasaki](/wiki/Saito_Nagasaki) from [Perth](/wiki/Perth,_Western_Australia), [Australia](/wiki/Australia). The SDAM focuses on promoting dark [alternative culture](/wiki/Alternative_culture) in the region through promoting music and art genres that interest the community such as [goth](/wiki/Goth_subculture), [industrial](/wiki/Industrial_music), and EBM ([electronic body music](/wiki/Electronic_body_music)), and facilitates meet-ups and events to assist in growing the social platform. ## SDAM Events Since 2006, SDAM has maintained a regular series of club events catering to the Singaporean [Gothic](/wiki/Goth_subculture) and Alternative demographic. The current incarnation of club events is **Back in Black**, which takes over from **Dark Friday** Prior to Dark Friday, the monthly parties organised in ascending chronological order were **Ghast**, **Heart of Darkness** and **Alternation** (See below). Other social events include chalets, meetups and even beach parties. ### Back in Black (2017 - present) Back in Black is the current series of monthly SDAM club nights featuring [Gothic Rock](/wiki/Gothic_rock), [Industrial Music](/wiki/Industrial_music), [EBM](/wiki/Electronic_body_music), [synthwave](/wiki/Synthwave_(2000s_genre)), [darkwave](/wiki/Dark_wave), [new wave](/wiki/New_wave_music), and [synthpop](/wiki/Synth-pop) music, featuring DJs like DJ Red, MNRV, [Cosmic Armchair](/wiki/Cosmic_Armchair), and veteran DJ Mentor (Chris Ho). The first Back in Black of the series, in September 2017, succeeded in reuniting the Goth Community in Singapore after a hiatus of a few years. ### Dark Friday Dark Friday is SDAM's flagship clubbing event and was held on a monthly rotation at various venues, including Night and Day Bar in Selegie. Dark Friday has since been on a hiatus with other event series put in place to satisfy specific niches in the [Singapore](/wiki/Singapore) [gothic](/wiki/Goth_subculture) community - these new nights include an old school night \"Original Sin\" as well as \"A Necessary Evil\" and even a revival of Heart of Darkness **Dark Friday** debuted on 2008-06-13 in Taboo ([Tanjong Pagar](/wiki/Tanjong_Pagar)) as a collaboration with Sigsaly Transmissions through NetManagement as a free event for charity. The first Dark Friday was used as a vehicle to launch the 2CD Compilation *Machines Against Hunger* globally with the event serving as the [Singapore](/wiki/Singapore) leg of the promotion. The compilation featured a collection of [Electronic Body Music](/wiki/Electronic_Body_Music) and [industrial music](/wiki/Industrial_music) tracks from 34 artists such as [Dawn of Ashes](/wiki/Dawn_of_Ashes) and [Sturm Café](/wiki/Sturm_Caf%C3%A9). All net profit from the sale of the album internationally was cited to be donated to [Action Against Hunger](/wiki/Action_Against_Hunger). As SDAM is an informal community group, no funds were collected and no CDs were sold on site - guests were encouraged to purchase the album directly from Sigsaly Transmissions or to donate directly to [Action against Hunger](/wiki/Action_against_Hunger). Since then, Dark Friday, has attracted notable international guest artists such as [Eskil Simonsson](/wiki/Eskil_Simonsson), frontman of [Covenant (band)](/wiki/Covenant_(band)) ([Sweden](/wiki/Sweden)) on 2008-10-03 and [Angelspit](/wiki/Angelspit)'s Zoog and DestroyX on 2009-12-05. [Sdam](/wiki/Sdam) through Dark Friday has persisted in being the first (and presently only) platform to consistently bring such artists from the international [Goth](/wiki/Gothic_rock) / [industrial music](/wiki/Industrial_music) touring circuit to [Singapore](/wiki/Singapore) and [South East Asia](/wiki/South_East_Asia). It has also attracted attention in the global alternative scene, particularly when sponsor NetManagement brokered the promotional material of the 2009-03-13 Run of Dark Friday, featuring DJ Mini, to share one side of a flyer with the [Kinetik Festival](/wiki/Kinetik_Festival) in Canada. The distribution of the latter was simultaneously made in both [Montreal](/wiki/Montreal) and [Singapore](/wiki/Singapore). Due to [Singapore](/wiki/Singapore)'s geographic position, it has been strategically advantageous for regional [gothic](/wiki/Goth_subculture) promoters to begin to use Dark Friday as an incidental [Asian](/wiki/Asia) show stopover for flightshares when planning tours to [Australia](/wiki/Australia) or up to [Japan](/wiki/Japan), such as in the case of [Covenant](/wiki/Covenant_(band)) where promoter Riveting Promotions in [Sydney](/wiki/Sydney) held a Covenant concert immediately after Eskil's performance in Dark Friday ### Heart of Darkness The second offering from SDAM after a largely indie effort at Ghast was conceived by [Saito Nagasaki](/wiki/Saito_Nagasaki) through brokerage of a sponsorship by [Jack Daniel's](/wiki/Jack_Daniel%27s) Singapore distributor Thai-Pore Enterprise Pte Ltd. The event's debut featured local Metal bands Meza Virs and Absence of the Sacred. The latter formula was applied to all subsequent runs of the event in Saito's effort to leverage on the local Metal scene's fanatic supporters to bolster a fragmented gothic/industrial audience. *Heart of Darkness* won critical acclaim in [Time Out](/wiki/Time_Out_(company)) magazine's Singapore Edition as the Number 1 critic's choice, ranking above [Zouk](/wiki/Zouk_(club))'s \"Readyset Glo, The Motored Sessions\" and [Ministry of Sound](/wiki/Ministry_of_Sound) Singapore's \"[Godskitchen](/wiki/Godskitchen) Presents Les Hemlock\". Heart of Darkness was brought back by SDAM on 18 July 2009 mainly due to nostalgia reasons on part of the [Sdam](/wiki/Sdam) committee as well as the host venue (NOVA) being a dedicated Jack Daniels bar, a current key account of the Thaipore, the original sponsor. The rehash featured a lineup of DJs Lique, Mentor, Murderfreak and [Saito Nagasaki](/wiki/Saito_Nagasaki); ### Alternation Debuting on 9 August 2007, Alternation became Singapore's longest running dedicated alternative music night, (hosted at DXO, [Esplanade - Theatres on the Bay](/wiki/Esplanade_-_Theatres_on_the_Bay)) lasting 31 weeks up to its finale on *6 March 2008* The event was held on a weekly rotation on Thursdays with a notable international guest appearance by [Alec Empire](/wiki/Alec_Empire) of [Atari Teenage Riot](/wiki/Atari_Teenage_Riot) on 2007-09-20 Alternation has since been rehashed with a comeback event held on 2009-10-16 at DXO featuring an Art and Photography exhibition titled \"Absinthe Garden\" The exhibition featured works by notable local photographers Deadpoet and Razin Razor. ## SDAM Committee The Current SDAM committee comprises 7 members holding separate portfolios and working on a voluntary basis. - Goth Misunderstood (Singapore Goth pt.1), Razor.TV - Singapore Dark Alternative Movement's official portal and forum - Singapore Dark Alternative Movement's official Facebook Group - Singapore Dark Alternative Movement's Official Myspace - Singapore Dark Alternative Movement's official Livejournal community\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:02.505595",
  "title": "Singapore Dark Alternative Movement",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Dark_Alternative_Movement"
}