{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:43.394860"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore Chinese Girls' School\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2014)* *(Learn how and when to remove this message)*Independent school in Singapore **Singapore Chinese Girls' School** (**SCGS**) is an independent girls' school in [Novena](/wiki/Novena,_Singapore), [Singapore](/wiki/Singapore), located next to [Stevens MRT station](/wiki/Stevens_MRT_station). Founded in 1899, it is one of the oldest institutions in Singapore. It offers a six-year primary education in its primary school section, as well as a four-year secondary education in its secondary school section, which was among the first secondary schools in Singapore to be accorded independent school status in 1989. Since 2013, it has partnered with [Eunoia Junior College](/wiki/Eunoia_Junior_College) for a six-year [Integrated Programme](/wiki/Integrated_Programme), which allows its secondary school students to proceed to Eunoia Junior College for Years 5 and 6 and take the [Singapore-Cambridge GCE Advanced Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) examinations at the end of Year 6. ## History This section **may need to be rewritten** to comply with Wikipedia's quality standards. Relevant discussion may be found on the talk page. You can help. The talk page may contain suggestions. *(September 2017)* In 1899, [Lim Boon Keng](/wiki/Lim_Boon_Keng), [Song Ong Siang](/wiki/Song_Ong_Siang), [Khoo Seok Wan](/wiki/Khoo_Sook_Yuen), along with others, actively promoted a school for Chinese girls and in April 1899, SCGS was established. Lew Luk Lin was elected president but offered to vacate his seat to Lim who declined. On 3 July 1899, SCGS opened at [Hill Street](/wiki/Hill_Street,_Singapore) with an enrolment of seven girls and Mary Geary as headmistress. Lim's wife, Margaret Wong, also gave lessons in Chinese. Due to general resistance of the local conservative population who was not in favour of girls having a formal education, transportation between the school and the students' homes has to be provided by SCGS. In December 1906, SCGS relocated to another site on Hill Street due to high rental costs of the original site. On 13 July 1908, SCGS relocated again further down to the junction of Hill Street and Coleman Street with land given by the government. In 1923, the school left its premises at Hill Street (the site later became the [Central Fire Station](/wiki/Central_Fire_Station,_Singapore)) and moved to [Emerald Hill](/wiki/Emerald_Hill,_Singapore). The premises at Emerald Hill cost S$60,000. The school building was a two-storey block with 12 classrooms, an assembly hall, a staff room, and a principal's office. From 1905 to 1936, the school admitted a handful of male students, but afterwards reverted to being an all-girls school. After 1946, newly created government laws forced the school to accept girls of all races. By 1950, SCGS had an enrolment of 700 girls, which rose to 900 in 1952. ### Attainment of Independent Status In 1989, SCGS celebrated its 90th birthday and became an independent school, with more latitude to expand the curriculum. On 4 July 1994, after 70 years at Emerald Hill, the school moved to a newly built campus at [Dunearn Road](/wiki/Dunearn_Road). In 2011, SCGS was presented the School Excellence Award, part of the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore))'s (MOE) Masterplan of Awards, which recognises schools for excellence in both education methods and results. In addition, SCGS received the Best Practice Award for all three categories (Student All-Round Development, Teaching and Learning, and Staff Well-being) and the Outstanding Development Award for National Education. These achievements affirm the school's holistic education for the pupils as well as the capacity and commitment of the staff. ### Introduction of Joint Integrated Programme In 2012, the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) announced that SCGS and five other schools would offer the [Integrated Programme](/wiki/Integrated_Programme) (IP). However, SCGS would continue to offer the [Singapore-Cambridge GCE Ordinary Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) Programme to existing and incoming students. In January 2013, SCGS accepted the first batch of IP students in the Secondary One intake alongside new students on the 'O' Level programme. After four years at SCGS, IP students will bypass the 'O' Level examination and move on to [Eunoia Junior College](/wiki/Eunoia_Junior_College). The junior college was newly created as part of a Joint Integrated Programme (JIP) to accept IP students from SCGS, [CHIJ Saint Nicholas Girls' School](/wiki/CHIJ_Saint_Nicholas_Girls%27_School) and [Catholic High School](/wiki/Catholic_High_School,_Singapore) starting from 2017. Besides IP students, Eunoia Junior College will also accept students from other secondary schools with 'O' Level qualifications. All students enrolled in Eunoia Junior College will sit for the [Singapore-Cambridge GCE 'A' Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) examination after a two-year programme. ## School identity and culture ### Crest The colours of the school crest are jade and gold. This reflects her time-honoured tradition, because jade and gold in [Hokkien](/wiki/Hokkien) (*Kim Gek*), which is the colloquial name for SCGS girls and alumni, and in [Mandarin](/wiki/Mandarin_Chinese) (*JinYu*) connotes a young Peranakan girl brought up and educated in the best manner. The school motto is \"Sincerity, Courage, Generosity and Service.\" The [Yin and yang](/wiki/Yin_and_yang) aspects of the traditional Chinese culture symbol of balance are in jade and gold respectively. This symbol, which represents the universe, light, darkness, life and death, lies at the heart of the many branches of classical Chinese sciences, philosophy and medicine. ## Notable alumnae - [Jennie Chua](/wiki/Jennie_Chua), businesswoman - [Halimah Yacob](/wiki/Halimah_Yacob), eighth [President of Singapore](/wiki/President_of_Singapore) - [Janice Koh](/wiki/Janice_Koh), actress and former [Nominated Member of Parliament](/wiki/Nominated_Member_of_Parliament) - [Susan Lim](/wiki/Susan_Lim), general surgeon - [Rui En](/wiki/Rui_En), actress and singer - [Thio Li-ann](/wiki/Thio_Li-ann), law professor and former [Nominated Member of Parliament](/wiki/Nominated_Member_of_Parliament) - [Education in Singapore](/wiki/Education_in_Singapore) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:43.394485",
  "title": "Singapore Chinese Girls' School",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Chinese_Girls%27_School"
}