{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:57:28.792949"
  },
  "content": "Annual message delivered by the Prime Minister of Singapore to the entire nation The **National Day Rally (NDR)** ([Chinese](/wiki/Chinese_language): 国庆群众大会; [pinyin](/wiki/Pinyin): *Guóqìng Qúnzhòng Dàhuì*; [Malay](/wiki/Malay_language): *Rapat Umum Hari Kebangsaan*; [Tamil](/wiki/Tamil_language): தேசிய தின பேரணி) is an annual message delivered by the [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) to the entire nation, on the first or second Sunday after the [National Day Parade](/wiki/Singapore_National_Day_parade) (NDP) on 9 August. Started in 1966, the national day rally is Singapore's equivalent of the [President of the United States](/wiki/President_of_the_United_States)’ [State of the Union](/wiki/State_of_the_Union) address. The prime minister uses the rally to review the country’s status, its key challenges, as well as to set the country's direction, major policy changes, the economy, future plans and achievements. Currently, the prime minister does the rally speech in all of its official languages, [English](/wiki/Singapore_English), [Mandarin](/wiki/Singaporean_Mandarin) and [Malay](/wiki/Malay_language) ([national language](/wiki/National_language#Singapore)), except for [Tamil](/wiki/Tamil_language), where only dubbing is available from its English broadcast. ## History The rally began in 1966 as a \"private meeting\" between the prime minister and grassroots leaders. The transcript was released to the media only two weeks later. Only in 1971 did first [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) decide \"at the last minute\" to televise the speech, which has since been annually broadcast live. The first rally in 1966 was held on the eve of National Day. Since 1967, the rally has been held at least a week after National Day.[*citation needed*] The rally was delivered at the former [National Theatre](/wiki/Singapore_National_Theatre) between 1966 and 1983. With the theatre's closure and demolition in 1984, the rally was held at the [Singapore Conference Hall](/wiki/Singapore_Conference_Hall) for two years before being shifted to [Kallang Theatre](/wiki/Kallang_Theatre) between 1986 and 2000. In 2001, the rally moved to the University Cultural Centre at the [National University of Singapore](/wiki/National_University_of_Singapore). Since 2013, the rally is held at the [ITE College Central](/wiki/ITE_College_Central), with the exception in 2021, when the Rally was held in [Mediacorp](/wiki/Mediacorp) campus. ### 1966 National Day Rally The first National Day Rally was held on 8 August 1966 at the [National Theatre](/wiki/Singapore_National_Theatre). At a closed-door event before National Day, Prime Minister Lee Kuan Yew told grassroots leaders, *\"Every year, on this 9th August for many years ahead—how many, I do not know—we will dedicate ourselves anew to consolidate ourselves to survive; and, most important of all, to find an enduring future for what we have built and what our forebears will build up\"*. ### 1971 National Day Rally The 1971 rally was the first to be televised, at Prime Minister Lee Kuan Yew's \"last minute\" decision. Since then, the rally has become \"a fixture on the political calendar\". Lee delivered his \"cautiously optimistic\" speech \"off the cuff\", remarking, \"You have done well—six superb years, a magnificent performance against all the odds, so much so that everybody says, 'But, of course, everybody knows that Singapore is a very well-endowed place... Oh, just natural course of events.' It wasn't, you know. We made it so...\" ### 1981 National Day Rally The 1981 rally marked the first time where [Cabinet](/wiki/Cabinet_of_Singapore) ministers delivered their speeches. ### 1983 National Day Rally At the 1983 rally, Prime Minister Lee Kuan Yew *\"trotted out facts and figures to show that the more highly educated a woman was, the less likely she was to reproduce\"*, before concluding, *\"[W]e are really discarding our able parents in the next generation and doubling the less able\"*. The resulting controversy eroded electoral support for his [People's Action Party](/wiki/People%27s_Action_Party) for several years to come. ### 1988 National Day Rally In 1988, Prime Minister Lee Kuan Yew delivered \"one of his most quoted lines\": *\"And even from my sick bed, even if you are going to lower me into the grave, and I feel that something is going wrong, I'll get up.\"* ### 1991 National Day Rally In 1991, second [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Goh Chok Tong](/wiki/Goh_Chok_Tong) delivered his maiden speech at the National Day Rally. He \"spoke with a self-deprecating humour that heralded a new, gentler style of governance\", which he underscored by remarking, *\"I am not going to follow [Lee Kuan Yew's] act. I am going to walk my own way.\"* ### 2002 National Day Rally At the 2002 rally, Prime Minister Goh Chok Tong remarked, *\"Fair-weather Singaporeans will run away whenever the country runs into stormy weather. I call them 'quitters'. Fortunately, 'quitters' are in the minority. The majority of Singaporeans are 'stayers'... As we say in Hokkien, 'pah see buay zao'.\"* His labels generated \"much discussion\". ### 2004 National Day Rally In 2004, third Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) made his maiden address at the National Day Rally. However, rather than deliver a \"cautious speech\", he \"surprised many by slaughtering a few sacred cows\". He promoted a new \"teach less, learn more\" education policy, introduced a shortened five-day work week for the [Civil Service](/wiki/Singapore_Civil_Service), and most controversially, mooted the idea of casinos in Singapore. In 1970, Prime Minister Lee Kuan Yew's response to casinos in Singapore had been \"no, not over my dead body\", though the elder Lee had since changed his mind. ### 2005 National Day Rally In 2005, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) adopted the current format of delivering his Malay and Chinese remarks at 6:45pm, with a break at 7:30pm, before commencing his English address at 8:00pm. Prior to 2005, the rally was a continuous speech from 8:00pm.[*citation needed*] ### 2007 National Day Rally In 2007, opposition and [Nominated Members of Parliament](/wiki/Nominated_Members_of_Parliament) were invited to the National Day Rally for the first time. ### 2008 National Day Rally In 2008, the English language telecast of the rally, initially scheduled for live broadcast at 8:00pm on 17 August, was postponed to the next day. The move was to allow Singaporeans to watch Singapore take on [China](/wiki/China) in the women's table tennis finals at the [Beijing Olympics](/wiki/2008_Summer_Olympics). The rally itself proceeded as usual at the University Cultural Centre, but was only broadcast the next day. ### 2009 National Day Rally In 2009, Singaporeans used the [Twitter](/wiki/Twitter) hashtag #ndrsg to tweet about the rally. ### 2010 National Day Rally The 2010 rally was held on the last Sunday of August to avoid clashing with the [Youth Olympic Games](/wiki/2010_Summer_Youth_Olympics) earlier that month. ### 2012 National Day Rally The 2012 rally marked the second time where [Cabinet](/wiki/Cabinet_of_Singapore) ministers delivered their speeches at 6:45pm, before the prime minister's remarks at 8:00pm. It was also the first to feature sign-language translation in real time. It was held on the last Sunday of August to facilitate [Ramadan](/wiki/Hari_Raya) festivities. ### 2013 National Day Rally The 2013 rally was the first to be held at [ITE College Central](/wiki/ITE_College_Central) after 12 years at the [National University of Singapore](/wiki/National_University_of_Singapore)'s University Cultural Centre. Lee said the move was \"for a serious purpose - to underscore my longstanding commitment to investing in…every Singaporean\". ### 2015 National Day Rally In his 2015 speech, \"set within the context of... [an impending general election](/wiki/2015_Singaporean_general_election)\", Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) \"asked for a strong mandate\" without being \"baldly partisan\". PM Lee also mentioned two ministers, [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan) and [Lim Swee Say](/wiki/Lim_Swee_Say), who would respectively be standing in [Holland–Bukit Timah GRC](/wiki/Holland%E2%80%93Bukit_Timah_GRC) and [East Coast GRC](/wiki/East_Coast_GRC), the two most contested PAP-held constituencies. ### 2016 National Day Rally 80 minutes into his English remarks at the 2016 rally, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) suddenly took ill at 9:20pm. Half an hour later, [Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore) [Teo Chee Hean](/wiki/Teo_Chee_Hean) announced that Lee would resume his speech. The [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)) (PMO) also said that PM Lee had felt \"unsteady because of prolonged standing, heat and dehydration\", adding, \"His heart is fine and he did not have a stroke.\" At 10:40pm, he returned to speak for another 15 minutes. By then, he looked well and thanked the audience for waiting for him, who gave him a standing ovation. ### 2017 National Day Rally The 2017 rally was held on 20 August 2017 at [ITE College Central](/wiki/ITE_College_Central). Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong)'s speech mainly focused on the obstacles which Singapore was currently facing, namely [Diabetes](/wiki/Diabetes), [Pre-school](/wiki/Pre-school) and [Technology](/wiki/Technology). ### 2018 National Day Rally The 2018 rally was held at [ITE College Central](/wiki/ITE_College_Central) on 19 August 2018, with the rally focused on trending issues such as housing, healthcare and cost of living. Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) introduced, among other policies, the Merdeka Generation Package—a spin-off from the [Pioneer Generation Package](/wiki/Pioneer_Generation_Package), the Voluntary Early Redevelopment Scheme and a revamped Home Improvement Programme. He also announced that Singapore would be seeking a second inscription on [UNESCO](/wiki/UNESCO)'s World Heritage List of [her hawker culture](/wiki/Hawker_centre#In_Singapore), and that Senior Minister of State and Mayor [Maliki Osman](/wiki/Maliki_Osman) would be leading an improvement project for [Geylang Serai](/wiki/Geylang_Serai). ### 2019 National Day Rally The 2019 rally was held on 18 August 2019 at [ITE College Central](/wiki/ITE_College_Central). In Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong)'s speech, he highlighted education bursaries and subsidies, along with the mention of successful bursary holders who were invited along, [Pulau Brani](/wiki/Pulau_Brani)'s redevelopment plan as \"Downtown South\", the ongoing [China–United States trade war](/wiki/China%E2%80%93United_States_trade_war), and how Singapore was involved in, climate change; its seriousness and their measures, and changes to the re-employment and retirement ages which will take effect by 2022. Lee also announced that *SG Bicentennial Experience*, an exhibit held at [Fort Canning](/wiki/Fort_Canning_Hill) in commemoration of the bicentennial anniversary of modern foundation of Singapore was extended from mid-September to 31 December due to overwhelming responses and success. ### 2020 National Day Rally The 2020 rally was not held due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic). Instead, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) delivered a speech in Parliament on 2 September. ### 2021 National Day Rally The 2021 rally was held at the [Mediacorp Campus](/wiki/Mediacorp) on 29 August 2021. Originally scheduled for 22 August 2021, the rally was postponed due to the introduction of Phase 2 (Heightened Alert) measures to cope with an increase in [COVID-19](/wiki/COVID-19) community cases. In his speech he highlighted several employment measures, including Workfare enhancements like more top-ups to $1.1 billion in two years and lowering the age criteria to those 30 years old compared to 35 years old now, expanding [Progressive Wage Model](/wiki/Progressive_wage) to more sectors such as the retail, food and waste management sectors, as well as general careers like administrative assistants and drivers, a local qualifying salary and a PW Mark to acknowledge companies which pay workers fairly, studying concerns of delivery riders, controls on S-Passes and Employment Passes, legislating TAFEP guidelines and a tribunal for workplace disputes. He also highlighted measures on racial issues; like a proposed Maintenance of Racial Harmony Act to consolidate existing laws and put softer approaches, and allowing [tudungs](/wiki/Tudong) in public healthcare settings from November 2021 especially for nurses. ### 2022 National Day Rally The 2022 rally was held on 21 August 2022, returning to [ITE College Central](/wiki/ITE_College_Central) after 3 years being the previous time back in 2019. On Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong)'s speech, he announced special awards for frontliners who help fought [COVID-19](/wiki/COVID-19), being the COVID-19 Resilience Medal and state awards that indicate the special circumstance of COVID, along with impending relaxations of indoor masking for most areas except on public transport and in healthcare facilities. Lee also announced the impending repeal of [Section 377A](/wiki/Section_377A_(Singapore)) of the Penal Code while protecting the definition of marriages from future legal challenges by spelling out Parliament's right to do so in the Constitution. Existing policies on media standards—particularly in films and advertising, education, public housing and adoption rules will remain unchanged. Other policies announced include future schemes to attract talent to Singapore, along with infrastructural enhancements to Singapore. They are Tuas Port; which will run in an automated and digitalised manner, Changi Airport Terminal 5; which will go ahead with measures to boost resilience during pandemics and make the building more environmentally-friendly, building 150,000 housing units at the current [Paya Lebar Air Base](/wiki/Paya_Lebar_Air_Base) area and future plans from \"Long Term Plan Review\" by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority). ### 2023 National Day Rally The 2023 rally was held on 20 August 2023 at [ITE College Central](/wiki/ITE_College_Central). It was the final rally for Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) who subsequently handed over the premiership to [Lawrence Wong](/wiki/Lawrence_Wong) on 15 May 2024. Lee announced a new Majulah Package for *Young Seniors* who were above 50 or early 60s, born in 1973 or earlier. The package comprised three components - *Earn and save Bonus*, *Retirement Saving Bonus* and *MediSave Bonus*. Lee also spoke about ageing, making homes more senior-friendly under the EASE Programme (Enhancement for Active Seniors) as well as upgrading infrastructure and building more shelters as well more assisted living facilities as part of the new national programme *Age Well SG* which complements 'Healthier SG'. Lee also announced a new framework for the purchase of HDBs - Standard, Plus and Prime Flats. Under the new framework, it was also announced that Singles would be able to purchase new 2-room flats across all three types of flats under the new framework. Ending off the rally, Lee spoke about the recent PAP scandals such as Minister [S. Iswaran](/wiki/S._Iswaran)'s investigation as well as the affair between former Speaker of Parliament [Tan Chuan Jin](/wiki/Tan_Chuan_Jin) and Member of Parliament [Cheng Li Hui](/wiki/Cheng_Li_Hui) have not affected his plans for succession and that it was still on track. ### 2024 National Day Rally The 2024 National Day Rally was delivered by Prime Minister [Lawrence Wong](/wiki/Lawrence_Wong) on 18 August 2024 at [ITE College Central](/wiki/ITE_College_Central). This rally marked Wong's first rally as PM, following his succession of [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) in May 2024. During his speeches, the new Prime Minister announced several policy initiatives. These include Singapore's first-ever unemployment support scheme, a revamp of the [Gifted Education Programme](/wiki/Gifted_Education_Programme_(Singapore)), enhanced shared parental leave entitlements, and increased support for [build-to-order](/wiki/Build_to_order_(HDB)) flat applicants - with more priority given to singles and additional grants for low-income households. He also unveiled plans for [Sports Hub](/wiki/Singapore_Sports_Hub)'s future development, featuring a new 18,000-seat indoor stadium, pedestrianised roads, a community boulevard, and the consolidation of sport facilities, such as the integration of [Singapore Sports School](/wiki/Singapore_Sports_School) and training centres for national athletes. ## Format ### Broadcast The programme used to be aired as a single slot programme from 8 pm onwards. Since 2005, the rally is usually broadcast live from 6.45pm till 10pm (SST), with a break between 7:30 and 8 pm (the break was extended to 8.15 pm from 2017 onwards), across [Mediacorp](/wiki/Mediacorp) channels. However, most English rallies were over-run and most programmes on Mediacorp had postponed to the following week but some programmes were shown immediately after the English rally. Most programmes on MediaCorp would resume earlier at 9:30pm or later at 11:00pm if the rally over-ran the scheduled time. Platform/LanguageEnglish Dubbing in EnglishMandarin Dubbing in MandarinMalay Dubbing in MalayDubbing in TamilTV[Channel 5](/wiki/Channel_5_(Singaporean_TV_channel)) [CNA](/wiki/CNA_(TV_network)) (8pm-10pm)[Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)) [Channel U](/wiki/Channel_U_(Singaporean_TV_channel))[Suria](/wiki/Suria_(TV_channel))[Vasantham](/wiki/Vasantham_(TV_channel))Radio[CNA938](/wiki/CNA938)[Capital 95.8FM](/wiki/Capital_95.8FM)[Warna 94.2FM](/wiki/Warna_94.2FM)[Oli 96.8FM](/wiki/Oli_96.8FM)OnlineCNA Live [meWATCH](/wiki/MeWATCH)meWATCH (Chinese)-- From 2001 to 2004, the rally was also broadcast on the now-defunct [SPH MediaWorks](/wiki/SPH_MediaWorks)' channels, and from 2009 to 2018 (except for 2016) on [Mediacorp Okto](/wiki/Okto). ### Transcripts Transcripts of the rally speech are usually available for viewing after the event at Mediacorp news portals, [Singapore Press Holdings](/wiki/Singapore_Press_Holdings) news portals, the website of the Prime Minister's Office and the online press centre of the [Government of Singapore](/wiki/Government_of_Singapore). Highlights of the speeches will usually be reported by [Singapore newspapers](/wiki/Singapore_newspapers) in the following days. ## List of rallies YearDateVenueSpeakerTranscript19668 August 1966 (Monday)[National Theatre](/wiki/Singapore_National_Theatre)[Lee Kuan Yew](/wiki/Lee_Kuan_Yew)196716 August 1967 (Wednesday)196816 August 1968 (Friday)196916 August 1969 (Saturday)197016 August 1970 (Sunday)197115 August 1971 (Sunday)197213 August 1972 (Sunday)197326 August 1973 (Sunday)197418 August 1974 (Sunday)197517 August 1975 (Sunday)197615 August 1976 (Sunday)197714 August 1977 (Sunday)197813 August 1978 (Sunday)197919 August 1979 (Sunday)198017 August 1980 (Sunday)198116 August 1981 (Sunday)198215 August 1982 (Sunday)198314 August 1983 (Sunday)198419 August 1984 (Sunday)[Singapore Conference Hall](/wiki/Singapore_Conference_Hall)198518 August 1985 (Sunday)198617 August 1986 (Sunday)[Kallang Theatre](/wiki/Kallang_Theatre)198716 August 1987 (Sunday)198814 August 1988 (Sunday)198920 August 1989 (Sunday)199026 August 1990 (Sunday)199111 August 1991 (Sunday)[Goh Chok Tong](/wiki/Goh_Chok_Tong)English199216 August 1992 (Sunday)English199315 August 1993 (Sunday)English199421 August 1994 (Sunday)English199520 August 1995 (Sunday)English199618 August 1996 (Sunday)English199724 August 1997 (Sunday)English199823 August 1998 (Sunday)English199922 August 1999 (Sunday)English200020 August 2000 (Sunday)English200119 August 2001 (Sunday)[University Cultural Centre](/wiki/National_University_of_Singapore)English200218 August 2002 (Sunday)English200317 August 2003 (Sunday)English200422 August 2004 (Sunday)[Lee Hsien Loong](/wiki/Lee_Hsien_Loong)English200521 August 2005 (Sunday)English200620 August 2006 (Sunday)English200719 August 2007 (Sunday)Malay · Chinese · English200817 August 2008 (Sunday)English200916 August 2009 (Sunday)English201029 August 2010 (Sunday)English201114 August 2011 (Sunday)English201226 August 2012 (Sunday)English201318 August 2013 (Sunday)[ITE College Central](/wiki/ITE_College_Central)English201417 August 2014 (Sunday)Malay · Chinese · English201523 August 2015 (Sunday)Malay · Chinese · English201621 August 2016 (Sunday)Malay · Chinese · English (part 1 · part 2)201720 August 2017 (Sunday)Malay · Chinese · English201819 August 2018 (Sunday)Malay · Chinese · English201918 August 2019 (Sunday)Malay · Chinese · English2020Cancelled due to the COVID-19 pandemic202129 August 2021 (Sunday)[Mediacorp Campus](/wiki/Mediacorp)[Lee Hsien Loong](/wiki/Lee_Hsien_Loong)Malay · Chinese · English202221 August 2022 (Sunday)[ITE College Central](/wiki/ITE_College_Central)Malay · Chinese · English202320 August 2023 (Sunday)Malay · Chinese · English202418 August 2024 (Sunday)[Lawrence Wong](/wiki/Lawrence_Wong)Malay · Chinese · English202517 August 2025 (Sunday) Malay · Chinese · English ## Response An article titled \"*Singapore's National Day Rally Speech: A Site of Ideological Negotiation*\" analyses the inaugural National Day Rally speeches of three Singapore prime ministers. It locates these speeches in the continuous ideological work that the PAP government has to do to maintain consensus and forge new alliances among classes and social forces that are being transformed by globalisation. Increasingly, these speeches have had to deal with the contradictions between nation-building and the tensions between the liberal and reactionary tendencies of the global city. According to Kenneth Paul Tan of the [Lee Kuan Yew School of Public Policy](/wiki/Lee_Kuan_Yew_School_of_Public_Policy), he stated that *\"the rally speech has also been a part of larger celebrations surrounding the commemoration of Singapore's independence gained on 9th August 1965. These celebrations have come to include a short and formal televised National Day message from the prime minister, observance ceremonies held at organisations in the public and private sectors, constituency dinners and ministerial speeches, regularly televised music videos of patriotic songs composed for the celebrations, and—most spectacular of all—a National Day parade that since the mid-1980s has included not only a traditional ceremonial segment, but also high-tech mass performances and re-enactments of the official \"Singapore Story\" that end on a climax of fireworks\"*. He added that *\"Clearly the symbolic and formal aspects of the speech are just as important as its contents, taking Singaporeans collectively to an emotional high. This is especially so during general election years, when the prime minister announces the PAP's \"report card\" of achievements in government as well as the distribution of election \"goodies\" to the Singaporean masses—the lower income voters in particular—as a way of reinforcing the image of government as benevolent provider\"*. As an annual injection of patriotism, the National Day celebrations help to inoculate Singaporeans against the disenchantment that accompanies advanced industrial societies, whether they are formally classified as capitalist or socialist, democratic or authoritarian. Singaporeans are reminded every year of the PAP's pioneer leaders—Lee Kuan Yew and his \"lieutenants\". The PAP knows that its authority will be secure as long as it remains able to make Singaporeans believe that it can continue to deliver material prosperity and security for all, regardless of race. Therefore, the PAP has had to reassert its relevance constantly by insisting on Singapore's fundamentally vulnerable nature and condition, an insistence that has sustained a culture of fear and arrested the risky global environment, the PAP also knows that the transactional basis on which its authority is built has become fragile and therefore needs to be strengthened by moral authority. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:57:28.792547",
  "title": "Singapore National Day rally",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_National_Day_rally"
}