{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:00:41.116287"
  },
  "content": "Ideology**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singaporean communitarianism\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2014)* *(Learn how and when to remove this message)*This article **may be unbalanced towards certain viewpoints**. Please help improve it by adding information on neglected viewpoints. Relevant discussion may be found on the talk page. *(March 2012)* *(Learn how and when to remove this message)* **Singaporean communitarianism** was founded by [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) in 1959 under the [People's Action Party](/wiki/People%27s_Action_Party) (PAP). ## Principles [Communitarianism](/wiki/Communitarianism) is the belief that a perfect society relies not of the ambition of personal [individualism](/wiki/Individualism), but rather consists of the responsibilities of cohesive communal structures. This is inherently a dualistic approach to a nationalistic society. Singaporean communitarianism sets up communities to support the greater good, much like the spokes support a wheel. Emphasis is placed not on the inherent rights a government owes to an [individual](/wiki/Individual), but rather the inherent responsibilities an individual owes to their [community](/wiki/Community). Lee Kuan Yew was the first Singaporean leader to emphasize a nation which created a national interest amongst the splintered cultures of Singapore. This was done as a transformative approach to the national [hegemony](/wiki/Hegemony) at the time which was eroding due to a lapse in time from the historical conditions that led to the original underlying [Marxist](/wiki/Marxist) ideology of the PAP, among other things. Although it may have been the pragmatic approach to Marxism that was the catalyst of a [First World](/wiki/First_World) [Singapore](/wiki/Singapore), it was also Lee Kuan Yew's national interest approach which allowed the success of Singapore to grow. The weakening hold of pragmatism acted as a [Petri dish](/wiki/Petri_dish) allowing for new concepts such as communitarianism to implant itself in the national consciousness. Recent global political trends tend to fill pragmatic voids with [liberal democracy](/wiki/Liberal_democracy) such as after the fall of the [Soviet Union](/wiki/Soviet_Union) and most of its satellite nations. However, due to Singapore's majority ethnic [Chinese](/wiki/Chinese_people) (coupled with a sense of retaliatory ethnic pride against the then recent [Malaysian](/wiki/Malaysia) expulsion) and its [Confucian](/wiki/Confucian) mentality, formal democratic processes were framed within a communitarian ideology. This ideological communitarian veil over Singaporean democracy includes such actions as the PAP's attempt to redirect cultural and political development towards traditional values. This redirection was perceived as way of resisting the \"corrupting influences of an incipient Westernisation\", or in other words a way to Confucianise society. Singaporean communitarianism included a [public housing](/wiki/Public_housing) programme by the [Housing Development Board](/wiki/Housing_Development_Board) (HDB) in 1960 which currently houses approximately 80% of the Singaporean population. The legislative act that allowed the HDB to acquire vast amounts of [privately owned land](/wiki/Land_tenure) is in contrast to British and Singaporean [common law](/wiki/Common_law) [property rights](/wiki/Property_rights). Although the HDB gave a legal rationale for the acquisition, it was clearly done to further advance the ideological hegemony of the times.[*citation needed*]\n",
  "language": "en",
  "processed_at": "2026-01-12T12:00:41.115850",
  "title": "Singaporean communitarianism",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singaporean_communitarianism"
}