{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:51.886422"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore Cooperation Programme\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2023)* *(Learn how and when to remove this message)* The **Singapore Cooperation Programme** (**SCP**) is a series of programmes offered by the [Government of Singapore](/wiki/Government_of_Singapore) to facilitate the sharing with other developing countries the technical and systems skills that [Singapore](/wiki/Singapore) has learned and acquired over the years. SCP was established in 1992 to consolidate technical assistance initiatives offered by Singapore since the 1960s. Technical assistance focuses on training and increasing the skills of a nation. As a country whose only resource is its people, Singapore believes human resource development is vital for economic and social progress. Singapore had also benefited from technical assistance from other countries and international organisations. ## Beginnings In the 1970s, Singapore started to exchange its experiences with friends around the world through various programmes. These programmes were brought under a single framework when the Singapore Cooperation Programme (SCP) was established in 1992 under the Technical Cooperation Directorate (TCD) of the Ministry of Foreign Affairs. Through the SCP, Singapore has been sharing its development experience through courses, seminars, workshops, consultancy as well as hosting study visits in a range of fields. ## Areas of interest The main fields of training include Education, Law and Judiciary, Sustainable Development, Communications and Transport, Economic Development and Trade Promotion, Healthcare, Public Administration and Digital Government. Some of the TCTP partners include [Australia](/wiki/Australia), [Canada](/wiki/Canada), European Commission, [France](/wiki/France), [Germany](/wiki/Germany), [Japan](/wiki/Japan), [The Holy See](/wiki/The_Holy_See), the [Republic of Korea](/wiki/Republic_of_Korea), [Luxembourg](/wiki/Luxembourg), [New Zealand](/wiki/New_Zealand), [Norway](/wiki/Norway), [Thailand](/wiki/Thailand), the [Asia Development Bank](/wiki/Asia_Development_Bank), Commonwealth of Learning, Colombo Plan Secretariat, Commonwealth Secretariat, Economic and Social Commission for Asia and the Pacific, Hanns Seidel Foundation, International Atomic Energy Agency, International Civil Aviation Organisation, International Maritime Organisation, International Monetary Fund, United Nations Children's Fund, United Nations Development Programme, US Vietnam Trade Council, World Bank, World Health Organisation, World Intellectual Property Organisation and World Trade Organisation. ## Participating countries As of 2015, there are 100,000 officials who had participated in SCP. SCP hosted over 6,000 officials from 170 countries who attended about 300 courses and workshops yearly. As of January 2017, more than 112,000 officials from 170 countries have been trained.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:51.886113",
  "title": "Singapore Cooperation Programme",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Cooperation_Programme"
}