{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:58:42.830419"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore Xin Hua Sports Club\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2018)* *(Learn how and when to remove this message)*Football club The **Singapore Xin Hua Sports Club** is a semi-professional [football](/wiki/Association_football) team that currently competes in the [Singapore National Football League](/wiki/Singapore_National_Football_League) Division 2. It was founded in 1911 as a local football organisation in [Singapore](/wiki/Singapore) which was initially set up to promote football amongst the [Chinese](/wiki/Chinese_Singaporeans) community in [colonial Singapore](/wiki/Colony_of_Singapore). ## History In 1911, the Straits Chinese of Singapore formed the **Straits Chinese Football Association** (SCFA). The various Straits Chinese clubs in Singapore who already had a football team were in the SCFA while all other clubs were encouraged to join. The SCFA would regulate the football matches and be an authority among the football clubs. While the SCFA lacked a playing ground for clubs to play matches, the Fairy Dale Cup was held with eight teams competing. In 1913, [Lim Boon Keng](/wiki/Lim_Boon_Keng) became the president of SCFA. During [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) in [World War II](/wiki/World_War_II), the SCFA was disbanded. After the war in 1945, the SCFA was revived with an election of the council members and renamed as **Singapore Chinese Football Association** ([Chinese](/wiki/Chinese_language): 星華人足球協進會) (SCFA). In 1947, Choo Kwai Low founded the Malayan Chinese Football Association (MCFA) with SCFA as a member. In March 1970, SCFA changed its name to **Singapore Chinese Football Club** ([Chinese](/wiki/Chinese_language): 新加坡華人足球會) (SCFC). It was reported in May that according to Choo, due to MCFA's new general deputy secretary, who happened to be an assistant registrar of Johor's registry of companies, MCFA was warned by the registry of companies for breaking a law for having SCFC, a non Malaysian club, as a member. As a result, SCFC left MCFA. SCFC was renamed as Singapore Xin Hua Sports Club. ## Football In 1982, SCFC hosted the MCFA cup and won the competition, beating Selangor 2-0. In 1987, SCFC decided to accept the invitation to play in the MCFA cup having last played in the final of the 1982 MCFA cup. ### Tyrwhitt Soccerites In 1985, the Singapore Chinese Football Club formed the Tyrwhitt Soccerites, which players consisted of different races, to participate in the [National Football League](/wiki/Singapore_Football_League) (NFL). In 1987, Tyrwhitt Soccerites won the NFL Division II Champions and was promoted to Division I. They won the Division I in the first year and was promoted to the [FAS Premier League](/wiki/FAS_Premier_League). However they ended up last in the Premier League in their first season in 1989. From 1989 to 1990, Tyrwhitt Soccerites was sponsored by German sports brand, [Puma](/wiki/Puma_(brand)). In 1994, the club signed Australian coach Michael Urukalo, Australian striker [Abbas Saad](/wiki/Abbas_Saad) and Croatian goalkeeper, Sandro Radun. In 1995, the club indicated interest in playing in the Premier League for the 1995 season. [Football Association of Singapore](/wiki/Football_Association_of_Singapore) (FAS) gave the club a day to confirm that it had resolved its financial troubles which the club was unable to, resulting in FAS refusing the club's participation in the league. #### Manager - William Thum (1988–89) - Andrew Lim (1990–??) - Juergen Martiens (1993) ### Singapore Xin Hua Football Club In 2016, Singapore Chinese Football Club was renamed as Singapore Xin Hua Sports Club. In 2022, Singapore Xin Hua Sports Club was renamed as Singapore Xin Hua Football Club. In 2022, Singapore Xin Hua clinched the [Island Wide League](/wiki/2022_Island_Wide_League) (IWL) title after overcoming [Kaki Bukit SC](/wiki/Kaki_Bukit_SC) 2-0 in the final at the [Jalan Besar Stadium](/wiki/Jalan_Besar_Stadium). The club became the 10th winner of the competition and finished their campaign with a 100 per cent record. They were promoted to [Singapore Football League](/wiki/Singapore_Football_League) (SFL) 2 for the first time. However, the club were relegated back to the IWL after finishing in bottom two of [2023 SFL 2](/wiki/2023_Singapore_Football_League#League_2). Despite being relegated, the club won SFL2 Fair Play Award during the FAS Awards Night 2023. They have been playing in the IWL since 2024. #### Team List - 2024 IWL team - 2025 IWL team ### Affiliated football clubs Katong Football Club was an affiliated football club of SCFC. ### Amateur football An amateur football team was formed in 2007 and took part in Singapore's amateur football organisation [ESPZEN](/wiki/ESPZEN)'s Sunday League. Most of its players are Chinese footballers and are well trained. The team won the Dixy Cup Johor in 2008 and was runner-up the next year in 2009. ### Veterans' Tournaments The SCFC regularly send its members for friendlies and tournaments throughout the region of Asia and the Pacific. Tournaments include the annual Evergreen Cup for football veterans. The 9th Evergreen Cup was hosted by Singapore in 2005. ### Competitions - Football Association of Singapore – Singapore National Football League Division 3 Champions 1986 - Football Association of Singapore – Singapore National U-19 Tournament 1986 - Football Association of Singapore – Singapore National Football League Division 2 Champions 1987 - Football Association of Singapore – Singapore Pools Premier League 1988 - Football Association of Singapore – Singapore National U-17 Tournament 1988 - Football Association of Singapore – Singapore National Football League Division 1 Champions 1988 - Football Association of Singapore – Singapore Premier League 1989 - World Chinese Football Association – 7th Evergreen Veteran Cup 1995 - Football Association of Singapore – Singapore National Football League Division 3 2000 - Football Association of Singapore – Singapore National Football League Division 3 Champions 2001 - Football Association of Singapore – Singapore National Football League Division 2 Champions 2002 - Football Association of Singapore – Singapore National Football League Division 1 2003 - World Chinese Football Association – 8th Evergreen Veteran Cup 2003 - World Chinese Football Association – 9th Evergreen Veteran Cup 2005 - Football Association of Singapore – FICO Sports Futsal Challenge U-13 Runners up 2007 - Singapore 9's Master 9-A-Side Football Tournament 2008 - North East Central Children Futsal Challenge U-12 Runners up 2008 - K-Line Cup Challenge U-12 Runners up 2008 - K-Line Cup Challenge U-15 Runners up 2008 - Singapore Soccer Coaches Malaysia Tour Challenge U-15 Champions U-15 2008 - Football Association of Singapore – FICO Sports Futsal Challenge U-12 Champions 2008 - Coerver Challenge Cup U-14 Champions 2008 - Coerver Challenge Cup U-16 Runners up 2009 - Coerver Challenge Cup U-14 Third Placing 2009 - Coerver Challenge Cup U-12 Champions 2009 - Coerver Challenge Cup U-10 Champions 2009 - NSE Children League Tournament 2010 - RSUC President Challenge Trophy 2010 ## Basketball The basketball team was formed in 2016 to play in the [National Basketball League](/wiki/National_Basketball_League_(Singapore)) (NBL) Division 1. In its second year playing in the NBL, it won the Division 1 championship in November 2017. ## Activities Today, the SCFC involves itself in a number of grassroots and regional activities. These include: - Participation in local football tournaments - Youth Development Academy - Veterans' Tournaments ## Youth Development Academy Established in February 2007, the SCFC Academy is targeted at youth of all races living in the region of Singapore. Training is conducted by Asian Football Confederation qualified coaches and ex-Singapore internationals. The SCFC Academy maintains a unique approach towards training. Character development of its players takes equal, if not more importance than technical football skills. A strong emphasis is also placed on the players' academics. Players are known to have been barred from training if they do not do well at school, and parents are very much involved in the progress of their children in the Academy. Unlike clubs with youth academies or centres-of-excellence, the Academy's aims are to develop their players to be good enough to represent their own schools, and not necessarily SCFC. The Academy currently trains boys in the under-18/16/14/12/10/8 categories, with about 40 players in each senior and junior side. Since its establishment, the Academy's players have done well, winning several local and regional tournaments. Some of their players have also gone on to play for the schools such as the [Singapore Sports School](/wiki/Singapore_Sports_School) or even join the [S.League](/wiki/S.League). ## Community SCFC supports the development of Singapore football in the community. In addition to the SCFC Academy, the Club also maintains a school outreach programme. The club coaches football teams of primary and secondary schools each year. To date, the club has provided coaching for: - [Seng Kang Secondary School](/wiki/Seng_Kang_Secondary_School) - [Punggol Secondary School](/wiki/Punggol_Secondary_School) - [Greenwood Primary School](/wiki/Greenwood_Primary_School) - [Woodlands Primary School](/wiki/Woodlands_Primary_School,_Singapore) ## Affiliates Over the years, SCFC has established relations with several football organisations in Asia and the Pacific, especially with overseas Chinese football organisations in the region. Affiliated football organisations hail from: - Australia - Canada - China - Hong Kong - Indonesia - Macau - Malaysia - Taiwan\n",
  "language": "en",
  "processed_at": "2026-01-12T11:58:42.830033",
  "title": "Singapore Xin Hua Sports Club",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Xin_Hua_Sports_Club"
}