{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:00:37.657580"
  },
  "content": "Mandarin Chinese as spoken in Singapore **Singaporean Mandarin** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 新加坡华语; [traditional Chinese](/wiki/Traditional_Chinese_characters): 新加坡華語; [pinyin](/wiki/Pinyin): *Xīnjiāpō Huáyǔ*) is a variety of [Mandarin Chinese](/wiki/Mandarin_Chinese) spoken natively in Singapore. Mandarin is one of the four [official languages](/wiki/Official_language) of Singapore alongside [English](/wiki/English_language), [Malay](/wiki/Malay_language) and [Tamil](/wiki/Tamil_language). Singaporean Mandarin can be divided into two distinct forms: **Standard Singaporean Mandarin** and **Colloquial Singaporean Mandarin (Singdarin)**. These forms are easily distinguishable to speakers proficient in Mandarin. The standard form is used in formal contexts, including television and radio broadcasts, and is the variant taught in government and international schools. The colloquial form is used informally among Singaporeans. Singaporean Mandarin contains many unique [loanwords](/wiki/Loanwords) from other Chinese languages, such as [Hokkien](/wiki/Hokkien_influence_on_Singaporean_Mandarin), as well as Singapore's other official languages: English, [Malay](/wiki/Malay_language) and [Tamil](/wiki/Tamil_language). The widespread adoption of Singaporean Mandarin by the [Chinese community in Singapore](/wiki/Chinese_in_Singapore) followed the government's [Speak Mandarin Campaign](/wiki/Speak_Mandarin_Campaign) launched in 1979. Today, it is the second most commonly spoken language in Singapore after English and has largely replaced [Singaporean Hokkien](/wiki/Singaporean_Hokkien) as the [lingua franca](/wiki/Lingua_franca) among Singaporean Chinese. The rise of China in the 21st century has increased the prominence of Mandarin proficiency in Singapore. By 2010, more Singaporeans were multilingual, with a growing number speaking two or more languages. Since the early 21st century, the influx of [mainland Chinese](/wiki/Mainland_Chinese) immigrants from [mainland China](/wiki/Mainland_China) has influenced Singaporean Mandarin to align more closely with [Standard Chinese](/wiki/Standard_Chinese), although distinctive features have been retained. The language continues to evolve, influenced by [Mainland Mandarin Chinese](/wiki/Standard_Chinese), [Taiwanese Mandarin](/wiki/Taiwanese_Mandarin) and [English](/wiki/English_language). Since the 2010s, the proportion of Singaporean Chinese speaking Mandarin at home has begun to decline, with [Singapore English](/wiki/Singapore_English) increasingly used and now surpassing Mandarin as the primary language spoken at home. ## Overview ### Standard Singaporean Mandarin The official standard of Mandarin in [Singapore](/wiki/Singapore), locally known as *Huáyǔ* (华语; 華語), is based on the phonology of the [Beijing dialect](/wiki/Beijing_dialect) and the grammar of [Vernacular Chinese](/wiki/Vernacular_Chinese). It is largely identical to the standard Mandarin used in the [People's Republic of China](/wiki/People%27s_Republic_of_China) (known there as *Pǔtōnghuà* 普通话) and in [Republic of China (Taiwan)](/wiki/Taiwan) (known there as *Guóyǔ* 國語 and more recently also as *Huáyǔ* 華語). Standard Singaporean Mandarin, typically heard in television and radio news broadcasts, is generally closer to [Guoyu](/wiki/Taiwanese_Mandarin) in terms of [phonology](/wiki/Phonology), [vocabulary](/wiki/Vocabulary) and [grammar](/wiki/Grammar) than to [Putonghua](/wiki/Putonghua). Differences are minor and mainly appear in the [lexicon](/wiki/Lexicon). ### Colloquial Singaporean Mandarin Also commonly known as **Singdarin**[*citation needed*] ([simplified Chinese](/wiki/Simplified_Chinese_characters): 新加坡式华语; [traditional Chinese](/wiki/Traditional_Chinese_characters): 新加坡式華語; [pinyin](/wiki/Pinyin): *Xīnjiāpōshì Huáyǔ*; [Wade–Giles](/wiki/Wade%E2%80%93Giles): *hsin1 chia1 p'o1 shih4 hua2 yü3*) or **Singnese** ([Chinese](/wiki/Chinese_language): 星式中文; [pinyin](/wiki/Pinyin): *Xīngshì Zhōngwén*; [Wade–Giles](/wiki/Wade%E2%80%93Giles): *hsing1 shih4 chung1 wen2*; lit. 'Sing[apore] colloquial Chinese language'), the colloquial variety is a [Mandarin](/wiki/Mandarin_Chinese) dialect native and unique to [Singapore](/wiki/Singapore) similar to its English-based counterpart [Singlish](/wiki/Singlish_vocabulary). It is based on [Mandarin](/wiki/Mandarin_Chinese) but has a large amount of [English](/wiki/English_language) and [Malay](/wiki/Malay_language) in its vocabulary. There are also words from other Chinese languages such as [Cantonese](/wiki/Cantonese), [Hokkien](/wiki/Hokkien) and [Teochew](/wiki/Teochew_dialect) as well as [Tamil](/wiki/Tamil_language). While Singdarin grammar is largely identical to [Standard Mandarin](/wiki/Standard_Chinese), there are significant divergences and differences especially in its pronunciation and vocabulary. In terms of colloquial spoken Mandarin, Singaporean Mandarin is subjected to influence from the local historical, cultural and social influences of Singapore. As such, there are remarkable differences between colloquial Singaporean Mandarin and [Standard Chinese](/wiki/Standard_Chinese), and a non-Singaporean Chinese speaking individual may find it difficult to understand. ### Features of Singaporean Mandarin Singaporean Mandarin has preserved the [vocabulary](/wiki/Vocabulary) and certain other features from [Classical Chinese](/wiki/Classical_Chinese) and early [Vernacular Chinese](/wiki/Vernacular_Chinese) (早期白話; *zǎoqī báihuà*), dating back from the early 20th century. Since Singapore's [Chinese medium schools](/wiki/Chinese_schools) adopted Chinese teaching materials from [Republic of China](/wiki/Republic_of_China_(1912%E2%80%931949)) in the early 20th century, Singapore's early Mandarin pronunciations was based on the [Zhuyin](/wiki/Zhuyin) in the *Dictionary of National Pronunciation* (國音字典; *Guó yīn zìdiǎn*) and *Vocabulary of National Pronunciation for Everyday Use* (國音常用字彙; *Guó yīn chángyòng zìhuì*). As such, it had preserved many older forms of pronunciations. In addition, during its initial development, Singaporean Mandarin was also influenced by the other Chinese varieties of Singapore such as [Hokkien](/wiki/Min_Nan), [Teochew](/wiki/Teochew_dialect), [Cantonese](/wiki/Standard_Cantonese) etc. From 1949 to 1979, due to lack of contact between Singapore and [People's Republic of China](/wiki/People%27s_Republic_of_China), [Putonghua](/wiki/Putonghua) did not exert any form of influence on Singaporean Mandarin. On the contrary, the majority of Mandarin Chinese entertainment media, Chinese literature, books and reading materials in Singapore came mainly from [Taiwan](/wiki/Republic_of_China). As a result, Singaporean Mandarin has been influenced by [Taiwanese Mandarin](/wiki/Taiwanese_Mandarin) to a certain degree. After the 1980s, along with [China](/wiki/China)'s [Open Door Policy](/wiki/Economic_reform_in_the_People%27s_Republic_of_China), there was increasing contact between Singapore and mainland China, thus increasing [Putonghua](/wiki/Putonghua)'s gradual influence on Singaporean Mandarin. These influences included the adoption of [pinyin](/wiki/Pinyin) and the shift from usage of [Traditional Chinese characters](/wiki/Traditional_Chinese_characters) to [Simplified Chinese characters](/wiki/Simplified_Chinese_characters). Much of the [lexicon](/wiki/Lexicon) from [Putonghua](/wiki/Putonghua) had also found its way into Singaporean Mandarin although not to a huge extent. ## History ### Background Historical sources indicate that before 1819, when [Stamford Raffles](/wiki/Stamford_Raffles) arrived in Singapore, there were already a few Chinese settlers on the island. After Raffles established Singapore as a trading post in 1819, many [Peranakan](/wiki/Peranakan) from Malaya and European merchants began arriving. To meet the growing demand for labour, large numbers of [coolies](/wiki/Coolies) were brought from China. The influx of Chinese labourers increased after the [Opium War](/wiki/Opium_War). Those who migrated from China to Singapore during the 19th and early 20th centuries were known as \"*sinkeh*\" (新客). Many were contract labourers, including dockworkers. Most came to escape poverty and seek better opportunities, while others fled the wars and unrest in China during the first half of the 20th century. The majority originated from the southern provinces of [Fujian](/wiki/Fujian), [Guangdong](/wiki/Guangdong) and [Hainan](/wiki/Hainan). These *sinkeh* included large numbers of [Hoklo](/wiki/Hoklo_people) (Hokkien), [Teochew](/wiki/Teochew_people), [Cantonese](/wiki/Cantonese_people) and [Hainanese](/wiki/Hainanese_people). They brought with them a variety of Chinese languages, including [Hokkien](/wiki/Hokkien), [Teochew](/wiki/Teochew_dialect), [Cantonese](/wiki/Cantonese), [Hakka](/wiki/Hakka) and [Hainanese](/wiki/Hainanese). As these languages were mutually unintelligible, [clan associations](/wiki/Kongsi) were formed along lines of dialect and ancestral origin to provide social support for members of the same linguistic group.The use of Mandarin to serve as a [lingua franca](/wiki/Lingua_franca) amongst the Chinese only began with the founding of [Republic of China](/wiki/Republic_of_China_(1912%E2%80%931949)), which established Mandarin as the official tongue. ### Development of Mandarin in Singapore Before the 20th century, old-style private Chinese schools in Singapore, known as *sīshú* (私塾), generally used Chinese varieties such as Hokkien, Teochew and Cantonese as the [medium of instruction](/wiki/Medium_of_instruction) for teaching the [Chinese classics](/wiki/Chinese_classics) and [Classical Chinese](/wiki/Classical_Chinese). Singapore's first Mandarin-medium classes appeared around 1898, but schools using other Chinese varieties remained in operation until 1909. Following the [May Fourth Movement](/wiki/May_Fourth_Movement) in 1919 and the influence of the [New Culture Movement](/wiki/New_Culture_Movement) in China, these schools gradually replaced non-Mandarin instruction with Mandarin Chinese, or *Guóyǔ* (國語). The [Kuomintang](/wiki/Kuomintang) (KMT)–led government of China supported this shift by sending teachers and textbooks, and by the 1920s all Chinese schools in Singapore had adopted Mandarin despite British discouragement. In the early years of Mandarin education in Singapore, there was no fully standardised colloquial form to serve as a learning model. Most teachers were from southern China and spoke with strong regional accents, which influenced Singaporean Mandarin by eliminating features such as [erhua](/wiki/Erhua) (兒化) and the light tone (輕聲). The publication of the *Dictionary of National Pronunciation* in 1919 introduced a hybrid system combining northern sounds with southern rhymes, including the [checked tone](/wiki/Checked_tone) (入聲), but it was only in 1932 with the *Vocabulary of National Pronunciation for Everyday Use*, based entirely on the Beijing dialect, that a consistent standard emerged. This standard was adopted in Singapore’s Chinese schools. During the 1930s and 1940s, new immigrants from China, known as *xīn kè* (新客), helped establish more Chinese schools, further expanding Mandarin's use. Over time, the term for Mandarin in Singapore shifted from *Guóyǔ* (National Language) to *Huáyǔ* (Chinese Language). From the 1950s to the 1970s, Singaporean Mandarin was heavily influenced by [Taiwanese Mandarin](/wiki/Taiwanese_Mandarin), as most Chinese publications came from Taiwan or Hong Kong. In the 1980s, following mainland China's [economic reforms](/wiki/Chinese_economic_reform), Singapore adopted [Hanyu Pinyin](/wiki/Hanyu_Pinyin) and switched from [Traditional Chinese characters](/wiki/Traditional_Chinese_characters) to [Simplified Chinese characters](/wiki/Simplified_Chinese_characters). The [Speak Mandarin Campaign](/wiki/Speak_Mandarin_Campaign) launched in 1979 spurred further standardisation, with the [Promote Mandarin Council](/wiki/Promote_Mandarin_Council) conducting research based on linguistic models from mainland China and Taiwan. Since the 1990s, greater interaction with mainland China and a large influx of Chinese migrants have brought more [Putonghua](/wiki/Putonghua) vocabulary into Singaporean Mandarin. ## Differences from Standard Mandarin ### Vocabulary Major differences between Singaporean Mandarin *Huayu* (华语) and [Putonghua](/wiki/Putonghua) lie in the [vocabulary](/wiki/Vocabulary) used. A lack of contact between Singapore and China from 1949 to 1979 meant that Singaporean Mandarin had to invent new words to fit the local context, as well as borrow words from [Taiwanese Mandarin](/wiki/Taiwanese_Mandarin) or other Chinese varieties that were spoken in Singapore. As a result, new Mandarin words proprietary to Singapore were invented. The *Dictionary of Contemporary Singaporean Mandarin Vocabulary* (时代新加坡特有词语词典) edited by Wang Huidi (汪惠迪) listed 1,560 uniquely local Singaporean Mandarin words, which are not used in mainland China or Taiwan. ### Unique Singaporean Mandarin words There are many new terms that are specific to living in Singapore. These words were either translated from Malay and non-Mandarin Chinese varieties (or invented) as there were no equivalent words in [Putonghua](/wiki/Putonghua). Some of the words are taken from the [Hokkien](/wiki/Hokkien) translation of Malay words. Words translated from Malay into [Hokkien](/wiki/Hokkien) include *kampung* (甘榜, English 'village'), *pasar* (巴刹, English 'market'). This explains the uniquely Singapore Mandarin words. Traditional ChineseSimplified ChinesePinyinDefinition紅毛丹红毛丹*hóngmáodān**[rambutan](/wiki/Rambutan)* (a type of Southeast Asian fruit)奎籠奎笼*kuílóng**[kelong](/wiki/Kelong)* (a place for fishing)甘榜甘榜*gānbǎng**[kampung](/wiki/Kampung)* (village)沙爹沙爹*shādiē**[Satay](/wiki/Satay)* (a type of Singaporean Malay food)囉㘃/羅惹罗惹*luōrě**[Rojak](/wiki/Rojak)* (a type of Singaporean Malay food)清湯清汤*qīngtāng*clear soup or broth固本固本*gùběn*coupon. Also used for car parking組屋组屋*zǔwū*flat built by [Housing Development Board](/wiki/Housing_Development_Board)擁車證拥车证*yōngchēzhèng*[car ownership-license](/wiki/Certificate_of_Entitlement)保健儲蓄保健储蓄*bǎo jiàn chǔ xǜ*[medisave](/wiki/Medisave) (medical saving)週末用車周末用车*zhōu mò yòng chē*Weekend Car (a classification of car ownership in Singapore)財路财路*cáilù*\"[Giro](/wiki/Giro_(banking))\" (a system of payment through direct bank account deduction in Singapore)巴刹巴刹*bāshā*\"[bazaar](/wiki/Bazaar)\" or market or *pasar* (Malay)民衆俱樂部 / 聯絡所民众俱乐部 / 联络所*mín zhòng jù lè bù lián luò suǒ*[community centre](/wiki/Community_centre)叻沙叻沙*lāsā**[laksa](/wiki/Laksa)* (a type of curry noodle)垃圾蟲垃圾虫*lèsè chóng/lājī chóng*\"litter-bug\"; someone who violated the law for littering排屋排屋*páiwū*[terrace house](/wiki/Terrace_house)建國一代建国一代jiàn guó yí dàiPioneer generation; to describe the early builders of Singapore ### Same meaning, different words There are some words used in Singaporean Mandarin that have the same meaning with other words used in [Putonghua](/wiki/Putonghua) or [Taiwanese Mandarin](/wiki/Taiwanese_Mandarin): Chinese CharactersPinyinDefinitionPutonghuaGuoyuNotes乐龄*lè líng*old people老龄 lǎo líng年長者 nián zhǎng zhě三文治*sān wén zhì*sandwich三明治 sān míng zhìFrom English \"sandwich\" via Cantonese 三文治 *sāam màhn jih*德士*déshì*taxi出租车 chūzūchē計程車 jìchéngchēcompare Cantonese 的士 *dīk sih* (from English \"taxi\").货柜*huò guì*container集装箱 jí zhuāng xiāng貨櫃 huò guì火患*huǒ huàn*fire火災 huǒ zāi火警 huǒ jǐng火災 is also used in Singapore and Taiwan.耐*nài*durable/lasting耐用 nài yòng耐用 nài yòngFrom classical Chinese. 耐用 is also used in Singapore.驾车*jià chē*drive a car开车 kāi chē開車 kāi chē驾 originates from classical Chinese. 开车 is also used in Singapore. 驾车 has also found its way into Putonghua vocabulary.首个*shǒu gè*first第一个 dì yī gè第一个 is also used in Singapore. 首个 has also found its way into Putonghua vocabulary.公众*gōng zhòng*public mass群众 qún zhòng群眾 qún zhòng公众 has also found its way into Putonghua vocabulary. 群众 is also used in Singapore, as in 群众大会 (rally).群体*qún tǐ*organized group集体 jí tǐ集體 jí tǐ群体 has also found its way into Putonghua and Taiwanese Mandarin vocabulary. 集体 is also used in Singapore, more commonly as an adverb (*en masse*).第一时间*dì yī shí jiān*immediately立刻 lì kè立即 lì jíLiterally 'the first timing'. Both 立刻 and 立即 are used in Singapore as well.一头雾水*yī tóu wù shǔi*blurred and confused晕头转向 yūn tóu zhǔan xìang糊裡糊塗 hú lǐ hú túThe idiom 一头雾水 has also found its way into Putonghua vocabulary.码头*mǎ tóu*dock港口 gǎng kǒu港口 gǎng kǒuFrom Hokkien/Cantonese, Hokkien: *bé-thâu*, Cantonese: *ma tau*. 头 may carry a neutral tone in Mandarin, thus the phrase becoming *mǎtou*.领袖*lǐng xiù*leader领导 lǐng dǎo領袖 lǐng xiù領袖 is sometimes used in Singapore, more commonly as a verb (*to lead*).手提电话*shǒu tí diàn huà*mobile phone手机 shǒu jī行動電話/手機 xíng dòng diàn huà/shǒu jī手机 is also used in Singaporean Mandarin, although less frequently.客工*kè gōng*foreign worker外勞 wài láo外劳 also appears in some Singaporean Chinese writing (e.g. [Lianhe Zaobao](/wiki/Lianhe_Zaobao))农夫*nóng fū*farmer农民 nóng mín鄉民 xiāng mín农夫 was an older Chinese term used in China before 1949, but continues to be used in Singapore.巴士*bā shì*bus公交车 gōng jiāo chē公車/巴士 gōng chē/bā shìFrom Cantonese.电单车*diàn dān chē*motorcycle摩托车 mó tuō chē機車 jī chēFrom Cantonese.罗里*luó lǐ*lorry卡车 kǎ chē貨車 huò chēFrom English word \"lorry\".角头*jiǎo tóu*corner角落 jiǎo luò角落 jiǎo luòFrom Hokkien *kak-thâu*. Note that in Putonghua, 角头 actually means \"chieftain of mafia/secret society\" instead of \"corner\". Occasionally, the phrase carries the Putonghua meaning in Singaporean context, so the latter may be clarified with a postposition like 间 *jiān* (in between), 内 *nèi* or 里 *lǐ* (both mean 'in(side)').散钱*sǎn qián*small change零钱 líng qián零錢 líng qiánOriginates from classical Chinese. 散钱 is also used in Putonghua, while 零钱 is sometimes used in Singapore, especially in writing. ### Same word, different meanings This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(August 2024)* *(Learn how and when to remove this message)* There are certain similar words used in both Singaporean Mandarin and Putonghua, but have different meanings and usage. Chinese CharactersPinyinMeaning in HuayuMeaning in PutonghuaNotes小姐*xiǎo jiě*MissProstitute or lady involved in sex trade小姐 is used to refer to a lady or waitress in restaurant in Singaporean Mandarin. However, in Putonghua, 小姐 has negative connotation in the northern provinces, used mainly to refer to prostitutes. 女士 or 服务员 tends to be more commonly used in Putonghua, instead of 小姐. In Taiwan it is used the same way as in Singapore.对付*duì fù*fight against/counteracttake action to deal with a person or problem对付 is used to refer in negative connotation in Singaporean Mandarin to mean fight or counteract e.g. against a criminal or terrorist. But in Putonghua, it can have positive connotation to mean take action dealing with a person or problem.懂*dǒng*knowunderstand懂 is commonly used in Singaporean Mandarin to mean \"know\" instead of 知道 (Putonghua). 懂 means 'understand' in Putonghua.计算机*jì suàn jī*calculatorcomputer计算机 in Putonghua means 'computer', and 计算器 is used instead to refer to 'calculator'. In recent years, 电脑 for computer has become more popular in Putonghua. ### Loanwords and influence from other Sinitic languages There is quite a number of specific words used in Singaporean Mandarin that originate from other Chinese varieties such as Hokkien, Teochew, Cantonese etc. These languages have also influenced the pronunciation in Singaporean Mandarin. Chinese CharactersPinyinDefinitionNotes阿兵哥*ā bīng gē*soldiersoriginates from Hokkien \"a-peng-ko\"怕输*pà shū*afraid to loseoriginates from Hokkien \"[kiaⁿ-su](/wiki/Kiasu)\" (惊输)几时*jǐ shí*when?originates from Hokkien \"kuí-sî\" or Classical Chinese阿公*ā gōng*grandpaoriginates from Hokkien \"a-kong\"阿妈*ā mā*grandmaoriginates from Hokkien \"a-má\" (阿嬤).阿婆*ā pó*old ladyoriginates from Hokkien \"a-pô\"很显*hěn xiǎn*very boringspoken colloquially in Singaporean Mandarin instead of 无聊/闷 (in Standard Mandarin). The word \"显\" originates from Hokkien 'hián-sèng' (显圣).敢敢*gǎn gǎn*be brave/daringspoken colloquially in Singaporean Mandarin instead of 勇敢 (in Standard Mandarin). For instance, 敢敢做介开心人 (dared to be a happy person – also the title for a [Mediacorp Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)) sitcom). The word \"敢敢\" originates from Hokkien \"káⁿ-káⁿ\" (daring)古早*gǔ zǎo*ancientoriginates from Hokkien \"kó͘-chá\". Appears in some Singaporean Chinese writing (e.g. Hawker Centre) instead of 古時候 (in Standard Mandarin).做工*zuò gōng*workoriginates from Hokkien \"cho-kang\", which means 'work'. 做工 is often spoken colloquially in Singaporean Mandarin instead of 工作/上班 (in Standard Mandarin). In Standard Mandarin, 做工 usually means doing work that involves manual hard labour.烧*shāo*hotoriginates from Hokkien \"sio\", which means 'hot'. 烧 is often spoken colloquially in Singaporean Mandarin instead of 热/烫 (in Standard Mandarin).什么来的*shén me lái de*What is this?originates from Hokkien \"siáⁿ-mi̍h lâi ê\" (啥物來的). 什么来的 is often spoken colloquially in Singaporean Mandarin instead of the more formal 这是什么 (in Standard Mandarin)起价*qǐ jià*price increaseoriginates from Hokkien \"khí-kè\". 起价 is often spoken colloquially in Singaporean Mandarin instead of the more formal 涨价 (in Standard Mandarin)做莫*zuò mò*Why? / Doing what?originates from Cantonese 做咩 *zou me*. 做莫 (or 做么) is often spoken colloquially in Singaporean Mandarin instead of the more formal 为什么/做什么 (in Standard Mandarin)哇佬*wà láo*man!Corruption of a vulgar Hokkien word是乜*shì miē*is it?The word 乜 mēh, more often rendered as 咩 (see above), originates from Cantonese and is used in colloquial Singaporean Mandarin. Compare Standard Mandarin 是吗 *shì ma*.大耳窿dà ěr lóng[loan shark](/wiki/Loan_shark)originates from Cantonese. (compare Guoyu: 地下錢莊)搭客*dā kè*passengeroriginates from Cantonese. (compare Putonghua: 乘客)摆乌龙*bǎi wū lóng*misunderstanding/make mistakes/confusionoriginates from Cantonese.好脸*hào liàn*boastful, likes to show offoriginates from Teochew \"ho lien\" (好脸). Other than \"likes to show off\", the term can also describes someone who has a strong pride, i.e. cares about not losing face. (compare Putonghua: 爱出风头, Guoyu: 愛現)粿条*guǒ tiáo*a type of flat noodleoriginates from Teochew \"kuey tiao\" (粿条). Compare Cantonese \"hor fan\" (河粉) ### Loanwords and English influences There is quite a number of specific words used in Singaporean Mandarin that originate or are transliterated from English. These words appear in written Singaporean Mandarin. Chinese CharactersPinyinDefinitionNotes摩多西卡*móduōxīkǎ*motorcycleBoth 电单车 and 摩托车 are now more frequently used in Singaporean Mandarin巴仙*bāxiān*percentage百分比 is standard ## Grammar This section **possibly contains original research**. Please improve it by verifying the claims made and adding inline citations. Statements consisting only of original research should be removed. *(August 2024)* *(Learn how and when to remove this message)* In terms of standard written Mandarin in Singapore, the Singaporean Mandarin grammar is almost similar to that of Putonghua. However, the grammar of **colloquial Singaporean Mandarin** can differ from that of Putonghua as a result of influence from other [varieties of Chinese](/wiki/Varieties_of_Chinese), [classical Chinese](/wiki/Classical_Chinese) and [English](/wiki/English_language). Some of the local Singaporean Mandarin writings do exhibit certain local Singaporean features. ### Time When speaking of minutes, colloquial Singaporean Mandarin typically uses the word 字 (*zì*), which represents a unit of 5 minutes. When referring to a number of hours (duration), 钟头 (*zhōngtóu*) is used instead of 小时 (*xiǎoshí*). For instance: 5 minutes: 一个字 (yī gè zì)10 minutes: 两个字 (liǎng gè zì)15 minutes: 三个字 (sān gè zì)45 minutes: 九个字 (jiǔ gè zì)1 hour: 一个钟头 (yī gè zhōng tóu) The use of *zì* (字) originates from Hokkien (*jī* or *lī*), Cantonese or Classical Chinese. Its origin came from the ancient Chinese units of measuring time. In ancient Chinese time measurement, hours were measured in terms of *shíchén* (时辰), equivalent to 2 hours while minutes were measured in terms of *kè* (刻), equivalent to 15 minutes. Each *kè* was in turn divided into 3 *zì* (equivalent to 5 minutes). For instance, 7:45 pm is: 七(qī) 点(diǎn) 九(jiǔ)七(qī) 点(diǎn) 四十(sìshí) 五(wǔ) 分(fēn)。 (Standard Mandarin) ### Days of the week As a result of Hokkien influence, colloquial Singaporean Mandarin typically uses the word \"拜-\" (*bài*) to refer to the days of the week, in lieu of Standard Mandarin \"星期-\" (*xīngqí-*). For instance: Monday: 拜一 (*bàiyī*) instead of 星期一 (*xīngqíyī*)Sunday: 礼拜天 (*lǐbàitiān*) or simply 礼拜 (*lǐbài*) instead of 星期日 (*xīngqírì*)A week: 一个礼拜 (*yī gè lǐbài*) instead of the more formal 一个星期 (*yī gè xīngqí*) Both 拜 (*bài*) and 礼拜 (*lǐbài*) originate from Hokkien *pài* and *lé-pài* respectively. ### Large numbers In colloquial Singaporean Mandarin, 万 (*wàn*), referring to a \"ten thousand\" is often used, but 十千 (*shí qiān*), referring to \"ten thousands\" is occasionally used too. This usage was influenced by English numbering system and also [Chinese Indonesian](/wiki/Chinese_Indonesian) who frequently uses large [Indonesian currency](/wiki/Indonesian_currency), Rp10000 (0.71 USD) and above. ### Use of the word \"先\" The word \"先\" (*xiān*) is often used at the end of a sentence in colloquial Singaporean Mandarin (instead of after a subject, as in Standard Mandarin), as a result of influence from Cantonese grammar. For example, take the sentence \"You walk first\": 你(nǐ) 走(zǒu) **先**(**xiān**)。 (Singaporean Mandarin)你(nǐ) **先**(**xiān**) 走(zǒu)。 (Standard Mandarin)你(nei) 走(jau) **先**(**sin**)。 (Cantonese)(Note that the reverse, 你先走 is ungrammatical in spoken Cantonese.) ### The use of the word \"而已\" 而已 (*éryǐ*) is more common in colloquial Singaporean Mandarin than in Standard Mandarin, which uses 罢了 (*bàle*). While 而已 (*éryǐ*) is also used in colloquial Mandarin within Mainland China, but perhaps to a lesser extent as compared to Singapore or Taiwan. For example: Translation: *only like this / only this kind!* 这(zhè) 样子(yàngzi) **而已**(**éryǐ**) 啊(a)！ (Singaporean Mandarin)这(zhè) 样子(yàngzi) **罢了**(**bàle**)！ (Standard Mandarin)這(zhè) 樣子(yàngzi) **算了**(**suànle**) 吧(ba)！ (Taiwanese Mandarin) ### \"大只\" and \"小只\" When people describe the size of animals, for example, chicken, these are used to mean 'large' and 'small'. Putonghua tends to use 肥 and 瘦 instead. These two words are also used to refer to the body frame of a person. \"大只\" refers to people who appear to be tall, masculine or with a large body build. \"小只\" is used to describe people with a small built, tiny frame. ### Use of the word \"啊\" as an affirmative In colloquial Singaporean Mandarin, the word \"啊\" is often used in response to a sentence as an affirmative. It is often pronounced as /ã/ (with a nasal tone) instead of 'ah' or 'a' (in Putonghua). Putonghua tends to use \"是(的)/对啊/对呀\" (*shì (de)/duì a/duì ya*), \"哦\" (*ó*), \"噢\" (*ō*), \"嗯\" (en/ng) to mean \"yes, it is\". ### Use of the word \"才\" instead of \"再\" In Singaporean Mandarin, there is a greater tendency to use the word *cái* \"才\" (then) in lieu of Standard Mandarin zài \"再\" (then), which indicates a future action after the completion of a prior action. For instance: \"关税申报单刚巧用完了，打算在飞机上领了**才**填写。\"*The tax declaration forms have all been used up, I'll have to get a form on the plane then and fill it out.*\"现在不要说，等他吃饱了**才**说。\"*Don't say anything now; say it only after he has finished his meal.* ### The use of the word \"有\" In Singaporean Mandarin, one typical way of turning certain nouns into adjectives, such as 兴趣 (*xìngqù*, 'interest'), 营养 (*yíngyǎng*, 'nutrition'), 礼貌 (*lǐmào*, 'politeness'), is to prefix the word \"有\" (*yǒu*) at the front of these nouns. For example: \"很**有**兴趣\" (hěn **yǒu** xìngqù – *very interested*)\"很**有**营养\" (hěn **yǒu** yíngyǎng – *very nutritious*)\"很**有**礼貌\" (hěn **yǒu** lǐmào – *very polite*). 有 is sometimes omitted in writing. ### Reduplication of verbs preceding \"一下\" In Singaporean Mandarin, verbs preceding \"一下\" may be [reduplicated](/wiki/Reduplication), unlike in Putonghua. This practice is borrowed from the [Malay](/wiki/Malay_language) and [Indonesian](/wiki/Indonesian_language) method of [pluralizing words](/wiki/Malay_grammar#Reduplication). In Putonghua grammar, the use of the word \"一下(儿)\" (*yīxià(r)*) is often put at the back of a verb to indicate that the action (as indicated by the verb) is momentary. For example: **想**(xiǎng) **想**(xiǎng) 一下(yīxià) 。(Singaporean Mandarin)**想**(xiǎng) 一下(yīxià) 。(Standard Mandarin)Think for a while.**研究**(yánjiū) **研究**(yánjiū) 一下(yīxià) 。 (Singaporean Mandarin)**研究**(yánjiū) 一下(yīxià) 。(Standard Mandarin)Research for a while. ### Colloquial use of the word \"被\" Singaporean Colloquial Mandarin tends to use 被 (*bèi*) more often than Putonghua, due to influence from English and/or [Malay](/wiki/Malay_grammar#Verbs). It is used to express a passive verb. Compare the following: \"The road has been repaired\"马路(mǎlù) **被**(bei) 修好(xiūhǎo) 了(le) (Singaporean Mandarin)马路(mǎlù) **已**(yǐ) 修好(xiūhǎo) 了(le) (Putonghua) ### Using adjectives as verbs Sometimes, colloquial Singaporean Mandarin might use intransitive verbs as transitive. For instance, 进步 (improve) is an intransitive verb. But as influenced by the use of English, \"I want to improve my Chinese\" is sometimes said in Singaporean Mandarin as \"我要**进步**我的华语\". In Standard Mandarin, this is \"我要让我的华语**进步**\". ## Phonology and tones The [phonology](/wiki/Phonology) and [tones](/wiki/Tone_(linguistics)) of Singaporean Mandarin are generally similar to that of [Standard Mandarin](/wiki/Standard_Mandarin). There are 4 tones similar to those in [Standard Mandarin](/wiki/Standard_Mandarin), but [Erhua](/wiki/Erhua) (儿化, *-er* finals) and the neutral tone (轻声, lit. 'light tone') are generally absent in Singaporean Mandarin. The earliest development of Singaporean Mandarin includes the **old Beijing phonology** (老国音), followed by **new Beijing phonology** (新国音) and then finally [Hanyu Pinyin](/wiki/Hanyu_Pinyin) of [mainland China](/wiki/Mainland_China). In its initial development, Singaporean Mandarin was highly influenced by the *[ru sheng](/wiki/Ru_sheng)* (入声, checked tone or 5th tone) from other Chinese varieties. As such, the 5th tone did appear in earlier Singaporean Mandarin. The characteristics of the 5th tone are as follows: - It is a falling tone. The common tone letter is 51, but sometimes it is 53. - The tone does not last long. It feels more like an 'interrupted stop'. - The syllable which carries the tone had a [glottal stop](/wiki/Glottal_stop); sometimes the final sounds to be clear, but sometimes, it does not sound very clear. This [glottal stop](/wiki/Glottal_stop) not only interrupts the lasting period of the tone, but also makes the start of [consonant](/wiki/Consonant) stronger, thus nearing itself more to a [voiced consonant](/wiki/Voiced_consonant). However, due to years of influence from China's varieties of Mandarin, prevalence of the 5th tone in Singaporean Mandarin is declining. Minor differences occur between the phonology (tones) of Standard Singaporean Mandarin and other forms of Standard Mandarin. Chinese characterDefinitionSingaporeMainland ChinaTaiwanNotes休**息**Take a restxiū**xí**xiū**xi**xiū**xí**The character 息 is pronounced with the 2nd tone in Standard Singaporean Mandarin, same as that in Taiwan. In mainland China, 息 is pronounced with a neutral tone instead.**垃圾**Rubbish**lèsè**/**lājī****lājī****lèsè**The pronunciation for 垃圾, which was influenced by Wu Chinese, is the same in Singapore and Taiwan where the pronunciation from before 1949 is maintained. However, due to influence from mainland China, the pronunciation is inclining itself towards Standard Chinese.**角**色Role**jiǎo**sè**jué**sè**jiǎo**sè/**jué**sèThe pronunciation for 角色 is the same in Singapore and Taiwan where the pronunciation *jiǎosè* from before 1949 has been maintained. However, both *juésè* and *jiǎosè* can be used interchangeably in the Chinese-speaking world.包**括**Includebāo**kuò**bāo**kuò**bāo**guā**/bāokuòThe pronunciation for 包括 is the same in Singapore and mainland China.**血液**Blood**xuěyì****xuèyè/xuěyè****xiěyì/xiěyè**Singapore and Taiwan uses the literary pronunciation of both characters *xuěyì* from before 1949. ## Influences from other languages in Singapore This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(August 2024)* *(Learn how and when to remove this message)* Just like any languages in Singapore, Singaporean Mandarin is subjected to influences from other languages spoken in Singapore. [Singaporean Hokkien](/wiki/Singaporean_Hokkien) is the largest non-Mandarin Chinese variety spoken in Singapore. The natural tendency of Hokkien-speakers to use the Hokkien way to speak Mandarin has influenced to a large degree the colloquial Mandarin spoken in Singapore. The [colloquial Hokkien-style Singaporean Mandarin](/wiki/Hokkien_influence_on_Singaporean_Mandarin) is commonly heard in Singapore, and can differ from Putonghua in terms of vocabulary, phonology and grammar. Besides [Singaporean Hokkien](/wiki/Singaporean_Hokkien), Mandarin is also subjected to influence coming from other Chinese varieties such as [Teochew](/wiki/Teochew_dialect), [Cantonese](/wiki/Cantonese), [Hakka](/wiki/Hakka), and [Hainanese](/wiki/Hainanese), as well as [English](/wiki/English_language) and [Malay](/wiki/Malay_language). ## Writing system This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(August 2024)* *(Learn how and when to remove this message)* In Singapore, [simplified Chinese characters](/wiki/Simplified_Chinese_characters) are the official standard used in all official publications as well as the government-controlled press. While [simplified Chinese characters](/wiki/Simplified_Chinese_characters) are taught exclusively in schools, the government does not officially discourage the use of Traditional characters. Therefore, many shop signs continue to use Traditional characters. As there is no restriction on the use of [traditional characters](/wiki/Traditional_Chinese_characters) in the mass media, television programmes, books, magazines and music CDs that have been imported from Hong Kong or Taiwan are widely available, and these almost always use Traditional characters. Most karaoke discs, being imported from Hong Kong or Taiwan, have song lyrics in Traditional characters as well. While all official publications are in simplified characters, the government still allows parents to choose whether to have their child's Chinese name registered in Simplified or Traditional characters though most choose the former. Singapore had undergone three successive rounds of character simplification, eventually arriving at the same set of Simplified characters as the [People's Republic of China](/wiki/China). Before 1969, Singapore generally used Traditional characters. From 1969 to 1976, the Ministry of education launched its own version of Simplified characters, which differed from that of mainland China. But after 1976, Singapore fully adopted the Simplified characters of mainland China. ## Chinese writing style and literature This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(August 2024)* *(Learn how and when to remove this message)*This section **possibly contains original research**. Please improve it by verifying the claims made and adding inline citations. Statements consisting only of original research should be removed. *(August 2024)* *(Learn how and when to remove this message)* ### Chinese writing style Before the [May Fourth Movement](/wiki/May_Fourth_Movement) in 1919, Singapore Chinese writings were based on [Classical Chinese](/wiki/Classical_Chinese). After the May Fourth Movement, under the influence from the [New Culture Movement](/wiki/New_Culture_Movement) in China, the Chinese schools in Singapore began to follow the new education reform as advocated by China's reformist and changed the writing style to [Vernacular Chinese](/wiki/Written_vernacular_Chinese). Singapore's Chinese newspaper had witnessed this change from Vernacular Chinese. *[Lat Pau](/wiki/Lat_Pau)*, one of the earliest Chinese newspaper, was still using Classical Chinese in 1890. By 1917, it continued to use Classical Chinese. But by 1925, it had changed to Vernacular Chinese. After this, all Chinese newspaper in Singapore used Vernacular Chinese. ### Singaporean Chinese Literature The development of the Singaporean Chinese literature reflected the history of immigrants in Singapore. When many Chinese writers from Southern China arrived in Singapore, they established Chinese schools, newspaper press etc. They contributed a lot to the development of Chinese literature in Singapore. In 1919, the *New National Magazine* (新國民雜誌) marked the birth of Singaporean Chinese literature. In those days, the migrant's mindset was still deeply entrenched. Many of the literary works were influenced by New Culture Movement. Most of the literary works that were published originated from the works of writers in China. In 1925, the presence of literary supplements such as *Southern Wind* (南風), *Light of Singapore* (星光) brought a new dimension to Singaporean Chinese literature. They differed from past magazine that relied on writers from China. It was at this time, that the thoughts of [Nanyang](/wiki/Nanyang_(region)) began to surface the corner. In January 1927, the *Deserted Island* (荒島) published in the *New National Press* (新國民日報) clearly reflected the features of Nanyang in its literary work. The \"localization\" literary works mostly described the lifestyle in Nanyang, the people and their feelings in Nayang. The quality of Singaporean Chinese literature had greatly improved. In 1937, the outbreak of [Second Sino-Japanese War](/wiki/Second_Sino-Japanese_War) raised the anti-Japanese sentiment. The literature during these times reflected the missions of national salvation against the Japanese. This brought a halt to the localization movement and in turn re-enacted a sense of Chinese nationalism amongst the migrants in Singapore. From 1941 till 1945, during the Japanese occupation of Singapore, the activities for Chinese literature was halted. After the war, people in Singapore began to have a sense of belonging to this piece of land, and they also had a desire for freedom and democracy. During this times, Singaporean Chinese literature was inclined towards Anti-colonialism. With new arts and thoughts, between 1947 – 1948, there was a debate between \"Unique Singaporean Literary Art\" and \"literary thoughts of migrants\". The results from these debated led to a conclusion that the Singaporean Chinese literature was going to develop on its own independently. The \"localization\" clearly marked the mature development of Singaporean Chinese literature. During the 1950s, writers from Singapore drew their literary works mostly from the local lifestyle and events that reflected the lifestyle from all areas of the society. They also included many non-Mandarin Chinese proverbs in their works. They created unique works of literature. Writers including Miao Xiu (苗秀), Yao Zhi (姚紫), [Zhao Rong](/wiki/Zhao_Rong) (趙戎), Shu Shu (絮絮) etc. represented the writers of \"localization\" works. From 1960 to 1970, the number of literary works published began to increase. Locally-born and locally bred Singaporean writers became the new writers in the stage of Singaporean Chinese literature. Their works were mainly based on the views of Singaporeans towards issues or context happening in Singapore. They continued the \"localization\" movement and brought the Singaporean Chinese literature to a new dimension. ## Arts and entertainment ### Music A [Mandopop](/wiki/Mandopop) scene began to emerge in Singapore in the 1960s, while the Speak Mandarin Campaign intensified the presence of Mandopop on local radio and television. The 1980s saw the development of *[xinyao](/wiki/Xinyao)*—a genre of contemporary Mandarin ballads with themes such as romance and life in Singapore, and popularized by singer-songwriters such as [Liang Wern Fook](/wiki/Liang_Wern_Fook). ### Opera ### Films ## Sociolinguistics ### Politics Language plays an important role in Singapore politics. Up to today, it is still important for politicians in Singapore to be able to speak their mother tongue (and even other varieties) fluently in order to reach out to the multilingual community in Singapore. According to observation, an election candidate who is able to speak fluent Mandarin has a higher chance of winning an election. As such, most election candidates will try to use Mandarin in campaign speeches in order to attract Mandarin-speaking voters. ### Singaporean Mandarin Standard Some Chinese elites in Singapore had criticized that the Mandarin standard of Chinese Singaporean has dropped greatly due to the closure or subsequent conversion of Chinese-medium schools to English-medium schools in the 1980s. Others attributed the drop in standard to the lack of learning Chinese literature in schools. Ever since 1965 when Singapore became independent, bilingual policy has become the pillar of Singapore's education. The first language of Singapore was English, while Mandarin was chosen as the \"mother tongue\" of Chinese Singaporean. Generally, most Chinese Singaporean can speak Mandarin fluently, but are usually weaker in writing Chinese. ### Influence of Mainland China's economic rise on Singapore In recent years, with the subsequent economic rise of mainland China and a transition from a world factory to a world market, Mandarin has become the 2nd most influential language after English. Besides transmitting Chinese culture values, many people began to realize the economic values of Mandarin, which has raised the interests of local and working professionals in learning Mandarin. ### Language policy and culture Under the bilingual policy of Singapore, Chinese Singaporeans had a greater chance to speak and use English especially in school and at work. But this can cause a relative limitation in the use of mother tongue. Generally speaking, most Chinese Singaporeans are able to speak Mandarin, and also read newspapers in it, but only a minority is able to use it at a professional level such as academic research, literary writing etc. In the endeavor to use English, some Chinese Singaporeans even distanced themselves from the mother tongue culture, resulting in the erosion of Chinese culture in Singapore. ## Media Since the establishment of the Speak Mandarin Campaign in 1979, all Chinese-language programming broadcast by Singapore state media outlets, particularly the [Singapore Broadcasting Corporation](/wiki/Mediacorp) (SBC) and its successors, have been in Mandarin. Its current incarnation Mediacorp runs two Mandarin-language television channels, [Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)) and [Channel U](/wiki/Channel_U_(Singaporean_TV_channel)), as well as the radio stations [Yes 933](/wiki/YES_933) (contemporary pop), [Capital 958](/wiki/Capital_958) (classic hits), and [Love 972](/wiki/Love_972) ([adult contemporary](/wiki/Adult_contemporary_music)). [SPH Media](/wiki/SPH_Media) and [So Drama! Entertainment](/wiki/So_Drama!_Entertainment) also run Mandarin radio stations, while SPH owns the country's only Mandarin-language daily newspaper, the *[Lianhe Zaobao](/wiki/Lianhe_Zaobao)*. - [Singapore Chinese characters](/wiki/Singapore_Chinese_characters) - [Speak Mandarin Campaign](/wiki/Speak_Mandarin_Campaign) - [Chinese Singaporean](/wiki/Chinese_Singaporean) - [Languages of Singapore](/wiki/Languages_of_Singapore) - [Malaysian Mandarin](/wiki/Malaysian_Mandarin) - [Comparison of national standards of Chinese](/wiki/Comparison_of_national_standards_of_Chinese) - [Standard Mandarin](/wiki/Standard_Mandarin) ### Notes ### Chinese books - 周清海编著， 《新加坡华语词汇与语法》，新加坡玲子传媒私人有限公司出版，, September 2002, [ISBN](/wiki/ISBN_(identifier)) 981412723X， [ISBN](/wiki/ISBN_(identifier)) 978-981-4127-23-3 (Zhou, Qinghai (2002), *Vocabulary and Grammar of Singaporean Mandarin*, Lingzi Media) - 周清海（著），《变动中的语言》，新加坡玲子传媒私人有限公司出版, 2009, [ISBN](/wiki/ISBN_(identifier)) 9814243922、[ISBN](/wiki/ISBN_(identifier)) 9789814243926 (Zhou, Qinghai (2009), *The changing languages*, Lingzi Media) ### Bibliography in Chinese\n",
  "language": "en",
  "processed_at": "2026-01-12T12:00:37.657225",
  "title": "Singaporean Mandarin",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singaporean_Mandarin"
}