{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:40.101570"
  },
  "content": "Private university in Singapore The **Singapore Institute of Management** (**SIM**) is a private tertiary education institution in [Singapore](/wiki/Singapore). Founded on 28 November 1964 by the [Economic Development Board](/wiki/Economic_Development_Board) (EDB), SIM is registered under the [Committee for Private Education](/wiki/Committee_for_Private_Education) (CPE). SIM offers diploma, transnational undergraduate and postgraduate programmes, and [executive education](/wiki/Executive_education) courses. ‹ The template *Infobox university* is being considered for merging. › 1°19′33″N 103°47′59″E﻿ / ﻿1.32583°N 103.79972°E﻿ / 1.32583; 103.79972 The SIM Group provides its core services through two educational brands: SIM Global Education and SIM Academy. From 2005 to 2017, SIM Group established and managed [SIM University](/wiki/SIM_University) (UniSIM). ## SIM Global Education ‹ The template *Infobox university* is being considered for merging. › SIM Global Education (SIM GE) is a private education institute. It offers diploma, bachelor's degree and master's degree with universities from Australia, Europe, the United Kingdom and the United States. The institution has 16,000 students with about 30% being full-time international students from over 40 countries. The institute offers both full-time and part-time programmes. In 2018, SIM opened its first overseas representative office in Indonesia, Jakarta to cultivate awareness of its offered programmes under the SIM GE brand in Indonesia. ### Industry partnership In 2018, SIM GE and SGTech signed a Memorandum of Understanding (MOU). The MOU offers internship and job opportunities from among SGTech's member companies in the technology sector. SGTech will also engage industry professionals to mentor SIM GE students. ### Graduate employment SIM reported that 82.4 per cent of its 2019 and 2020 graduates found jobs within six months after graduation. Among the total, 57.1 per cent were in full-time jobs, 15.6 per cent were in part-time jobs, and 9.8 per cent were freelancers. The median starting gross monthly salary of those in full-time employment was $2,815. ## SIM International Academy SIM previously operated SIM International Academy for Secondary 1 to 4 classes, leading to an International General Certificate of Secondary Education (IGCSE). The Academy stopped accepting applications the following year and is no longer listed as a SIM constituent. ## SIM University (2005–2017) [SIM University](/wiki/SIM_University) (UniSIM) was a publicly funded, private university in Singapore approved by the Ministry of Education. Its enrolment was close to 10,000 students. In 2017, UniSIM was restructured into the [Singapore University of Social Sciences](/wiki/Singapore_University_of_Social_Sciences) (SUSS) and became Singapore's sixth autonomous university under the ambit of the Ministry of Education (MOE). It is no longer a member of the Singapore Institute of Management Group (SIM). ## Campus The Singapore Institute of Management has two campuses across the west side of Singapore. The two campuses cover a total land area of 120,000 sqm. - SIM Website - SIM Global Education website - SIM Academy\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:40.101229",
  "title": "Singapore Institute of Management",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Institute_of_Management"
}