{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:00:42.242014"
  },
  "content": "Culinary traditions of Singapore **Singaporean cuisine** is derived from several [ethnic groups](/wiki/Ethnic_groups_in_Singapore) in [Singapore](/wiki/Singapore) and has developed through centuries of political, economic, and social changes in the cosmopolitan [city-state](/wiki/City-state). Influences include the [cuisines](/wiki/Cuisine) of the [Malays](/wiki/Malay_cuisine)/[Indonesians](/wiki/Indonesian_cuisine), [Chinese](/wiki/Chinese_cuisine) and the [Indians](/wiki/Indian_Singaporean_cuisine) as well as, [Peranakan](/wiki/Peranakan_cuisine) and [Western](/wiki/European_cuisine) traditions (particularly [English](/wiki/English_cuisine) and [Portuguese](/wiki/Portuguese_cuisine)-influenced [Eurasian](/wiki/Fusion_cuisine), known as [Kristang](/wiki/Kristang_people)). The cuisine has a medium spiciness range, mostly due to historical immigrant influence from [South Asia](/wiki/South_Asia) and the [Malay Archipelago](/wiki/Malay_Archipelago). More modern influences from neighbouring regions such as [Japan](/wiki/Japanese_cuisine), [Korea](/wiki/Korean_cuisine) and [Thailand](/wiki/Thai_cuisine) are also present.[*citation needed*] In Singapore, food is viewed as crucial to its national identity and a unifying cultural thread. [Singaporean literature](/wiki/Singaporean_literature) declares eating a national pastime and food a national obsession. Food is a frequent topic of conversation among Singaporeans. Religious dietary strictures do exist; [Muslims](/wiki/Muslims) do not eat pork and [Hindus](/wiki/Hindus) do not eat beef, and there is also a significant group of [vegetarians](/wiki/Vegetarianism)/[vegans](/wiki/Vegans). People from different communities often eat together, while being mindful of each other's culture and choosing food that is acceptable for all. In addition to venues serving traditional Singaporean food, restaurants serving cuisine from a diverse range of countries worldwide are also common in Singapore. ## History Ever since Singapore was established as a British port in 1819, Singaporean cuisine has been influenced by different cultures due to its position as an international shipping port. It is geographically located in between the [Pacific](/wiki/Pacific_Ocean) and [Indian oceans](/wiki/Indian_Ocean) and it has the shape of a peninsula and an island at the same time, where various cultures and trades used to and continue to occur. Singapore's geographical position is surrounded by various Asian countries, hence there is much diversity in food and culture. Indonesia is located to the south, while Thailand, China, the Philippines and Malaysia are located to the north, and India is located to the west. The culture of Singapore is made up of diverse influences from different continents and countries. Hence, the Singapore cuisine can be said to be culturally enriched. Singaporean cuisine has also been influenced by its colonial history, as it established as a [British](/wiki/British_Empire) [colony](/wiki/Straits_Settlements) from the early 19th century until the mid-20th century when it became part of Malaysia before becoming independent; Singapore was also occupied by [Imperial Japan](/wiki/Empire_of_Japan) during the [Second World War](/wiki/World_War_II). It is believed that certain dishes that are part of Singaporean cuisine today predates the [arrival of Raffles](/wiki/Founding_years_of_modern_Singapore) in 1819; some of these dishes include [laksa](/wiki/Laksa), [biryani](/wiki/Biryani) and [betel quid](/wiki/Betel). However, it is unknown when these dishes arrived in Singapore, as historical records on them are largely scattered and inaccurate as these dishes were largely made by early Singapore immigrants at home and not served in an establishment. Adaptation of various dishes that were prepared by early Singapore immigrants to suit the ingredients and taste preferences were how some of the dishes were created; some examples of such dishes are [fish head curry](/wiki/Fish_head_curry), [kaya toast](/wiki/Kaya_toast) and [Hainanese chicken rice](/wiki/Hainanese_chicken_rice), which are culinary staples in Singaporean cuisine today. ### Hawker centres A large part of Singaporean cuisine revolves around [hawker centres](/wiki/Hawker_centres), where hawker stalls were first set up around the mid-19th century, and were largely street food stalls selling a large variety of foods These street vendors usually set up stalls by the side of the streets with pushcarts or bicycles and served cheap and fast foods to [coolies](/wiki/Coolie), office workers and those that did not cook at home. Although the street vendors provided early Singapore immigrants with cheap and fast meals, these stalls were unhygienic, due to the lack of supporting infrastructure such as waste disposal and a steady supply of fresh water, and limited sanitation practices. Starting in the 1960s, the Singapore government began enforcing more rules and regulations for street hawkers, and relocated these vendors to more permanent locations with the construction of wet markets and hawker centres across the country. Today, when dining out, Singaporeans often eat at hawker centres, [coffee shops](/wiki/Kopi_tiam) or [food courts](/wiki/Food_court) rather than restaurants, due to convenience, a wider range of options and affordability. Hawker centres are widespread and offer affordable food. They usually feature dozens of stalls in a single complex, with each stall offering its own speciality dishes. Well-known hawker centres among tourists include Telok Ayer Market, Maxwell Food Center, Lau Pa Sat and Newton Food Centre. Coffee shops are non-air-conditioned versions of food courts and are commonly found island-wide, usually at the bottom of blocks of [HDB](/wiki/Housing_and_Development_Board) [flats](/wiki/Apartment). Hawker centres, or open-air food courts, have come to define Singaporean food culture. Popular markets like Old Airport Road Food Centre in [Geylang](/wiki/Geylang), Golden Mile Food Centre on Beach Road and [Maxwell Food Centre](/wiki/Maxwell_Food_Centre) in [Chinatown](/wiki/Chinatown,_Singapore) offer the best of Chinese, Malay and Indian cooking, melded into foods that are uniquely Singaporean. Some well-known Singaporean hawker or *kopitiam* dishes includes kaya toast, [chilli crab](/wiki/Chilli_crab), fish head curry, laksa, [roti prata](/wiki/Roti_prata) and Hainanese chicken rice, which is widely considered to be one of Singapore's national dishes. In 2016, [Hong Kong Soya Sauce Chicken Rice and Noodle](/wiki/Hong_Kong_Soya_Sauce_Chicken_Rice_and_Noodle) and [Hill Street Tai Hwa Pork Noodle](/wiki/Hill_Street_Tai_Hwa_Pork_Noodle) became the first two street food locations in the world to be awarded a [Michelin star](/wiki/Michelin_star). The former also gained the title of the world's \"cheapest Michelin-starred meal\". In 2018, Singapore hawker culture was nominated by Singapore's National Heritage Board (NHB), National Environment Agency and Federation of Merchants' Associations Singapore for inscription into [UNESCO](/wiki/UNESCO)'s [Representative list of the Intangible Cultural Heritage of Humanity](/wiki/UNESCO_Intangible_Cultural_Heritage_Lists#Representative_list_of_the_Intangible_Cultural_Heritage_of_Humanity). The nomination was submitted in March 2019 and approved and inscribed on 16 December 2020. UNESCO described the hawker centre as \"‘community dining rooms’ where people from diverse backgrounds gather and share the experience of dining over breakfast, lunch and dinner.\" ## Food culture A common greeting for many Singaporean comes in the form of the question \"Have you eaten?\", and its equivalent in various Chinese languages. It is one way of expressing a greeting to another person. It is also possible to assume that this is how Singaporeans think about meals and food. Since Singapore is a multicultural nation, there is a diverse range of people who might have different and restricted diets, such as [Muslims](/wiki/Muslims) and Hindus. Since Singapore is influenced by many different regions, religions, and cultures, there are also many events or anniversaries. During the [Lunar New Year](/wiki/Lunar_New_Year), people eat [nian gao](/wiki/Nian_gao), which is originally from China, and is traditionally eaten around the Chinese New Year. It is an extension of Malay cuisine but influenced by the Chinese and Indians – not to mention the [Arabs](/wiki/Arabs), British and other immigrants who have contributed to making Singapore one of the world's most important trading ports. ## Singapore food internationally Singaporean food is a significant cultural attraction for tourists and visitors. Some Singaporean dishes have become internationally known. In 2011, four Singaporean dishes were included in the list of 'World's 50 Most Delicious Foods (Readers' Pick)' – a worldwide online poll by 35,000 people held by [CNN International](/wiki/CNN_International). They are [Hainanese chicken rice](/wiki/Hainanese_chicken_rice) (13th), [chili crab](/wiki/Chili_crab) (29th), [Katong laksa](/wiki/Katong_laksa) (44th) and [roti prata](/wiki/Roti_prata) (45th). [Anthony Bourdain](/wiki/Anthony_Bourdain) brought international attention to local food available in hawker centres on his show, *No Reservations*. He featured Tian Tian Chicken Rice and [Maxwell Food Centre](/wiki/Maxwell_Food_Centre) on the programme. Bourdain also publicly spoke about hoping to feature four Singaporean dishes in his upcoming food hall in New York City. [Gordon Ramsay](/wiki/Gordon_Ramsay) participated in a '[Hawker Heroes Challenge](/wiki/SingTel_Hawker_Heroes_Challenge)' held in Singapore in 2013, in which each competitor made three dishes. Ramsay's chili crab was voted the best, but he lost on the other two dishes to Ryan Koh (representing 328 Katong Laksa) and Foo Kui Lian (representing Tian Tian Chicken Rice). Singaporean cuisine has been promoted as a tourist attraction by the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board). The [Singapore Food Festival](/wiki/Singapore_Food_Festival), held every year in July, is a celebration of Singapore's cuisine. The Overseas Singaporean Unit also organises [Singapore Day](/wiki/Singapore_Day) in major cities around the world as a platform for Singaporeans living abroad. One of Singapore Day's major draws is the local Singaporean hawker food, which is prepared on-site by well-known hawkers specially flown in for the event. ## Types of food This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(December 2020)* *(Learn how and when to remove this message)* Singaporean food can be divided into six types: meat, seafood, rice, noodles, dessert and snacks. Singapore is especially renowned for its seafood. [Chilli crab](/wiki/Chilli_crab) and [black pepper crab](/wiki/Black_pepper_crab) are two quintessential dishes that dominate the scene and are greatly recommended to tourists. Another favourite is [sambal stingray](/wiki/Sambal_stingray). In the meat category, Hainanese chicken rice is the most popular dish. Essentially, it is rice cooked with chicken fat, served with steamed chicken, accompanied with chilli sauce and cucumbers. Three noodle dishes stand out in Singapore cuisine. \"Hokkien prawn mee\" comprises fried egg noodles and rice noodles with prawns, sliced pork, fishcake and squid. It is stir-fried with a broth usually made from prawns. \"Nyonya laksa\" is composed of rice noodles served in a coconut prawn broth. \"[Char kway teow](/wiki/Char_kway_teow)\" is stir-fried rice noodles with prawns, Chinese sausage, bean sprout, lard and cockles. In the dessert category, tau-suan is one of many types of desserts commonly found in hawker centres around Singapore. Tāu-suàn (split mung bean soup), is a dessert of Teochew origin. It is a sweet and starchy soup made from split mung beans, usually eaten with *[youtiao](/wiki/Youtiao)*. In the snack category, [kaya toast](/wiki/Kaya_toast) is the representative dish, primarily due to the use of [kaya](/wiki/Coconut_jam). \"Kaya kopitiams\" are a common sight on the island. These affordable coffee shops dish out bread toasts, spread with coconut egg jam and butter, served with coffee and tea as well as two soft [boiled eggs](/wiki/Boiled_egg). ## Common dishes and snacks ### Chinese-inspired The dishes that comprise \"Singaporean Chinese cuisine\" today were originally brought to Singapore by the early southern Chinese immigrants ([Hokkien](/wiki/Fujian_cuisine), [Teochew](/wiki/Teochew_cuisine), [Cantonese](/wiki/Cantonese_cuisine), [Hakka](/wiki/Hakka_cuisine) and [Hainanese](/wiki/Hainan_cuisine)). They were then adapted to suit the local availability of ingredients, while absorbing influences from Malay, Indian and other cooking traditions. Most of the names of Chinese-originated Singaporean dishes were derived from languages and dialects of southern China, [Hokkien (Min Nan)](/wiki/Southern_Min) being the most common. As there was no common system for transliterating these Sinitic languages and dialects into the Latin alphabet, it is common to see different variants on the same name for a single dish. For example, *bah kut teh* may also be spelt *bak kut teh*, and *char kway tiao* may also be spelt *char kuay teow*. - [Bak kut teh](/wiki/Bak_kut_teh) (肉骨茶; *ròu gǔ chá*), pork rib soup made with a variety of Chinese herbs and spices. In Singapore the broth is usually Teochew style, meaning peppery and light in color, unlike the dark, herbal Hokkien style favoured in Malaysia. - [Beef kway teow](/wiki/Beef_kway_teow) (牛肉粿条; *niú ròu guǒ tiáo*), flat rice noodles stir-fried with beef, served dry or with soup. - [Bak chang](/wiki/Zongzi) (肉粽; *ròu zòng*), glutinous rice dumplings, usually filled with pork, mushrooms and stewed egg, steamed in bamboo leaves. Although it is Chinese in origin, it is also a favourite in [Peranakan cuisine](/wiki/Peranakan_cuisine). - [Bak chor mee](/wiki/Bak_Chor_Mee) (肉脞面; *ròu cuò miàn*; 'minced pork noodles'), egg noodles with minced pork, braised mushroom, pork meatball and other ingredients, served dry or in soup. Usually the flat, tape-like [mee pok](/wiki/Mee_pok) noodle is used. - [Ban mian](/wiki/Ban_mian) (板面; *bǎn miàn*), hand-made flat noodles served with vegetables, minced meat, sliced mushrooms, and an egg in an [anchovy](/wiki/Anchovy_(food))-based soup. Noodle variations are common. \"Ban mian\" refers to flat, long noodles; \"mee hoon kuay\" (米粉粿; *mí fěn guǒ*; 'rice vermicelli cake') refers to flat, rectangular noodles; \"you mian\" (幼面; *yòu miàn*; 'thin noodles') refers to thin noodles. - [Chai tow kway](/wiki/Chai_tow_kway) (菜头粿; *cài tóu guǒ*), also known as char kway (炒粿; *chǎo guǒ*) or carrot cake, is a dish of steamed [radish](/wiki/Radish)/[daikon](/wiki/Daikon) cakes diced and stir-fried with garlic, egg, chopped preserved radish, and sometimes with shrimp. This dish comes in black (fried with sweet dark soy sauce) or white (fried into an omelette) versions, with a chilli paste sometimes added. - [Char kway teow](/wiki/Char_kway_teow) (炒粿条; *chǎo guǒ tiáo*), thick, flat rice noodles stir-fried in dark soy sauce with shrimp, eggs, beansprouts, fish cake, cockles, green leafy vegetables, Chinese sausage and fried cubes of lard. - [Char siu](/wiki/Char_siu) (叉烧; *chā shāo*), also romanised cha-su, cha siu, cha sio, caa siu and char siew, is barbecued pork marinated in a sweet BBQ sauce in [Cantonese cuisine](/wiki/Cantonese_cuisine). - Chicken noodles is an egg noodle dish with diced chicken meat. - [Chwee kueh](/wiki/Chwee_kueh) (水粿; *chúi-kóe/shuǐ guǒ),* a type of steamed rice cake served with preserved radish. - [Crab bee hoon](/wiki/Crab_bee_hoon) (螃蟹米粉; *páng xiè mí fěn*) is a rice vermicelli dish served with whole [mud crab](/wiki/Scylla_serrata). It may be served dry or in soup and sometimes in a [claypot](/wiki/Clay_pot_cooking). - [Drunken prawns](/wiki/Drunken_prawns) (醉虾; *zuì xiā*), prawns cooked with [rice wine](/wiki/Rice_wine). - [Duck rice](/wiki/Duck_rice) (鸭饭; *yā fàn*), braised duck served with rice cooked with yam and shrimp. It can be served simply with white rice and a thick dark sauce, or with braised hard-boiled eggs, preserved salted vegetables, and hard bean curd *(tau kua)* on the side. [Teochew](/wiki/Teochew_cuisine) boneless duck rice is a similar, but a more refined dish. The duck is deboned and sliced thinly, allowing the sauces to seep into the meat. Roasted duck rice is also commonly sold. - [Fish ball noodles](/wiki/Mee_pok) (鱼丸面; *yú wán miàn*), similar to bak chor mee, except that fish balls are used instead of minced pork. - [Fish soup bee hoon](/wiki/Fish_soup_bee_hoon) (鱼片米粉; *yú piàn mí fěn*) is a Singaporean soup served with sliced fish pieces, green vegetables and bee hoon. - [Frog leg](/wiki/Frog_leg) porridge (田鸡粥; *tían jī zhōu*) is served with frog legs, scallion, ginger and thick black sauce in a claypot with porridge in another claypot. - [Hae mee](/wiki/Hae_mee) (虾面; *xiā miàn*), stir-fried prawn noodles cooked in a broth made from prawn heads and pork bones, topped with ingredients such as prawns, sliced pork belly, squid, egg, lard, and served with sambal chili and lime on the side. - [Hainanese chicken rice](/wiki/Hainanese_chicken_rice) (海南鸡饭; *Hǎinán jī fàn*) is based on the Hainanese dish [Wenchang chicken](/wiki/Wenchang_chicken). It is considered Singapore's national dish. - [Hainanese curry rice](/wiki/Hainanese_curry_rice) is a dish consisting of steamed white rice smothered in a mess of curries and braised gravy. - [Har cheong gai](/wiki/Har_cheong_gai) (虾酱鸡; *xiā jiàng jī*; 'shrimp paste chicken'), chicken wings fried in a batter with fermented [shrimp paste](/wiki/Shrimp_paste). - [Hokkien mee](/wiki/Hokkien_mee) (福建面; *Fújiàn miàn*), egg noodles and rice noodles stir-fried with egg, slices of pork, prawns and squid, and served and garnished with spring onion, lard, sambal chilli and lime (for adding lime juice to the dish). - [Ham chim peng](/wiki/Ham_chim_peng) (咸煎饼; *xián jiān bǐng*), a deep-fried bun-like pastry sometimes filled with bean paste. - [Kaya toast](/wiki/Kaya_toast) (咖椰吐司; *kā yē tǔ sī*), a traditional breakfast dish. [Kaya](/wiki/Kaya_(jam)) is a sweet coconut and egg jam which is spread over toasted bread. Combined with a cup of local coffee and a half-boiled egg, this constitutes a typical Singaporean breakfast. - [Kway chap](/wiki/Kway_chap) or kuay chap (粿汁; *guǒ zhī*), a Teochew dish of flat, broad rice sheets in a soup made with dark soy sauce, served with pig offal, braised duck meat, various kinds of beancurd, preserved salted vegetables, and braised hard-boiled eggs. - [Mee pok](/wiki/Mee_pok) (面薄; *miàn báo*), a noodle dish characterised by its flat and yellow appearance, varying in thickness and width. - [Min chiang kueh](/wiki/Martabak_manis) (面煎粿; *miàn jiān guǒ*), a thick, chewy pancake with a ground peanut and sugar filling. Other variations include grated coconut and red bean paste. This traditional snack also is served in blueberry, cheese and chocolate varieties. - [Oyster omelette](/wiki/Oyster_omelette) (蠔烙; *háolào*), a dish of omelette cooked with fresh raw oysters, tapioca starch and eggs. - Pig's brain soup (猪脑汤; *zhū nǎo tāng*), a soup dish comprising pig brain with Chinese herbs. - [Pig fallopian tubes](/wiki/Pig_fallopian_tubes) (生肠; *shēng cháng*), a dish comprising stir-fried pig fallopian tubes with vegetables and sambal chilli. - [Pig's organ soup](/wiki/Pig%27s_organ_soup) (猪杂汤; *zhū zá tāng*; 'pig spare parts soup'), a soup-based variant of kuay chap - [Pig's trotters](/wiki/Pig%27s_trotters) (猪蹄; *zhū tí*) usually braised in black sauce and vinegar. - [Popiah](/wiki/Popiah) (薄饼; *báo bǐng*), Hokkien/Teochew-style [spring roll](/wiki/Spring_roll) or rolled [crêpe](/wiki/Cr%C3%AApe), stuffed with stewed turnip, Chinese sausage, shrimp and lettuce. - Shredded chicken noodles (鸡丝面; *jī sī miàn*), a noodles dish topped with shredded chicken, fish dumpling and mushroom. - [Sliced fish soup](/wiki/Sliced_fish_soup) (鱼片汤; *yú piàn tāng*), a soup dish consisting of fish and vegetables. - [Soon kway](/wiki/Soon_kueh) (笋粿; *sǔn guǒ*), a white vegetable dumpling with black soy sauce. - [Teochew porridge](/wiki/Teochew_porridge) (潮州粥; *Cháozhōu zhōu*), a rice porridge dish consumed with a selection of local side dishes. - [Turtle soup](/wiki/Turtle_soup) (乌龟汤; *wū guī tāng*, also known as 山瑞汤; *shān ruì tāng*), a soup or stew made from turtle flesh. - [Vegetarian bee hoon](/wiki/Vegetarian_bee_hoon) (斋米粉; *zhāi mǐ fěn*), thin braised [rice vermicelli](/wiki/Rice_vermicelli) to which a choice of various gluten, vegetable, or beancurd-based delicacies may be added. - [Yong tau foo](/wiki/Yong_tau_foo) (酿豆腐; *niàng dòu fǔ*), a dish that contains a varied selection of food items, including tofu filled with ground meat mixture or fish paste, fish balls, crab sticks, an assortment of vegetables and meat. - [Youtiao](/wiki/Youtiao) (油条; *yóu tiáo*), also called yew char kueh (油炸粿; *yóu zhá guǒ*), fried dough crullers similar to those served in other Chinese cuisines around the world. - [Yam ring](/wiki/Yam_ring) (佛钵; *fú bō*), a deep-fried ring of [taro](/wiki/Taro) filled with stir-fried ingredients - [Ngoh hiang](/wiki/Ngoh_hiang) (also known as lor bak or five-spice meat roll) is a common Chinese dish in Singapore and Southeast Asia. It is a sausage-like roll made with minced meat (usually pork and shrimp), seasoned with five-spice powder, and wrapped in beancurd skin, which is then deep-fried. It is frequently seen in hawker centers and restaurants, often eaten as an appetizer or snack. ### Malay and Indonesian Situated between [Malaysia](/wiki/Malaysian_cuisine) and [Indonesia](/wiki/Indonesian_cuisine), Singaporean [Malay dishes](/wiki/Malay_cuisine) are influenced by the food of the neighbouring [Malay Peninsula](/wiki/Malay_Peninsula), [Sumatra](/wiki/Sumatra), [Java](/wiki/Java) and the [Riau Islands](/wiki/Riau_Islands). Despite absorbing regional influences, it tends to be adapted to local tastes and differs from their counterparts in neighbouring countries. Although Malays, such as the [Orang Laut](/wiki/Orang_Laut), are native to Singapore, most Malays in Singapore today are descended from native Indonesians or native Malays from present-day Malaysia. Hence, Singaporean Malay cuisine features a unique set of influences, especially from [Minang cuisine](/wiki/Padang_food). Spices and coconut milk are common ingredients, although Chinese ingredients such as taupok (tofu puffs) and tofu (known as tauhu in Malay) have been integrated. Many Chinese and [Tamil Muslim](/wiki/Tamil_Muslim) adaptations of the following dishes also exist. As almost all Malays are Muslims, pork is not used as it is prohibited in [Islam](/wiki/Islam). - [Acar](/wiki/Acar), [pickled](/wiki/Pickling) vegetables or fruits with dried chilli, peanuts, and spices. Indian and Peranakan versions can also be found. - [Assam pedas](/wiki/Asam_pedas), seafood and vegetables cooked in a sauce consisting of tamarind, coconut milk, chilli, and spices. - [Ayam penyet](/wiki/Ayam_penyet), fried chicken dish consisting of fried chicken that is smashed with the pestle against mortar to make it softer and a relatively new culinary phenomenon of Indonesian origin. - [Bakso](/wiki/Bakso), also Ba'so, meatballs served with noodles. - [Begedil](/wiki/Perkedel), mashed potato mixture that is fried into patties and eaten together with mee soto. - [Curry puff](/wiki/Curry_puff), also known as epok-epok, a flaky pastry usually stuffed with curry chicken, potato cubes, and a slice of hard-boiled egg. Sardines are sometimes used in place of chicken. - Dendeng paru, a dish of dried beef lung cooked in spices. - [Goreng pisang](/wiki/Pisang_goreng), bananas rolled in flour, fried, and eaten as a snack. - [Gudeg](/wiki/Gudeg) putih, white jackfruit curry. - Gulai daun ubi, sweet potato leaves stewed in coconut milk. - [Keropok](/wiki/Krupuk), deep fried crackers usually flavoured with shrimp, but sometimes with fish or vegetables. - [Ketupat](/wiki/Ketupat), rice cakes steamed in a square-shaped coconut leaf wrapping and usually served with satay. - Lemak siput, shellfish cooked in a thick coconut milk-based gravy. - [Lontong](/wiki/Lontong), compressed rice cakes (see ketupat) in a spicy vegetable soup. - [Nagasari](/wiki/Nagasari), a rice snack with Indonesian origins. - [Nasi goreng](/wiki/Nasi_goreng), steamed rice stir-fried in a wok, often mixed with other ingredients, such as eggs, vegetables and meat. - [Nasi Padang](/wiki/Nasi_Padang), a steamed white rice served with an array – sometimes as many as 12, or more – of pre-cooked dishes, the mini banquet usually laid out in small plates. - [Otak-otak](/wiki/Otak-otak)/otah, spicy fish cake grilled in a banana leaf wrapping. - [Pecel lele](/wiki/Pecel_lele), fried catfish served with chilli paste. - [Rawon](/wiki/Rawon), beef soup. - [Rojak bandung](/wiki/Rojak_bandung), a variant of [Singaporean-style rojak](/wiki/Rojak#Malaysian_and_Singaporean_rojak). - [Roti john](/wiki/Roti_john), an omelette sandwich. - [Sambal](/wiki/Sambal), not a dish in itself, but a common chilli-based accompaniment to most foods. - [Satay](/wiki/Satay), grilled meat on skewers served with satay sauce (a spicy peanut sauce) and usually eaten with ketupat, cucumber and onions. - [Sayur lodeh](/wiki/Sayur_lodeh), a mix of vegetables in coconut milk. - [Soto](/wiki/Soto_(food)), a soup dish mainly composed of meat and vegetables. - [Soto ayam](/wiki/Soto_ayam), a spicy chicken soup that features chicken shreds, rice cakes and sometimes begedil. - [Tumpeng](/wiki/Tumpeng), a cone-shaped rice dish of Javanese origin. It is served with side dishes of vegetables and meat. ### Indian Like other Singaporean ethnic cuisines, Indian Singaporean cuisine has been influenced by multiple cultural groups. Dishes from both North India and South India can be found in Singapore. - [Appam](/wiki/Appam), a fermented rice pancake. - [Dosa](/wiki/Dosa_(food)), rice and lentil pancake. Commonly served as a \"masala\" version that includes spiced potatoes and is served with different types of sambar. - [Murtabak](/wiki/Murtabak), an [Indian-Muslim](/wiki/Islam_in_India) dish originating from the Middle East. It consists of folded dough stuffed with spiced minced meat, onions and egg, and is often served with curry. - [Naan](/wiki/Naan), an Indian oven-baked flatbread. - [Putu mayam](/wiki/Idiyappam) rice flour [string hoppers](/wiki/String_hoppers) or noodles served with sugar and coconut usually eaten for breakfast. - [Roti prata](/wiki/Roti_prata), a local evolution of the Indian [paratha](/wiki/Paratha). It is a common dish for breakfast and supper. It is a fried bread pancake that is crispy on the outside and soft on the inside. The dough is flipped to attain the right texture, then cooked quickly on a greased stove and served with curry or sugar. A plethora of modern variations are available, including egg, cheese, chocolate, [masala](/wiki/Spice_mix), durian and ice cream. - [Satti sorru](/wiki/Satti_sorru): Indian claypot rice - [Soup kambing](/wiki/Sup_kambing), a local [Tamil-Muslim](/wiki/Tamil_Muslim) dish of spiced mutton soup. - Soup tulang, a local [Tamil-Muslim](/wiki/Tamil_Muslim) dish of mutton or beef leg bones stewed in a spice. The bones are broken to allow the marrow to be eaten. - Soup tulang merah, is a dish consisting of mutton or beef bones stewed in a sweet and spicy red soup of mutton stock, tomatoes, ginger, chillies and spices. It is considered a Singapore invention - [Tandoori chicken](/wiki/Tandoori_chicken), chicken marinated in a mixture of spices and yogurt and cooked in a clay oven. - [Vadai](/wiki/Vada_(food)), spicy, deep-fried snacks that are made from dhal, lentils or potato. ### Cross-cultural A number of dishes, listed below, can be considered as truly hybrid or multi-ethnic food. - Ayam buah keluak, a Peranakan dish of chicken stewed with spices and Southeast Asian black nuts (buah keluak). - [Biryani](/wiki/Biryani) (Indian variant) or [nasi briyani](/wiki/Biryani#Malaysia_and_Singapore) (Malay variant), a popular mixed rice dish commonly found in places offering Malay or Indian food. - Cereal prawns (麦片虾; *mài piàn xiā*), stir-fried prawns with sweetened cereal. - Laksa lemak, a Peranakan dish of vermicelli noodles and fried bean curd served in a creamy coconut sauce with slices of shrimp, fish, and cockles. - [Fish head curry](/wiki/Fish_head_curry), a dish created by Singapore's Malayali (an Indian ethnic group from [Kerala](/wiki/Kerala)) community with some Chinese and Malay influences. The head of a [red snapper](/wiki/Red_snapper_(fish)) (*ikan merah*, literally 'red fish') stewed in curry consisting of varying amounts of coconut milk and tamarind juice, along with vegetables ([okra](/wiki/Okra) and [eggplant](/wiki/Eggplant) are common). Usually served with either rice or bread. - [Kari debal](/wiki/Devil%27s_curry) or devil's curry, a Eurasian Singaporean curry dish with Portuguese and Peranakan influences. Includes chicken, cabbage, sausage, and bacon pieces stewed in a curry sauce. - Kari lemak ayam, a Peranakan chicken curry with a coconut milk base - [Katong laksa](/wiki/Katong_laksa), Singaporean thick rice noodles cut into shorter pieces (bee hoon) in a coconut curry gravy with prawn and egg. Sometimes tau pok (beancurd puffs) or fish cake may be added.[*citation needed*] - [Kueh tutu](/wiki/Kue_putu_mangkok) steamed rice flour pastries with a sweet shredded coconut or peanut filling - [Kueh pie tee](/wiki/Kueh_Pie_Tee), a thin and crispy pastry tart shell filled with a spicy, sweet mixture of thinly sliced vegetables and prawns. - [Kway teow goreng](/wiki/Kwetiau_goreng), stir-fried [flat rice noodles](/wiki/Shahe_fen). - [Mee rebus](/wiki/Mi_rebus), egg noodles with a spicy slightly sweet curry-like gravy. The gravy is made from sweet potatoes, curry powder, water, salted soybeans, dried shrimp and peanuts. - [Mee siam](/wiki/Mee_siam), a dish of thin rice vermicelli. - [Mee goreng](/wiki/Mee_goreng), yellow egg noodles stir fried with ghee, tomato sauce, chilli, eggs, vegetables, and various meats and seafood. - [Mee soto](/wiki/Soto_mie), a spicy noodle soup dish. - [Rojak](/wiki/Rojak#Malaysian_and_Singaporean_rojak), a traditional fruit and vegetable salad dish of Indian origin and with Malay/Indonesian influences. - Sambal kangkong, a dish of [water spinach (*kangkong*)](/wiki/Ipomoea_aquatica) fried in sambal. - [Satay bee hoon](/wiki/Satay_bee_hoon), rice noodles served with cuttlefish, fried bean curd puffs, cockles and water spinach in satay sauce. - [Tauhu goreng](/wiki/Tauhu_goreng), fried bean curd with sweet sauce. - \"Western food\" in hawker centres where \"Singapore-style\" chicken chop (topped with black pepper or mushroom sauce), chicken cutlet, and pork chop are available. These are usually served with fries or mashed potato, coleslaw and baked beans. This style is often called \"Hainanese Western food\" due to the fact that it traces its origins to Hainanese immigrants who worked as cooks in the kitchens of Western employers. ### Seafood Singaporeans also eat a wide variety of seafood including fish, squid (known as *sotong* in Malay), stingray, crab, lobster, clams, and oysters. Well-known seafood dishes include: - [Black pepper crab](/wiki/Black_pepper_crab), hard-shell crabs cooked in a black pepper sauce. Salted egg crab and buttermilk crab are also common - [Chilli crab](/wiki/Chilli_crab), hard-shell crabs cooked in chilli sauce, usually served with [man tou](/wiki/Man_tou), or deep-fried buns - [Oyster omelette](/wiki/Oyster_omelette), an oyster omelette mixed with flour and fried, served garnished with coriander - Sambal lala, soft-shell clams fried with sambal sauce - [Sambal stingray](/wiki/Sambal_stingray) or *hang hir* (魟鱼; 魟魚; *hōng yú*), smothered in sambal and served on banana leaf; also known as *ikan bakar* in Malay ## Fruit A wide variety of tropical fruits are available all year round. By far the most well known is the [durian](/wiki/Durian), known as the \"King of Fruits\", which produces a characteristic odour from the creamy yellow custard-like flesh within its spiky green or brown shell. Durians are banned on public transport, elevators, certain hotels, and public buildings because of their strong odour. Other popular tropical fruits include [mangosteen](/wiki/Mangosteen), [jackfruit](/wiki/Jackfruit), [longan](/wiki/Longan), [lychee](/wiki/Lychee), [rambutan](/wiki/Rambutan), [soursop](/wiki/Soursop), [pineapple](/wiki/Pineapple) and [mango](/wiki/Mango). Some of these fruits also are used as ingredients for other dishes: iced desserts, sweet-and-sour pork, and certain types of salad such as [rojak](/wiki/Rojak). ## Desserts Singaporean desserts have a varied history. A typical food court or hawker centre dessert stall will usually have a large variety of desserts available, including but not limited to: - [Bubur cha cha](/wiki/Bubur_cha_cha), a dish of pearled sago, sweet potatoes, yams, bananas, black-eyed peas, pandan leaves, sugar, and salt cooked in coconut milk and served hot or cold. - [Chendol](/wiki/Cendol), basic version consist of pandan jelly strips with coconut milk and gula melaka syrup with shaved iced; other ingredients which could be added are red beans, sweet corns, ice cream and even durians. - [Cheng tng](/wiki/Cheng_tng) (清汤; *qīng tāng*), a light, refreshing soup with longan, barley, [agar](/wiki/Agar) strips, lotus seeds and a sweet syrup, served either hot or cold. It is analogous to the Cantonese [ching bo leung](/wiki/Ching_bo_leung). - [Ice kacang](/wiki/Ais_kacang), a mound of grated ice on a base consisting of jelly, red beans, corn and [attap](/wiki/Nypa_fruticans) seeds, topped with various kinds of coloured sugar syrups, [palm sugar](/wiki/Palm_sugar), rose syrup and [evaporated milk](/wiki/Evaporated_milk). - [Kuih](/wiki/Kuih) or kueh, small cakes or coconut milk based desserts that come in a variety of flavours, usually containing fruit such as durian or banana. [Pandan](/wiki/Pandanus_amaryllifolius) is a common flavouring. - [Kueh laddu](/wiki/Laddu) are ball-shaped sweets. - [Kueh lapis](/wiki/Kue_lapis) is a rich, multi-layered cake-style kueh using a large amount of egg whites and studded with prunes. - [Kueh modak](/wiki/Modak) are rice flour dumplings stuffed with coconut and palm sugar. - Lapis sagu is also a popular kueh with layers of alternating colour and a sweet, coconut taste. - [Orh-nee](/wiki/Taro_pur%C3%A9e) (芋泥; *yù ní*), a Teochew dish consisting of [taro](/wiki/Taro) (locally known as \"yam\") paste, coconut paste and ginkgo nuts. - [Pulut hitam](/wiki/Bubur_ketan_hitam), a creamy dessert made of black glutinous rice and served with coconut cream. - Tau suan (豆爽; *dòu shuǎng*), [mung beans](/wiki/Mung_bean) in jelly, served hot with dough crullers. - [Tang yuan](/wiki/Tangyuan_(food)), bite-sized glutinous rice balls often filled with black sesame filling and sometimes served in ginger soup. ### Ice cream sandwich [Wafer](/wiki/Wafer) ice cream sandwiches are a popular dish sold by street vendors operating carts on busy street corners. These carts carry a variety of flavours, including but not limited to vanilla, chocolate, strawberry, coffee, sweet corn, coconut, and durian. While some vendors sell their ice cream in cups or cones, as is common in the West, the more popular variant is on slices of bread or between wafers. The ice cream consists of sealed blocks which are sliced to order and then placed on a single slice of over-sized, often multicolored bread. This can be either white bread or a slice of multicolored, slightly sweetened bread (dyed with food colouring and flavoured with pandan leaf extract). ## Drinks and beverages Popular Singaporean drinks include: - [Bandung](/wiki/Bandung_(drink)), rose syrup with evaporated milk. - [Beer in Singapore](/wiki/Beer_in_Singapore) - Chin chow drink (仙草水; *xiān cǎo shuǐ*), [grass jelly](/wiki/Grass_jelly) made into a sweet beverage. - [Kopi](/wiki/Kopi_(drink)), the local coffee in Singapore. Singapore's kopi jargon is mixed with various languages. - Kopi: Coffee with sugar and condensed milk - Kopi-**O**: Coffee with sugar - Kopi-**O**-**kosong**: Coffee without sugar and evaporated milk - Kopi-**C**: Coffee with sugar and evaporated milk - Kopi-**peng**: Iced coffee with sugar and condensed milk - Kopi-**siew**-**dai**: Coffee with less sugar and condensed milk - Kopi-**siew**-**siew**-**dai**: Coffee with little sugar and condensed milk - Kopi-**ga**-**dai**: Coffee with extra sugar and condensed milk - Kopi-**gao**: Coffee with sugar, condensed milk and extra thick concentrated coffee - Kopi-**di**-**lo**: Coffee with no dilution - Kopi-**poh**: Coffee with extra dilution - Lemon barley drink - Water chestnut drink - [Horlicks](/wiki/Horlicks), malt milk drink. Variations include the Horlicks Dinosaur, a standard Horlicks drink topped with a scoop of Horlicks powder. - [Milo](/wiki/Milo_(drink)), chocolate/malt milk drink. Variations include the [Milo Dinosaur](/wiki/Milo_Dinosaur), a standard Milo drink topped with a scoop of Milo powder. - [Sugarcane](/wiki/Sugarcane) juice, usually blended to order from fresh sugar cane stalks. - Teh tarik, a pulled milk tea, often served hot. Variations include Teh halia tarik, which uses ginger tea instead of black tea. - Teh halia tarik, ginger tea with \"pulled\" milk (tarik) - [Singapore sling](/wiki/Singapore_sling). While the cocktail was invented in Singapore's [Raffles Hotel](/wiki/Raffles_Hotel), and is still served at the hotel's Long Bar, it is not common in most Singaporean bars. ## Singaporean dishes uncommon in Singapore - [Singapore-style noodles](/wiki/Singapore-style_noodles) (星州炒米粉; *xīng zhōu chǎo mí fěn*), an [American Chinese](/wiki/American_Chinese_cuisine) dish featuring fried rice vermicelli flavoured with yellow curry powder which can also be commonly found in Hong Kong, is not found in Singapore. The close relative to this dish is [fried bee hoon](/wiki/Bihun_goreng) (thin rice noodles). - Singapore fried *kway tiao* (星州炒粿条; *xīng zhōu chǎo guǒ tiáo*), a dish featuring fried thick, flat rice noodles flavoured with dark soy sauce commonly available in some Chinese restaurants in Canada and the United States, is also not a Singaporean dish. The dish most resembling it is [char kway teow](/wiki/Char_kway_teow). - Food portal - Singapore portal - [Culture of Singapore](/wiki/Culture_of_Singapore) - [Gastronomy in Singapore](/wiki/Gastronomy_in_Singapore) - [List of coffeehouse chains](/wiki/List_of_coffeehouse_chains) - [List of chicken restaurants](/wiki/List_of_chicken_restaurants) - [List of countries with organic agriculture regulation](/wiki/List_of_countries_with_organic_agriculture_regulation) - [List of shopping malls in Singapore](/wiki/List_of_shopping_malls_in_Singapore) - [List of supermarket chains in Singapore](/wiki/List_of_supermarket_chains_in_Singapore) - [List of vegetarian restaurants](/wiki/List_of_vegetarian_restaurants) - [List of restaurants in Singapore](/wiki/List_of_restaurants_in_Singapore) - [List of Singaporean dishes](/wiki/List_of_Singaporean_dishes) - [JL Studio](/wiki/JL_Studio)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:00:42.241593",
  "title": "Singaporean cuisine",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singaporean_cuisine"
}