{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:54:36.168403"
  },
  "content": "Educational qualification in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore-Cambridge GCE Normal Level\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2017)* *(Learn how and when to remove this message)* The **Singapore-Cambridge General Certificate of Education Normal Level** (or **Singapore-Cambridge GCE N-Level**) examination is a national examination held annually in Singapore. It is taken after four years in the Normal (Academic) or Normal (Technical) stream. For subjects examined in [English](/wiki/English_language) and foreign languages, the examining authority are the [University of Cambridge Local Examinations Syndicate](/wiki/University_of_Cambridge_Local_Examinations_Syndicate). For localised language subjects, the examining authority is the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) (MOE). The Singapore-Cambridge General Certificate of Education Normal Level examination is sub-categorised into Normal (Academic) Level (N(A) Level) and Normal (Technical) Level (N(T) Level), catering to candidates under the Normal (Academic) (abbreviated as N(A)) and Normal (Technical) (abbreviated as N(T)) streams respectively. ## Singapore-Cambridge GCE Normal (Academic) Level The General Certificate of Education Normal (Academic) Level (or GCE N(A)-Level) examinations are taken by Secondary 4 students in the Normal (Academic) stream normally in September and October of the year. Students would normally receive their results by the mid to end of December in the same year they sat for the examinations and their grades are reflected as per the grading system below. Most Normal (Academic) students are offered at least 5 subjects, but may range to as many as 6 or 7 depending on the electives they take on and the school they are in. Mandatory subjects for Normal (Academic) students include **English Language, Mathematics (Syllabus A), Mother Tongue Language, Combined Sciences and Combined Humanities.** Although most students are encouraged to take Mother Tongue as a mandatory subject, some students may still choose to be exempt from Mother Tongue depending on varying circumstances, although the margin of exempted students are relatively minimal. ### Subjects offered at the Normal (Academic) Level Subjects that are highlighted in **bold** are mandatory subjects for students in the Normal (Academic) stream in most secondary schools. SubjectElective OptionsSyllabus (2019)Syllabus (2020)Offer of higher O Level syllabus**English Language Syllabus A****None****1190****1190****Yes****Mathematics Syllabus A****None****4045****4045****Yes (Elementary Mathematics)****Chinese Language****None****1196****1196****Yes****Malay Language****None****1197****1197****Yes****Tamil****None****1198****1198****Yes****Combined Sciences****Chemistry and Physics****5105****5105****Yes [Science (Physics, Chemistry)]****Combined Sciences****Physics and Biology****5106****5106****Yes [Science (Physics, Biology)]****Combined Sciences****Biology and Chemistry****5107****5107****Yes [Science (Chemistry, Biology)]****Combined Humanities****Social Studies, Geography****2175****2175****Yes [Humanities(Social Studies, Geography)]****Combined Humanities****Social Studies, History****2176****2176****Yes [Humanities(Social Studies, History)]****Combined Humanities****Social Studies, Literature in English****2177****2177*****No**Additional MathematicsNone40444044NoFood and NutritionNone60726073NoArtNone61256125NoDesign and TechnologyNone70547055 **R**NoPrinciples of AccountsNone70887088NoBengali, Gujarati, Hindi, Punjabi and Urdu None3236, 3237, 3238 3239, 3240 3236, 3237, 3238 3239, 3240 No ### Grading A student's total grade for the GCE N(A) Levels examinations are calculated using this equation: **EMB3**. This equation is short for the combined total grades of the student's English Language, Mathematics and Best 3 subjects grades to form a totality. This total grade of EMB3 can be used to determine which courses in higher education the student may pursue after leaving secondary school, although some may still choose to remain in their secondary schools to continue onto Secondary 5 (Normal) and sit for the GCE Ordinary Levels examinations. Grades 1 to 5 are considered passing grades. Students who fail to pass English, Mathematics and three other subjects or have an EMB3 above 19 points will not be allowed to proceed to Secondary 5. GradeNumeric Score Range175-100270-74365-69460-64550-59U<49 Normal (Academic) students may be offered GCE O-Level subjects depending on the school they are in. Depending on their academic grades reflected from Secondary 1, a student may be considered eligible for taking on GCE O-Level subjects as long as they meet the Minimum Entry Requirements for the particular subject. Currently, only English Language, Mother Tongue Languages and Mathematics may be taken by Normal (Academic) students at the GCE O-Level standard. Students are normally required to have at least a grade 2 and above (70 and above) in their Secondary 1 or 2 years to be offered the GCE O-Level subject. ### Grade Conversion from the GCE O-Level to N-Level Grade in O LevelsConverted Grade in N LevelsDifference in GradeA1 through B312 (from B3) 1 (from A2) B4 through C624 (from C6) 3 (from C5) 2 (from B4) D734E844 F9 grades at O-Level will not be converted to any N(A)-Level grade. ### Courses for N(A) students after N(A)-Level There are five types of education pathways a Normal (Academic) student may pursue after secondary education. These include the Polytechnic Foundation Programme (PFP), Direct-Entry-Scheme to Polytechnic Programme (DPP), Early Admission Exercise (EAE-ITE), Institute of Technical Education NITEC Course and progression to Secondary 5 Normal. Education PathwayEligibility, Requirements and InformationApplication PhaseNotesPolytechnic Foundation Programme (PFP)ELMAB3 equals or below 12 whereby; English must be grade 3 or better. Some courses may require English to be grade 2 or better (mostly business or humanities courses); Maths and 3 other relevant subjects to be grade 3 or better. Failure to attain a grade 3 or better in relevant subjects will mean the student will not be eligible for enrollment into the PFP. Application normally starts in or around start to mid-January.-Direct-Entry-Scheme to Polytechnic Programme (DPP)ELMAB3 equals or below 19 whereby; English, Maths and 3 other relevant subjects must be equivalent to grade 4 or better. Failure to attain a grade 4 or better in relevant subjects will mean the student will not be eligible for enrollment into the DPP. Students also have to meet the required course cut-off points. Students will have to undergo a 10 preparatory weeks before joining Higher NITEC course in April of the same year. Students that do well in Higher NITEC will get a chance to proceed to a Polytechnic-related course based on the course taken in Higher NITEC. Students who have gotten a raw GPA of 2.5 or above and are in an Applied Science, Engineering or InfoComm Technology courses will be able to proceed to polytechnic while students with a raw GPA of 3.0 or above in a Business course will be able to move on to polytechnic. However, students with a raw GPA of 3.5 or above that are in an Engineering or InfoComm technology course will be able to move on to year 2 of a related Polytechnic course. Application normally starts on the day of the GCE N-Level results collection.-Early Admission Exercise for the Institute of Technical Education (EAE-ITE)Successful candidates of the EAE-ITE must meet the set Minimum Entry Requirements (MER) as per NITEC course they were enrolled into, whereby; English, Maths and 3 other relevant subjects must be equivalent to grade 5 or better. Students who has done well in Nitec with a raw GPA of 3.5 or above will be able to move on to a Polytechnic-related course. Application normally starts in the end of May. Interviews will begin in July and the results of the EAE will be published by end August.-Institute of Technical Education National ITE Certificate Courses (ITE-NITEC)ELMAB3 grade differ depending on course type and requirements. Some courses may accept students with any ELMAB3 grade. Students who has done well in NITEC with a raw GPA of 3.5 or above will be able to move on to a Polytechnic-related course. Application normally starts on the day of the GCE N-Level results collection.- ### Polytechnic Foundation Programme (PFP) Polytechnic Foundation Programme (PFP)is a programme that is for Secondary 4N(A) students. It was implemented in 2012 by the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) (MOE). It is to provide more pathways to the tertiary education for the Secondary 4 N(A) students instead of going Secondary 5N to take the O-Level. To be eligible, a student must get at least a Grade 4 for the ELMAB3 subjects, getting no more than 12 points (excluding CCA points) and expected to be the top 10% cohort in the whole cohort of Singapore. This programme will only commence estimated during the month of April. Students are expected to pass all modules to advance to Year-One of Polytechnic to take their diploma. ## Singapore-Cambridge GCE Normal (Technical) Level The Singapore-Cambridge General Certificate of Education Normal Technical Level (or Singapore-Cambridge GCE N(T)-Level) are taken by Normal Technical students after four years of secondary school education. This will eventually lead them to the [Institute of Technical Education](/wiki/Institute_of_Technical_Education) (ITE). Alternatively, if they performed well enough in Secondary 1, they may be laterally transferred to the Secondary 2 Normal (Academic) stream. However, if they have not been laterally transferred in Secondary 2 N(T), but did exceptionally well when taking Secondary 4 GCE N(T) Level, they can be laterally transferred to Secondary 4 N(A) Level in the event they achieved the criteria of ELMAB1 and later on, they can continue studying in Secondary 4 N(A). Students may also opt to read a maximum of 3 subjects at the N(A) level. The curriculum is geared towards strengthening students’ proficiency in English and Mathematics. Students take English Language, Mathematics, Basic Mother Tongue, and Computer Applications as compulsory subjects. The aggregate used for the GCE N(T) Level is ELMAB1 (English, Math, and 1 best subject). The grades are as following: ### Grading A: 75% and above B: 70% to 74% C: 60% to 69% D: 50% to 59% U: Below 49% ungraded, or failed <<< Will not be shown on the [Certificate of Secondary Education](/wiki/Certificate_of_Secondary_Education). The N(T)-Level can be considered a rough analogue of the [Certificate of Secondary Education](/wiki/Certificate_of_Secondary_Education), examined in the UK in the era of the [Tripartite System](/wiki/Tripartite_System). Schools are not split into technical, secondary modern, or grammar, as they were in Britain, but rather follow the comprehensive system used in Britain today. However, there exists 2 technical schools or specialized N(T) schools, Crest Secondary School and Spectra Secondary School including Pathlight School. - [Secondary education in Singapore](/wiki/Secondary_education_in_Singapore) - [Singapore-Cambridge GCE Ordinary Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) - [Singapore-Cambridge GCE Advanced Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:54:36.167987",
  "title": "Singapore-Cambridge GCE Normal Level",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore-Cambridge_GCE_Normal_Level"
}