{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:57:10.115270"
  },
  "content": "Statutory board in SingaporeThis article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"Singapore Land Authority\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2007)* *(Learn how and when to remove this message)* The **Singapore Land Authority** (**SLA**) is a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the [Ministry of Law](/wiki/Ministry_of_Law_(Singapore)) of the [Government of Singapore](/wiki/Government_of_Singapore). SLA optimises land resources for Singapore's social and economic development. ## History The SLA was formed on 1 June 2001 when the Land Office, Singapore Land Registry, Survey Department and Land Systems Support Unit were merged. ## Role With the vision of 'Limited Land, Unlimited Space', SLA is responsible for maximising Singapore's land resources, by: - Optimising land and space utilisation, - Safeguarding property ownership, and - Promoting the use of land-space data through geospatial. SLA has two functional roles: developmental and regulatory. - Developmental: SLA oversees the management of 11,000 hectares of state land and 2,700 state properties. SLA is also responsible for land sales, leasing, [land acquisitions](/wiki/Eminent_domain) and allocation, developing and marketing land-related information and maintaining the national land information database. - Regulatory: SLA is the national land registration authority, and is responsible for the management and maintenance of the national land survey system, to define the boundaries and legal limits of properties in Singapore. SLA also operates GeoWorks, Southeast Asia's first [geospatial](/wiki/Geospatial) industry centre. As a [co-working space](/wiki/Coworking), GeoWorks aims to nurture and strengthen the geospatial ecosystem in Singapore and beyond, bringing together MNCs, scale-ups and government agencies through partnership, collaboration and innovation. The GeoWorks GeoInnovation Programme is home to more than 20 startups and scale-ups in geospatial and related domains, including [artificial intelligence](/wiki/Artificial_intelligence), [drones](/wiki/Unmanned_aerial_vehicle), [autonomous vehicles](/wiki/Self-driving_car), [augmented reality](/wiki/Augmented_reality), [virtual reality](/wiki/Virtual_reality), [geospatial analysis](/wiki/Spatial_analysis), [satellite imagery](/wiki/Satellite_imagery) and [route optimisation](/wiki/Vehicle_routing_problem). GeoWorks is located at [mTower](/wiki/MTower). ## State-managed Properties Notable properties managed by SLA include: - [Gillman Barracks](/wiki/Gillman_Barracks) - Dempsey Hill (former Tanglin Village) - [Kallang Airport](/wiki/Kallang_Airport) - [Tanjong Pagar Railway Station](/wiki/Tanjong_Pagar_railway_station) - [Former Bukit Timah Fire Station](/wiki/Former_Bukit_Timah_Fire_Station) - [Changi Hospital](/wiki/Changi_Hospital) - [Temasek Shophouse](/wiki/Temasek_Shophouse) - Turf City - 5 Kadayanallur Street (former St. Andrew’s Mission Hospital) - 45 Sultan Gate at [Kampong Glam](/wiki/Kampong_Glam) - Close to 500 [Black and White Bungalows](/wiki/Black_and_white_bungalow) across Singapore, including Scotts Road, Goodwood Hill, Bukit Timah, Alexandra Park, Sembawang, Malcolm Park, Changi and Seletar - [St. John’s Island](/wiki/Saint_John%27s_Island), [Lazarus Island](/wiki/Lazarus_Island) and [Kusu Island](/wiki/Kusu_Island) - [SiReNT](/wiki/SiReNT) - [Virtual Singapore](/wiki/Virtual_Singapore) - Singapore Land Authority Official Website - GeoWorks - Singapore's Geospatial Industry Centre - OneMap - authoritative national map of Singapore - State Property Information Online This Singaporean organisation article is a stub. You can help Wikipedia by expanding it.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:57:10.114888",
  "title": "Singapore Land Authority",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Land_Authority"
}