{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:57:57.856603"
  },
  "content": "Singapore domestic and international postal service provider**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article's lead section **may need to be rewritten**. Please review the lead guide and help improve the lead of this article if you can. *(April 2019)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore Post\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2023)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Singapore Post Limited**, commonly abbreviated as **SingPost**, is an [associate company](/wiki/Associate_company) of [Singtel](/wiki/Singtel) and [Singapore](/wiki/Singapore)'s designated Public Postal Licensee which provides domestic and international postal services. It also provides logistics services in the domestic and international markets, warehousing and fulfillment, and global delivery services. SingPost also offers products and services including postal, agency and financial services through its post offices, Self-service Automated Machines (SAMs) and [vPOST](/wiki/VPOST), its [internet portal](/wiki/Internet_portal). Its headquarters is located in [Paya Lebar](/wiki/Paya_Lebar), Singapore. Today, Singapore has 13 operating offices worldwide, over 7,000 PopStation lockers, 269 Self-service Automated Machines (SAMs), and 44 Post Offices. ## History ### Early history Postal Services were available in Singapore since the island was founded by Sir Stamford Raffles in 1819. Initially, mail services were handled by the military authorities and then by the Master Attendant in 1823. The volume of mail was very small in those days and letters were collected and delivered from a single mail office. The Post Office, as it was then known, shared a room with the Master Attendant's Marine Office and the clerk to the Registrar of Import and Export. The whole establishment of the post office in the 1830s consisted of one European clerk, one local writer and a peon. To cope with the increasing volume of mail, the Post Office, then known as the Singapore Post Office, later General Post Office, was moved in 1854 to its own building near the Town Hall by the side of the Singapore River. Although it was more spacious, there were frequent complaints regarding its location. The Commercial Square (business sector) was on the opposite side of the river, so going to the Post office was inconvenient as one had to cross the river by boat. After 1856, a footbridge was constructed across the river and a toll of 1⁄4 cent was levied. As trade flourished in Singapore and both postal and marine traffic grew heavier, the Post Office was separated from the Marine Office and it became a separate department in October 1858. During the period 1819 and 1858, letters for posting had to be handed in at the Post Office. No postage stamps were used but a register was kept of all letters received at the Post Office and of the names of sailing ships on which they were conveyed. Stamped receipts were also given for all letters sent to the Post Office for dispatch. For the convenience of the residents, a register was kept of their individual postage accounts on the understanding that all postage due would be regularly settled every month. The first postage stamps were introduced for payment of postage only in 1854. In the early days, the flagstaff at Government Hill (now Fort Canning) was eagerly watched as flying of a flag at daylight, or the firing of a gun at night, signified the arrival of a ship with mail. This infused new life into the quiet community. On receipt of letters from incoming ships, the Post Office sorters would proceed to register alphabetically all the letters before sending them out through the postmen for delivery. Postal delivery services by means of bullock cart, horse carriage or on foot, were first restricted to the town area. Posting boxes were later installed in the town area for the posting of mail which were then collected by horse-drawn mail coaches. In 1873, a new General Post office was built on the site of the former Fort Fullerton, a location which was much nearer to the commercial centre of the town. However, the British Government failed to foresee the needs of the future, with the result that the building had to be replaced by another on practically the same site. The new General Post Office was completed in 1885, three years after approval was obtained. The General Post Office was closed on 23 April 1921. All the equipment were moved to a building on the recently reclaimed land at Collyer Quay, and staff worked at this temporary post office during the construction of Fullerton Building. The post office was transferred back to Fullerton Building on 23 July 1928 and has remained there since. The latter part of the 19th century marked the modern phase of the development in the history of the Singapore postal service. Services were extended to include a parcel post service, money order and postal order services and a post office savings bank. 1897 saw the establishment of the first sub-post offices, and by 1938, some 20 sub-post offices were already providing decentralised postal facilities on the island. The horse-drawn mail coaches were withdrawn and replaced by motor vans in 1914 as the mail traffic handled steadily increased. ### Modern history In 1979, it was reported that the Postal Services Department would be merged with [Telecommunication Authority of Singapore](/wiki/Singtel) (TAS). In 1980, Communications Minister, [Ong Teng Cheong](/wiki/Ong_Teng_Cheong) announced that a consideration was done to merge the Department and TAS. The merger was scheduled to be done by April 1982 but was postponed to be completed in July 1982. The department and TAS was finally merged on 1 October 1982. In 1992, Telecoms was split into three entities, the reconstituted TAS (later becoming [Infocomm Media Development Authority](/wiki/Infocomm_Media_Development_Authority)), [Singapore Telecommunications Limited](/wiki/Singtel) (SingTel) and Singapore Post Private Limited, an associated company of Singapore Telecommunications. In 1993, Singapore Post introduced Q-TV, a video-based \"advertising medium\" which shows post office information and commercials, targeting customers waiting for the next available counter. Singapore Post Limited was then incorporated on 28 March and then listed on the mainboard of the [Singapore Exchange](/wiki/Singapore_Exchange) (SGX-ST) on 13 May 2003. It was then granted the first Public Postal License by TAS. As a licensee, Singapore Post is allowed to operate postal services - receiving, collecting and delivering letters and postcards from one place to another until 31 March 2037. In 2009, SingPost acquired the remaining 50% stake in G3 Worldwide Aspac (G3AP), thereby giving the company presence in 10 countries (including Singapore). SingPost bought Quantium Solutions, a joint venture between SingPost, Dutch TNT and Britain's Royal Mail. SingPost also raised its stake in Malaysian Logistics company GDEX to 27% in 2011. [Alibaba](/wiki/Alibaba_Group) bought a 10.35% stake in SingPost for [S$](/wiki/Singapore_dollar)312.5 million in May 2014. Both parties also signed an agreement to pursue a joint venture in the business of e-commerce logistics. In 2018, SingPost chose to integrate AI-assisted route planning software from LogiNext into its logistics platform, dubbed LaMP. In October 2015, SingPost acquired a 96.3 per cent stake in TradeGlobal for US$168.6 million ([S$](/wiki/Singapore_dollar)210 million), thereby expanding its e-commerce footprint in the [United States](/wiki/United_States). SingPost also trialed a drone delivery system, using a commercial drone modified by a joint team from SingPost and [Infocomm Development Authority](/wiki/Infocomm_Media_Development_Authority) Labs. SingPost was fined S$100,000 in 2017 and S$300,000 in 2018 for failing to meet mail delivery standards by the [Infocomm Media Development Authority](/wiki/Infocomm_Media_Development_Authority). In March 2024, SingPost group announced the reorganisation of the company into three business units: Singapore, Australia and International. On the evening on 22 December, it was announced that CEO Vincent Phang was sacked together with two other senior executives over mishandling of whistleblower's report. The whistleblower reported that manual entries of delivery status codes by the international business unit were done without supporting documents to avoid paying contractual penalties to a customer. Phang and group chief financial officer Vincent Yik announced they would contest the decision by SingPost. In February 2025, SingPost [laid off](/wiki/Layoff) 45 employees as part of a \"restructuring\" exercise. In May, SingPost announced that it made a full year net profit of S$245.1 million (US$188 million) for its financial year that ended Mar 31, more than double of the previous year. The increase of profit is due to the sale of its Australia business Freight Management Holdings. ## Australia In 2014, SingPost's whole-owned subsidiary Quantium Solutions (Australia) acquired 100% of Couriers Please Holdings, an Australia-based last mile delivery company, from New Zealand Post Group. In December 2020, SingPost acquired a 28% stake in Freight Management Holdings (FMH), a leading 4th party logistics (4PL) service company in Australia. Its stake was increased to 51% in November 2021 and in January 2023 it acquired an additional 37% interest, bringing its total stake in FMH to 88%. During the reorganisation of SingPost in 2024, FMH , CouriersPlease and Border Express to be managed as a Australia unit. In December 2024, SingPost announced its plan to divest its Australian business, FMH, to private equity firm Pacific Equity Partners for a cash consideration of A$775.9 million (US$504.1 million). The sale was completed before March 2025. ## Mobile post office The Mobile Post Office was introduced in November 1952 and was operated by Postal Services Department. It provided on-the-spot postal services to residents living in rural areas where there were no post offices. The vans followed fixed routes and time schedules which were announced in the newspapers and each visit only lasted about one to two hours. As more postal facilities were set up across the island, the mobile post offices were used as temporary post offices while a permanent post office is being built. The mobile post office were withdrawn from service in 1980. ## POPDrop The POPDrop was introduced in 2023 as a replacement for its Self-service Automated Machines (SAMs). The first kiosk is located at the General Post Office at SingPost Centre in Paya Lebar. As of August 2025, there are 36 POPDrop kiosks. While similar to SAM, the POPDrop kiosk lacks a weighing scale. - [Postage stamps and postal history of Singapore](/wiki/Postage_stamps_and_postal_history_of_Singapore) - [Postal codes in Singapore](/wiki/Postal_codes_in_Singapore) - [List of national postal services#Asia](/wiki/List_of_national_postal_services#Asia) - Singapore Post Limited official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:57:57.856321",
  "title": "Singapore Post",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Post"
}