{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:33.229896"
  },
  "content": "Governing body of field hockey in SingaporeThis article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"Singapore Hockey Federation\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2022)* *(Learn how and when to remove this message)* The **Singapore Hockey Federation** is the [governing body](/wiki/Sports_governing_body) of [field hockey](/wiki/Field_hockey) in [Singapore](/wiki/Singapore). It is affiliated to IHF [International Hockey Federation](/wiki/International_Hockey_Federation) and AHF [Asian Hockey Federation](/wiki/Asian_Hockey_Federation). The headquarters of the federation are in [Singapore](/wiki/Singapore). Mathavan Devadas is the President of the Singapore Hockey Federation and Abdul Samad bin Mohamed Ismail is the General Secretary. ## History The history of field hockey in Singapore traces back to 1902 during British rule, during which the Royal Engineers introduced the sport at the Singapore Recreation Club. Eventually the Singapore Hockey Association was formed on 8 July 1931. The Association was formed under the auspices of Donald Hoblyn and the Police Sports Association. O.R.S Bateman was the first President of SHA. Later in 1939, the Singapore Women’s Hockey Association (SWHA) was also formed. The two associations merged in 1992 to form the Singapore Hockey Federation (SHF). The first competition was organised by SHA in the 1949/50 season. The [Singapore men's hockey team](/wiki/Singapore_men%27s_national_field_hockey_team) have participated at the Olympics in the (/wiki/Field_hockey_at_the_1956_Summer_Olympics) event at Melbourne where they finished at the 8th place. They won their only gold medal at the [1973 Southeast Asian Games](/wiki/1973_Southeast_Asian_Peninsular_Games) held at Singapore. - [Singapore men's national field hockey team](/wiki/Singapore_men%27s_national_field_hockey_team) - [Singapore women's national field hockey team](/wiki/Singapore_women%27s_national_field_hockey_team) - Singapore Hockey Federation This field hockey article is a stub. You can help Wikipedia by expanding it. - v - t - e This article about a sports-related organization is a stub. You can help Wikipedia by expanding it. This article about sports in Singapore is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:33.229511",
  "title": "Singapore Hockey Federation",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Hockey_Federation"
}