{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:54.173051"
  },
  "content": "The **Singapore Islamic Hub** ([Abbreviation](/wiki/Abbreviation): **SIH**; [Malay](/wiki/Malay_language): *Hab Islam Singapura*; [Jawi](/wiki/Jawi_alphabet): هاب اسلام سيڠاڤورا) is a religious campus that houses Masjid Muhajirin, [Madrasah Irsyad Zuhri Al-Islamiah](/wiki/Madrasah_Al-Irsyad_Al-Islamiah) and the headquarters of [Majlis Ugama Islam Singapura](/wiki/Majlis_Ugama_Islam_Singapura) (Muis). These institutions combined ([mosque](/wiki/Mosque), [madrasa](/wiki/Madrasa) and [majlis](/wiki/Majlis)) create a cohesive and symbiotic whole, embodies the Islamic principles of Iman, Ilmu and Amal (*Faith, Knowledge and Deeds*) respectively. ## History In the late 1970, it was the site of Masjid Muhajirin. Muis previously operated out of offices at Empress Place. In 1988, MUIS moved to a 6-story S$6.5 million office building known as the Islamic Centre of Singapore, next to Masjid Muhajirin. In 2006, the mosque was closed and both buildings were demolished and rebuilt to form the current Singapore Islamic Hub. Built at a cost of S$32 million, the campus was officially opened in July 2009, coinciding with the 40th anniversary of Muis. ### Muis Headquarters The tallest structure within the SIH campus, known as the \"Muis Building\", houses the headquarters of Muis. ## Masjid Muhajirin ### History Masjid Muhajirin was the first mosque to be built with the help of the Mosque Building Fund (MBF). Construction of the institution began in October 1975 and completed in April 1977, opened by Minister for Social Affairs at that time, the late [Othman Wok](/wiki/Othman_Wok). The original mosque featured an onion-shaped dome of the Persian-Indian architectural style atop its minaret, and also bore influences from traditional Minangkabau design. Due to the institution's rich history, the mosque is part of the Toa Payoh Heritage Trail. ### Architecture Though integrated with the other blocks of SIH, the design and architecture of the mosque building differs from the other blocks of SIH. The extensive usage of glass panels and aluminum grilles creates a contemporary architectural style blending with arabesque geometric motifs inspired by architectural styles from across the Islamic world include arches incorporated into its windows and external walls, as well as designs on its barricades with timber-coloured concrete roof supports. The double-tier pointed roof of the mosque also feature traditional Malay style ochre tiles. ## Madrasah Irsyad Zuhri Al-Islamiah ## Transportation The building is accessible from [Braddell MRT station](/wiki/Braddell_MRT_station).\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:54.172633",
  "title": "Singapore Islamic Hub",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Islamic_Hub"
}