{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:32.045589"
  },
  "content": "Association of publishers in Singapore The **Singapore Book Publishers Association** (SBPA) was incorporated in May 1968 with 22 company members, 14 of which were of [Singapore](/wiki/Singapore) origin. As of 1 July 2016 the association has 64 members engaged in a wide range of publishing, marketing and distribution activities. These are in the areas of educational [textbooks](/wiki/Textbooks), [children's books](/wiki/Children%27s_books), general and trade books, academic and scholarly publications, reference materials and some electronic publications. The main aims of the association are to encourage fair trade practices and maintain high standards of workmanship and service in the publishing business; to encourage the widest possible distribution of printed books in Singapore in particular and throughout the world in general; and to promote and protect, by all lawful means, the interests of the [publishers](/wiki/Publishers) in Singapore. At the AGM held on 11 May 2016, the following publishers were installed as members of the Executive Committee of the Singapore Book Publishers Association for the new two-year term 2016–2018: ## Members - AK Publishing Pte Ltd - Alkem Company (S) Pte Ltd - Alston Publishing House - APD Singapore - Armour Publishing - [Asiapac Books](/wiki/Asiapac_Books) (Official Website) - Art Square Creation (S) Pte Ltd - Banjo & Sons - Big Tree Edu Aids Consultancy - Bubbly Books Pte Ltd - Cannon International - [Cambridge University Press](/wiki/Cambridge_University_Press) - Candid Creation Publishing LLP - Casco Publications Pte Ltd - CCH Asia - Child Educational Co. - Copyright Licensing and Administration Society of Singapore Ltd (CLASS) - CSC Publishing - Editions Didier Millet - Educational Publishing House - [Elsevier](/wiki/Elsevier) Asia - Elm Tree Distributors - English Corner International - [Epigram Books](/wiki/Epigram_Books) - Experiences & Experiments Pte Ltd - FAN-Math Education - Hodder Education - [Institute of Southeast Asian Studies](/wiki/Institute_of_Southeast_Asian_Studies) - ilovereading.sg - JLB Publishing - [John Wiley & Sons](/wiki/John_Wiley_%26_Sons) (Asia) - [LexisNexis](/wiki/LexisNexis) - Lingzi Media - Magazines Express - Markono Print Media - MarketAsia Distributors - Marshall Cavendish Education - Marshall Cavendish International - McGraw-Hill Education (Asia) - Modern Montessori International - [Monsoon Books](/wiki/Monsoon_Books) - [NUS Press](/wiki/NUS_Press) - Pan Asia Publishing - Pansing Distribution - [Pearson Education](/wiki/Pearson_Education) Asia - Preston Corporation - Pustaka Nasional - Rank Books - Sage Publications Asia Pacific - Scholastic Books - Select Books - September 21 Enterprise - Shing Lee Publishers - Singapore Asia Publishers - Singapore Academy of Law - Academy Publishing - Spicers Paper - Springer Science+Business Media - Star Publishing - Success Publishing House - [Taylor & Francis](/wiki/Taylor_%26_Francis) Asia Pacific - Tech Publications - Tusitala Digital Publishing - Union Book Co. - [World Scientific](/wiki/World_Scientific) Publishing - Official website This Singaporean organisation article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:32.045306",
  "title": "Singapore Book Publishers Association",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Book_Publishers_Association"
}