{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:05.530490"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore Discovery Centre\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2014)* *(Learn how and when to remove this message)* The **Singapore Discovery Centre** (**SDC**) is an '[edutainment](/wiki/Edutainment)' and [tourist attraction](/wiki/Tourist_attraction) by the [Ministry of Defence of Singapore](/wiki/Ministry_of_Defence_(Singapore)) in [Jurong West](/wiki/Jurong_West), [Singapore](/wiki/Singapore). The centre includes exhibits which display [the history of Singapore](/wiki/History_of_Singapore) as well as an insight on the future. ## History In 1992, Heritage Technology Exhibition, a member of the Singapore Technologies Group, announced to build a centre to show Singapore's success. The centre was projected to cost SGD30 million and to be built within [SAFTI Military Institute](/wiki/SAFTI_Military_Institute) in Jurong. The center will have 10,000 square meters of exhibition space. SDC was opened on 24 October 1996. The centre was built beside SAFTI Military Institute at a cost of SGD70 million. It was officially opened on 23 November 1996. SDC closed for redevelopment from November 2004 to June 2006. The centre reopened on 18 July 2006 by then Minister for Defence, Mr Teo Chee Hean. ## Exhibits In its first phase it developed showing Singapore's recent history - living under the flags of Britain, Japan and Malaysia before becoming an independent nation. Milestones in that journey were picked out in a theatrical setting. 'Singapore Today' showed the vibrant life in late 20th century Singapore. Other galleries include mini-theaters showing the role of tactics and planning in everyday life and showcased the Singapore Armed Forces. Indoor exhibits include 'So Singapore Theatre, Gateway, Portals, Build it, Crisis Simulation Theatre, Harmony Circle etc. Outdoor exhibits includes a playground and the a display of aircraft. The Chief Exhibit Designer for the centre's creation is UK based Neal Potter. The centre was planned by Canadian company Lord Cultural Resources and the building was designed by mgt Architects from Australia. ### Outdoor exhibits The centre also has an outdoor exhibition of military hardware used by the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces). Permanent exhibits include an [AMX-13](/wiki/AMX-13) tank, [UH-1H](/wiki/UH-1H) helicopter and a [Skyhawk fighter jet](/wiki/Douglas_A-4_Skyhawk). ## Awards and recognition - Tripartite Committee on Work-Life Strategy, 2012 - Work-Life Achiever Award 2012 - Minister for Defence Award (MiDAs), 2013 - Inducted into the MiDAs League for a five-year tenure as advocates of national defence - Singapore Book of Records, 2020 - Longest Sheltered Walkway Fitted With Solar Panels - Singapore Good Design Award (SG Mark) – Interior Design, 2021 - Awarded for SDC’s Permanent Exhibits Gallery: Through the Lens of Time - NS Mark (Gold), 2021 - Official site\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:05.529931",
  "title": "Singapore Discovery Centre",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Discovery_Centre"
}