{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:58:54.104017"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore and the World Bank\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2017)* *(Learn how and when to remove this message)*The examples and perspective in this article **may not include all significant viewpoints**. Please improve the article or discuss the issue. *(June 2017)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* Singapore officially joined the [International Bank for Reconstruction and Development](/wiki/International_Bank_for_Reconstruction_and_Development) (IBRD) on August 3, 1966 after Singapore's independence from Malaysia. By 1975, [Singapore](/wiki/Singapore) received 14 total loans from the [World Bank](/wiki/World_Bank), 10 of these loans were used exclusively for infrastructure projects. Currently, Singapore is a member of World Bank Group Institutions including [International Bank for Reconstruction and Development](/wiki/International_Bank_for_Reconstruction_and_Development) (IBRD), [International Finance Corporation](/wiki/International_Finance_Corporation) (IFC), [Multilateral Investment Guarantee Agency](/wiki/Multilateral_Investment_Guarantee_Agency) (MIGA), [International Development Association](/wiki/International_Development_Association) (IDA), and the International Centre of Settlement of Investment Disputes (ICSID). ## Infrastructure Projects ### The Port of Singapore Expansion and Improvement Project The first infrastructure project was the expansion of the [Jurong](/wiki/Jurong) Harbour in Singapore. The objective of the project was to help establish new real estate and satellite cities surrounding the area. Estimated to cost S$14-million, the [Jurong Port](/wiki/Jurong_Port) was completed in 1966. During this time, it was estimated that about 200-300 jobs were created. Additionally, the harbour's expansion linked Singapore to international shipping lines. Upon completion, the Jurong Port had 5 deep-water berths, stretching a total of 9,000 feet. These deep-water berths allowed the deepest ships to dock in port to provide the city with cargo and raw materials. Additionally, the new berths helped increase port traffic significantly. The project was successful and, in 1969, the government began to draft new plans for the port. ## Current Agreements with the World Bank ### Singapore: First Infrastructure and Urban Development Hub In 2015, Singapore signed an agreement with the World Bank to establish the country as its first infrastructure and urban development hub. The operation will employ hundreds of new people over the next 2 years in both the World Bank and the private sector arms. The new hub will provide financing and services to developing economies with a focus on sustainable infrastructure and urban development. Projects on the public sector side will be dedicated to sustainable energy, transport, information and communications technology, public-private partnerships, trade and competitiveness, and urban development as well as the global infrastructure facility. ## Singapore and Sustainability Singapore is a member of the World Bank and it supports organizations including the Global Platform for Sustainable Cities. This organization is funded by the Global Environment Facility and it helps cities to understand how sustainable they currently are and what they can improve upon. The GPSC focuses on projects in cities such as responses to climate change as well as eco-friendly public transportation GSPC. Singapore also works towards sustainability in the world by exchanging information with the World Bank. This information exchange happened when the World Bank and Singapore’s Infrastructure Asia signed an MoU. Infrastructure Asia works on sustainability projects such as floating solar panels. There is also an MoU between the World Bank and Singapore’s Public Utilities Board. Singapore’s PUB is the country’s water agency and it responds to the threat of sea levels rising. The organization is committed to using water in a sustainable way and it urges people to not waste water. The PUB also works to keep water clean and avoid water pollution. Due to this partnership, the World Bank supports Singapore’s International Water Week for the years 2020, 2022, and 2024. Singapore’s International Water Week is to show how the city is managing its water supply and teach attendees how they can better manage their own water supplies. The World Bank also partners with Singapore’s World Cities Summit. The goal of the World Cities Summit is to teach its attendees about how they can tackle sustainability issues in cities committed to eco-friendly movements. Singapore’s Centre for Liveable Cities and the Urban Redevelopment Authority help organize Singapore’s World Cities Summit.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:58:54.103734",
  "title": "Singapore and the World Bank",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_and_the_World_Bank"
}