{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:54:38.231253"
  },
  "content": "Annual examination held in Singapore for secondary school students The **Singapore-Cambridge General Certificate of Education Ordinary Level** (or **Singapore-Cambridge GCE O-Level**) is a school qualification jointly conducted by the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) (MOE), [Singapore Examinations and Assessment Board](/wiki/Singapore_Examinations_and_Assessment_Board) (SEAB) and the [University of Cambridge Local Examinations Syndicate](/wiki/University_of_Cambridge_Local_Examinations_Syndicate) (UCLES), with exams taking place in [Singapore](/wiki/Singapore) annually. Students are graded in the bands ranging from A to F and each band has a respective grade point, a lower grade point indicates poor performance (e.g. A1 band equates to 1 grade point). The number at the end of each grade corresponds to the grade point that they receive (i.e. A1 = 1, A2 = 2, B3 = 3, B4 = 4, C5 = 5, C6 = 6, D7 = 7 E8 = 8, F9 = 9). To pass an individual O-Level subject, a student must score at least C6 (6 grade points) or above. The highest grade a student can attain is A1 (1 grade point). The Singapore-Cambridge General [Certificate](/wiki/Academic_certificate) of Education Ordinary Level (GCE O-Level) qualification was introduced in 1971. Despite the engagement of an identical examination board as a partnering authority, the Singapore-Cambridge GCE Ordinary Level has no relation to the [British GCSE qualification](/wiki/General_Certificate_of_Secondary_Education), having de-linked since 2006 when the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) (MOE) took over the management of its national examination. This is owing to the stark differences in the development of the respective education systems in the two countries. Nevertheless, the qualification is recognised internationally as equivalent to the [International General Certificate of Secondary Education](/wiki/International_General_Certificate_of_Secondary_Education) (IGCSE), taken by international candidates including Singaporean students who take the exam as private candidates, as well as the [General Certificate of Secondary Education](/wiki/General_Certificate_of_Secondary_Education) (GCSE) qualification taken by students in the [United Kingdom](/wiki/United_Kingdom). The examination is taken by secondary school students at the end of their fourth year (for [Express stream](/wiki/Secondary_education_in_Singapore)) or fifth year (for [Normal Academic stream](/wiki/Secondary_education_in_Singapore)), and is open to private candidates. Recent studies show that approximately 30,000 candidates take the Singapore-Cambridge GCE O-Level exams annually. In 2019, MOE announced that the last year of assessment for the Singapore-Cambridge GCE O-Levels will be in 2026. From 2027, all Secondary 4 (equivalent to Grade 10) students will sit for the new **Singapore-Cambridge Secondary Education Certificate (SEC)**, which combines the former O-Levels, NA-Levels and NT-Levels certificates into a single certificate. This is in alignment with the removal of streaming in secondary schools from 2024, which previously separated O-Level, NA-Level and NT-Level candidates into the Express Stream, Normal (Academic) Stream and Normal (Technical) Stream respectively, in efforts to improve social mobility within the country. ## Syllabus Examined subjects taken in [English](/wiki/English_language) and international languages are set and marked by the [University of Cambridge Local Examinations Syndicate](/wiki/UCLES) (UCLES), with the standards and grading for the subjects determined by SEAB and MOE in consultation with [Cambridge International Education](/wiki/Cambridge_International_Education) (CIE). Localised subjects, including Mother Tongue subjects such as Chinese, Malay and Tamil and Combined Humanities (Social Studies) are set, marked and graded locally by the [Singapore Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) (MOE). After the examination, standard papers (excluding the specified localised papers) are sent to [Cambridge Assessment International Examinations](/wiki/Cambridge_Assessment_International_Education) (CIE) board (in Britain) for marking. For localised papers, the personal details of the student are omitted with the use of the Integrated Examination System where bar-code labels are used. Local teachers would not be able to recognise scripts from students of his or her own school as the candidates' names are neither written on the papers nor printed on the labels, hence preventing malpractice of teachers. ## Grades Candidates are graded based on their performance relative to the cohort. A grade in one GCE exam subject consists of a number and an accompanying letter. In descending order of achievement, the grades are: A (1,2), B (3,4), C (5,6), D7, E8, and F9. This means students are graded in the bands from A to F, and each band is given a respective grade, higher or better the performance lower the respective grade, ie. A1 band has 1 grade point. Other respective grade points are A2 band = 2 grade points, B3 = 3, B4 = 4, C5 = 5, C6 = 6, D7 = 7, E8= 8, F9 = 9. A grade of C6 band (6 grade points) or better is considered an O-Level pass. Obtaining a pass in one or more subjects will lead to a Singapore-Cambridge General Certificate of Education (Ordinary Level). Candidates whose subject(s) are denoted as 'Absent'—should they be absent from any component(s) for the subject—will not have the subject listed on the certificate; this is likewise for those who obtain an F9, though it will appear on the result slip. The grades of the five or six subjects (depending on the scoring system used) taken are added to give an aggregate score known as L1R5 (one language subject and five relevant subjects), or EL1R2B2, which is a separate aggregate scoring system used for polytechnic admission. The score is calculated by adding up the numeral of each grade. For example, a candidate who scores a grade of A1 in six subjects will have an L1R5 score of six. ## Subjects Admission to Junior college is based on the results of L1R5 subjects, i e. One first language subject (L1) and 5 relevant subjects (R5). Students must achieve an L1R5 score of 20 or below to be eligible to enter Junior College. From 2028, students applying to Junior College will be admitted based on the results of their L1R4 subjects instead and will need an L1R4 score of 16 or below. ### Special and Express students All Special and Express stream students are required to take a minimum of six subjects, but are allowed to take up to a maximum of nine. Students who wish to take ten subjects must obtain permission from the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)). All Special and Express students must take the following subjects: - English Language, including listening comprehension and an oral examination - Mathematics - Mother Tongue, including listening comprehension and an oral examination (except for students taking NTIL and other non-mainstream languages) (Second Language or Literature may be taken by foreign students in lieu of Mother Tongue such as Japanese, Indonesian and Arabic) - Combined Humanities (Compulsory Social Studies with either Elective Geography, History or Literature in English, Chinese, Malay or Tamil). - Science (Physics, Chemistry, Biology) - Pure Science (includes a science practical exam for candidates); and/or - Combined Science (combinations of any two science subjects listed above, considered as one subject) #### Elective Subjects - Additional Mathematics - Principles of Accounts (POA) - Applied Subjects (Electronics, Computing, Drama and Exercise and Sports Science) - Nutrition and Food Science/ Food and Nutrition ( F&N) - Design and Technology - Art - Music - Applied Subjects (Biotechnology, Design Studies, Media Studies, Computer Science) (only for selected schools authorised to offer the subjects) - Pure Humanities (Geography, History, Literature in English/Chinese/Malay/Tamil) - Religious Knowledge (Bible Knowledge, Islamic Law) - Higher Mother Tongue - Foreign Languages (3rd Languages: Malay (Special Programme), Chinese (Special Programme), French, Spanish, German, Japanese, Arabic, Burmese, Thai, Indonesian) - Economics and Business Studies (only for selected schools authorised to offer the subject) ### Normal (Academic) students Students in the Normal (Academic) stream take four to seven subjects including: - English Language (includes listening comprehension and an oral examination) - Mathematics (Elementary Mathematics) - Mother Tongue (includes listening comprehension and an oral examination) (Second Language or Literature may be taken by foreign students in lieu of Mother Tongue such as Japanese, Indonesian and Arabic) - Combined Humanities (Compulsory Social Studies with either Elective Geography, History or Literature in English, Chinese, Malay or Tamil). - Combined Science (combinations of any two science subjects (Biology, Chemistry & Physics), considered as one subject) #### Elective Subjects - Additional Mathematics - Principles of Accounts - Design and Technology - Food and Nutrition - Art - Music - Foreign Languages (3rd Languages Malay, French, German, Japanese, Arabic, Burmese, Thai, Indonesian) ### English Language From 2023, students will be taking the new syllabus, Syllabus 1184. The key differences in the new syllabus include: - Paper 1, Continuous Writing: New content component in Section C - Paper 2, Visual Text Comprehension: Questions based on two texts instead of one - Paper 3, Listening Comprehension: Section on Stated/Implied removed, its 4 marks redistributed to the last 2 sections on note-taking - Paper 4, Oral: Reading Aloud removed, replaced by Planned Response.[*better source needed*] ### Mother Tongue The [Singapore Examinations and Assessment Board](/wiki/Singapore_Examinations_and_Assessment_Board) (SEAB) is the examining authority for Mother Tongue subjects. The Mother Tongue paper is different from the other papers, in that it includes a \"Mid-Year Examination\" for written papers (i.e. Papers 1 and 2), taken on the first Monday of the June school holidays. The Oral and Listening Comprehension papers are usually taken in July, and the results for Mother Tongue are subsequently released in August. However, the candidate may opt to re-take the paper in October/November along with the other papers that the candidate has registered for, though an additional fee is payable. The November re-assessment only covers the written examinations; no re-assessment is available for the Oral and Listening Comprehension component of the examination. The best result of the two assessments is reflected in the result slip which will be released in January the following year. In addition to the grade, it will also show the candidate's performance in the Oral/Aural Examination as Distinction (highest), Merit, Pass or Ungraded.[*citation needed*] With effect from 2007, the use of approved electronic handheld dictionaries in O-Level Mother Tongue and Higher Mother Tongue composition examinations (Paper 1) has been allowed. ### Social Studies Social Studies, the compulsory subject of the two components in Combined Humanities, is used as an implicit study of National Education. The last Social Studies syllabus for GCE N and O Level was revised in 2016. There are two sections in the national examination namely, Source-based Case Study (SBCS) and Structured Response Questions (SRQ). For the SBCS section, students are required to examine and evaluate sources pertaining to three Social Studies Issues (1) Governance and Citizenship (2) Living a Diverse Society (3) Being Part of a Globalised World. For the SRQ section, students are also required to offer suggestions to address societal concerns arising from the three issues. Apart from the government schools, specialised private institutions offers Social Studies lessons to help students develop knowledge and skills required to master the subject.[*citation needed*] ### School-based Science Practical Assessment Pure Science subjects (Physics, Chemistry and Biology) include the [School-based Science Practical Assessment (SPA)](/wiki/School-based_Science_Practical_Assessment_(SPA)_for_GCE_%27O%27_Level_in_Singapore) for school candidates. It assesses candidates' competence in science practical skills over an appropriate period of time that the candidates is offering the subject, and forms 20% of the overall mark for the subject. While the questions are set by the Ministry of Education, the assessment is scheduled, carried out and marked by the school before submitting the scripts to the MOE. The scores for the assessment are kept confidential and are never disclosed to the candidates. The assessment is grouped into three skill sets: Skill set 1 – Performing and Observing Skill set 2 – Analysing Skill set 3 – Planning Each candidate is to be assessed only twice for each of skill sets 1 and 2 and only once for skill set 3. In 2018, the revision of the O Level Science Syllabus resulted in the SPA Component being phased out and replaced by the previous one-time Practical Examinations again.[*better source needed*] ## List of subjects examined Sources: **Cambridge Subjects** Subject CodeSubjectLanguage mediumNotes1184[English Language](/wiki/English_Language)English1135Arabic as a 3rd LanguageArabicFor school candidates only.1136Bahasa Indonesia as a 3rd LanguageIndonesianFor school candidates only.Religious Studies (Bible Knowledge)EnglishNo longer examined by SEAB.2065[Literature in English](/wiki/Literature_in_English)English2174[History](/wiki/History)English2279[Geography](/wiki/Geography)English2267Combined HumanitiesEnglish2260Humanities (Social Studies, Geography)English2261Humanities (Social Studies, History)English2262Humanities (Social Studies, Literature in English)English2263Humanities (Social Studies, Literature in Chinese)EnglishLocal Subject2264Humanities (Social Studies, Literature in Malay)EnglishLocal Subject2265Humanities (Social Studies, Literature in Tamil)EnglishLocal Subject3917[French](/wiki/French_language)French3918[German](/wiki/German_language)German3034[Spanish](/wiki/Spanish_language)SpanishFor school candidates only.[Arabic](/wiki/Arabic)ArabicNo longer examined by SEAB.3194[Hindi](/wiki/Hindi)Hindi3196[Urdu](/wiki/Urdu)Urdu3199[Gujarati](/wiki/Gujarati_language)Gujarati3203[Panjabi](/wiki/Panjabi_language)Panjabi3215[Bengali](/wiki/Bengali_language)Bengali3249[Burmese](/wiki/Burmese_language)Burmese3260[Thai](/wiki/Thai_language)Thai3919[Japanese](/wiki/Japanese_language)Japanese4052[Mathematics](/wiki/Mathematics)English5086Science (Physics, Chemistry)English5087Science (Physics, Biology)English5088Science (Chemistry, Biology)English6063[Electronics](/wiki/Electronics)EnglishNew subject from 2018. For school candidates only.6085[Music](/wiki/Music)EnglishFor school candidates only.6086Higher MusicEnglishFor school candidates only.6097Nutrition And Food ScienceEnglishFor school candidates only.6081Exercise And Sports ScienceEnglishLocal Subject6091[Physics](/wiki/Physics)EnglishRevised syllabus from 2018.6092[Chemistry](/wiki/Chemistry)EnglishRevised syllabus from 2018.6093[Biology](/wiki/Biology)EnglishRevised syllabus from 2018.6123[Art](/wiki/Art)EnglishFor school candidates only. Last year of exam in 2025. 6124Higher ArtEnglishFor school candidates only. Last year of exam in 2025. 7059Design and TechnologyEnglishFor school candidates only.7155[Computing](/wiki/Computing)EnglishNew subject from 2018. For school candidates only.4049Additional MathematicsEnglishNew syllabus from 2021 for 4 Express and future 5 Normal Academic students.7087Principles of AccountsEnglishNew syllabus from 2021 for 4 Express and 5 Normal Academic students. The change is to the response format for Paper 2. The new response format requires candidates to write their answers on the question paper. **O-Level School Initiated Elective (OSIE) Cambridge Subjects** Subject CodeSubjectLanguage mediumNotes2286[Economics](/wiki/Economics)EnglishThe subject is applicable only for candidates from schools approved to offer the subject.2299[Drama](/wiki/Drama)EnglishFor school candidates only.6767[Physical Education](/wiki/Physical_Education)EnglishNo longer examined by SEAB.7085Business StudiesEnglishThe subject is applicable only for candidates from schools approved to offer the subject. **Applied Subjects** Subject CodeSubjectLanguage mediumNotesNP04[Biotechnology](/wiki/Biotechnology)EnglishFor school candidates only.NP05Design StudiesEnglishFor school candidates only. **Note**: The above Applied Subjects are applicable only for candidates from schools approved to offer the subjects. Candidates registering for Applied Subjects will be charged subject fees cited by the examining agencies. **Local Subjects Examined in Chinese** Subject CodeSubjectLanguage mediumNotes1116Higher ChineseChineseLocal Subject1153Chinese BChineseChinese B is not an O-Level subject.1160[Chinese](/wiki/Chinese_language)ChineseLocal Subject1166Chinese (Special Programme)ChineseLocal Subject2031Literature in ChineseChineseLocal Subject **Local Subjects Examined in Malay** Subject CodeSubjectLanguage mediumNotes1117Higher MalayMalayLocal Subject1133Malay (Special Programme)MalayLocal Subject1148[Malay](/wiki/Malay_language)MalayLocal Subject1151Malay BMalayMalay B is not an O-Level subject. Local Subject Islamic Religious KnowledgeMalayNo longer examined by SEAB.2238Literature in MalayMalayRevised syllabus from 2018. Local Subject **Local Subjects Examined in Tamil** Subject CodeSubjectLanguage mediumNotes1147Higher TamilTamilLocal Subject1152Tamil BTamilTamil B is not an O-Level subject. Local Subject 1157[Tamil](/wiki/Tamil_language)TamilLocal Subject2033Literature in TamilTamilLocal Subject - [Secondary education in Singapore](/wiki/Secondary_education_in_Singapore) - [Integrated Programme](/wiki/Integrated_Programme) - [General Certificate of Secondary Education](/wiki/General_Certificate_of_Secondary_Education) - [General Certificate of Education](/wiki/General_Certificate_of_Education) - [International General Certificate of Secondary Education](/wiki/International_General_Certificate_of_Secondary_Education) - [Singapore-Cambridge GCE Advanced Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) - [List of CIE Ordinary Level subjects](/wiki/List_of_CIE_Ordinary_Level_subjects) - [Singapore-Cambridge GCE Normal Level](/wiki/Singapore-Cambridge_GCE_Normal_Level) - Singapore-Cambridge GCE O-Level on the SEAB website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:54:38.230847",
  "title": "Singapore-Cambridge GCE Ordinary Level",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore-Cambridge_GCE_Ordinary_Level"
}