{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:57:00.396096"
  },
  "content": "Organization to promote kindness in Singapore The **Singapore Kindness Movement** is a non-government, non-profit organisation, a registered charity and an Institution of Public Character that executes public education programs aimed at cultivating kindness and graciousness in [Singaporean](/wiki/Singapore) society. It was officially launched in 1997. The movement serves as the successor to the Singapore Courtesy Council that oversaw the [National Courtesy Campaign (Singapore)](/wiki/National_Courtesy_Campaign_(Singapore)) from the 1980s through the 1990s. ## History The Singapore Kindness Movement (SKM) was initiated in response to former Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong)’s call to Singaporeans to develop into a more caring and gracious society in the new century. In his 1996 New Year’s address, stated \"We have become a [developed economy](/wiki/Developed_country) because we put our minds to it and strive hard to reach our goals. Let us now complement our economic achievements with social, cultural, and spiritual development. Then by the 21st century, Singapore will be a truly successful, mature country, with a developed economy and a gracious society.\" PM Goh announced the SKM pilot project in July 1996, when he launched the Singapore Courtesy Campaign. Some 2,000 students from the uniformed groups in 20 secondary schools participated in the pilot project. The Movement was launched in January 1997, to over 80,000 secondary school students. SKM was officially registered as a non-profit society on 31 January 1997. In March 2001, the National Courtesy Campaign was subsumed by the Movement. Singapore Kindness Movement was the secretariat of the World Kindness Movement from 2003-2012. ## Vision and Mission Vision: A kind and gracious Singapore Mission: To build a gracious Singapore by creating public awareness for acts of kindness and inspiring them, as well as influencing and raising standards for behaviour and responsibility. Its main objectives are: To encourage all Singaporeans to be more kind and considerate. To enhance public awareness of acts of kindness. To influence and raise the standards of social behaviour in our society. ## Structure The SKM organisational structure consists of two main parts: The SKM Council (SKMC) and the SKM Secretariat. The SKM Council comprises members from the private and public sectors. The Movement is supported by the [Ministry of Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth) and funded by a government grant. SKM also secures funds through sponsorships. The patron of the Movement is Prime Minister [Lawrence Wong](/wiki/Lawrence_Wong) and the current Chairperson is Ms Junie Foo. The adviser for the Movement is Mr David Neo, Acting Minister for Culture, Community and Youth and Senior Minister of State, Ministry of Education. ## Logo, mascot and icon Logo: The two strokes and ovals of the Singapore Kindness Movement logo depicts two people—one who does an act of kindness and the other who receives it. The freehand strokes combine to form a heart. Red symbolises love for your fellow man and green represents caring for the environment, tolerance, creativity, and consideration. Mascot: Singa has been the official mascot of the Singapore Kindness Movement. His look has been refreshed since 2014 and is now known as *Singa the Kindness Lion.* Yellow Gerbera Daisy: The Yellow Gerbera daisy is a symbol of appreciation that has become synonymous with the notion of kindness and appreciation in Singapore and with the Singapore Kindness Movement. ## Focus areas - Gracious Living & Online Graciousness - Character Education & Parenting - Shared Public Spaces - Singapore Kindness Movement Website - The Pride Website - Hood Champions Website - Kindsville Website - Seed Kindness Fund Website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:57:00.395710",
  "title": "Singapore Kindness Movement",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Kindness_Movement"
}