{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:00:55.350571"
  },
  "content": "* *Singaporeans for Democracy (SfD)** was a [Singapore](/wiki/Singapore) based [human rights](/wiki/Human_rights) [non-governmental organization](/wiki/Non-governmental_organization) formed in 2010 by activist-academic Dr [James Gomez](/wiki/James_Gomez_(politician)) and several seasoned socio-political activists. The SFD objective was to advocate for political and social reform in Singapore, as well as fostering a multi-partisan civil and political platform to promote [democracy](/wiki/Democracy) within Singapore and abroad. Members of SfD voted to dissolve the organization during their Annual General Meeting in April 2012, with a dissolution request submitted to Singapore's Registry of Societies in June 2012. ## History Singaporeans for Democracy was mooted by several Singapore activists who sought to bring their own networks and resources to a broader NGO platform for democracy advocacy and activism in early 2009. The process of registering the organisation was then revealed during a public gathering in January 2010 by activist and academic [James Gomez](/wiki/James_Gomez_(politician)). During another public forum in January 2010, the organisation revealed its pro-tem committee and released more updates on the organisation's registration which had been delayed by Singapore's Registry of Societies since April 2009. Singaporeans for Democracy was officially gazetted as a political association by the Registry of Societies (Singapore) in February 2010. In April 2012, members of SfD voted to dissolve the organization during their Annual General Meeting. A dissolution request was submitted to Singapore's Registry of Societies in June 2012. According to SfD, the process of dissolution was to draw attention to legislation that hindered its work as a political action group in Singapore. ## Work SfD maintained its advocacy of a multi-partisan approach to work with NGO and political parties that share a similar ideal to further democracy. Although SFD was a Singapore-based organisation, its leadership stressed on the importance of developing links and maintaining solidarity with foreign NGOs and organisations at the regional and global level. Singaporeans for Democracy had also been involved in civil and political rights campaigns in Singapore. Some of the key campaigns that were synonymous with SfD are: - Election Reform in Singapore - Freedom of Expression, Assembly and Association. - Removing of the Race Column in Singapore NRICs Singaporeans for Democracy also organized Singapore's first Freedom Film Festival in November 2010, as well as the subsequent Freedom Film Festival in October 2011. ## Organization SFD's leadership remained the same throughout the thirty months of its existence from January 2010 till June 2012. The post of Executive Director was held by Dr [James Gomez](/wiki/James_Gomez_(politician)), while the position of Executive Secretary was held by filmmaker [Martyn See](/wiki/Martyn_See). Other key activists that were associated with Singaporeans for Democracy include:- - Seelan Palay – social political activist and artist - Rachel Zeng – socio-political activist involved with the Singapore Anti Death Penalty Campaign - Ho Choon Hiong - filmmaker and socio-political activist - This article about [law](/wiki/Law) in Asia is a stub. You can help Wikipedia by expanding it. - v - t - e This [human rights](/wiki/Human_rights)–related article is a stub. You can help Wikipedia by expanding it. - v - t - e This Singaporean organisation article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:00:55.350165",
  "title": "Singaporeans for Democracy",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singaporeans_for_Democracy"
}