{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:59:50.136594"
  },
  "content": "Period of Singapore History (1826–1942)Part of a series on the[History of Singapore](/wiki/History_of_Singapore)[Early history](/wiki/Early_history_of_Singapore) (pre-1819)[Srivijaya](/wiki/Srivijaya)650–1377[Temasek](/wiki/Temasek), [Long Ya Men](/wiki/Long_Ya_Men), [Ban Zu](/wiki/Ban_Zu)c.14th century[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)1299–1398[Majapahit](/wiki/Majapahit)1398–1400[Malacca Sultanate](/wiki/Malacca_Sultanate)1400–1528[Johor Sultanate](/wiki/Johor_Sultanate)1528–1819British colonial era (1819–1942)[Founding](/wiki/Founding_years_of_modern_Singapore)1819–1826Straits Settlements1826–1867Crown colony1867–1942[Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) (1942–1945)[Fall of Singapore](/wiki/Fall_of_Singapore)1942[Sook Ching](/wiki/Sook_Ching)1942[Double Tenth incident](/wiki/Double_Tenth_incident)1943[Post-war period](/wiki/Colony_of_Singapore) (1945–1962)[First Legislative Council](/wiki/History_of_Singapore#First_Legislative_Council_(1948–1951))1948–1951[Maria Hertogh riots](/wiki/Maria_Hertogh_riots)1950[Second Legislative Council](/wiki/History_of_Singapore#Second_Legislative_Council_(1951–1955))1951–1955[Anti-National Service Riots](/wiki/1954_National_Service_riots)1954[Internal self-government](/wiki/Self-governance_of_Singapore) (1955–1963)[Hock Lee bus riots](/wiki/Hock_Lee_bus_riots)1955[Singapore Glass Factory strikes](/wiki/Singapore_Glass_Factory_strikes)1960[Pulau Senang prison riots](/wiki/Pulau_Senang_prison_riots)1963[Merger with Malaysia](/wiki/History_of_the_State_of_Singapore_(Malaysia)) (1963–1965)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)1962[Operation Coldstore](/wiki/Operation_Coldstore)1963[Race riots in Singapore](/wiki/1964_race_riots_in_Singapore)1964[MacDonald House bombing](/wiki/MacDonald_House_bombing)1965[Republic of Singapore](/wiki/History_of_the_Republic_of_Singapore) (1965–present)[ASEAN Declaration](/wiki/ASEAN_Declaration) ([ASEAN](/wiki/Association_of_Southeast_Asian_Nations))1967[1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore)1969[Laju incident](/wiki/Laju_incident)1974[Operation Spectrum](/wiki/Operation_Spectrum)1987[Asian financial crisis](/wiki/1997_Asian_financial_crisis#Singapore)1997[Embassies attack plot](/wiki/Singapore_embassies_attack_plot)2001[H1N1 pandemic](/wiki/2009_swine_flu_pandemic_in_Asia#Singapore)2009–2010[Bus drivers' strike](/wiki/2012_Singapore_bus_drivers%27_strike)2012[Little India riot](/wiki/2013_Little_India_riot)2013[2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit)2018[COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore)2020–2022By topic - [Timeline](/wiki/Timeline_of_Singaporean_history) - [Riots](/wiki/List_of_riots_in_Singapore) - [Military](/wiki/Military_history_of_Singapore) Singapore portal - v - t - e [Singapore](/wiki/Singapore) was part of the [Straits Settlements](/wiki/Straits_Settlements) between 1826 and 1942, together with [Penang](/wiki/Penang) and [Malacca](/wiki/Malacca). Singapore was the [capital](/wiki/Capital_city) and the [seat of government](/wiki/Seat_of_government) of the Straits Settlements after it had been moved from [George Town](/wiki/George_Town,_Penang) in 1832. From 1830 to 1867, the Straits Settlements was a residency, or subdivision, of the [Presidency of Bengal](/wiki/Bengal_Presidency), in [British India](/wiki/British_India). In 1867, the Straits Settlements became a separate [Crown colony](/wiki/Crown_colony), directly overseen by the [Colonial Office](/wiki/Colonial_Office) in [Whitehall](/wiki/Whitehall) in London. The period saw Singapore establish itself as an important trading port and developed into a major city with a rapid increase in population. The city remained as the capital and seat of government until British rule was suspended in February 1942, when the [Imperial Japanese Army](/wiki/Imperial_Japanese_Army) [invaded Singapore](/wiki/Battle_of_Singapore) during [World War II](/wiki/World_War_II). Following the war, it was officially replaced by the [Colony of Singapore](/wiki/Colony_of_Singapore) in 1946. ## Beginning of British rule in Singapore In 1819, the British official, [Stamford Raffles](/wiki/Stamford_Raffles), landed in Singapore to [establish a trading port](/wiki/Founding_years_of_modern_Singapore). The island's status as a British outpost was initially in doubt, as the [Dutch government](/wiki/Batavian_Republic) soon issued bitter protests to the British government, arguing that their sphere of influence had been violated. The British government and the [East India Company](/wiki/East_India_Company) were initially worried about the potential liability of this new outpost, but that was soon overshadowed by Singapore's rapid growth as an important trading post. By 1822, it was made clear to the Dutch that the British had no intention of giving up the island.[*citation needed*] The status of Singapore as a British possession was cemented by the [Anglo-Dutch Treaty of 1824](/wiki/Anglo-Dutch_Treaty_of_1824), which carved up the Malay archipelago between the two colonial powers. The area north of the [Straits of Malacca](/wiki/Straits_of_Malacca), including [Penang](/wiki/Penang), [Malacca](/wiki/Malacca) and Singapore, was designated as the British sphere of influence, while the area south of the Straits was assigned to the Dutch. This division had far-reaching consequences for the region: modern-day [Malaysia](/wiki/Malaysia) and Singapore correspond to the British area established in the treaty, and modern-day [Indonesia](/wiki/Indonesia) to the Dutch. In 1826, Singapore was grouped together with Penang and Malacca into a single administrative unit, the [Straits Settlements](/wiki/Straits_Settlements), under the administration of the [East India Company](/wiki/East_India_Company). ## Residency of Bengal Presidency (1830–1867) In 1830, the Straits Settlements became a residency, or subdivision, of the [Presidency of Bengal](/wiki/Bengal_Presidency), in [British India](/wiki/British_India). This status continued until 1867. ### Trade and economy During the subsequent decades, Singapore grew to become one of the most important ports in the world. Several events during this period contributed to its success. British intervention in the Malay peninsula from the 1820s onwards culminated, during the 1870s, in the formation of [British Malaya](/wiki/British_Malaya). During this period, Malaya became an increasingly important producer of [natural rubber](/wiki/Natural_rubber) and [tin](/wiki/Tin), much of which was shipped out through Singapore. Singapore also served as the administrative centre for Malaya until the 1880s, when the capital was shifted to [Kuala Lumpur](/wiki/Kuala_Lumpur). In 1834, the British government ended the East India Company's monopoly on the China trade, allowing other British companies to enter the market and leading to a surge in shipping traffic. The trade with China was opened with the signing of the [Unequal Treaties](/wiki/Unequal_Treaties_(China)), beginning in 1842. The advent of ocean-going [steamships](/wiki/Steamboat), which were faster and had a larger capacity than [sailing ships](/wiki/Sailing_ship), reduced transportation costs and led to a boom in trade. Singapore also benefited by acting as a coaling station for the [Royal Navy](/wiki/Royal_Navy) and merchant ships. The opening of the [Suez Canal](/wiki/Suez_Canal) in 1869 dramatically reduced the travel time from Europe to East Asia, again providing a boost for trade. By 1880, over 1.5 million tons of goods were passing through Singapore each year, with around 80% of it transported by steamships and trading ships. The main commercial activity was [entrepôt](/wiki/Entrep%C3%B4t) trade which flourished under no taxation and little restriction. Many merchant houses were set up in Singapore mainly by European trading firms, but also by Jewish, Chinese, Arab, Armenian, American and Indian merchants. There were also many Chinese middlemen who handled most of the trade between the European and Asian merchants. ### Civil service Despite Singapore's growing importance, the administration set up to govern the island was generally understaffed, poorly funded, weak, and ineffectual. Administrators were usually posted from India with little or no knowledge of the region, and were unfamiliar with local languages and customs of the people. As long as British trade was not affected, the administration was unconcerned with the welfare of the populace. While Singapore's population had quadrupled between 1830 and 1867, the size of the civil service in Singapore had remained unchanged. In 1850 there were only twelve police officers to keep order in a city of nearly 60,000. Most people had no access to public health services, and diseases such as [cholera](/wiki/Cholera) and [smallpox](/wiki/Smallpox) caused severe health problems, especially in overcrowded working-class areas. Malnutrition and opium-smoking were major social woes during this period. ### Society As early as 1827, the Chinese had become the largest ethnic group in Singapore. During the earliest years of the settlement, most of the Chinese in Singapore had been [Peranakans](/wiki/Peranakans), the descendants of Chinese who had settled in the archipelago centuries ago, who were usually well-to-do merchants. As the port developed, much larger numbers of Chinese [coolies](/wiki/Coolie) flocked to Singapore looking for work. These [migrant workers](/wiki/Migrant_worker) were generally male, poor and uneducated, and had left [China](/wiki/Qing_dynasty) (mostly from southern China) to escape the political and economic disasters in their country. They aspired to make their fortune in [Southeast Asia](/wiki/Southeast_Asia) and return home to China, but most were doomed to a life of low-paying unskilled labour. Until the 20th century, few Chinese ended up settling permanently, primarily because wives were in short supply. The sex ratio in Singapore's Chinese community was around hundred to one, mainly due to restrictions that the Chinese government imposed, up until the 1860s, on the migration of women. [Malays](/wiki/Malay_people) in Singapore were the second largest ethnic group in Singapore until the 1860s. Although many of the Malays continued to live in [kampungs](/wiki/Kampung), or the traditional Malay villages, most worked as wage earners and craftsmen. This was in contrast to most Malays in Malaya, who remained farmers. By 1860, Indians became the second largest ethnic group. They consisted of unskilled labourers like the Chinese coolies, traders, soldiers garrisoned at Singapore by the government in [Calcutta](/wiki/Calcutta), as well as a number of Indian convicts who were sent to Singapore to carry out public works projects, such as clearing jungles and swampy marshes and laying out roads. They also helped construct many buildings, including [St. Andrew's Cathedral](/wiki/St._Andrew%27s_Cathedral,_Singapore), and many Hindu temples. After serving their sentences, many convicts chose to stay in Singapore. As a result of the administration's hands-off attitude and the predominantly male, transient, and uneducated nature of the population, the society of Singapore was rather lawless and chaotic. [Prostitution](/wiki/Prostitution_in_Singapore), gambling, and [drug abuse](/wiki/Drug_abuse) (particularly of opium) were widespread. Chinese criminal [secret societies](/wiki/Secret_societies_in_Singapore) (analogous to modern-day [triads](/wiki/Triad_society)) were extremely powerful; some had tens of thousands of members, and turf wars between rival societies occasionally led to death tolls numbering in the hundreds. Attempts to suppress these secret societies had limited success, and they continued to be a problem well into the 20th century. The colonial division of the [architecture of Singapore](/wiki/Architecture_of_Singapore) developed in this period, recognisable elements which remain today in the form of [shophouses](/wiki/Shophouse), such as those found in Little India or Chinatown. ## Crown colony (1867–1942) As Singapore continued to grow, the deficiencies in the Straits Settlements administration became increasingly apparent. Apart from the indifference of British India's administrators to local conditions, there was immense bureaucracy and red tape which made it difficult to pass new laws. Singapore's merchant community began agitating against British Indian rule, in favour of establishing Singapore as a separate colony of Britain. The British government finally agreed to make the Straits Settlements a [Crown colony](/wiki/Crown_colony) on 1 April 1867, receiving orders directly from the Colonial Office rather than from India. As a Crown Colony, the Straits Settlements was ruled by a governor, based in Singapore, with the assistance of [executive](/wiki/Executive_Council_(Commonwealth_countries)) and [legislative councils](/wiki/Legislative_Council_of_the_Straits_Settlements). Although the councils were not elected, more representatives for the local population were gradually included over the years. ### Chinese protectorate The colonial government embarked on several measures to address the serious social problems facing Singapore. For example, a [Chinese Protectorate](/wiki/Chinese_Protectorate) under [Pickering](/wiki/William_Pickering_(Singapore)) was established in 1877 to address the needs of the Chinese community, including controlling the worst abuses of the coolie trade and protecting Chinese women from forced prostitution. In 1889 Governor Sir [Cecil Clementi Smith](/wiki/Cecil_Clementi_Smith) banned [secret societies in colonial Singapore](/wiki/Secret_societies_in_colonial_Singapore), driving them underground. Nevertheless, many social problems persisted up through the post-war era, including an acute housing shortage and generally poor health and living standards. ### Tongmenghui In 1906, the [Tongmenghui](/wiki/Tongmenghui), a revolutionary Chinese organisation dedicated to the overthrow of the [Qing dynasty](/wiki/Qing_dynasty) led by [Sun Yat-Sen](/wiki/Sun_Yat-Sen), founded its [Nanyang](/wiki/Nanyang_(geographical_region)) branch in Singapore, which was to serve as the organisation's headquarters in Southeast Asia. The [Tongmenghui](/wiki/Tongmenghui) would eventually be part of several groups that took part in the [Xinhai Revolution](/wiki/Xinhai_Revolution) and established the [Republic of China](/wiki/Republic_of_China_(1912%E2%80%931949)). Overseas Chinese like the immigrant Chinese population in Singapore donated generously to groups like the Tongmenghui, which would eventually evolve into the [Kuomintang](/wiki/Kuomintang). Today, this founding is commemorated in the [Sun Yat Sen Nanyang Memorial Hall](/wiki/Sun_Yat_Sen_Nanyang_Memorial_Hall) - previously known as Sun Yat Sen Villa or Wang Qing Yuan (meaning \"House of the Heavens above\" in Chinese) - in Singapore where the branch operated from. According to [George Yeo](/wiki/George_Yeo), the Foreign Minister of Singapore, in those days the Kuomintang party flag, which later became the [flag of the Republic of China](/wiki/Flag_of_the_Republic_of_China), was sewn in the Sun Yat Sen Villa by Teo Eng Hock and his wife. ### 1915 Singapore Mutiny Singapore was not directly affected by the [First World War](/wiki/World_War_I) (1914–18), as the conflict did not spread to Southeast Asia. The most significant event during the war was a [mutiny in 1915](/wiki/1915_Singapore_Mutiny) by [sepoys](/wiki/Sepoys) of the [5th Light Infantry](/wiki/5th_Light_Infantry) from British India who were garrisoned in Singapore. On the day before the regiment was due to depart for Hong Kong, and hearing rumours that they were to be sent to fight the [Ottoman Empire](/wiki/Ottoman_Empire), about half of the Indian soldiers mutinied. They killed several of their officers and some civilians before the mutiny was suppressed by British Empire and allied forces plus local troops from [Johore](/wiki/Johore). ### Singapore in the 1920s and 1930s This is how [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), its Prime Minister for 32 years, described Singapore: I grew up in a Singapore of the 1920s and 1930s. The population was less than a million and most of Singapore was covered by mangrove swamps, rubber plantations, and secondary forest because rubber had failed, and forests around Mandai/Bukit Timah took its place. In these early decades, the island was riddled with [opium](/wiki/Opium) houses and [prostitution](/wiki/Prostitution), and came to be widely monikered as \"Sin-galore\" ### Naval base After the [First World War](/wiki/World_War_I), the British government devoted significant resources to building a [naval base](/wiki/Singapore_Naval_Base) in Singapore, as a deterrent to the increasingly ambitious [Japanese Empire](/wiki/Empire_of_Japan). Originally announced in 1923, the construction of the base proceeded slowly until the [Japanese invasion of Manchuria](/wiki/Japanese_invasion_of_Manchuria) in 1931. When completed in 1939, at the very large cost of $500 million, the base boasted what was then the largest [dry dock](/wiki/Dry_dock) in the world, the third-largest [floating dock](/wiki/Floating_dock_(jetty)), and having enough fuel tanks to support the entire British navy for six months. It was defended by heavy 15-inch naval guns stationed at [Fort Siloso](/wiki/Fort_Siloso), [Fort Canning](/wiki/Fort_Canning) and Labrador, as well as a [Royal Air Force](/wiki/Royal_Air_Force) airfield at [Tengah Air Base](/wiki/Tengah_Air_Base). [Winston Churchill](/wiki/Winston_Churchill) touted it as the \"[Gibraltar](/wiki/Gibraltar) of the East\" and military discussions often referred to the base as simply \"[East of Suez](/wiki/East_of_Suez)\" The base did not have a fleet. The [British Home Fleet](/wiki/British_Home_Fleet) was stationed in Europe, and the British could not afford to build a second fleet to protect its interests in Asia.[*citation needed*] The so-called [Singapore strategy](/wiki/Singapore_strategy) called for the Home Fleet to sail quickly to Singapore in the event of an emergency. However, after [World War II](/wiki/World_War_II) broke out in 1939, the fleet was fully occupied with defending Britain, and only the small [Force Z](/wiki/Force_Z) was sent to defend the colony. People in Singapore who held German identify papers, including Jews fleeing the Nazis such as [Karl Duldig](/wiki/Karl_Duldig), [Slawa Duldig](/wiki/Slawa_Duldig), and [Eva Duldig](/wiki/Eva_Duldig), were arrested and deported from Singapore. The British colonial government classified them as \"citizens of an enemy country\". - [Secret societies in colonial Singapore](/wiki/Secret_societies_in_colonial_Singapore) Library resources about **Singapore in the Straits Settlements** - Resources in your library - Resources in other libraries - Firaci, Biagio (10 June 2014). \"Sir Thomas Stamford Raffles and the British Colonization of Singapore among Penang, Melaka and Bencoonen\".\n",
  "language": "en",
  "processed_at": "2026-01-12T11:59:50.136267",
  "title": "Singapore in the Straits Settlements",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_in_the_Straits_Settlements"
}