{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:07.389935"
  },
  "content": "The **SAF Merit Scholarship** (**Women**) is a scholarship introduced in 1993 by the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) (MINDEF) to attract young Singaporean women who aspire to become combat officers in the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF). ## Requirements The scholarship is awarded to a selected group of women each year who had displayed outstanding [A-Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) results and leadership qualities. Potential candidates for this scholarship are put through [basic military training](/wiki/Basic_military_training) and [officer cadet](/wiki/Officer_Cadet) training for assessment of their suitability for military career. Those awarded the scholarship are groomed for senior command and management positions in the SAF upon their return from overseas undergraduate studies. The scholarship is one of the most prestigious scholarships that are offered to young women in [Singapore](/wiki/Singapore). Since its inception, the scholarship has been awarded to more than 40 women. The pioneer group of recipients includes Gan Siow Huang, Goh Jerica, Adeline Heng and Toh Jiao Ming. Like their male counterparts, they lead men and manage technologically advanced equipment in the SAF. ## History In 2010, one of the pioneer group recipients, [Gan Siow Huang](/wiki/Gan_Siow_Huang), was promoted to the rank of Colonel. In 2015, Gan was promoted to the rank of Brigadier-General, making her the first female [general](/wiki/General) in the SAF. This makes her the first female air force officer to be promoted to the Colonel rank. She was the highest-ranking female officer in the Singapore Armed Forces until March 2020, when she entered politics. This article **needs additional or more specific categories**. Please help out by adding categories to it so that it can be listed with similar articles. *(December 2025)* This Asian [military](/wiki/Military) article is a stub. You can help Wikipedia by expanding it. - v - t - e This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:07.389451",
  "title": "Singapore Armed Forces Merit Scholarship (Women)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Armed_Forces_Merit_Scholarship_(Women)"
}