{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:57:25.854551"
  },
  "content": "Singapore National Academy of Science (SNAS) is an academic institution in Singapore dedicated to promoting the advancement of science and technology, promoting academic exchanges, and recognizing scholars who have made outstanding achievements in the field of natural sciences. SNAS was established in 1976 as an umbrella organization to coordinate the activities of multiple scientific societies in Singapore and represent the Singaporean scientific community in international academic affairs. ## History The origins of SNAS can be traced back to the 1960s, when Singapore had just gained independence in 1965 and urgently needed to lay the foundation for national development through science, technology and education. During this period, the Singapore government and academia recognized the strategic importance of science and technology, especially in promoting industrialization and economic transformation. In 1967, an academic group with the goal of promoting science popularization and academic exchanges was initially formed to integrate the resources of Singapore scientists and enhance public interest in science. This group laid the foundation for the later SNAS. In 1975, Dr. Lee Siew Meng, then Minister of Education of Singapore, proposed to reorganize SNAS into a federation of societies to more effectively represent the interests of Singapore scientists. In 1976, SNAS was officially established and became the core institution for coordinating the scientific community in Singapore. Since 2011, SNAS has begun to select academicians to honor outstanding individuals who have made outstanding achievements in the field of science. Academicians are divided into three categories: academicians, foreign academicians and honorary academicians, covering fields such as physics, biology, engineering and environmental sciences. Candidates are nominated by scientific associations, universities or current academicians, and are voted on by academicians after rigorous review. The total number of candidates does not exceed 100, and no more than 10 new candidates are awarded each year. These scientists contribute their wisdom to Singapore's scientific research, teaching and policies, and promote scientific progress and social development. - https://snas.org.sg 1°20′00″N 103°44′01″E﻿ / ﻿1.3333°N 103.7335°E﻿ / 1.3333; 103.7335 This Singaporean organisation article is a stub. You can help Wikipedia by expanding it. - v - t - e This [government agency](/wiki/Government_agency)–related article is a stub. You can help Wikipedia by expanding it.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:57:25.854216",
  "title": "Singapore National Academy of Science",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_National_Academy_of_Science"
}