{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:57:18.654514"
  },
  "content": "Singapore mathematics competition The **Singapore Mathematical Olympiad** (**SMO**) is a mathematics competition organised by the [Singapore Mathematical Society](/wiki/Singapore_Mathematical_Society) since 1956. It comprises three sections, Junior, Senior and Open, each of which is open to all pre-university students studying in Singapore who meet the age requirements for the particular section. The competition is held annually, and the first round of each section is usually held in late May or early June. The second round is usually held in late June or early July. The Junior section includes concepts from the secondary 1 and 2 curriculum and is open to lower secondary students, the Senior section includes concepts from the [Singapore GCE ordinary level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) curriculum and is open to upper secondary students, the Open section includes concepts from the [Singapore GCE advanced level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) curriculum and is open to students not yet attending university full-time. Some additional concepts are also included (see respective sections below). Calculators are not allowed in the SMO. ## History The Singapore Mathematical Society (SMS) has been organising mathematical competitions since the 1950's, launching the first inter-school Mathematical Competition in 1956. The Mathematical Competition was renamed to Singapore Mathematical Olympiad in 1995. In 2016, the SMS attempted to make the SMO more inviting to students by aligning questions more closely with school curriculum, although solutions still require considerable insight and creativity in addition to sound mathematical knowledge. In 2020 and 2021, the written round (Round 1) in all sections were postponed to September due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic), while the invitational round (Round 2) in all sections were cancelled. The normal competition timeline was resumed in 2022. ## Junior Section There are two rounds in the Junior Section: a written round (Round 1) and a special round (Round 2). The paper in Round 1 comprises 5 multiple-choice questions, each with five options, and 30 short answer questions until 2017. From 2018 onwards, The paper has 20 short answer questions instead. The Junior section is geared towards Lower Secondary students, and topics tested include number theory, combinatorics, geometry, algebra, and probability. Beginning in 2006, a second round was added, based on the Senior Invitational Round, in the form of a 5-question, 3-hour long paper requiring full-length solutions. Only the top 10% of students from Round 1 are eligible to take Round 2. ## Senior Section There are two rounds in the Senior Section: a written round (Round 1) and an invitational round (Round 2). The paper in Round 1 comprises 5 multiple-choice questions, each with five options, and 20 short answer questions. The Senior section is geared towards Upper Secondary students, and topics tested include number theory, combinatorics, geometry, algebra, and probability. The second round, the Senior Invitational Round consists of a 5-question, 4-hour long paper requiring full-length solutions. Only the top 10% of students from Round 1 are eligible to take Round 2. ## Open Section Similar to the Senior Section, there are also two rounds, a written round (Round 1) and an invitational round (Round 2). The paper in Round 1 comprises 25 short answer questions, and is geared towards pre-university students. Topics tested include number theory, combinatorics, geometry, algebra, calculus (occasionally), probability, but of a higher difficulty level than the Senior Section. The Open Invitational Round consists of a 5-question, 4-hour long paper requiring full-length solutions, in which only the top scorers of Round 1 are invited to take. This test will help determine the individual rankings of the scorers, and in addition, it acts as a guideline to select Singaporean or Permanent Resident participants for the National Team training team, whereby a further six will then be selected for the [International Mathematical Olympiad](/wiki/International_Mathematical_Olympiad). ## Ranking and Prizes Since 2006, in each of the Junior, Senior and Open sections, prizes are awarded to the 30 individuals with the highest total scores in the first and second rounds. 2020 and 2021 were exceptions, where prizes were only given to the top 13 individuals due to the cancellation of the second round. School awards are given in 2 categories, Cat 1 and Cat 2, based on the achievements of students in the Junior and Senior (for Cat 1), and Open (for Cat 2) sections. Schools may receive gold, silver, bronze or participation, in decreasing order of merit. In addition, the Singapore Mathematical Challenge Trophy is awarded to the school with the highest total score of the best 3 individual scores in the Junior, Senior and Open sections. The above prizes take the form of cash awards, certificates displaying the individual's/team's ranking, as well as trophies. Individuals who do not place in the top 30 may also receive gold, silver, bronze, honourable mentions or participation, in decreasing order of merit. - [List of mathematics competitions](/wiki/List_of_mathematics_competitions) - [International Mathematics Olympiad](/wiki/International_Mathematics_Olympiad) - Singapore and Asian Schools Math Olympiad (SASMO) Since 2006. - SIMOC - IJMO - Singapore Mathematical Society Competition Page\n",
  "language": "en",
  "processed_at": "2026-01-12T11:57:18.654215",
  "title": "Singapore Mathematical Olympiad",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Mathematical_Olympiad"
}