{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:00:10.574850"
  },
  "content": "Foiled terrorism plot against two mosques The **Singapore mosque attacks plot** was a plan by a [far-right](/wiki/Far-right_politics) extremist to commit two [Islamophobic](/wiki/Islamophobia) terrorist attacks at two Singaporean mosques on 15 March 2021, the two-year anniversary of the [Christchurch mosque shootings](/wiki/Christchurch_mosque_shootings). The plot was uncovered in late November 2020 by the [Internal Security Department](/wiki/Internal_Security_Department_(Singapore)), who arrested a 16-year-old Indian Singaporean Protestant youth under the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)) (ISA). The perpetrator reportedly expressed [anti-Islamic views](/wiki/Islamophobia) and was inspired by the actions of Brenton Tarrant, the Christchurch mosque shooter. The suspect is the youngest person and the first far-right extremist to be detained under the ISA. ## Background ### The suspect According to the [Internal Security Department](/wiki/Internal_Security_Department_(Singapore)) (ISD), the suspect was a 16-year-old [Protestant Christian](/wiki/Protestantism) of [Indian ancestry](/wiki/Singaporean_Indians) who was motivated by [Islamophobia](/wiki/Islamophobia) and fascinated with violence. After watching several [ISIL](/wiki/Islamic_State_of_Iraq_and_the_Levant) propaganda videos including one showing the execution of Ethiopian Christians, the suspect came to believe that ISIL represented [Islam](/wiki/Islam) and that Islam called on its followers to kill non-Muslims. The suspect was also influenced by the 2019 [Christchurch mosque shooter](/wiki/Christchurch_mosque_shootings) Brenton Tarrant, having read his manifesto \"The Great Replacement\" and watched a livestream video of the terror attacks on the [Al Noor Mosque](/wiki/Al_Noor_Mosque,_Christchurch) and [Linwood Islamic Centre](/wiki/Linwood_Islamic_Centre) in [Christchurch](/wiki/Christchurch). Following the [Nice stabbing](/wiki/2020_Nice_stabbing) on 29 October 2020, he became convinced that an attack by Muslims on Christians was imminent. ### Radicalisation According to the government of Singapore's [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)), the boy had watched the livestream of the [Christchurch attack](/wiki/Christchurch_attack), and read the [Australian terrorist](/wiki/Terrorism_in_Australia)'s manifesto, and he was the first in Singapore to be radicalised by a far-right ideology. He had also watched videos from ISIS that reinforced his distorted view of Muslims and Islam. A press release from their [Internal Security Department](/wiki/Internal_Security_Department_(Singapore)) stated that as a result of the ISIS propaganda the youth \"came to the erroneous conclusion that ISIS represented Islam, and that Islam called on its followers to kill non-believers\". ### Planning and manifestos Following the [2020 Nice stabbing](/wiki/2020_Nice_stabbing), the suspect began making detailed plans to attack two mosques on 15 March 2021, the second anniversary of the Christchurch mosque shootings. After initially considering the An-nur Mosque, the suspect selected the [Yusof Ishak Mosque](/wiki/Masjid_Yusof_Ishak) in [Woodlands](/wiki/Woodlands,_Singapore) due to its proximity to the Assyafaah Mosque in [Sembawang](/wiki/Sembawang). According to the ISD, the suspect conducted online research and reconnaissance using Google Maps and Street View on both mosques to prepare for the attacks. Despite not having a driving license, he intended to obtain a car for driving between the two targets. Following Tarrant's example, the suspect bought a tactical vest from internet auction website [Carousell](/wiki/Carousell_(company)) in November 2020, which he intended to strap a mobile device for livestreaming his attacks. He also tried to purchase a gun via the messaging platform [Telegram](/wiki/Telegram_(software)) but abandoned it after suspecting a scam. The suspect also admitted that his plans to obtain firearms were thwarted by Singapore's strong gun control laws. The suspect also explored building a [Triacetone Triperoxide](/wiki/Acetone_peroxide) bomb but abandoned it due to logistical and personal safety concerns. Finally, the suspect settled on a [Smith & Wesson](/wiki/Smith_%26_Wesson) machete on [Carousell](/wiki/Carousell_(company)) but was not able to purchase it prior to his arrest. The suspect also prepared two documents which he intended to disseminate prior to his attacks. The first document was a message to the people of France in response to the 2015 Paris attacks and the 2020 Nice stabbing which advocated conflict against Muslims. The second document was an uncompleted manifesto outlining his hatred for Islam and rejection of [pacifism](/wiki/Pacifism). The suspect expressed hope that his actions would challenge those who believed that [Islamic extremism](/wiki/Islamic_extremism) was right. He also praised Tarrant (the perpetrator of the Christchurch attacks) as a \"saint\" and described the Christchurch attacks as a \"justifiable killing of Muslims.\" ## Arrest, investigation, and detention In November 2020, the [Internal Security Department](/wiki/Internal_Security_Department_(Singapore)) received intelligence about a Singapore-based individual who wanted to attack Muslims in Singapore. The suspect was arrested under the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)) on 26 November and subsequently issued with a detention order on 23 December after being deemed to pose an \"imminent security threat.\" The youth was the youngest person and first far-right extremist to be detained under the ISA. Due to his young age, the teenager's mother was present during the interview and he was allowed visits during the 30-day investigation period. During the course of the ISD's investigation, the suspect admitted that he could only foresee two outcomes to his plan: that he was arrested before he could carry out the attacks or that he executed his plan and was killed by the [Singapore Police](/wiki/Singapore_Police). The suspect also told investigators that he was prepared to die for his cause. The ISD's investigation concluded that the suspect did not try to influence anyone with his \"extreme outlook\" or recruit others into his attack plot. His immediate family and others within his social circle were unaware of his attack plans and anti-Islamic views. In late January 2021, Singaporean [Minister for Law](/wiki/Minister_for_Law_(Singapore)) and [Minister for Home Affairs](/wiki/Minister_for_Home_Affairs_(Singapore)) [K. Shanmugam](/wiki/K._Shanmugam) ruled out prosecuting the suspect in a court of law, arguing that the court proceedings would inflame communal tensions. He also said that Muslims arrested for potential terrorism offenses under the ISA were also not charged in court. Based on the current rehabilitative approach towards Islamist terrorism suspects detained under the ISA, Shanmugan and the ISD indicated that the suspect would undergo holistic programme consisting of religious, psychological and social rehabilitation including counselling to address his propensity violence and extremist views. In January 2024, the youth was released from detention after spending almost three years in detention. ## Media coverage and reactions Singaporean authorities first disclosed the case to the news media and public on 27 January 2021. Home Affairs Minister K. Shanmugam also discussed details of the mosque attacks plot and investigation during a press conference. In addition, the Singapore mosque attacks plot was covered by several international media including [Al Jazeera](/wiki/Al_Jazeera_Media_Network), [ABC News](/wiki/ABC_News_(Australia)), [BBC News](/wiki/BBC_News), *[The Courier-Mail](/wiki/The_Courier-Mail)*, *[The Hindu](/wiki/The_Hindu)*, *[The New Zealand Herald](/wiki/The_New_Zealand_Herald)*, and the *[South China Morning Post](/wiki/South_China_Morning_Post)*. Following media coverage of the mosque attacks plot, staff at the targeted Assyafaah Mosque and Yusof Ishak Mosque tightened patrols. Though worshippers continued to visit mosques on Thursday, many were hesitant to bring their children. The [Islamic Religious Council of Singapore](/wiki/Islamic_Religious_Council_of_Singapore) issued a statement that the case highlighted the threat of online radicalization, and condemned acts of terror and violence \"which have no place in any religion.\" Security studies Professor [Rohan Gunaratna](/wiki/Rohan_Gunaratna) stated that Singaporean Muslims trusted the Singapore Government to protect them from threats and warned that governments needed to deal with the growing threat of terrorism on cyberspace. The [National Council of Churches of Singapore](/wiki/National_Council_of_Churches_of_Singapore) condemned the actions of the suspect as unrepresentative of the Christian faith and teachings and also affirmed their commitment to peaceful relations with the Singaporean Muslim community. In addition, several Singaporean Christian bodies including the [Catholic Church](/wiki/Catholic_Church_in_Singapore), the [Methodist Church](/wiki/Methodist_Church_in_Singapore), the Alliance of Pentecostal and Charismatic Churches of Singapore (APCCS), and the [Heart of God Church](/wiki/Heart_of_God_Church) (HOGC) issued statements condemning violence and extremism and expressing solidarity with the Muslim community.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:00:10.574476",
  "title": "Singapore mosque attacks plot",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_mosque_attacks_plot"
}