{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:56.088246"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore Jewellery Design Award\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2012)* *(Learn how and when to remove this message)*The topic of this article **may not meet Wikipedia's general notability guideline**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Singapore Jewellery Design Award\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2012)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* The **Singapore Jewellery Design Award** is a [competition](/wiki/Competition) among [art school](/wiki/Art_school) students, initiated by the [Singapore](/wiki/Singapore) Jewellery association (SJA). The SJDA provides an opportunity for the winning designs to be manufactured into [jewellery](/wiki/Jewellery) pieces to be marketed and sold. The contest is divided into three major categories. After a preliminary round, the top 30 designs proceed to the final round and compete for the winning position. Winning designs are showcased at the Singapore International Jewellery show. In 2018, the award was held during the Singapore Jewellery and Gem Fair. ## Winners 2017 - Growing With Singapore - Category A: Heirloom (Past) - Marisa Chow, Nanyang Academy of Fine Arts (NAFA), Singapore - Category B: Racial Harmony (Present) - Hans Daniel V. De Castro, University of the Philippines (Diliman), The Philippines - Category C: Future of Us (Future) - Li Chih Tung, Taiwan Jewellery Arts Institute, Taiwan \"Singapore Jewelry and Gem Fair 2016: Shine Brighter than the Stars\". Retrieved 13 March 2019. - Official website - Diamond prices in Singapore - Jewelry Mmnufacturers This [award](/wiki/Award)-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:56.087905",
  "title": "Singapore Jewellery Design Award",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Jewellery_Design_Award"
}