{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:44.103788"
  },
  "content": "International arbitration organisation **Singapore International Arbitration Centre** (SIAC) is a not-for-profit [international arbitration](/wiki/International_arbitration) organisation based in Singapore, which administers arbitrations under its own rules of arbitration and the [UNCITRAL](/wiki/UNCITRAL) Arbitration Rules. It was established on 1 July 1991 and is located at [Maxwell Chambers](/wiki/Maxwell_Chambers), formerly the Customs House. SIAC arbitration awards have been enforced in many jurisdictions including Australia, China, Hong Kong SAR, India, Indonesia, Jordan, Thailand, UK, USA and Vietnam, amongst other New York Convention signatories. SIAC is a global arbitral institution providing case management services to parties from all over the world. SIAC was ranked by lists as the top arbitral institution in the world. ## History SIAC was established on 1 July 1991 as an independent, not-for-profit organisation in [Singapore](/wiki/Singapore). ## Rules ### SIAC Arbitration Rules SIAC publishes its own rules for commercial arbitrations, which it regularly updates. The current rules in force are the \"Arbitration Rules of the Singapore International Arbitration Centre SIAC Rules 7th Edition, 1 January 2025\". ### Investment Arbitration Rules of the Singapore International Arbitration Centre The 1st edition of the Investment Arbitration Rules of the Singapore International Arbitration Centre (1st Edition, 1 January 2017) (SIAC IA Rules 2017) is a specialised set of rules to address the unique issues present in the conduct of international investment arbitration. The SIAC IA Rules 2017 are effective as from 1 January 2017. This Singaporean organisation article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:44.103268",
  "title": "Singapore International Arbitration Centre",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_International_Arbitration_Centre"
}