{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:59:56.448218"
  },
  "content": "Pedagogy emphasizing problem-solving mastery **Singapore math** (or **Singapore maths** in [British English](/wiki/British_English)) is a teaching method based on the national mathematics curriculum used for first through sixth grade in Singaporean schools. The term was coined in the [United States](/wiki/United_States) to describe an approach originally developed in Singapore to teach students to learn and master fewer mathematical concepts at greater detail as well as having them learn these concepts using a three-step learning process: concrete, pictorial, and abstract. In the concrete step, students engage in hands-on learning experiences using physical objects which can be everyday items such as paper clips, toy blocks or math manipulates such as counting bears, link cubes and fraction discs. This is followed by drawing pictorial representations of mathematical concepts. Students then solve mathematical problems in an abstract way by using numbers and symbols. The development of Singapore math began in the 1980s when [Singapore](/wiki/Singapore)'s [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) developed its own mathematics textbooks that focused on problem solving and developing thinking skills. Outside Singapore, these textbooks were adopted by several schools in the [United States](/wiki/United_States) and in other countries such as [Canada](/wiki/Canada), [Israel](/wiki/Israel), the [Netherlands](/wiki/Netherlands), [Indonesia](/wiki/Indonesia), [Chile](/wiki/Chile), [Jordan](/wiki/Jordan), [India](/wiki/India), [Pakistan](/wiki/Pakistan), [Thailand](/wiki/Thailand), [Malaysia](/wiki/Malaysia), [Japan](/wiki/Japan), [South Korea](/wiki/South_Korea), the [Philippines](/wiki/Philippines) and the [United Kingdom](/wiki/United_Kingdom). Early adopters of these textbooks in the U.S. included parents interested in [homeschooling](/wiki/Homeschooling) as well as a limited number of schools. These textbooks became more popular since the release of scores from international education surveys such as [Trends in International Mathematics and Science Study](/wiki/Trends_in_International_Mathematics_and_Science_Study) (TIMSS) and [Programme for International Student Assessment](/wiki/Programme_for_International_Student_Assessment) (PISA), which showed Singapore at the top three of the world since 1995. U.S. editions of these textbooks have since been adopted by a large number of [school districts](/wiki/School_district#United_States) as well as [charter](/wiki/Charter_schools_in_the_United_States) and [private schools](/wiki/Private_schools). ## History Before the development of its own mathematics textbooks in the 1980s, Singapore imported its mathematics textbooks from other countries. In 1981, the Curriculum Development Institute of Singapore (CDIS) (currently the Curriculum Planning and Development Division) began to develop its own mathematics textbooks and curriculum. The CDIS developed and distributed a textbook series for [elementary schools](/wiki/Primary_school) in Singapore called *Primary Mathematics*, which was first published in 1982 and subsequently revised in 1992 to emphasize problem solving. In the late 1990s, the country's Ministry of Education opened the elementary school textbook market to private companies, and [Marshall Cavendish](/wiki/Marshall_Cavendish), a local and private publisher of educational materials, began to publish and market the *Primary Mathematics* textbooks. Following Singapore's curricular and instructional initiatives, dramatic improvements in math proficiency among Singaporean students on international assessments were observed. TIMSS, an international assessment for math and science among fourth and eighth graders, ranked Singapore's fourth and eighth grade students first in mathematics four times (1995, 1999, 2003, and 2015) among participating nations. Likewise, the [Organisation for Economic Co-operation and Development](/wiki/Organisation_for_Economic_Co-operation_and_Development) (OECD)'s [Programme for International Student Assessment](/wiki/Programme_for_International_Student_Assessment) (PISA), a worldwide study of 15-year-old school students' scholastic performance in mathematics, [science](/wiki/Science), and [reading](/wiki/Reading_(process)), has ranked Singaporean students first in 2015, and second after [Shanghai](/wiki/Shanghai), [China](/wiki/China) in 2009 and 2012. Since the TIMSS publication of Singapore's high ranking in mathematics, professional mathematicians in the U.S. took a closer look at Singapore mathematics textbooks such as *Primary Mathematics*. The term *Singapore math* was originally coined in the U.S. to describe the teaching approach based on these textbooks. In 2005, the [American Institutes for Research](/wiki/American_Institutes_for_Research) (AIR) published a study, which concluded that U.S. schools could benefit from adopting these textbooks. The textbooks were already distributed in the U.S. by Singapore Math, Inc., a private venture based in Oregon. Early users of these textbooks in the U.S. included parents interested in [homeschooling](/wiki/Homeschooling) as well as a limited number of schools. They became more popular since the release of the TIMSS scores showing Singapore's top ranking. As of 2004, U.S. versions of Singapore mathematics textbooks were adopted in over 200 U.S. schools. Schools and counties that had adopted these textbooks reported improvements in their students' performance. Singapore math textbooks were also used in schools from other countries such as [Canada](/wiki/Canada), [Israel](/wiki/Israel), [the Philippines](/wiki/The_Philippines) and the [United Kingdom](/wiki/United_Kingdom). ## Features ### Covers fewer topics in greater depth Compared to a traditional U.S. math curriculum, Singapore math focuses on fewer topics but covers them in greater detail. Each semester-level Singapore math textbook builds upon prior knowledge and skills, with students mastering them before moving on to the next grade. Students, therefore, need not re-learn these skills at the next grade level. By the end of sixth grade, Singapore math students have mastered multiplication and division of fractions and can solve difficult multi-step word problems. In the U.S., it was found that Singapore math emphasizes the essential math skills recommended in the 2006 Focal Points publication by the [National Council of Teachers of Mathematics](/wiki/National_Council_of_Teachers_of_Mathematics) (NCTM), the 2008 final report by the National Mathematics Advisory Panel, and the proposed [Common Core State Standards](/wiki/Common_Core_State_Standards_Initiative), though it generally progresses to topics at an earlier grade level compared to U.S. standards. ### Three-step learning process Singapore math teaches students mathematical concepts in a three-step learning process: concrete, pictorial, and abstract. This learning process was based on the work of an American psychologist, [Jerome Bruner](/wiki/Jerome_Bruner). In the 1960s, Bruner found that people learn in three stages by first handling real objects before transitioning to pictures and then to symbols. The Singapore government later adapted this approach to their math curriculum in the 1980s. The first of the three steps is concrete, wherein students learn while handling objects such as chips, dice, or paper clips. Students learn to count these objects (e.g., paper clips) by physically lining them up in a row. They then learn basic [arithmetic operations](/wiki/Arithmetic#Arithmetic_operations) such as [addition](/wiki/Addition) or [subtraction](/wiki/Subtraction) by physically adding or removing the objects from each row. Students then transition to the pictorial step by drawing diagrams called \"bar-models\" to represent specific quantities of an object. This involves drawing a rectangular bar to represent a specific quantity. For instance, if a short bar represents five paper clips, a bar that is twice as long would represent ten. By visualizing the difference between the two bars, students learn to solve problems of addition by adding one bar to the other, which will, in this instance, produce an answer of fifteen paper clips. They can use this method to solve other mathematical problems involving subtraction, [multiplication](/wiki/Multiplication), and [division](/wiki/Division_(mathematics)). Bar modeling is far more efficient than the \"guess-and-check\" approach, in which students simply guess combinations of numbers until they stumble onto the solution. Once students have learned to solve mathematical problems using bar modeling, they begin to solve mathematical problems with exclusively abstract tools: numbers and symbols. ### Bar modeling Bar modeling is a pictorial method used to solve [word problems](/wiki/Word_problem_(mathematics_education)) in [arithmetic](/wiki/Arithmetic). These bar models can come in multiple forms such as a whole-part or a comparison model. With the whole-part model, students would draw a rectangular bar to represent a \"whole\" larger quantity, which can be subdivided into two or more \"parts.\" A student could be exposed to a word problem involving addition such as: *If John has 70 apples and Jane has 30 apples, how many apples do they both have?* The solution to this problem could be solved by drawing one bar and dividing it into two parts, with the longer part as 70 and the shorter part as 30. By visualizing these two parts, students would simply solve the above word problem by adding both parts together to build a whole bar of 100. Conversely, a student could use whole-part model to solve a subtraction problem such as 100 - 70, by having the longer part be 70 and the whole bar be 100. They would then solve the problem by inferring the shorter part to be 30. The whole-part model can also be used to solve problems involving multiplication or division. A multiplication problem could be presented as follows: *How much money would Jane have if she saved $30 each week for 4 weeks in a row?* The student could solve this multiplication problem by drawing one bar to represent the unknown answer, and subdivide that bar into four equal parts, with each part representing $30. Based on the drawn model, the student could then visualize this problem as providing a solution of $120. Unlike the whole-part model, a comparison model involves comparing two bars of unequal lengths. It can be used to solve a subtraction problem such as the following: *John needs to walk 100 miles to reach his home. So far, he has walked 70 miles. How many miles does he have left to walk home?* By using the comparison model, the student would draw one long bar to represent 100 and another shorter bar to represent 70. By comparing these two bars, students could then solve for the difference between the two numbers, which in this case is 30 miles. Like the whole-part model, the comparison model can also be used to solve word problems involving addition, multiplication, and division. - [Common Core State Standards Initiative](/wiki/Common_Core_State_Standards_Initiative) - [Mathematics education](/wiki/Mathematics_education) - [Programme for International Student Assessment](/wiki/Programme_for_International_Student_Assessment) - [Trends in International Mathematics and Science Study](/wiki/Trends_in_International_Mathematics_and_Science_Study) - BBC (December 2, 2013). \"Can the Singapore method help your children learn maths?\". BBC. Archived from the original on December 3, 2013. - Jackson, B. \"Singapore Math Demystified!\". The Daily Riff. Retrieved September 20, 2013.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:59:56.447900",
  "title": "Singapore math",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_math"
}