{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:00:53.027522"
  },
  "content": "People of SingaporeEthnic group **Singaporeans** are the [citizens](/wiki/Citizenship_of_Singapore) of the [island](/wiki/Island_country) [city-state](/wiki/City-state) of [Singapore](/wiki/Singapore). Singapore is home to a people of a variety of origins, with the city-state itself being a [multi-racial](/wiki/Multiracialism) and [multi-cultural](/wiki/Multiculturalism) country. Singaporeans of [Chinese](/wiki/Chinese_Singaporeans), [Malay](/wiki/Malay_Singaporeans), [Indian](/wiki/Indian_Singaporeans) and [Eurasian](/wiki/Eurasians_in_Singapore) descent have made up the overwhelming majority of the population since the 19th century. The Singaporean diaspora is also far-reaching worldwide. In 1819, the [port of Singapore](/wiki/Port_of_Singapore) was established by [Stamford Raffles](/wiki/Stamford_Raffles), who opened Singapore as an [entrepôt](/wiki/Entrep%C3%B4t) on the [southern coasts](/wiki/City_of_Singapore_(historical_entity)). Over the decades, many [immigrants](/wiki/Immigration_to_Singapore) from the region settled in Singapore. By 1827, the population of the island was composed of people from various ethnic groups. The Singaporean identity was fostered to help different groups integrate and identify collectively with the nation, while preserving the culture and traditions of each community without forcing minority cultures to [assimilate](/wiki/Cultural_assimilation) into a single majority culture. According to a 2017 survey by the [Institute of Policy Studies](/wiki/Institute_of_Policy_Studies_(Singapore)), 49% of Singaporeans identify with both the Singaporean identity and their ethnic identity equally, while 35% would identify as \"Singaporeans\" first and 14.2% would identify with their ethnic identity. As of 2025, the total population of Singaporeans stands at 3,660,700 and the population of [overseas Singaporeans](/wiki/Overseas_Singaporean) stands at 221,600. ## Overview ### Early years The earliest records of settlement on the island date back to the 2nd century, where the island was identified as a trading port which was part of a chain of similar trading centres that linked [Southeast Asia](/wiki/Southeast_Asia) with the [Tamils](/wiki/Tamils) in [South Asia](/wiki/South_Asia) and the [Mediterranean](/wiki/Mediterranean) in [Europe](/wiki/Europe). The earliest settlers of the island were known as the [Orang Laut](/wiki/Orang_Laut), and the island was an outpost of the [Srivijaya Empire](/wiki/Srivijaya_Empire) until it was [invaded](/wiki/Chola_invasion_of_Srivijaya) by the [Tamil](/wiki/Tamil_people) Emperor [Rajendra Chola I](/wiki/Rajendra_Chola_I) of the [Chola Empire](/wiki/Chola_Empire) in the 11th century. According to the 19th century Chinese record *Investigation of Southern Pacific* (南洋蠡測) (Nanyang Li Ce), it described the presence of Chinese tombs in Singapore. Words and inscriptions recording the period of [Later Liang](/wiki/Later_Liang_(Five_Dynasties)) and [Emperor Gong of Song](/wiki/Emperor_Gong_of_Song) were found on these tombs and this may suggest that from the 8th to 13th centuries, some Chinese had settled, lived, died and were buried in Singapore. A small [Malay](/wiki/Malay_world) polity, known as the [Kingdom of Singapura](/wiki/Kingdom_of_Singapura), was founded in 1299 by a fleeing Srivijayan prince, [Sang Nila Utama](/wiki/Sang_Nila_Utama), who was crowned as the [Raja](/wiki/Raja) of the new state. It was largely [Hindu](/wiki/Hindu)–[Buddhist](/wiki/Buddhist). After the fall of the kingdom in 1398, the island fell under the suzerainty of the [Majapahit](/wiki/Majapahit) and subsequently the [Malacca Sultanate](/wiki/Malacca_Sultanate) until its destruction by [Portuguese raiders](/wiki/Portuguese_presence_in_Asia) in 1613. Afterwards, Singapore fell into obscurity from the 17th to 18th centuries. Prior to the arrival of Raffles in 1819, there were about a hundred indigenous Malays living on the island under the [Johor Sultanate](/wiki/Johor_Sultanate). Most of the indigenous Malays came from the [Malay Archipelago](/wiki/Malay_Archipelago). There were an estimated 150 people living on the island, who were predominantly the [Orang Laut](/wiki/Orang_Laut) with small population of 120 Malays who were the followers of Temenggong Abdul Rahman, and about 20 to 30 Chinese. ### Modern Singapore The majority of Singaporeans today are descendants of immigrants who settled on the island when Singapore was founded as a [British trading port](/wiki/British_colony) by Raffles in 1819, except for the Malays who are indigenous to the region of Malaya. At that time, Raffles decided Singapore would be a [free port](/wiki/Free_port) and as news of the free port spread across the archipelago, [Bugis](/wiki/Bugis), [Javanese](/wiki/Javanese_people), [Peranakan Chinese](/wiki/Peranakan), [South Asian](/wiki/South_Asians) and [Hadhrami Arab](/wiki/Hadhrami_people) traders flocked to the island, due to the Dutch trading restrictions. After six months of Singapore's founding as a free port, the population increased to 5,000, with the first census of 1824 showing that 6,505 out of the 10,683 total were Malays and Bugis settlers. Within the first few months of becoming a British settlement, a large number of Chinese migrants also started to settle on the island. In 1825, the population of the island had passed the ten thousand mark and by the census of 1826, there were more Chinese with a population of 6,088, as compared to 4,790 Malays excluding the Bugis and Javanese. By 1871, due to the influx of migrants from [Malaya](/wiki/Malay_Peninsula), China, India and other parts of Asia, Singapore's population had reached nearly 100,000, with over half of them being Chinese. Many of these early migrants were predominantly male and they would usually return to their home countries after they had earned enough money. By the early to mid twentieth century, an increasingly significant number of migrant workers chose to stay permanently, with their descendants forming the bulk of Singapore's population today. In 1957, Singapore attained self-governance and Singaporean citizenship was granted to selected residents who were born in Singapore or the [Federation of Malaya](/wiki/Federation_of_Malaya), British citizens who had been resident for two years, and others who had been resident for ten years. On September 16, 1963, all Singaporeans effectively became [Malaysian citizens](/wiki/Malaysians) as Malaya, Singapore, [North Borneo](/wiki/Crown_Colony_of_North_Borneo) and [Sarawak](/wiki/Crown_Colony_of_Sarawak) were [merged](/wiki/Singapore_in_Malaysia) to form Malaysia. However, about two years after the merger, Singapore seceded from Malaysia on August 9, 1965, and Malaysian citizenship was withdrawn from Singaporean citizens. Singaporean nationality law was incorporated into the new [Constitution of Singapore](/wiki/Constitution_of_Singapore). The constitution repealed the 1957 Ordinance, and all persons who were citizens as of 16 September 1963 by virtue of the Ordinance continued to be Singaporean citizens. Today, Singaporean citizenship is granted by birth, by descent, or by registration. Although provided for in the Constitution, citizenship by [naturalisation](/wiki/Naturalisation) is no longer granted. The government instead uses the constitutional provision for citizenship by registration to grant citizenship to resident aliens. ## Racial and ethnic groups Singaporeans by ethnic groups (2025)Ethnicity of Singaporeans[Chinese](/wiki/Chinese_Singaporeans)75.5%[Malay](/wiki/Malay_Singaporeans)15.1%[Indian](/wiki/Indian_Singaporeans)7.6%Others1.8% Singaporeans with [Chinese](/wiki/Chinese_Singaporeans) ancestry make up 75.5% of the citizen population of 3,660,700, [Malays](/wiki/Malay_Singaporeans) make up 15.1%, [Indians](/wiki/Indian_Singaporeans) 7.6%, and residents of \"other\" descent 1.8%, as of 2025. To avoid physical racial segregation and formation of ethnic enclaves common in other multi-racial societies, the Singaporean government implemented the \"Ethnic Integration Policy\" (EIP) in 1989, where each block of [public housing](/wiki/Public_housing_in_Singapore) units are sold to families from ethnicities roughly comparable to the national average. Today, the Chinese–Malay–Indian–Others (CMIO) model is the dominant organising framework of race in Singapore. The country celebrates [Racial Harmony Day](/wiki/Racial_Harmony_Day) to commemorate the [1964 race riots in Singapore](/wiki/1964_race_riots_in_Singapore), which resulted in 36 people dying and 560 suffering severe injuries, and to remember the consequences of racial disharmony the country experienced during the riots. Singaporeans of other ethnicities, notably [Arabs](/wiki/Arab_Singaporean), [Armenians](/wiki/Armenians_in_Singapore), [Eurasians](/wiki/Eurasians_in_Singapore) and [Sri Lankans](/wiki/Sri_Lankans_in_Singapore), are classified into broader ethnic groups under the CMIO model. For example, [Javanese](/wiki/Javanese_people) are classified under the \"Malay\" ethnic group, [Peranakans](/wiki/Peranakan) under \"Chinese\" and [Sikhs](/wiki/Sikhism_in_Singapore) under \"Indian\". There is some debate over the CMIO model, as certain subgroups argue that they do not identify with the broader categories it assigns. ## Culture\n",
  "language": "en",
  "processed_at": "2026-01-12T12:00:53.027128",
  "title": "Singaporeans",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singaporeans"
}