{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:25.956986"
  },
  "content": "Sustainability plan in Singapore The ***Singapore Green Plan 2030*** is a plan released by the [Government of Singapore](/wiki/Government_of_Singapore) on 10 February 2021 that sets targets for sustainability in Singapore by 2030. This \"collective whole-of-nation effort\" supports Singapore's aim to achieve [net zero emissions](/wiki/Net_zero_emissions) by 2050. The plan is spearheaded by five Ministries, being the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)), [Ministry of National Development](/wiki/Ministry_of_National_Development_(Singapore)), [Ministry of Sustainability and the Environment](/wiki/Ministry_of_Sustainability_and_the_Environment), [Ministry of Transport](/wiki/Ministry_of_Transport_(Singapore)) and the [Ministry of Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)). ## Background Efforts to create a sustainable Singapore hark back to 1992, when the first Green Plan was released. Another edition was released in 2002, titled the ***[Singapore Green Plan 2012](/wiki/Singapore_Green_Plan_2012)***. Several carbon-neutral targets were announced, with targets set in 2020 to half 2030 peak greenhouse gas emissions by 2050 and achieve net-zero emissions \"as soon as viable\" by the second half of this century. During a parliamentary motion on tackling [climate change](/wiki/Climate_change) held on 1 February 2021, several MPs called for more to be done, ranging from hiking the [carbon tax](/wiki/Carbon_tax) to being a carbon services hub, improving sustainability standards in the public service, ensuring preservation of forests, putting up a sustainability curriculum and [declaring a climate emergency](/wiki/Climate_emergency_declaration). In response, Minister for Sustainability and the Environment [Grace Fu](/wiki/Grace_Fu) announced a Singapore Green Plan that would be launched nine days later, along with a review to carbon tax prices. The motion was later passed. A progress update on the Green Plan was provided on 8 March 2022. ## Content The Singapore Green Plan 2030 has five key pillars, being \"City in Nature\", \"[Sustainable Living](/wiki/Sustainable_living)\", \"Energy Reset\", \"Green Economy\" and \"Resilient Future\". They will be enabled by a Green Government and Green Citizenry. Green Government involves Singapore’s government embedding sustainability into key business areas (including procurement) setting more ambitious targets for public infrastructure. Green citizenry includes enabling and empowering Singapore residents to get involved in the sustainability journey, working together to enact the Green Plan. As part of the plan, several new targets were announced. These include: - Projected to install up 60,000 [electric vehicle](/wiki/Electric_vehicle) charging points, with new car models required to run on cleaner energy sources; - Having schools reduce their net carbon emissions by two-thirds with at least 20 per cent carbon-neutral and the rest following soon after; - Making [Jurong Island](/wiki/Jurong_Island) a sustainable energy and chemicals park; - Singapore to be made a sustainable tourism destination with plans to hone Singapore as a carbon services hub; - Reduce waste deposited into [Semakau landfill](/wiki/Semakau_landfill) by 20 per cent, to be achieved by 2026, and building on a target to reduce waste up to 30 per cent by 2030 as part of the [Zero Waste](/wiki/Zero_waste) Masterplan announced in 2019; - A new Enterprise Sustainability Programme and Eco Stewardship Programme for companies and schools respectively, to get sensitised to sustainability. Most of the other targets put in the Plan were previously announced. Finally, a series of Green Plan Conversations will be organised to collaborate with Singaporeans on environmental initiatives and find the best way to achieve these goals. - [Climate change in Singapore](/wiki/Climate_change_in_Singapore) - [Environmental issues in Singapore](/wiki/Environmental_issues_in_Singapore) - [Singapore](/wiki/Singapore) - Green Plan website - Singapore Green Plan 2030 Charts Ambitious Targets for Next 10 Years to Catalyse National Sustainability Movement\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:25.956523",
  "title": "Singapore Green Plan 2030",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Green_Plan_2030"
}