{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:58:30.736322"
  },
  "content": "Teachers' organization in Singapore The **Singapore Teachers' Union** (**STU**) is the largest teachers' organisation in [Singapore](/wiki/Singapore). It is an affiliate of the [National Trades Union Congress](/wiki/National_Trades_Union_Congress) (NTUC), a member of the ASEAN Council of Teachers and the [Education International](/wiki/Education_International). The STU was founded in 1946 and represents over 13,000 teachers and educators employed by the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)). The STU provides assistance in dealing with work-related problems and advice on terms and conditions of service. It works through collaboration, cooperation and dialogues with the Ministry of Education. It also organises various workshops, courses and seminars for teachers. ## History There were teachers associated with the [Malayan Democratic Union](/wiki/Malayan_Democratic_Union) (MDU), a political party with an anti-colonial platform. They were the prime movers for the establishment of a teachers' union. Giving them strong support was [John Eber](/wiki/John_Eber_(lawyer)), a lawyer who was in the MDU leadership. On 28 September 1946, about 200 teachers attended a meeting under the auspices of Singapore Teachers' Association (STA). A key agenda of the meeting was a motion to have a union of their own, as STA had no legal status to negotiate better terms for teachers. The motion was moved by P V Sharma and seconded by Yapp Thean Chye. STA was revived at a general meeting held at [Raffles Institution](/wiki/Raffles_Institution) on 13 November 1925, \"after an interim period during which a great deal of thought and discussion was given to the production of a constitution free from any suspicion of trade-unionism and which would enable the activities of the Association to be carried on more expeditiously.\" The STU was founded on 19 October 1946, after more than 300 teachers attended the STU's inaugural meeting at 331 [North Bridge Road](/wiki/North_Bridge_Road), the headquarters of the MDU. The meeting lasted for 5 hours, and saw the adoption of the union's constitution. The founding members were H N Balhatchet (President), Yapp Thean Chye (General Secretary), P V Sharma (General Secretary), Lim Choo Sye (Treasurer), N Scharenguivel (Editor), Kiang Ai Kim, Quah Quek Tin, Frank James, J E K Retnam, Seow Cheng Fong and Tay Kheng Hock. Since then, its notable leaders included former President of the Republic of Singapore C V Devan Nair, Minister of State for Labour Sia Kah Hui, former Member of Parliament Lawrence Seah and Vice President of NTUC Edwin Lye Teck Hee. It was one of the unions that supported the formation of NTUC in 1961. On 15 February 1960, the Graduate Teachers' Association decided on dissolution following a ballot vote by members who opted to join the Singapore Teachers' Union. In line with NTUC's effort to modernise the Labour Movement in Singapore, STU organised a Modernisation Seminar from 27 February to 1 March 1971. The theme was \"The Teacher and the Dynamics of Nation Building\". The Seminar saw the setting up of a Professional Wing, and emphasised the importance of professional competence and upgrading as a key to ensuring better wages and conditions of service. It also led to the abolition of the Branch system, the introduction of a check-off system for collecting union dues and the launch of a union newsletter, The Mentor. Prior to the introduction of a check-off system, Union leaders had to personally collect union dues from school representatives. On 18 February 1981, Member of Parliament for Anson C. V. [Devan Nair](/wiki/Devan_Nair) called for Teachers' Unions to be converted into professional bodies, stating that teachers' organisations should be more concerned with \"formulating, monitoring and promoting the range of professional interests, standards and values of educators. The teaching profession itself must be socially upgraded and revalued, not necessarily in monetary terms.\" On 19 February, First Deputy Prime Minister [Goh Keng Swee](/wiki/Goh_Keng_Swee) spoke in Parliament and recommended that the Teachers' Unions be \"dissolved and transformed into a professional association to raise standards\". He said that the five Teachers' Unions should ideally be merged into one, failing which they could \"federate with existing professional teachers associations.\" He further added that as members of a professional association, teachers are entitled to represent the teaching profession on claims, grievances and grouses about the terms and conditions of service and other matters, but their principal objective must to be to raise professional standards of the teaching profession. Member of Parliament for Moulmein [Lawrence Sia](/wiki/Lawrence_Sia), who was also STU's president, responded that \"although he was not averse to the idea suggested, the mere change of name and status would not remove the many frustrations teachers faced.\" In response, the Singapore Teachers' Union held meetings with members in places other than government schools, which included [Catholic Junior College](/wiki/Catholic_Junior_College), Marymount Convent, St Gabriel's School and premises of the Katong Scouts' Association. The small sessions culminated in a general meeting in the theatrette of the [National Stadium](/wiki/Former_National_Stadium,_Singapore). A copy of the STU's Report was then submitted to every Member of Parliament, including the newly appointed Education Minister Dr [Tony Tan](/wiki/Tony_Tan). On Teachers' Day in 1982, STU organised a walkathon, which attracted over 2,000 members, and raised $75,000 each for the [Singapore Labour Foundation](/wiki/Singapore_Labour_Foundation) and Mendaki. Eleven Ministers and MPs joined the throng. According to then STU's General Secretary Swithun Lowe, Devan Nair informed him that Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) had asked Goh to carry on his plans to reform the Education system, but to \"leave STU alone\". ## Membership Singapore Teachers' Union Ordinary membership is open to all Education Officers employed by MOE. Allied Educators employed by MOE can join the Union as General members. Retired Education Officers can continue their membership as General members. ## Code of Ethics for Teachers In 1966, STU Central Council endorsed the first Code of Ethics for Teachers in Singapore, which was drafted by the STU's Professional Sub-committee. The Code was then put before the Annual Delegates Conference of the Union on 12 June 1966 for adoption. The Code outlined the expected norms of behaviour of teachers in relation to society, the profession, the pupil, fellow teachers, extra curricular activities, Educational superiors, parents, community and the Union. Though the Code was never enforced, it embodied the principles that STU perceives as the key to the Union's relationships with the stakeholders of the Education System. ## Co-operative Educare Co-operative Limited is a co-operative of Singapore Teachers' Union. ## Teachers' Housing Estate The Teachers' Housing Estate was started by STU in 1967 to provide teachers with affordable housing. To keep development costs low, STU decided to undertake the project in the rural area, and acquired a tract of land off Yio Chu Kang Road. Completed in 1968, 256 terrace houses were built in all, priced between $23,000 and $25,000. While the prices were low for the times, it was still a large sum for teachers then, the majority of whom were earning between $325 and $690 a month. About 70% of the houses were sold to teachers eventually. In 1973, STU completed the Teachers' Centre, located in the estate. The centre was equipped with office space and a multi-purpose hall. Facilities such as a swimming pool, squash courts, a library and a canteen were built. Such facilities were uncommon in the 1970s and they were highly popular among STU members. Schools would also use the centre for events such as seminars. Courses were run for STU members, from professional development to recreational courses including cooking and social dancing here. ## Young STU Young STU is the youth chapter of STU and a part of Young NTUC. It comprises STU members of age 35 years old and below. A key initiative of the Young STU is the annual Beginning Teachers Forum, where Educators with up to 3 years of working experience are briefed on things to note and common pitfalls early in their teaching career. ## Incident ### Salary reduction of teachers upon re-employment In 2011, the Ministry of Education announced that teachers have to be prepared for a pay-cut of up to 30 per cent upon re-employment at the statutory retirement age of 62. Previously, the pay of re-employed teachers was pegged to their last-drawn salary. On 4 August 2011, the General Secretary of STU, Edwin Lye Teck Hee, made a statement in response to media queries, calling the policy revision as \"regressive\", \"unfair\" and \"inequitable\" to teachers. The Union had also submitted feedback to the Public Service Division and MOE. He further added, \"With the current tight labour market and the experience gap in the schools, experienced teachers are undeniably an essential part of the education landscape and should naturally command a premium. There is a case for making a special consideration for our re-employed experienced teachers to be given their last drawn pay or a salary closer to the last drawn amount.\" On 8 August 2011, MOE clarified that the pay cuts will be commensurate with the teachers' lighter workload as compared to that of the permanent teachers. Teachers who held middle management positions will receive up to 30 per cent pay cut as they will no longer be holding managerial responsibilities upon re-employment. Most teachers, who were not holding on to middle management positions, will see a reduction of about 18 per cent of their salaries upon re-employment. The move to reduce the salaries of re-employed teachers was part of the alignment of MOE's re-employment practices with the other public sector employees. On 11 August 2011, MOE and the Teachers' Unions issued a joint statement on their agreement to use the tripartite guidelines on re-employment when implementing the Public Service-wide terms of re-employment. MOE, with assistance from the Unions, will draw up guidelines for schools regarding the job duties and responsibilities of re-employed teachers. In this way, the basis for a teacher's job scope during re-employment and the appropriate compensation will be clearer for all parties concerned. In July 2013, the Public Service Division announced that there shall be no pay cut for junior civil servants rehired at age 62.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:58:30.735937",
  "title": "Singapore Teachers' Union",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Teachers%27_Union"
}