{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:22.304790"
  },
  "content": "* *Singapore Arts Street** is an annual arts event held in Singapore since 2006, usually during mid of the year. It is akin to an Australian arts market, being free for visitors and involving a large number of participating artists of varying fame, skill and disciplines (including graffiti spray painting). Participating artists also collaborate on the creation of large artworks at the event venue. It is the first event of this scale in Singapore. ## Early years Singapore Arts Street 2006 & 2007 were held on the sidewalk outside [Tanglin Shopping Centre](/wiki/Tanglin_Shopping_Centre). ## Singapore Arts Street 2008 Singapore Arts Street 2008 was held in [Hougang](/wiki/Hougang) and [Clarke Quay](/wiki/Clarke_Quay). The guest of honour was [Ms Lim Hwee Hua](/wiki/Lim_Hwee_Hua), then Senior Minister of State for Finance and Transport and Member of Parliament for [Aljunied GRC](/wiki/Aljunied_GRC) (now the first full female Minister in the Singapore Cabinet). There were more than 300 participating artists, including [Cultural Medallion](/wiki/Cultural_Medallion) recipient, Ms Chng Seok Tin; Mr Low Tho Seng, Ms Irene Hong, [Mr Ng Woon Lam](/wiki/Ng_Woon_Lam), Mr Prabhakara and Mr Tung Yue Nang. Volunteers from the [Yellow Ribbon Project](/wiki/Yellow_Ribbon_Project), Deaf & Hard-of-Hearing Federation and Asia Women's Welfare Association were involved. Around 20,000 visitors visited the event. ## Singapore Arts Street 2009 Singapore Arts Street 2009 was held on 11 to 12 July 2009. The guest of honour was [Mr Matthias Yao](/wiki/Matthias_Yao), Mayor of South East District, Singapore. - [Singapore International Festival of Arts](/wiki/Singapore_International_Festival_of_Arts) This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This article related to a festival in Asia is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:22.304494",
  "title": "Singapore Arts Street",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Arts_Street"
}