{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:39.824167"
  },
  "content": "National governing body for canoeing and kayaking in Singapore The **Singapore Canoe Federation** (SCF) formed in 1971, is the National Sports Association (NSA) responsible for the management, coordination, development and promotion of [canoeing](/wiki/Canoeing) in [Singapore](/wiki/Singapore). It also represents the interest of its athletes and members to the [Singapore Sports Council](/wiki/Singapore_Sports_Council), [Singapore National Olympic Council](/wiki/Singapore_National_Olympic_Council), as well as other international canoeing bodies. As a National Sports Association under the [Sport Singapore](/wiki/Sport_Singapore), and as an affiliate of both the [International Canoe Federation](/wiki/International_Canoe_Federation) and the [Asian Canoe Confederation](/wiki/Asian_Canoe_Confederation), SCF represents Singapore in international and regional matters on canoeing. ## Organisation The Council of the years 2015-2017 SCF consists of President Mr Yip Kwan Guan, Vice Presidents Mr Zason Chian, Mr Francis Ng, Mr Roy Chew and Mr Gideon Lu, Hon Secretary Henry Sim, Asst Hon Secretary Qui Yunru, Hon Treasurer Yeung Xintian and Asst Hon Treasurer Richard Tan ## Funding As a non-profit organisation, SCF is run by handful of full-time staffs together with Management Council and Executive who are volunteers from various [water sports](/wiki/Water_sports) clubs and organisations. The Sports SG and [Singapore Pools](/wiki/Singapore_Pools) are the federation's main sponsors. - Official website This article about a sports-related organization is a stub. You can help Wikipedia by expanding it. - v - t - e This article about sports in Singapore is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:39.823931",
  "title": "Singapore Canoe Federation",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Canoe_Federation"
}