{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:29.643576"
  },
  "content": "Arts and crafts centre in SingaporeThis article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)* The **Singapore Handicraft Centre** was an arts and crafts centre at the corner of Tanglin Road and Grange Road at the end of the [Orchard Planning Area](/wiki/Orchard_Road) in Singapore. It was completed in 1976 to \"preserve and promote the culture of neighbouring regions while ensuring a livelihood for skilled craftsmen\". The centre closed down in 1990 and was subsequently demolished to make way for the Tanglin Mall. ## History ### Planning and construction The [Singapore Tourist Promotion Board](/wiki/Singapore_Tourism_Board) began planning the centre in 1971. The land on which the centre was built was previously occupied by the Grange Road Market, a row of shophouses, the Ellis Road Mosque and several private homes. The market's stallholders received notices that they were to vacate the premises within a week in June 1974, after which many of them were to be resettled to a hawker centre on Holland Drive, with the rent there being twice the cost of rent at the Grange Road Market. By then, the private homes and the mosque had already been vacated and were awaiting demolition. The centre was to feature \"16 units of four-storey split-level shophouses, four units of three-storey split-level shophouses and another six units of two-storey split-level shophouses.\" It would include air-conditioning a beer hall occupying one floor accompanied by a \"sunken\" [beer garden](/wiki/Beer_garden) and an open-air plaza within the complex. It would also feature a 450-seat theatre for cultural shows. The 26 shops within the centre were to centre were to sell handicrafts for the art forms of several countries across Asia, including [Taiwan](/wiki/Taiwan), [Hong Kong](/wiki/Hong_Kong), [Japan](/wiki/Japan) and [India](/wiki/India). In October, the Singapore Tourist Promotion Board invited craftsmen from 19 different countries to occupy the centre's units. The board announced in the same month that rent at the centre would be cheaper when compared to other shopping centres in the area. Tenants were to be required to open and close at a certain hour and to hold daily handicraft demonstrations. ### Opening and initial tenants The $5.24 million complex opened on 25 September 1976. At its opening, the tenants included Chinese-born Singaporean painter [Chen Wen Hsi](/wiki/Chen_Wen_Hsi), ivory carver Poon Tik Sang, Persian carpet weaver Ali Esfand, Hong Kong jade carver Chu Chi Chang, potter Aw Eng Kwang, [batik](/wiki/Batik) painter Seah Kim Joo and furnituremaker Selangor Pewter. The theatre, which had yet to be completed, was to open in the following year. The open-air plaza was to be used to hold exhibitions. Then-[Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) delivered a speech at the opening ceremony. In March 1977, it was announced that the centre's shopowners would come together to form the Singapore Handicraft Centre Association. ### Exhibitions and events From 15 November to 20 November, the centre held an exhibition featuring several \"vanishing\" trades, including lantern making, Chinese calligraphy, clog making, snake-charming, fortune telling, opera mask making and the mobile movie man. Among the craftsmen featured at the exhibition was Yeo Chong Leong, who made a living selling painted masks on his cart and was \"believed to be the only survivor of this trade.\" Lantern maker Yeo Swee Huat was also among the craftsmen featured. From 13 January 1978 to 24 January, the International Nights festival was held at the centre, featuring, music, dances and food from seven Asian countries. The Tourist Promotion Board opened the Rasa Singapura Food Centre next to the centre in June to attract more customers to the area. ### Issues with lack of business In February 1979, it was announced that in an attempt to attract more customers to the centre, which had been suffering from \"poor business\", \"happy shopping hours\" featuring discounts and bargains would held on Saturdays. In May, the Singapore Tourist Promotion Board announced that rent would be increased in the July. The Singapore Handicraft Centre Merchants' Association, as well as many of the centre's tenants, launched unsuccessful appeals against the decision. One tenant chose to leave the centre as a result of the rent increase. In the following month, the board announced that two tenants would not have their lease renewed as they did not hold daily handicraft demonstrations and did not follow the stipulated opening and closing times. An article in the *New Nation* noted that it is \"difficult to keep a craftsman interested in demonstrating his skills to a non-existent audience\" and that \"the urge to close shop early is also quite natural when business is slow.\" The article wrote that the decision to evict the tenants \"underscores the difficulties the Handicraft Centre has faced since it opened nearly three years ago. The Singapore Cultural Theatre was completed and opened next to the centre and the Rasa Singapura Food Centre in November. In March 1980, the centre's tenants complained about the poor business at the centre, insisting that the board had promised that the theatre would attract more tourists, thus justifying the rent increase. The board denied ever making such a claim. The merchants' association announced in July that they would be organising a \"package tour\" for the centre, a move which had received the \"full support\" of the board. In June 1982, the board held a Vanishing Scenes exhibition which featured food vendors and craftsmen whose trades were \"rapidly disappearing\". In October, the board announced that after 1985, vacant units would be \"made available on the open property market and tenants will be charged a monthly rental based on current property prices.\" In July 1984, the board began leasing units to those who were not in the handicraft trade. The board wrote to the centre's tenants, asking if they would prefer the name of the centre be changed, with many of them stating that they preferred the current name. As such, the centre remained the Singapore Handicraft Centre. The Singapore Tourist Promotion Board began holding [pasar malams](/wiki/Pasar_malam) at the centre on Wednesdays and Sundays beginning on 7 April 1985. A week after, a spokesperson for the board announced that it would also be held on Mondays and Tuesdays. In May, Taiwanese singer [Fei Yu-ching](/wiki/Fei_Yu-ching) was invited by the board to perform at the pasar malam, which by then had over 110 stalls. As a result of its success, the board announced its intention to \"revive\" pasar malams in other areas in August. By then, the pasar malam had attracted more than 1,200 people on weekends and over 400 people on weekdays. In November, it was announced that the pasar malam would be held with a different theme every month. In May 1986, the pasar malam underwent a revamp to cater towards local instead of tourists. However, *[The Straits Times](/wiki/The_Straits_Times)* reported that business at the pasar malam on its first night in operation following the revamp was \"slow.\" By then, it was open on Wednesdays, Fridays, Saturdays and Sundays. By October, it was no longer open on Mondays. ### Redevelopment and closure In November 1989, the board announced that the Singapore Handicraft Centre, Rasa Singapore and the Cultural Theatre would be redeveloped. However, there were plans to relocate both the handicraft centre and the food centre, which were to keep their names. The Singapore Tourist Promotion Board proposed that the centre be relocated to [Orchard Point](/wiki/Orchard_Point). Tenants of both centres were to have vacated the buildings by the end of the year. However, the plans to redevelop the area were delayed as the board rejected all of the bids for the tender due to \"unacceptable design.\" The deadline was then extended to May of the following year. The board launched a re-tender of the site in March 1990. In October, the tender was won by Kuok Group's Allgreen Properties for $188.8 million, after which the centre was demolished to make way for Tanglin Mall. The Singapore Handicraft Centre was relocated to the [Chinatown Point](/wiki/Chinatown_Point). 1°18′15″N 103°49′24″E﻿ / ﻿1.3043°N 103.8234°E﻿ / 1.3043; 103.8234\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:29.643214",
  "title": "Singapore Handicraft Centre",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Handicraft_Centre"
}