{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:57:32.698032"
  },
  "content": "National youth orchestra of SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore National Youth Orchestra\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2018)* *(Learn how and when to remove this message)* The **Singapore National Youth Orchestra** (**SNYO**) is the national [youth orchestra](/wiki/Youth_orchestra) of Singapore. It is recognised by the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) as a National Project of Excellence and a key development programme for talented young musicians. Since 1 January 2016, the [Singapore Symphony Orchestra](/wiki/Singapore_Symphony_Orchestra) (SSO) has assumed management and operational responsibility for the SNYO, taking over the reins from the Ministry of Education. The SNYO is currently led by Principal Conductor Joshua Tan. It is made up of over 200 young musicians between the ages of 10 and 21. Entry into the SNYO is by a rigorous audition process. Members studying in mainstream secondary schools will have their participation in the SNYO recognised in lieu of a school-based Co-Curricular Activity (CCA). The SNYO aims to focus on developing the most talented classical musicians and building a vibrant music community for Singapore. The SNYO hopes its future graduates will excel at the technical playing of their instrument, hone their sense of artistic expression, develop strong character, and develop a lifelong love for music. The SNYO has its own SNYO Studios with 6 rooms for booking in the [Nanyang Academy of Fine Arts](/wiki/Nanyang_Academy_of_Fine_Arts) (NAFA) Tower Block along [Bencoolen Street](/wiki/Bencoolen_Street). Rehearsal sessions are usually held twice a week for the SNYO (Thursday night, Saturday afternoon) and once a week for the SNYS (Saturday morning), usually in the Orchestra Studio, with sectionals held across all studios.[*citation needed*] The SNYO was slated to give the Singapore live premiere of [Disney Fantasia](/wiki/Fantasia_(1940_film)) on 17 and 18 March 2020, but the concert was cancelled due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore). ## History The SNYO can trace its origins to the Children's Orchestra started by E A Brown in 1933. Brown, a choirmaster at [St Andrew's Cathedral](/wiki/St_Andrew%27s_Cathedral,_Singapore), organised an orchestra comprising children aged between 11 and 16 years old, with most of them playing the violin. By 1938, the Children's Orchestra had been reorganised into the Singapore Young People's Orchestra, still under the conductorship of Brown. The orchestra gave regular concerts at the [Victoria Memorial Hall](/wiki/Victoria_Memorial_Hall), known as Children's Concerts, which were a feature of the local entertainment scene until the outbreak of Second World War. The orchestra was resuscitated after the war and renamed Singapore's Junior Symphony Orchestra (SJSO) in 1948. The SJSO was conducted by Glanffrwd[*citation needed*] Williams, a Welshman who was appointed Master of Music in the Department of Education, and was appointed by the British administration to run the school's music programme here. In 1965, [Paul Abisheganaden](/wiki/Paul_Abisheganaden) took over the SJSO, under the aegis of the Department of Education. In the 1970s, the orchestra was reorganised as the Singapore Youth Orchestra (SYO) and was managed by the Young Musicians’ Society. This society was established by the MOE in 1968 to coordinate and direct the ministry's Music Education Programme. At the time, most of the SYO members were also young musicians belonging to the Goh Soon Tioe String Orchestra. The SYO was plagued with various problems including lack of funds for instruments, lack of rehearsal venues and trained wind players. Membership also began to dwindle. [Goh Soon Tioe](/wiki/Goh_Soon_Tioe), a private music teacher, was the conductor until 1975 when he stepped down for medical reasons, and the SYO disbanded. In 1977, the SYO was regrouped as part of the University of Singapore's Symphony Orchestra under the baton of Paul Abisheganaden, when it was housed at the University of Singapore Centre for Musical Activities (now the [National University of Singapore](/wiki/National_University_of_Singapore) Centre for the Arts). When the SSO was formed in 1978, the SYO became a feeder for the SSO, with many SYO members carrying on to play in the SSO or receiving SSO scholarships to further their musical education. In 1980, MOE formally took over the management of the group. It sought to build the SYO into a national youth orchestra and recognised it officially as an extra-curricular activity for students who are members. Professionally trained musicians (from the SSO, and graduates of music conservatories) give one-on-one fully subsidised coaching for most of the student musicians (the exceptions are those who choose to have their own tutors) and they also help conduct sectional rehearsals. In 1986, a junior orchestra to the main orchestra was formed, named the Singapore Youth Training Orchestra (SYTO). It has since been renamed to the Singapore National Youth Sinfonia (SNYS). In 2001, the orchestra was renamed as the Singapore National Youth Orchestra. In 2015, the [Ministry of Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth) (MCCY) took over the SNYO. In 2016, full operational and management control of the SNYO was transferred to the SSO, but continues to be recognised as a CCA by MOE. ## Conductors - 1933–1942 E A Brown - 1948–1965 Glanffrwd Williams - 1965–? [Paul Abisheganaden](/wiki/Paul_Abisheganaden) - ?–1970 Benjamin Khoo - 1970–1975 [Goh Soon Tioe](/wiki/Goh_Soon_Tioe) - 1975–1980 Paul Abisheganaden - 1980–1990 Vivien Goh (daughter of Goh Soon Tioe) as music director/resident conductor - 1990–2002 Lim Yau as music director - 2002–2004 Robert Casteels as music director/resident conductor - 2005–2010 [Lim Soon Lee](/wiki/Lim_Soon_Lee) as music director - 2010–2012 Darrell Ang as music director - 2010–2014 Tan Wee Hsin as resident conductor - 2014–2018 [Leonard Tan](/wiki/Leonard_Tan) as principal conductor - 2016–2022 Lin Juan as associate conductor - 2018–present Joshua Tan as principal conductor - 2018–present [Peter Stark](/wiki/Peter_Stark) as principal guest conductor - 2022–present Seow Yibin as associate conductor ## Tours - 1971 [Lausanne](/wiki/Lausanne), Switzerland - 1982 Rome, Italy - 1985 [Lancashire](/wiki/Lancashire), UK - 1988 [Perth](/wiki/Perth), Australia - 1993 [Kumamoto](/wiki/Kumamoto), Japan - 1997 Sydney - 2001 [Aberdeen](/wiki/Aberdeen), Scotland - 2005 Vienna, Austria - 2008 Florence, Italy - 2011 Aberdeen, Scotland - 2012 Berlin, Germany - 2016 Kuala Lumpur, Malaysia - 2018 [Guangzhou](/wiki/Guangzhou), China - 2018 Hong Kong SAR, China - 2025 Macau SAR, China - 2025 [Shenzhen](/wiki/Shenzhen), China - 2025 Hong Kong SAR, China - [Music of Singapore](/wiki/Music_of_Singapore) - [List of youth orchestras](/wiki/List_of_youth_orchestras) - Official website - Co-Curricular Branch – SNYO\n",
  "language": "en",
  "processed_at": "2026-01-12T11:57:32.697730",
  "title": "Singapore National Youth Orchestra",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_National_Youth_Orchestra"
}