{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:58:45.989236"
  },
  "content": "Annual event organised by the Ministry of Education, SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore Youth Festival\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2025)* *(Learn how and when to remove this message)* **Singapore Youth Festival (SYF)** is a biennial [Singaporean](/wiki/Singapore) event to showcase student's talents in [performing arts](/wiki/Performing_arts) in the country. First launched in 1967, the SYF has seen the involvement of more than 30,000 students in the activities and performances each year. ## History The SYF was first launched on 18 July 1967 by then [President of Singapore](/wiki/President_of_Singapore) [Yusof Ishak](/wiki/Yusof_Ishak), and was initially a two-week affair involving 24,000 students that year. The launch was part of a drive at that time to \"cultivate the human resource\" as espoused by then [Minister for Education](/wiki/Minister_for_Education_(Singapore)) [Ong Pang Boon](/wiki/Ong_Pang_Boon), although nation-building agendas were not too distant. The SYF Art and Crafts Exhibition was introduced in 1968, and local compositions by youths we showcased, such as the composition by Cerise Lim, then a Secondary 3 [Methodist Girls' School](/wiki/Methodist_Girls%27_School,_Singapore) student which was performed in 1969. Sports was also featured, such as the Track and Field championships which were held since 1967. The festival grew every year in scale, until complaints that it was over-emphasised in place of academics led to its scaling down to a one-night event in 1975. The event's programme ballooned again soon after, however. Drama was introduced in 1976, the [Singapore Youth Orchestra](/wiki/Singapore_Youth_Orchestra) was featured in 1980, and the Choral Festival became part of the programme in 1990. Public performances at locations such as the [National Museum of Singapore](/wiki/National_Museum_of_Singapore), the [Chinese Garden](/wiki/Chinese_Garden,_Singapore), the [Jurong Bird Park](/wiki/Jurong_Bird_Park) and shopping malls such as [Parkway Parade](/wiki/Parkway_Parade) were introduced from 1991. A mass jog was held in 1992, the Youth Flying Club was featured in 1996, and the National Heritage Trail was introduced in 1997. In 1994, the SYF was elevated as an official national-level event, and the festival was expanded to include youths in tertiary institutions, youth groups and clubs, the [National Youth Council](/wiki/National_Youth_Council) and the [People's Association](/wiki/People%27s_Association). Corporate partnerships were also forged to help finance public performances and to sponsor prizes for key events, such as the cash incentive prizes for the Best Display Band Competition and the Best Drum Major award which was sponsored by [Royal Dutch Shell](/wiki/Royal_Dutch_Shell). In more recent years, the SYF emphasised theme-based festivals, such as \"Opening Hearts\" in 2002. It also reached out to include youths with special needs, with the Singapore School of the Deaf, the Tanglin Special School and the Delta Senior School being involved since 2002, and it was involved in fund-raising efforts for the President's Challenge in the same year. ## Opening ceremonies The opening ceremonies are a grandiose affair, alternating between a full stadium-sized ceremony with marching contingents by the uniformed groups and mass display segments, and indoor ceremonies showcasing the performance arts groups. The former are currently held during the even years, and the latter, the odd years, although the rebuilding of the [National Stadium](/wiki/National_Stadium,_Singapore) has required a temporary shift into the [Singapore Indoor Stadium](/wiki/Singapore_Indoor_Stadium) even for the traditionally outdoor ceremonies. The Opening Ceremony of the 2010 edition of the Singapore Youth Festival was held at the [Singapore Indoor Stadium](/wiki/Singapore_Indoor_Stadium). It was hosted by the [National Police Cadet Corps](/wiki/National_Police_Cadet_Corps), with the theme \"Torch of Friendship\", as a tie-up for the [Singapore 2010 Youth Olympic Games](/wiki/Singapore_2010_Youth_Olympic_Games). The Opening Ceremony organising team alternates between two Uniformed Student Organisations, [National Police Cadet Corps](/wiki/National_Police_Cadet_Corps) and the [National Cadet Corps](/wiki/National_Cadet_Corps_(Singapore)) every other year. ## Arts presentation At the annual SYF Arts Presentation, judging is conducted for the performing arts groups in different categories, such that most individual groups are up for judging only biennially. The current list of groups and their annual rotation is as follows: PAGOdd yearsEven yearsBand (Brass, Concert, Brass Ensemble, Percussion Ensemble)Secondary Schools/Junior CollegesPrimary SchoolsDisplay Band-Secondary SchoolsChinese Orchestra (Full Orchestra, Mixed Ensemble)Secondary Schools/Junior CollegesPrimary SchoolsChoirSecondary Schools/Junior CollegesPrimary SchoolsDance (Chinese, Indian, International, Malay)Secondary Schools/Junior CollegesPrimary SchoolsDrama (English, Chinese, Malay)Secondary SchoolsJunior Colleges / Centralised InstituteInstrumental Ensemble (Angklung, Gamelan, Guitar, Handbell / Handchime, Harmonica, Strings, GuzhengSecondary Schools/Junior CollegesPrimary Schools In 2012, as part of the MOE's revamp of the festival, the former SYF Central Judging was renamed as the SYF Arts Presentation. The award structure was also revamped from Gold (with Honours), Gold, Silver, Bronze and certificate of participation to Distinction, Accomplishment and Commendation. The score needed to obtain the highest award was also lowered from 85% to 75%. - Official website Portals: - Singapore - Music\n",
  "language": "en",
  "processed_at": "2026-01-12T11:58:45.988827",
  "title": "Singapore Youth Festival",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Youth_Festival"
}