{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:03.774472"
  },
  "content": "Singaporean political party The **Singapore Democratic Party** (**SDP**) is a [social liberal](/wiki/Social_liberal) [political party](/wiki/Political_party) in [Singapore](/wiki/Singapore). Founded in 1980 by [Chiam See Tong](/wiki/Chiam_See_Tong), the party gained its first seat in [Parliament](/wiki/6th_Parliament_of_Singapore) in (/wiki/1984_Singaporean_general_election) when Chiam was elected the MP for [Potong Pasir](/wiki/Potong_Pasir_Single_Member_Constituency). In the [1991 general election](/wiki/1991_Singaporean_general_election), the SDP achieved its peak electoral success, securing three parliamentary seats with [Ling How Doong](/wiki/Ling_How_Doong) and [Cheo Chai Chen](/wiki/Cheo_Chai_Chen) winning in [Bukit Gombak](/wiki/Bukit_Gombak_Single_Member_Constituency) and [Nee Soon](/wiki/Nee_Soon_Central_Single_Member_Constituency) respectively. However, internal conflicts emerged in 1993, leading to Chiam's departure from the party in 1996 to join the [Singapore People's Party](/wiki/Singapore_People%27s_Party) (SPP), a party founded by former SDP members who supported Chiam. He was succeeded by [Chee Soon Juan](/wiki/Chee_Soon_Juan), who has served as Secretary-General since then. The SDP identifies as a [centrist](/wiki/Centrism) to [centre-left](/wiki/Centre-left) party, drawing on both [liberal](/wiki/Liberalism) and [social democratic](/wiki/Social_democratic) ideologies. Over the years, it has been shaped by different leadership styles and internal factions, particularly under Chiam and Chee, whose visions for the party diverged significantly. The party has had no parliamentary representation since (/wiki/1997_Singaporean_general_election). While some party members lean towards centre-left ideals, others align with centrist or even [centre-right](/wiki/Centre-right) positions. Since the 2000s, the party has increasingly focused on promoting human rights and democratic reforms. As part of its policy platform, the SDP advocates for constitutional reforms that strengthen [civil liberties](/wiki/Civil_liberties) and expand social protections. It promotes liberal approaches to key national issues in Singapore, including [education](/wiki/Education_in_Singapore), [healthcare](/wiki/Healthcare_in_Singapore) and [housing](/wiki/Public_housing_in_Singapore) as well as increased social welfare spending for [Singaporeans](/wiki/Singaporeans). The party also calls for a more moderated [immigration](/wiki/Immigration_to_Singapore) policy. Internationally, the SDP is affiliated with [Liberal International](/wiki/Liberal_International) and the [Council of Asian Liberals and Democrats](/wiki/Council_of_Asian_Liberals_and_Democrats), reflecting its commitment to [liberal democratic](/wiki/Liberal_democratic) values. ## History ### 1980–1992: Founding and early success The SDP was founded on 6 August 1980 by lawyer [Chiam See Tong](/wiki/Chiam_See_Tong), who had contested several elections as an independent candidate in the 1970s, together with consultant engineer [Fok Tai Loy](/wiki/Fok_Tai_Loy) and businessman Ernest Chew Tian Ern, who they took the roles of the party's founding [Secretary-General](/wiki/Secretary-General), [Chairman](/wiki/Party_Chair), and Assistant Secretary-General, respectively. The main objectives of the party were declared to be the \"elimination of colonialism and feudalism, the safeguarding of parliamentary democracy and upholding of the principles of democracy, socialism and the constitution.\" Two months later, on 19 October 1980, the party unveiled its emblem: a circle (which symbolises unity amongst Singapore's ethnic groups), behind an arrow (representing political progress in Singapore) in the colour red (signifying courage and determination). The party was inaugurated on 21 September 1981, a full year after being registered as a political party. In 1984, Fok died and [Ling How Doong](/wiki/Ling_How_Doong) took over as chairman of SDP. The party entered the election campaign of [1984 general election](/wiki/1984_Singaporean_general_election) with the slogan of \"Singaporeans for Singapore\", raising the need for elected opposition in parliament to bring democracy to Singapore. The party also raised other prominent issues of the time such as the need to reform the education and CPF system, and its opposition to the Elected Presidency. It noticeably fielded only four candidates in that general election: Secretary-General Chiam, Chairman Ling, Vice-Chairman Soon Kia Seng and treasurer Peter Lim Ah Yong. During the campaigning, the party came under fire from the government ruling party, [People's Action Party](/wiki/People%27s_Action_Party) (PAP), with Ling and Chiam bearing the brunt of the attacks. The PAP chose to highlight Ling's dismissal from the police force and the record of his election agent, but these were quickly rebutted by the SDP leadership. Chiam saw his secondary school record being brought up by the Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), who compared Chiam's intelligence with that of PAP's [Mah Bow Tan](/wiki/Mah_Bow_Tan) who was standing against the SDP leader. Chiam won the single seat of [Potong Pasir](/wiki/Potong_Pasir_Single_Member_Constituency) after three attempts in the constituency by a vote of 60.3% to Mah's 39.7%, making Chiam as only the second opposition politician ever to be elected to the Republic's Parliament after [J.B. Jeyaretnam](/wiki/Joshua_Benjamin_Jeyaretnam) of the [Workers' Party](/wiki/Workers%27_Party_of_Singapore). The SDP garnered 45.2% of total votes cast in the constituencies they had contested in. After Jeyaretnam was expelled from Parliament in 1986, Chiam was Singapore's sole opposition MP. A moderate, Chiam claimed that he was not opposing for the sake of opposition. He also said: \"But if they (the government) do the wrong things which are not good for Singapore, then we will oppose fearlessly\". The [1988 general elections](/wiki/1988_Singaporean_general_election) saw the opposition's strongest challenge since 1963, with 71 out of 82 seats contested. This election also saw the PAP engage the SDP's Chiam and WP's Jeyaretnam in a television debate. Besides Chiam and Ling, the SDP also fielded Ashleigh Seow (the son of former [Solicitor-General](/wiki/Attorney-General_of_Singapore) [Francis Seow](/wiki/Francis_Seow)), businessmen Jufrie Mahmood, [Cheo Chai Chen](/wiki/Cheo_Chai_Chen) and Ng Teck Siong, sales manager Kwan Yue Keng, bank clerical assistant Mohd Shariff Yahya, teacher George Sita, financial futures trader Jimmy Tan, former PAP MP Low Yong Nguan, businesswoman Toh Kim Kiat, construction supervisor Francis Yong Chu Leong, shipping manager Chia Ah Soon and director [Sin Kek Tong](/wiki/Sin_Kek_Tong). The party chose to target the government on the plan to amend the constitution, and that the economic prosperity indicators it used were untrue When the results were declared, it emerged that the SDP was the only opposition party to win a seat, with Chiam re-elected as Potong Pasir MP for a second term. The SDP scored 39.5% of the total votes cast in all the constituencies it had contested in. The PAP's announcement of a [general election in 1991](/wiki/1991_Singaporean_general_election) came when the ruling party was barely in office for three years. The SDP chose to highlight its objections to some controversial government policies such as the sharp increase of ministers' salaries, the cost of healthcare, university education, transport and the GST. Most significantly, the SDP engineered an agreement with the other opposition parties to contest just under half the seats in Parliament, thus creating a \"by-election effect\" (reassuring voters that there would not be a change in government and encouraging them to elect more opposition voices). The election results saw SDP best performance for an opposition in post-independence Singapore since [Barisan Sosialis](/wiki/Barisan_Sosialis) with a combined vote share of 48.6%. All nine of the candidates put up extremely strong fights against the PAP during this election, with three candidates elected to the parliament (Leader Chiam, party Chairman Ling and Cheo of [Potong Pasir SMC](/wiki/Potong_Pasir_SMC), [Bukit Gombak SMC](/wiki/Bukit_Gombak_SMC) and [Nee Soon Central SMC](/wiki/Nee_Soon_Central_SMC), respectively); While Ling and Cheo were elected in tight margins, Chiam's 69.6% was both himself and any opposition's best performance hitherto. Along with Worker's Party assistant secretary-general [Low Thia Khiang](/wiki/Low_Thia_Khiang) elected in [Hougang](/wiki/Hougang_Single_Member_Constituency), the opposition won a combined four parliament seats, then the largest representation since 1963. At the time, the result was viewed as being a notable setback to the ruling party and [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Goh Chok Tong](/wiki/Goh_Chok_Tong). ### 1992–2000: Changes in leadership and setbacks In 1992, Chiam recruited [Chee Soon Juan](/wiki/Chee_Soon_Juan), a [psychology](/wiki/Psychology) lecturer at the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS), to be an SDP candidate for a [by-election](/wiki/1992_Marine_Parade_by-election) in the [Marine Parade Group Representation Constituency](/wiki/Marine_Parade_Group_Representation_Constituency). Although the SDP was unsuccessful in the by-election (the PAP won 72.9% of the votes, the SDP 24.5%, and other smaller parties 2.6%), the recruitment of Chee as a candidate generated considerable public interest. However differences between Chiam, Chee and the rest of the party's Central Executive Committee were soon to emerge. Chee subsequently became the assistant secretary-general of the SDP and Chiam's protégé. In 1993, internal conflicts within the party came to a head. Tensions had been brewing between Chiam and other members of the Central Executive Committee (CEC) since before Chee joined the party. These disputes, which included disagreements over leadership style and party direction, were exacerbated by Chiam's attempt to censure Chee following a hunger strike. When the CEC did not support this censure, Chiam resigned from his position as Secretary-General. Despite Chiam's resignation, the CEC made efforts to persuade him to return. Chiam, however, demanded conditions deemed undemocratic by the CEC, such as sole power to appoint and dismiss CEC and cadre members, and the removal of Vice-Chairman Wong Hong Toy. These demands were against the party's democratic principles and constitution, leading to an impasse. Chiam later criticized the CEC publicly, prompting a disciplinary hearing. Although the CEC initially did not intend to expel him, the decision was made after a lengthy debate, with 11 out of 13 members voting for expulsion. The CEC continued attempts at reconciliation even after the decision was made, but these were unsuccessful. Following these events, supporters of Chiam left the SDP and formed the [Singapore People's Party](/wiki/Singapore_People%27s_Party) (SPP) in 1994, with Sin as its pro-tem leader. Chiam left SDP in December 1996 and joined the SPP ahead of the [1997 general election](/wiki/1997_Singaporean_general_election), becoming its leader and continuing his political career under a new banner. This period marked a significant turning point for the SDP, highlighting both the challenges of internal party dynamics and the commitment to maintaining democratic principles within the party structure. After being placed as the acting SDP leader in 1993, Chee began expressing his views on the lack of democracy in Singapore to the media. He published his second political book, *Dare To Change: An Alternative Vision for Singapore*, in 1996. This view had since led to the attention of the PAP's Organizing Secretary [Matthias Yao](/wiki/Matthias_Yao); ahead of the [1997 elections](/wiki/1997_Singaporean_general_election), Chee publicly issue a challenge to stand against Yao (who he accepted) in his constituency of [MacPherson](/wiki/MacPherson_Single_Member_Constituency). At the 1997 general election, the SDP suffered significant electoral setbacks with SDP failing to win a single seat since 1984, including incumbents Cheo and Ling, as well as Chee. Their party's vote also dropped from 48.6% down to 33.1%. However, fellow opposition parties enjoyed same success as the previous election with Chiam retaining his Potong Pasir seat, as a SDP candidate and WP's Low in his Hougang ward. In 1999, Chee came to national attention when he gave a public speech in the financial district despite being denied a permit to speak publicly. ### 2001–2010 : Further setbacks During the campaigning, Chee's meeting with Prime Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) sparked public's imagination during one of Goh's rallies where he, along with his followers, raised their fists and chanted slogans. Later, from his campaign vehicle, Chee used a [megaphone](/wiki/Megaphone) to ask Goh: \"Where is the S$18 billion that you have lent to (Indonesian President) [Suharto](/wiki/Suharto)?\" PAP shortly demanded Chee to apologise for claiming a false accusation or face a defamation lawsuit. Despite apologising to PAP a day later due to the party's pressure, SDP further criticise the PAP's economic policies and urged for the minimum wage of S$5 per hour for the rest of the 2001 campaign. The SDP's economic alternatives were dismissed by the PAP which claimed that the SDP policies would lead Singapore to bankruptcy and inflation. The party's popular vote fell for the second consecutive election, down to 20.4%, in addition on failing to win a seat for the parliament. Due to bankruptcy set forth by the PAP in the following year (which barred candidates from running in elections), this was Chee's last stint in the political arena until three elections later in 2015. In March 2006, just before the [2006 general election](/wiki/2006_Singapore_general_election), the party appeared to be cracking from within after Chee was jailed for not paying a fine for [contempt of court](/wiki/Contempt_of_court). SDP's chairman, Ling, was quoted as saying that the party \"would be run even better\" without Chee, citing that the party was not just a one-man show and could survive and even thrive without him. Chee's sister Chee Siok Chin. also a party member, confirmed that the party remained united. The party continued its preparations for the 2006 general election, choosing to target [Health Minister](/wiki/Ministry_of_Health_(Singapore)) [Khaw Boon Wan](/wiki/Khaw_Boon_Wan) in Sembawang GRC over the [National Kidney Foundation Scandal](/wiki/National_Kidney_Foundation_Singapore_scandal) and to ride on the public backlash at the time. The party subsequently published an editorial in the New Democrat questioning the PAP's credibility over the issue, but PAP went to sue SDP for defamation on 22 April, and PAP won, resulting in the entire CEC (except for the Chee Siblings) to apologise and pay damages by 26 April. Nevertheless, the party successfully nominate a combined seven candidates (Sembawang GRC and Bukit Panjang SMC) on nomination day, two days before being sued. The Sembawang team was led by Chee Siok Chin, along with businessmen Christopher Neo, Isa Abdul Aziz and Yong Chu Leong, marketing manager Gerald Sng Choon Guan and administrator Narayanasamy Gogelavany, while the party's chair, Ling, was fielded in Bukit Panjang SMC. The SDP's final vote share for Sembawang and Bukit Panjang was 23.3% and 22.8% respectively, marking a slight improvement in results as compared to 2001, but still far short of the national average of 33.3%. ### *Tak Boleh Tahan* protest On 15 March 2008, Chee and 18 others held a [demonstration](/wiki/Demonstration_(people)) at [Parliament House](/wiki/Parliament_House,_Singapore), all wearing red *Tak Boleh Tahan* (Cannot Take It) T-shirts to kick-start the campaign. At Parliament House, the protesters were warned by police to stop their [unlawful assembly](/wiki/Unlawful_assembly). When the warning was ignored, the police dispersed the protest and arrested the demonstrators. The trial *PP vs. Chee Soon Juan and 18 others* began on October 23, 2008, with the defendants charged on two counts of violating Section 5(4)b Chapter 184 of the Miscellaneous Offences (Public and Nuisance) Act. In their defense, the \"defendants claim that they're innocent by virtue of their right under the [Singapore constitution](/wiki/Constitution_of_Singapore) to enjoy the guarantees of freedom of assembly and expression\", and the trial has been described by [*The Washington Times*](/wiki/The_Washington_Times) as \"a test about whether [Singapore's judiciary](/wiki/Judiciary_of_Singapore) is independent\". In October 2010, the defendants were found guilty and were fined between S$900 and S$1,000. Six of the defendants appealed against the sentence with the High Court judge dismissing the appeal of Chee, Chee Siok Chin, SDP assistant secretary-general John Tan Liang Choo, film-maker Seelan Palay and freelance software developer Chong Kai Xiong while Yap Keng Ho was acquitted. ### 2011–2020 : Party improvements In preparation for the [impending elections in 2011](/wiki/2011_Singaporean_general_election), the Singapore Democratic Party organized two pre-election rallies at Hong Lim Park on September and November 2010. The Party also unveiled a Shadow Budget in February 2011, as well as its campaign strategy, \"The SDP Promise\" in April 2011. Between September 2010 and April 2011, SDP also continued its groundwork in the constituencies of Bukit Panjang, Holland–Bukit Timah, Yuhua and Whampoa. The party unveiled its slate of 11 candidates just a few days prior to Nomination Day. The candidates were introduced during press conferences on 21 and 22 April 2011. Former senior civil servant [Tan Jee Say](/wiki/Tan_Jee_Say), private school teacher Michelle Lee Juen, psychiatrist [Ang Yong Guan](/wiki/Ang_Yong_Guan) and social activist [Vincent Wijeysingha](/wiki/Vincent_Wijeysingha) made up the SDP's team for Holland–Bukit Timah GRC. Also announced during this period of time was the party's intention to contest Sembawang GRC. The team fielded there consisted of academic and former [WP](/wiki/Workers%27_Party_(Singapore)) member [James Gomez](/wiki/James_Gomez_(politician)), party Assistant-Secretary-General John Tan, entrepreneur Jarrod Luo, former unionist Sadasivam Veriyah and businessman Mohd Isa. Former ISA detainee Teo Soh Lung and party treasurer Gerald Sng were also introduced to the media and were fielded in the constituencies of Yuhua and Bukit Panjang respectively. The party later recruited Alec Tok, leaving Sng to make way for Tok in Bukit Panjang SMC. Among the issues brought up by the party prior to nomination day were: the heavy influx of foreigners into Singapore, [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan)'s mismanagement of the [Youth Olympic Games](/wiki/Youth_Olympic_Games) and the loss of sinking funds in the PAP run town councils in Holland–Bukit Timah and Bukit Panjang. However, these issues were quickly overshadowed by Balakrishnan's attack on the SDP team over a video supposedly containing Wijeysingha's \"gay agenda\". The SDP quickly refuted these allegations on Wijeysingha, with the party's Secretary-General making his stance clear on a video released by the party on 25 April. On nomination day, the Singapore Democratic Party team saw the nomination of all its candidates. In particular, the Holland–Bukit Timah team had also raised an objection to the nomination of the PAP's candidates. The PAP's [Sim Ann](/wiki/Sim_Ann) had filed in her occupation as a former civil servant and this was disputed by the SDP team given the short time span between Sim Ann's resignation from the civil service and nomination day. On the polling day on 7 May, the SDP was defeated in all the seats they contested, with 36.1%, 33.73%, 33.14% for Sembawang GRC, Bukit Panjang SMC and Yuhua SMC, respectively; however, their team in Holland–Bukit Timah GRC scored its best result since 1997, with 39.92% (slightly above the national average of 39.86%), and the party's scored 36.76% of the party's popular vote. After the election, Tan Jee Say resigned from SDP to seek candidacy for the [presidential election](/wiki/2011_Singaporean_presidential_election) held on August the same year, as constitution states that candidates were required to be [nonpartisan](/wiki/Non-partisan_democracy) and cannot represent in any political party. Tan only garnered 529,732 out of over two million valid votes (or 25.04%) and finished third in a four-cornered contest to [Tony Tan](/wiki/Tony_Tan), where he won the election with 744,397 votes (or 35.20%). In late August, the SDP held a CEC election with secretary-general Chee retaining his position while [Jufrie Mahmood](/wiki/Jufrie_Mahmood) and [Vincent Cheng](/wiki/Vincent_Cheng_Kim_Chuan) elected to chairman and vice-chairman respectively. On 23 November 2012, Chee was formally discharged from bankruptcy in court. Chee initially expressed his intention to contest the [Punggol East SMC](/wiki/Punggol_East_SMC) in the [2013 by-election](/wiki/2013_Singaporean_by-election) (which was precipitated after the incumbent MP [Michael Palmer](/wiki/Michael_Palmer_(politician)) resigned due to an extramarital affair), but later pulled out from contest to avoid a multi-cornered contest and backed WP (whose candidate, [Lee Li Lian](/wiki/Lee_Li_Lian), would later go on to win). Elections were called by [Prime Minister](/wiki/Prime_Minister) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) in 2015 commemorating after 50 years of independence. The SDP contested five electoral divisions, which were [Bukit Batok SMC](/wiki/Bukit_Batok_SMC), [Bukit Panjang SMC](/wiki/Bukit_Panjang_SMC), [Yuhua SMC](/wiki/Yuhua_SMC), [Holland-Bukit Timah GRC](/wiki/Holland-Bukit_Timah_GRC) and [Marsiling-Yew Tee GRC](/wiki/Marsiling-Yew_Tee_GRC). Chee led a team to contest Holland–Bukit Timah GRC (along with [Paul Tambyah](/wiki/Paul_Tambyah), a professor, Sidek Mallek, a compliance auditor, and Chong Wai Fung, a medical administrator). Despite failing to win any contested seat, Chee's team of Holland–Bukit Timah GRC polled above the Opposition's national average with 30.14% of the popular vote. In this electoral contest, Chee was noted for shifting away from a confrontational style of politics in an attempt to soften his image. Whether this was successful is debatable though it is commonly argued that Chee's return was a significant asset to the party. Although SDP's combined vote of 31.2% was lower compared to the previous election, this was against the backdrop of a large swing away from opposition parties, of which SDP was one of the least affected. On 22 August 2015, SDP moved their headquarters to Ang Mo Kio. On 20 March 2016, SDP announced that Chee would stood as a candidate for the forthcoming [by-election](/wiki/2016_Bukit_Batok_by-election) for the ward of [Bukit Batok SMC](/wiki/Bukit_Batok_SMC) held on 7 May, after incumbent [David Ong](/wiki/David_Ong) vacated his seat due to an extramarital affair involving another grassroots leader. During nomination day on 27 April, Chee was successfully nominated and faced the PAP's candidate [Murali Pillai](/wiki/Murali_Pillai). Former SDP member Kwan Yue Keng also stated his intention to contest as independent, but later withdrew upon Chee's successful nomination, as part of an agreement from the [People's Power Party](/wiki/People%27s_Power_Party_(Singapore)) to prevent a walkover. Despite the by-election defeat, an 11.78% swing towards SDP from the last election saw Chee's best performance score since 1997, at 38.79%. His best performance was widely attributed on his opinionated personality rather than introspective, and how his campaign drew notable attention to his supporters. On 7 August 2017, former [Parliamentary Speaker](/wiki/Speaker_of_Parliament_(Singapore)) [Halimah Yacob](/wiki/Halimah_Yacob) vacated her seat in [Marsiling-Yew Tee GRC](/wiki/Marsiling-Yew_Tee_GRC) in order to contest [that year's presidential election](/wiki/2017_Singaporean_presidential_election). While the seat remain vacant, the grassroots advisor was replaced by [Chua Chu Kang GRC](/wiki/Chua_Chu_Kang_GRC) MP [Zaqy Mohamad](/wiki/Zaqy_Mohamad) the day after. Despite Mohamad was a minority MP for the GRC and a grassroots advisor is not the same as having an MP elected by residents of the constituency, one of the original purposes of the GRC system was to [ensure minority representation](/wiki/Group_Representation_Constituency#Introduction_of_the_scheme), and thus a by-election was not held. On 14 September (the same day Yacob was sworn as [president](/wiki/President_of_Singapore) after the election went [uncontested](/wiki/Walkover)), the party's assistant treasurer Wong Souk Yee filed a lawsuit for a by-election (intended to occur on 15 January 2018 as cited in a pre-trial conference) to be called. Justice Chua Lee Ming presided on the hearing, but on 9 April 2018, their bid was dismissed and Wong was tasked to pay S$10,764.35; Chua told that a by-election should be called only when all seats in a GRC are vacated (which was did once on the [1992 Marine Parade by-election](/wiki/1992_Marine_Parade_by-election)), and there is no legal basis to ask the three remaining MPs to resign. On 16 January 2019, Wong called on the apex court to issue a mandatory order to compel its three MPs to step down for a two-hour hearing. In July 2018, SDP was among the six other opposition parties ([Reform Party](/wiki/Reform_Party_(Singapore)), [Singaporeans First](/wiki/Singaporeans_First), People's Power Party, [Democratic Progressive Party](/wiki/Democratic_Progressive_Party_(Singapore)), [National Solidarity Party](/wiki/National_Solidarity_Party_(Singapore)), [People's Voice Party](/wiki/Peoples_Voice_(Singapore))) present in a meeting led by former PAP MP [Tan Cheng Bock](/wiki/Tan_Cheng_Bock), on the possibility of forming a collation for the next election with Tan as the party leader. SDP intend to side WP as stated after the 2015 elections, but the latter declined their participation request, and did not turn up on the party's meeting. On 23 February 2019, at the time the impending election was yet to be announced, the party was the first to begin their election campaign despite a last-minute venue dropout, and announced that they would contest the same constituencies as they did in the 2015 election, and a goal to prevent the ruling PAP from retaining a government with a [supermajority](/wiki/Supermajority) (two-thirds of the total number of parliamentary seats) that the party attained since post-independence. Party's vice-chairman John Tan announced that SDP would also unveil policy papers on housing and the cost of living the following month, followed by healthcare and population issues in May. Former [DPP](/wiki/Democratic_Progressive_Party_(Singapore)) secretary-leader [Benjamin Pwee](/wiki/Benjamin_Pwee), on the same time, was revealed that he and a few others have submitted their applications to join the SDP, after Pwee left the party on 19 February. On 21 June, the party's leader confirmed Chee would settle a rematch in the [Bukit Batok SMC](/wiki/Bukit_Batok_SMC) against Murali in the election. Three days later on the 24th, the party confirmed their intentions to contest the same wards that they challenged in the last election, namely Bukit Panjang, Holland–Bukit Timah, Marsiling–Yew Tee and Yuhua. Their nominations were confirmed on 30 June, resulting in 11 candidates competing in the election, among which three candidates made their election debut, and [Tan Jee Say](/wiki/Tan_Jee_Say) returning to the party after earlier dissolving Singaporean First ahead of the nominations. SDP chairman and Bukit Panjang candidate [Paul Tambyah](/wiki/Paul_Tambyah) on 3 July had said the [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)) (MOM) had told \"employers they were not allowed to bring their workers for testing\", an allegation that Minister for National Development [Lawrence Wong](/wiki/Lawrence_Wong) later denied on 5 July. When the results were announced on 10 July, they were defeated in every seat contested, although Bukit Panjang came that close to winning the election with chairman Tambyah garnering 46.26% of the votes, while Chee came second with 45.20% of the votes while contesting Bukit Batok. Their vote share based on the constituencies contested was 37.04%, falling short from the national average of 38.76%. In November the same year, SDP held their CEC election. The CEC remain largely unchanged with Chee and Tambyah re-elected as secretary-general and chairman respectively and only one new member was elected into the CEC, Khung Wai Yeen replacing Mansura Sajahan. ### 2021–present: Change of party headquarters The party remained undeterred following the 2020 elections, especially on how the team ran a good campaign and the appearance of Tambyah. Former chairman Ling died on 30 April 2021 due to [pneumonia](/wiki/Pneumonia). In 2023, the party made early preparations leading up to the [next general election](/wiki/2025_Singaporean_general_election), scheduled to be held before November 2025, including its intention to contest on [Sembawang GRC](/wiki/Sembawang_GRC) for the first time since 2011, where the party began their walkabouts around August. On 12 April, the party announced that they will relocate their headquarters from Ang Mo Kio after eight years on 11 November to the \"western half of the island\", later revealing to be WGECA Tower. The party also suggested a coalition with [Progress Singapore Party](/wiki/Progress_Singapore_Party) (PSP) in June that year. Assistant Treasurer and CEC member-elect Manimaran Ashukumar died on 29 July. On 11 May 2024, the SDP held its GE2024 Campaign Launch event at its headquarters in Bukit Batok. Led by Secretary-General Chee and Chairman Tambyah, the party outlined key quality of life issues it would focus on as part of its election campaign – cost of living, inequality, productivity, and national identity – and put forth its position on current immigration and manpower policies affecting the former. On 20 February 2025, the SDP announced that secretary-general Chee would contest in [Bukit Batok SMC](/wiki/Bukit_Batok_SMC) for the third time to \"keep its primary focus on the constituencies\" where the party maintains a presence. However, following the redistricting of Bukit Batok SMC into the new Jurong East–Bukit Batok GRC, Chee announced on 23 March 2025 that he would contest in the newly-created [Sembawang West SMC](/wiki/Sembawang_West_SMC) instead, while chairman [Paul Tambyah](/wiki/Paul_Tambyah) would contest in [Bukit Panjang SMC](/wiki/Bukit_Panjang_Single_Member_Constituency). However, despite the acknowledgement of an \"uphill battle\", the party won none of the seats, though Chee came very close into being elected where he garnered 46.81% of his vote share, while the other wards had their votes slashed towards the PAP. Nonetheless, Chee respected the results despite citing that he fell short into electing him as an [Non-constituency Member of Parliament](/wiki/Non-constituency_Member_of_Parliament). On 18 May, Chee and Tambyah launched the \"Orange and Teal Social Enterprise Co-operative\" as a \"people-centric economic counterweight to the PAP–NTUC nexus\". They also advocated for electoral reforms via petitions and established a youth group in preparation for future elections. ## Organization and structure The SDP is governed by a twelve-member Central Executive Committee (CEC), who are elected by the party's cadre members at the Ordinary Party Conference held biennially. ### Central Executive Committee Line-up (2024–2026) On 3 February 2024, the Singapore Democratic Party (SDP) announced the election of its Central Executive Committee (CEC) during the 21st Ordinary Party Conference (OPC). The cadre members elected the CEC, which will serve a two-year term starting from February 2024. Dr. [Paul Tambyah](/wiki/Paul_Tambyah), Chairperson of the SDP, commented on the new CEC line-up, stating that it comprises a balanced mix of experienced party veterans and dynamic young members, all committed to fostering a more democratic Singapore. He expressed confidence that the team would successfully manage town councils and address important issues in Parliament with innovative solutions. Secretary-General Dr. [Chee Soon Juan](/wiki/Chee_Soon_Juan) emphasized the importance of a unified strategy for public engagement and planning as the party prepares for the upcoming General Election, expected in the latter half of 2024. He stressed the need for effective communication and groundwork to be established in the weeks and months ahead to ensure a strong electoral campaign. TitleNameSecretary-General[Chee Soon Juan](/wiki/Chee_Soon_Juan)Assistant Secretary-General / SecretariatChristopher AngChairman / Policy[Paul Tambyah](/wiki/Paul_Tambyah)Vice-Chairman / Training & DevelopmentBryan Lim Boon HengTreasurer / FundraisingSurayah AkbarAssistant Treasurer / Ground OperationsMatthew TanOrganising Secretary / Secretariat DeputyJufri SalimBranding & CommunicationsMin Cheong-SubramaniamCreative ServicesNaresh SubramaniamLogisticsAshukumar VeerappanLogistics DeputyFrancis YongMemberGerald SngPolicy Deputy[James Gomez](/wiki/James_Gomez_(politician))Ground Operations DeputyAbdul Salim Harun ## Leadership ### List of secretaries-general NoNameTerm startTerm end1[Chiam See Tong](/wiki/Chiam_See_Tong)6 August 198017 May 19932[Chee Soon Juan](/wiki/Chee_Soon_Juan)17 May 1993*Incumbent* ### List of chairmen NoNameTerm startTerm end1[Fok Tai Loy](/wiki/Fok_Tai_Loy)198019842[Ling How Doong](/wiki/Ling_How_Doong)198420073Gandhi Ambalam200720114[Jufrie Mahmood](/wiki/Jufrie_Mahmood)201120135Jeffrey George201320156Wong Souk Yee201520177[Paul Anantharajah Tambyah](/wiki/Paul_Tambyah)2017*Incumbent* ## Former elected Members of Parliament NoNameConstituencyMP since1[Chiam See Tong](/wiki/Chiam_See_Tong)[Potong Pasir SMC](/wiki/Potong_Pasir_SMC)1984–19962[Ling How Doong](/wiki/Ling_How_Doong)[Bukit Gombak SMC](/wiki/Bukit_Gombak_SMC)1991–19973[Cheo Chai Chen](/wiki/Cheo_Chai_Chen)[Nee Soon Central SMC](/wiki/Nee_Soon_Central_Single_Member_Constituency)1991–1997 ## Election results ### Parliament ElectionLeaderVotes%SeatsNCMPsPositionResultContestedTotal+/–SeatsWonLost(/wiki/1980_Singaporean_general_election)[Chiam See Tong](/wiki/Chiam_See_Tong)11,2921.77%3030 / 75—N/a 7thNo seats(/wiki/1984_Singaporean_general_election)32,1023.66%4131 / 79 10 / 1 3rdOpposition(/wiki/1988_Singaporean_general_election)158,34111.80%181171 / 810 / 2 3rdOpposition(/wiki/1991_Singaporean_general_election)93,85611.98%9363 / 81 2—N/a 2ndOpposition(/wiki/1997_Singaporean_general_election)[Chee Soon Juan](/wiki/Chee_Soon_Juan)76,12910.62%120120 / 83 30 / 1 4thNo seats(/wiki/2001_Singaporean_general_election)50,6078.09%110110 / 840 / 1 4thNo seats(/wiki/2006_Singaporean_general_election)45,9374.09%7070 / 840 / 1 3rdNo seats(/wiki/2011_Singaporean_general_election)97,3694.83%110110 / 870 / 3 4thNo seats(/wiki/2015_Singaporean_general_election)84,9313.76%110110 / 890 / 3 3rdNo seats(/wiki/2020_Singaporean_general_election)111,0544.45%110110 / 930 / 2 4thNo seats(/wiki/2025_Singaporean_general_election)88,8583.72%110110 / 970 / 2 5thNo seats #### Seats contested ElectionConstituencies contestedContested vote %+/–(/wiki/1980_Singaporean_general_election)[SMC](/wiki/Constituencies_of_Singapore): [Cairnhill](/wiki/Cairnhill_Single_Member_Constituency), [Joo Chiat](/wiki/Joo_Chiat_Single_Member_Constituency), [Potong Pasir](/wiki/Potong_Pasir_Single_Member_Constituency)30.7%—N/a(/wiki/1984_Singaporean_general_election)SMC: [Changkat](/wiki/Changkat_Single_Member_Constituency), [Chong Boon](/wiki/Chong_Boon_Single_Member_Constituency), **Potong Pasir**, [Yuhua](/wiki/Yuhua_Single_Member_Constituency)46.1% 15.4%(/wiki/1988_Singaporean_general_election)[3-member GRC](/wiki/Group_representation_constituency): [Aljunied](/wiki/Aljunied_Group_Representation_Constituency); SMC: [Braddell Heights](/wiki/Braddell_Heights_Single_Member_Constituency), [Bukit Batok](/wiki/Bukit_Batok_Single_Member_Constituency), [Bukit Gombak](/wiki/Bukit_Gombak_Single_Member_Constituency), [Bukit Panjang](/wiki/Bukit_Panjang_Single_Member_Constituency), [Buona Vista](/wiki/Buona_Vista_Single_Member_Constituency), Cairnhill, [Kim Keat](/wiki/Kim_Keat_Single_Member_Constituency), [Nee Soon Central](/wiki/Nee_Soon_Central_Single_Member_Constituency), [Nee Soon South](/wiki/Nee_Soon_South_Single_Member_Constituency), [Paya Lebar](/wiki/Paya_Lebar_Single_Member_Constituency), **Potong Pasir**, [Punggol](/wiki/Punggol_Single_Member_Constituency), [Thomson](/wiki/Thomson_Single_Member_Constituency), [Ulu Pandan](/wiki/Ulu_Pandan_Single_Member_Constituency), Yuhua39.5% 6.6%(/wiki/1991_Singaporean_general_election)SMC: Braddell Heights, Bukit Batok, **Bukit Gombak**, **Nee Soon Central**, Nee Soon South, **Potong Pasir**, [Tanglin](/wiki/Tanglin_Single_Member_Constituency), Ulu Pandan, Yuhua48.6% 9.1%(/wiki/1997_Singaporean_general_election)5-member GRC: Aljunied; 4-member GRC: [Jalan Besar](/wiki/Jalan_Besar_Group_Representation_Constituency); SMC: Bukit Gombak, [Macpherson](/wiki/Macpherson_Single_Member_Constituency), Nee Soon Central33.1% 15.5%(/wiki/2001_Singaporean_general_election)5-member GRC: [Hong Kah](/wiki/Hong_Kah_Group_Representation_Constituency), [Jurong](/wiki/Jurong_Group_Representation_Constituency); SMC: Nee Soon Central20.4% 12.7%(/wiki/2006_Singaporean_general_election)6-member GRC: [Sembawang](/wiki/Sembawang_Group_Representation_Constituency); SMC: Bukit Panjang23.2% 2.8%(/wiki/2011_Singaporean_general_election)5-member GRC: Sembawang; 4-member GRC: [Holland-Bukit Timah](/wiki/Holland-Bukit_Timah_Group_Representation_Constituency); SMC: Bukit Panjang, Yuhua36.8% 13.6%(/wiki/2015_Singaporean_general_election)4-member GRC: Holland-Bukit Timah, [Marsiling Yew Tee](/wiki/Marsiling-Yew_Tee_Group_Representation_Constituency); SMC: Bukit Batok, Bukit Panjang, Yuhua31.2% 5.6%(/wiki/2020_Singaporean_general_election)4-member GRC: Holland-Bukit Timah, Marsiling-Yew Tee; SMC: Bukit Batok, Bukit Panjang, Yuhua37.0% 5.8%(/wiki/2025_Singaporean_general_election)4-member GRC: Marsiling-Yew Tee; 5-member GRC: Sembawang; SMC: Bukit Panjang, [Sembawang West](/wiki/Sembawang_West_SMC)30.9% 6.1% ### By-elections ElectionLeaderConstituency contestedVotes%SeatsResultContestedTotal+/–WonLost(/wiki/1992_Singaporean_by-election)[Chiam See Tong](/wiki/Chiam_See_Tong)[Marine Parade GRC](/wiki/Marine_Parade_GRC)16,44724.5%040 / 4Lost(/wiki/2016_Bukit_Batok_by-election)[Chee Soon Juan](/wiki/Chee_Soon_Juan)[Bukit Batok SMC](/wiki/Bukit_Batok_SMC)14,15238.8%100 / 1Lost ### Bibliography - Official website - Press release on podcast Portals: - Liberalism - Politics - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:03.774062",
  "title": "Singapore Democratic Party",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Democratic_Party"
}