{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:00:15.973717"
  },
  "content": "Passport of the Republic of Singapore issued to Singapore citizens The **Singapore passport** is a [passport](/wiki/Passport) issued to citizens of the [Republic of Singapore](/wiki/Republic_of_Singapore). It enables the bearer to exit and re-enter Singapore freely; travel to and from other countries in accordance with [visa requirements](/wiki/Visa_requirements_for_Singapore_citizens); facilitates the process of securing [assistance from Singapore consular officials](/wiki/Consular_assistance) abroad, if necessary; and requests protection for the bearer while abroad. All Singapore passports are issued exclusively by the [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority) (ICA) on behalf of the [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)). The passport is valid for ten years. The Singapore passport is one of the most powerful passports in the world, having been placed as the most powerful passport itself on numerous occasions. In 2025, the Singapore passport has been ranked the most powerful passport in the world, with visa-free or visa on arrival access to 193 countries and territories according to the [Henley Passport Index](/wiki/Henley_Passport_Index). Subsequently, the Singapore passport is a popular target for counterfeiters due to the relatively liberal visa requirements for Singaporeans and the tendency for immigration officials to clear Singapore passport holders more quickly. In response, the ICA has thus adopted several measures to foil forgers, including adding digital photos and special ink since October 1999, and converting to a [biometric passport](/wiki/Biometric_passport) from August 2006. ## History The first version of the modern Singapore passport was introduced on 20 June 1966, replacing the Singapore Provisional Passport issued from 17 August 1965. Between 1963 and 1965, [Malaysian passports](/wiki/Malaysian_passport) were issued to residents of Singapore [when it formed part of Malaysia](/wiki/Singapore_in_Malaysia), and [CUKC](/wiki/Citizen_of_the_United_Kingdom_and_Colonies) [British passports](/wiki/British_passport) were issued prior to 1963. The [Straits Settlements](/wiki/Straits_Settlements), of which Singapore was the capital from 1832 until 1946, also issued its own passports prior to World War II. ### Singapore Restricted Passport (blue cover) Between 1967 and 1999, Singapore also issued a Restricted Passport with a blue cover mainly for travel to [West Malaysia](/wiki/Peninsular_Malaysia). The Restricted Passport was conceived due to the fact that many Singaporeans would regularly travel to West Malaysia for business and leisure purposes. The Restricted Passport ceased to be issued after 1999 due to a lack of demand and the red Singapore Passport was deemed to be the only valid travel document for overseas travel by Singapore citizens from 1 January 2000. ## Validity The Singapore passport is valid for a period of - - 10 years and 9 months issued before 1 April 2005. Remaining validity can be transferred to the new passport. - 5 years and 9 months issued from 1 April 2005 to 30 September 2021; and children below 16 from 1 October 2021 onwards due to facial change of features. Remaining validity can be transferred to the new passport. - 10 years issued from 1 October 2021 for adults above 16. Remaining validity cannot be transferred to the new passport. The government cited improved confidence in the security of biometric passports. ## Biometric passport Since 15 August 2006, all newly issued Singapore passports contain [biometric](/wiki/Biometric_passport) features (BioPass). A major reason for this addition is to comply with the requirements for the US [Visa Waiver Program](/wiki/Visa_Waiver_Program). The features also help to prevent forgery and minimise the abuse of Singapore passports. The biometric passports contain 64 pages, unlike the [machine readable passports](/wiki/Machine_readable_passport), which contain 96 pages. It costs [S$](/wiki/Singapore_Dollar)70 for a passport. One can apply for the passport on the Internet or at the ServiceSG Centres located at Our Tampines Hub, Heartbeat @ Bedok, Bukit Canberra, One Punggol and Woodlands Civic Centre. However, if the application is made in person at a [Singapore diplomatic mission](/wiki/List_of_diplomatic_missions_of_Singapore), it will cost S$80 in foreign currency equivalent. The biometric passport is valid for 10 years for adults above the age of 16 and the remaining validity cannot be transferred to the new passport. Children's passports under the age of 16 will be valid for 5 years and will allow the photograph in their passport to be updated more frequently, which will minimise identification problems when going through immigration. Only children under the age of 16 are allowed to transfer the remaining validity to the new passport. In a break from long standing practice, the passport number is now unique to each passport, instead of being identical to the holder's [NRIC](/wiki/National_Registration_Identity_Card) number. The biometric passport project cost the Singapore government a total of S$9.7 million. A new Singapore biometric passport design was introduced on 26 October 2017. It features a redesigned front cover as well as several new security features such as a Multiple Laser Image (MLI) in the shape of [Singapore Island](/wiki/Pulau_Ujong) and a window lock of the image of the passport holder which can be viewed as a positive or negative image when tilted and viewed under a light source. New visa page designs, featuring the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens), [Esplanade](/wiki/Esplanade_%E2%80%93_Theatres_on_the_Bay), [Marina Barrage](/wiki/Marina_Barrage), [Gardens by the Bay](/wiki/Gardens_by_the_Bay), [Singapore Sports Hub](/wiki/Singapore_Sports_Hub) and [Punggol](/wiki/Punggol) New Town were also introduced in the new biometric passport, replacing the previous [Central Business District](/wiki/Central_Area,_Singapore) and Esplanade visa page designs. ## Physical appearance ### Front cover Singapore passports are red in colour, with the words \"**REPUBLIC OF SINGAPORE**\" inscribed at the top of the front cover, and the [coat of arms of Singapore](/wiki/Coat_of_arms_of_Singapore) emblazoned in the centre of the front cover. The motto and the title of the national anthem of Singapore, [Majulah Singapura](/wiki/Majulah_Singapura), is inscribed on the scroll of the coat of arms, whilst the word **\"PASSPORT\"** is inscribed below. The [biometric passport](/wiki/Biometric_passport) symbol appears at the bottom of the front cover under the word **\"PASSPORT\"**. ### Passport note The passport contains a note from the [President of Singapore](/wiki/President_of_Singapore) addressing the authorities of all territories: > *The President of the Republic of Singapore requests all authorities to allow the Singapore citizen named in this passport to pass without delay or hindrance and, if necessary, to give all assistance and protection.* ### Information page Singapore passports include the following data on the plastic information page: - (left) Photo of the passport bearer - Type (PA – biometric passport) - Code of issuing state (SGP) - Passport number - Full name - Sex (Gender) - Nationality (Singapore Citizen) - Date of birth - Place of birth - Date of issue - Date of expiry - Modifications - Authority - [National ID number](/wiki/National_Registration_Identity_Card#Structure_of_the_NRIC_number/FIN) The information page ends with the [Machine Readable Zone](/wiki/Machine_Readable_Zone). ### Biometric chip The embedded chip stores the owner's digitised photograph, name, sex, date of birth, nationality, passport number, and the passport expiry date. This is the same information that appears on the printed information page of every passport. [Facial recognition technology](/wiki/Facial_recognition_system) was introduced with the release of the [ePassport](/wiki/Biometric_passport) to improve identity verification and reduce [identity-related fraud](/wiki/Identity_theft). Iris imaging was later added to complement the biometric fingerprint. ## Visa requirements Visa requirements for Singapore citizens are administrative entry restrictions by the authorities of other states which are placed on citizens of Singapore. As of June 2025, [Singaporean citizens](/wiki/Singapore_nationality_law) had visa-free or visa on arrival access to 193 countries and territories, ranking the Singapore passport the most powerful in the world in terms of travel freedom, according to the [Henley Passport Index](/wiki/Henley_Passport_Index). The Singapore passport often periodically switches between being 1st or 2nd on the list. ## Automated border control systems Singapore citizens aged 6 and older are eligible to use the automated clearance lanes at the country's checkpoints, provided that their biometric identifiers (iris / facial / fingerprints) have been enrolled with ICA. In addition, for young Singapore citizens who wish to use the automated lanes but had collected their passports before turning six, they may enrol their biometrics at the staffed immigration counters (with the supervision of their parent/guardian). In addition, with Singapore's developed and high-income status, Singapore citizens who intend to travel as [tourists](/wiki/Tourism), are also eligible to use the automated border control systems (eGates) when arriving in (or departing from) the various following countries: Country/RegionVisa-ExemptionDuration of Allowed initial stayName of Immigration AuthorityName of ABC SystemRef [Australia](/wiki/Australia)[Electronic Travel Authority](/wiki/Visa_policy_of_Australia#Electronic_visas)90 days[Australian Border Force](/wiki/Australian_Border_Force) (ABF)[SmartGate](/wiki/SmartGate) [France](/wiki/France)Visa not required90 days (within any 180-day period in the [Schengen Area](/wiki/Schengen_Area))[Direction centrale de la police aux frontières](/wiki/Direction_centrale_de_la_police_aux_fronti%C3%A8res) (DCPAF)[PARAFE](/wiki/PARAFE) [Hong Kong](/wiki/Hong_Kong)Visa not required90 days[Immigration Department (Hong Kong)](/wiki/Immigration_Department_(Hong_Kong))[e-Channel](/wiki/E-Channel) [Italy](/wiki/Italy)Visa not required90 days (within any 180-day period in the [Schengen Area](/wiki/Schengen_Area))[Polizia di Frontiera](/wiki/Polizia_di_Stato#Immigration_and_Border_Police)[EGate (Italy)](/wiki/EGate_(Italy)) [Japan](/wiki/Japan)aVisa not required90 daysImmigration Services Agency of Japan (ISA)Automated Gates [Malaysia](/wiki/Malaysia)bVisa not required30 days[Immigration Department of Malaysia](/wiki/Immigration_Department_of_Malaysia)Autogate/e-gate [New Zealand](/wiki/New_Zealand)[Electronic Travel Authority](/wiki/New_Zealand_Electronic_Travel_Authority)3 months[New Zealand Customs Service](/wiki/New_Zealand_Customs_Service)[eGate](/wiki/SmartGate) [Portugal](/wiki/Portugal)Visa not required90 days (within any 180-day period in the [Schengen Area](/wiki/Schengen_Area))[Serviço de Estrangeiros e Fronteiras](/wiki/Foreigners_and_Borders_Service) (SEF)[RAPID4ALL](/wiki/Automated_border_control_system#Portugal) [Thailand](/wiki/Thailand)cVisa not required30 days[Royal Thai Police Immigration Bureau](/wiki/Royal_Thai_Police#Immigration_Bureau)Automated Passport Control (APC) [United Arab Emirates](/wiki/United_Arab_Emirates)dVisa not required30 daysFederal Authority for Identity, Citizenship, Customs and Port Security (FAICCPS)Smart Gate [United Kingdom](/wiki/United_Kingdom)Visa not required6 months[UK Border Force](/wiki/Border_Force)[EPassport gates](/wiki/EPassport_gates) [United States](/wiki/United_States)[Visa Waiver Program](/wiki/Visa_Waiver_Program)90 days[U.S. Customs and Border Protection](/wiki/U.S._Customs_and_Border_Protection) (CBP)[Global Entry Programme](/wiki/Global_Entry) Automated Passport Control (APC) [Mobile Passport Control (MPC)](/wiki/Mobile_Passport_Control) a) The Trusted Traveller Program offered by the Immigration Services Agency of Japan (ISA), is limited to: - directors or full-time employees of the [Government of Singapore](/wiki/Government_of_Singapore) and its public and corporate affiliates. - directors or full-time employees of [international organizations](/wiki/International_organization). - directors or full-time employees of [public companies](/wiki/Public_company) listed in Japan and their subsidiaries. - directors or full-time employees of [public companies](/wiki/Public_company) listed in the [visa-exempt countries under Japanese visa policy](/wiki/Visa_policy_of_Japan#Visa_exempt_countries). - directors or full-time employees of [private companies](/wiki/Privately_held_company) with capital or investment of JPY 500 million. - business relationship foreign invitee of Japanese government-affiliated institutions or Japanese [publicly-listed corporations](/wiki/Public_company) (and their subsidiaries). - tourists with platinum or higher-status credit cards. - spouse or child (unmarried minor) of aforementioned businesspeople or [high-net-worth](/wiki/High-net-worth_individual) tourists. b) The e-gate can only be used after first-time arrival and registration at the manual immigration counter. Singapore passport holders may use e-gates at [Sultan Iskandar Building](/wiki/Sultan_Iskandar_Building) and [Sultan Abu Bakar Complex](/wiki/Sultan_Abu_Bakar_Complex) in [Johor](/wiki/Johor), and also at the [Kuala Lumpur International Airport](/wiki/Kuala_Lumpur_International_Airport). c) APC facility for Singapore passport holders only available at [Suvarnabhumi Airport](/wiki/Suvarnabhumi_Airport) and passports are still stamped upon exiting APC. d) The Smart Gates at Dubai Airport can only be used after the first-time arrival and registration at the manual immigration touchpoint in Dubai. ## Dual citizenship Dual citizenship is strictly prohibited by the Singaporean government. A dual citizen may have acquired citizenship by birth in a foreign country, by descent from a foreign citizen parent, or by registration. Singapore citizens who voluntarily and intentionally acquire citizenship of a foreign country after the age of 18 may be deprived of their Singaporean citizenship by the Government. Foreigners who naturalise as Singapore citizens are required to renounce all foreign citizenships. Persons who are born outside of Singapore and have at least one parent who is a Singaporean citizen may register with a Singaporean consulate within a year to acquire Singaporean citizenship by descent. However, such persons who acquire foreign citizenship (by birth in a *[jus soli](/wiki/Jus_soli)* country or naturalisation in another country at an early age) must choose one citizenship before reaching 22 years of age. Singapore passports issued to dual citizens have their maximum validity capped at up to their 22nd birthday. They can be renewed for the usual 5 year validity free of cost after renunciation of foreign citizenship and completion of the Oath of Renunciation, Allegiance and Loyalty (ORAL) before reaching 22 years of age. ## National Service issues All male citizens are required to be conscripted for two years as [National Service](/wiki/National_service_in_Singapore) (NS). There are different categories of people who is needed to apply for exit permit. It is mandatory for pre-enlistees above the age of 13 all the way to the ORNS to follow these exit permits. Failure to follow these regulations is an offence, a fine of up to $10,000 or imprisonment of up to 3 years or both. It can be released if you are exempted from National Service, or finish ORD in the lower PES level (PES E). LevelAgeExit permitsPre-Enlistment13 - 16.5 years old3 months and above16.5 years old - Enlistment/Exemption3 months and aboveEnlistmentThroughout the whole duration of NS3 months and aboveORNS (Reservist)For 10 years after ORD12 months and above Media related to Passports of Singapore at Wikimedia Commons - Issuing of Singapore passports - History of the Singapore passport From passport-collector.com\n",
  "language": "en",
  "processed_at": "2026-01-12T12:00:15.973198",
  "title": "Singapore passport",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_passport"
}