{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:57:24.472306"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore Mint\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2021)* *(Learn how and when to remove this message)* The **Singapore Mint** is a Singaporean [mint](/wiki/Mint_(facility)) manufacturer. The Singapore Mint is a fully owned subsidiary of [Sembcorp Industries](/wiki/Sembcorp). ## History The Singapore Mint was established in 1968 as a basic minting facility to produce [circulation coins for Singapore](/wiki/Singapore_dollar#Coins). It produced Singapore's first and second series of circulation coins. In 1984, the [Brunei Currency Board](/wiki/Brunei_Darussalam_Central_Bank), of newly independent [Brunei](/wiki/Brunei), ordered four million circulation coins and 8,000 sets of commemorative coins. The one cent coin was struck in bronze with the five, ten, twenty and fifty cents coins in [cupro-nickel](/wiki/Cupronickel). The commemorative coin set included a one dollar coin which is struck in cupro-nickel. The 50 cents and 1 dollar coin have additional security feature with a reeded edge with dots between lines at regular interval while other countries' circulation coins are mill-edged. On 13 November 1987, the [Board of Commissioners of Currency, Singapore](/wiki/Board_of_Commissioners_of_Currency,_Singapore) appointed Singapore Mint as the sole sales agent for commemorative coins issued by the Board. The mint also became the exclusive marketing agent and distributor of Singapore gold [bullion coins](/wiki/Bullion_coin). The mint currently also produces other countries' circulation coins. On 21 February 2013, the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) announced a third series of Singapore circulation coins but the contract to produce the coins went to the [Royal Canadian Mint](/wiki/Royal_Canadian_Mint). The Singapore Mint has 3 retail stores. ## Coin Gallery In 1983, a Coin Gallery, located at Jalan Boon Lay, was opened by the Singapore Mint to the public as a mini museum showing the history of Singapore coinage. As the gallery is located in the restricted premises of [Chartered Industries of Singapore](/wiki/Chartered_Industries_of_Singapore), arrangements need to be made to visit the gallery. ## Notable Production History ### Singapore 150th anniversary commemorative coin In 1969, the Singapore Mint released its first commemorative coin to mark the 150th anniversary of modern Singapore's founding. Weighing 24.88 and minted with .916 fineness gold with a $150 face value, the coin featured the [Raffles Lighthouse](/wiki/Raffles_Lighthouse), a landmark in Singapore. It has a mintage of 198,000. ### Changi Airport commemorative coin With the opening of Singapore's [Changi Airport](/wiki/Changi_Airport) in 1981, the mint produced 2 commemorative coins of the same design featuring the airport's control tower. One coin was minted in .925 silver weighing 20 grams while the other was minted in [copper-nickel](/wiki/Cupronickel) weighing 17 grams. The latter was the mint's first production of cupro-nickel coins. Both coins had a $5 [face value](/wiki/Face_value). ### Pope John Paul II Singapore visit medallion In 1986, [Pope John Paul II](/wiki/Pope_John_Paul_II) made his inaugural trip to Singapore, signifying the first-ever visit by a Catholic pontiff to the country. The Singapore Mint commemorated this visit with a cupro-nickel medallion with the pope's portrait on one side and a flying dove with the words “Love and Peace” on the other side. ### 50th Anniversary of Singapore Airlines In 1997, the 50th anniversary of [Singapore Airlines](/wiki/Singapore_Airlines), Singapore's national carrier, was commemorated with the issue of 3 coins - a $50 one ounce gold [proof coin](/wiki/Proof_coinage) (with .9999 fineness), a $5 30-gram silver proof (with .925 fineness), and a $5 20-gram copper-nickel coin. The coins' reverse featured a Singapore Airlines airplane with the text \"Singapore Airlines 50th Anniversary\". ### Trump-Kim summit medallions In 2018, the Singapore Mint produced three commemorative medallions to mark the [Trump-Kim summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit) - a half ounce gold proof medallion with .9999 [fineness](/wiki/Fineness), a one ounce silver proof medallion with .999 fineness, and a nickel-plated zinc medallion. The gold and silver medallions had an initial 1,000 and 10,000 mintage initially but were increased to 3,000 and 15,000 pieces due to \"overwhelming\" demand. ### NS55 silver medallion In 2022, the Singapore Mint produced a commemorative 20-gram NS55 silver proof-like medallion in celebration of Singapore's 55th year of [National Service](/wiki/National_service_in_Singapore) (NS). Minted with .999 fineness silver, the medallion featured five uniformed servicemen from the [Republic of Singapore Navy](/wiki/Republic_of_Singapore_Navy), the [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force), the [Singapore Army](/wiki/Singapore_Army), the [Singapore Police Force](/wiki/Singapore_Police_Force), and the [Republic of Singapore Air Force](/wiki/Republic_of_Singapore_Air_Force). ## Incident in 2020, the mint launched a series of commemorative medallions and a copper bust to mark the fifth anniversary of [Lee Kuan Yew](/wiki/Lee_Kuan_Yew)'s death. The collection was supposed to be the second issue of the mint's Singapore Salute Series. The sales were suspended shortly after public criticism of Singapore Mint profiting from Lee's image and also possibility of breaching [Ministry of Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth)'s (MCCY) guidelines of using Lee's image for \"commercial exploitation\". MCCY replied that it was aware of the launch and declined commenting on whether guidelines were breached. - Singapore portal - Numismatics portal - [List of mints](/wiki/List_of_mints) - [Singapore Portrait Series currency notes](/wiki/Singapore_Portrait_Series_currency_notes) - [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) - Official website - Soh, Doreen (1990). *From cowries to credit cards: stories of Singapore's money*. Federal Publications. p. 85. [ISBN](/wiki/ISBN_(identifier)) 9789810120337.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:57:24.472002",
  "title": "Singapore Mint",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Mint"
}