{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:57:15.993135"
  },
  "content": "Autonomous university in Singapore founded in 2000‹ The template *Infobox university* is being considered for merging. › **Singapore Management University** (**SMU**) is a publicly-funded private university in [Singapore](/wiki/Singapore). Founded in 2000, SMU is the third oldest [autonomous university](/wiki/Autonomous_university) in the country, modelling its education after the [Wharton School](/wiki/Wharton_School). The university is [triple accredited](/wiki/Triple_accreditation) by [AACSB](/wiki/Association_to_Advance_Collegiate_Schools_of_Business), [EQUIS](/wiki/European_Quality_Improvement_System) and [AMBA](/wiki/Association_of_MBAs). In 2024, SMU was ranked 44th in the world for Business and Management Studies, while also placing in the top 100 for Economics and Finance by QS. SMU enrols about 10,000 undergraduate and postgraduate students, offering undergraduate and graduate degree programmes in [accountancy](/wiki/Accountancy), [business administration](/wiki/Business_administration), [business analytics](/wiki/Business_analytics), [economics](/wiki/Economics), [financial services](/wiki/Financial_services), [information systems](/wiki/Information_systems), [software engineering](/wiki/Software_engineering), law, and the [social sciences](/wiki/Social_science). The university is organised into eight schools: School of Accountancy, Lee Kong Chian School of Business, School of Economics, School of Computing and Information Systems, Yong Pung How School of Law, School of Social Sciences, College of Integrative Studies and the College of Graduate Research Studies. ## History In 1997, the [Government of Singapore](/wiki/Government_of_Singapore) began considering setting up a third university in Singapore. [Ho Kwon Ping](/wiki/Ho_Kwon_Ping), a Singaporean business entrepreneur, was appointed to chair the task-force which determined that the new institution would follow the American university system featuring a more flexible broad-based education. Following a review of undergraduate business schools to serve as a model for SMU, the [Wharton School](/wiki/Wharton_School) of the [University of Pennsylvania](/wiki/University_of_Pennsylvania) emerged as the best candidate. The Wharton-SMU agreement was signed in February 1999 followed in June by the Wharton-SMU Research Center collaboration.[*citation needed*] In July 1999, [Janice Bellace](/wiki/Janice_R._Bellace), then Deputy Dean of the [Wharton School of the University of Pennsylvania](/wiki/Wharton_School_of_the_University_of_Pennsylvania), commenced a two-year term as SMU's first president alongside founding [provost](/wiki/Provost_(education)), Tan Chin Tiong. In 2000, SMU made its first home at the former Raffles College (now the [National University of Singapore](/wiki/National_University_of_Singapore)'s [Bukit Timah](/wiki/Bukit_Timah) campus) on Evans Road near [Hwa Chong Institution](/wiki/Hwa_Chong_Institution). The campus, first opened in 1929, had already been home to several institutions before SMU. In 2001, SMU upgraded and occupied the main campus facilities, balancing the need to refit and refurbish it with facilities while preserving the heritage of colonial architecture. From 2001 to 2004, Ronald Frank served as SMU's second president and was succeeded by Howard Hunter. Between 2000 and 2005, SMU saw the formation of four schools, its library and three centres of excellence as well as the graduation of the first batch of its students. After that, SMU moved from its Bukit Timah campus to its current campus in the [Bugis](/wiki/Bugis,_Singapore)-[Bras Basah](/wiki/Bras_Basah) district. Since then, SMU has expanded, with the establishment of its [School of Law](/wiki/Yong_Pung_How_School_of_Law) in 2007 and the restructuring of its School of Economics and Social Sciences into two separate schools: the School of Economics and the [School of Social Sciences](/wiki/SMU_School_of_Social_Sciences). In 2010, [Yong Pung How](/wiki/Yong_Pung_How) and [Arnoud De Meyer](/wiki/Arnoud_De_Meyer) took over the positions of SMU chancellor and president from [Richard Hu](/wiki/Richard_Hu) and Howard Hunter respectively. In 2015, [J. Y. Pillay](/wiki/J._Y._Pillay) replaced Yong as SMU's chancellor while [Lily Kong](/wiki/Lily_Kong) succeeded De Meyer as SMU's president in January 2019. Lim Chee Onn succeeded J. Y. Pillay as Chancellor in August that year.[*citation needed*] ## Academics SMU follows a [course credit](/wiki/Course_credit) system similar to that used in most American universities. Each individual course within the university is assigned a certain credit weightage and students are usually required to take a specified number of units to fulfill requirements for graduation. Courses are typically conducted as small group seminars of under 50 students. Undergraduate students may be enrolled in second majors as well as double degrees. ### Admissions SMU admits students from a list of pre-university or high school qualifications that includes the [Singapore-Cambridge GCE Advanced Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level), diplomas from the [five polytechnics or two arts institutions](/wiki/Education_in_Singapore#Polytechnics) and [International Baccalaureate diploma](/wiki/IB_Diploma_Programme) once a year. For entry to graduate or master programmes, SMU requires [GMAT](/wiki/GMAT) and [TOEFL](/wiki/TOEFL) or [IELTS](/wiki/IELTS) for most of the [majors](/wiki/Major_(academic)). Some majors also require submission of essays, recommendation letters, and a minimum work experience requirement. ## Schools ### School of Accountancy The School of Accountancy was launched in 2001 with the [Bachelor of Accountancy](/wiki/Bachelor_of_Accountancy) (BAcc) undergraduate degree as its sole offering. In 2005, the school launched the [Master of Professional Accounting](/wiki/Master_of_Professional_Accounting) (MPA) programme for professionals without undergraduate accounting qualifications. Both the SMU MPA and BAcc are accredited with the [Institute of Singapore Chartered Accountants](/wiki/Institute_of_Singapore_Chartered_Accountants), [Chartered Accountant Singapore](/wiki/Chartered_Accountant_of_Singapore), the Accounting and Corporate Regulatory Authority (ACRA), [CPA Australia](/wiki/CPA_Australia), the [Institute of Chartered Accountants Australia](/wiki/Institute_of_Chartered_Accountants_Australia) (ICAA) and the [Institute of Chartered Accountants in England and Wales](/wiki/Institute_of_Chartered_Accountants_in_England_and_Wales) (ICAEW). ### Lee Kong Chian School of Business The Lee Kong Chian School of Business was SMU's first school, opening its doors to its pioneer batch of [Bachelor of Business Management](/wiki/Bachelor_of_Business_Management) (BBM) students in August 2000. The school was named after the philanthropist [Lee Kong Chian](/wiki/Lee_Kong_Chian). In addition to its undergraduate offerings, the school offers masters degrees and PhDs. ### School of Economics The School of Economics was established in July 2002 as part of the then School of Economics and Social Sciences (SESS). The SOE has a total of 51 full-time faculty with extensive experience from around the world. As of now, the SOE offers the Bachelor of Science (Economics) as well as Master of Science programmes in Economics and Applied Economics. In 2007, the school also introduced a PhD in Economics programme. ### School of Computing and Information Systems The School of Computing and Information Systems (SCIS) was first formed as the School of Information Systems (SIS) with the aid of [Carnegie Mellon University](/wiki/Carnegie_Mellon_University) (CMU). In 2021, the school was rebranded as the School of Computing and Information Systems to reflect the larger focus on computing and software development in its offerings. Currently, the school offers four undergraduate degrees: Information Systems, Computer Science, Computing & Law, and Software Engineering. In addition to its bachelor's degrees, SCIS also offers the Master of Science in Computer Science, Master of Philosophy in Information Systems, [Master of IT in Business](/wiki/Master_of_IT_in_Business), the PhD in Information Systems/Computer Science and Doctor of Engineering (D.Eng.) programmes. ### Yong Pung How School of Law Originally named School of Law, the Yong Pung How School of Law (SOL) is SMU's smallest school with an annual intake of around 180 students. The establishment of the SOL was announced in August 2007. Previously, the SOL existed as the Department of Law under SMU's Lee Kong Chian School of Business, where it was chaired by [Andrew Phang](/wiki/Andrew_Phang). Its current dean is Lee Pey Woan, who succeeded [Goh Yihan](/wiki/Goh_Yihan) in 2022.[*citation needed*] On 11 April 2021, SMU renamed the school to include former chief justice [Yong Pung How](/wiki/Yong_Pung_How)'s name as a recognition for his founding contributions to the university. The SOL offers the [Bachelor of Laws](/wiki/Bachelor_of_Laws) (LLB) undergraduate programme, as well as a postgraduate [Juris Doctor](/wiki/Juris_Doctor) (JD) programme. The school also offers a [Master of Laws](/wiki/Master_of_Laws) (LLM) programme, with the option of a dual LLM with [Queen Mary University of London](/wiki/Queen_Mary_University_of_London). ### School of Social Sciences The School of Social Sciences (SOSS) was established in July 2002 as part of the then School of Economics and Social Sciences (SESS). Through a restructuring exercise in 2007, the School of Economics and School of Social Sciences were separated to form independent schools within SMU. The SOSS's primary offering is the [Bachelor of Social Science](/wiki/Bachelor_of_Social_Science), a multi-disciplinary undergraduate programme. Within this programme, three main majors are offered, namely [political science](/wiki/Political_science), [psychology](/wiki/Psychology) and sociology. In addition, the SOSS offers a PhD in Psychology. ### College of Integrative Studies The College of Integrative Studies (CIS) was formed in 2021 for interdisciplinary and integrative teaching and research. This is the first school in Singapore to offer an Individualised Major.[*citation needed*] ### College of Graduate Research Studies Like the CIS, the College of Graduate Research Studies (CGRS) also focuses on interdisciplinary programs.[*citation needed*] ## Professional education ### SMU Academy SMU Academy offers programmes for working professionals, to provide continuous lifelong education through diplomas and certificate programs. This includes a combination of practical industry knowledge and general management skills. ### SMU Executive Development In addition to its traditional academic programmes, the university also runs executive education and development programmes for leaders at four stages of their career: emerging leaders, general managers, senior executives and corporate directors. These courses include Executive Skills for board members in Challenging Times; SNEF-SMU CEO Seminars: The Art & Science of Productivity Leadership; and Johnson & Johnson-SMU Hospital Management.[*citation needed*] ## Institutes and centres ### Institute of Innovation and Entrepreneurship The Institute of Innovation and Entrepreneurship was established in 2009 and provides research, innovation and entrepreneurship training for the students of the university. In the same year, Business Innovations Generator, a [start-up](/wiki/Startup_company) incubation programme was implemented. In 2017, the institute launched Protégé Ventures, a student-run venture fund and training program. The first in Southeast Asia, it gives undergraduate and postgraduate students from Singapore-based universities a practical, real-life [venture capital](/wiki/Venture_capital) experience in sourcing, analysing and investing in technology-enabled [Asean](/wiki/ASEAN) startups with at least one student founder. The institute organises a major startup business competition called the Lee Kuan Yew Global Business Plan Competition, which receives entries from a large number of international universities. In 2020, the competition received submissions from over 650 universities. The tenth edition of the LKYGBPC launched the VC Office Hours, offering one-on-one consultations for founders by more than 30 senior partners from leading venture capital firms. Another highlight of the tenth edition was the Changemakers Conversations, a series of virtual panel discussions centred around themes such as \"Our New Normal\" and \"Growth in Asia\". ## Rankings & Reputation SMU is generally considered one of the top three universities in Singapore, along with [NUS](/wiki/National_University_of_Singapore) and [NTU](/wiki/Nanyang_Technological_University). ### World University Rankings SMU made its debut on the Quacquarelli Symonds World University Rankings in 2017. SMU is ranked No. 36 in the QS Business and Management Studies Subject, No. 49 in the QS Accounting Subject, No. 60 in the QS Economics Subject, No. 68 in the QS Social Sciences and Management Subject and No. 95 band in the QS Law and Legal Studies subject. Its Master of IT in Business is ranked No. 1 in Asia and No. 14 in the world by QS Masters in Business Analytics Ranking for 2020. #### QS broad subject areas QS World University Rankings by Subject (broad subject areas) 2025: Broad Subject Area**SMU's world rank**Accounting & Finance59Business and Management Studies44Social Sciences & Management178Economics77Computer Science and Information Systems139 #### Business school rankings - SMU Lee Kong Chian School of Business was ranked No. 58 worldwide and No. 13 in Asia in the Financial Times' 2021 global ranking of Master of Business Administration (MBA) programmes. - SMU Lee Kong Chian School of Business was ranked No. 76 worldwide and No. 8 in Asia in the Financial Times' 2020 global ranking of Masters in Management (MiM) programmes. - SMU Lee Kong Chian School of Business was ranked No. 6 in the 2018 Financial Times Top 25 Business Schools: Asia-Pacific region. - SMU Lee Kong Chian School of Business' Executive Master of Business Administration (EMBA) was ranked No. 22 worldwide by The [Financial Times](/wiki/Financial_Times). - SMU Lee Kong Chian School of Business was rated as a 4 Palmes business school and ranked second in Singapore and fourth in the Far East Asia Zone among 200 business schools 'with significant international influence' in the 'Best 1,000 Business Schools in 154 countries' ranking compiled by [Eduniversal](/wiki/Eduniversal) for 2020 #### Research rankings - SMU Lee Kong Chian School of Business was ranked No. 21 worldwide and No. 1 in Asia in the Financial Times' 2024 Aggregated Research Ranking. - SMU School of Computing & Information Systems was ranked 2nd in the world and 1st in Singapore for Software Engineering research output in 2023 by CSRankings.org. - SMU Lee Kong Chian School of Business' research productivity in top ranked journals across all fields of business in 2016–17 is No. 13 worldwide according to the University of Texas Dallas ranking. - SMU Lee Kong Chian School of Business' research productivity in top ranked journals in management field in 2016–17 is No. 2 worldwide according to the University of Texas Dallas ranking - SMU School of Accountancy was ranked No. 1 in Asia and No. 3 in the world for both Archival Research (All Topics) and Archival Research (Financial). It also ranks No. 1 in Asia for All Areas, All Disciplines according to the Brigham Young University Accounting Research Rankings 2016 - SMU was ranked No. 64 worldwide and No. 4 in Asia in the 2016 *Tilburg University Top 100 Worldwide Economics Schools Research Ranking* based on research contributions in leading international journals in the preceding five-year period - USNEWS ranks SMU's Economics and Business faculty as 77 globally. ### Accreditation SMU is the first university in Asia to be accredited by Ashoka, a global non-profit organisation supporting leading social entrepreneurs worldwide, as a Changemaker Campus as well as the first university in Singapore to be accredited as a research organisation by the Association for the Accreditation of Human Research Protection Programs, Inc. headquartered in Washington, D.C. SMU's Lee Kong Chian School of Business is one of the youngest business schools in the world and the only Singaporean business school to achieve the 'triple crown' accreditation by the [AACSB](/wiki/Association_to_Advance_Collegiate_Schools_of_Business), [AMBA](/wiki/Association_of_MBAs), and [EQUIS](/wiki/EFMD_Quality_Improvement_System). ## SMU Libraries The SMU Libraries consists of the Li Ka Shing Library and the Kwa Geok Choo Law Library. The Li Ka Shing Library was officially opened on 24 February 2006. ### Institutional Knowledge (InK) InK, Institutional Knowledge at SMU is the [institutional repository](/wiki/Institutional_repository) and archives of the Singapore Management University. It acquires, organises and provides access to the research and scholarly works of SMU faculty. Collections in InK include journal articles, working papers, conference proceedings, books, book chapters, reports and other research works including the dissertations and theses of postgraduate students and a collection of print and video teaching cases. In addition, there are also the heritage and research data collections.[*citation needed*] ## Campus and facilities The campus has 9 blocks: - Lee Kong Chian School of Business - School of Accountancy - Li Ka Shing Library - School of Computing & Information Systems 1 - School of Computing & Information Systems 2 / School of Economics - Yong Pung How School of Law & Kwa Geok Choo Law Library - College of Integrative Studies / School of Social Sciences - SMU Connexion - Administration Building Six of the buildings are connected by an underground walkway known as the Concourse, which is open to the public and lined with shops. The campus was designed by two teams of architects, with Cox Architects and Planners and DEG Architects in charge of the Administrative Building, and Edward Cullinan Architects and KNTA Architects designing the rest. Teaching facilities include seminar rooms, classrooms, computer labs and group study rooms used by students for project discussions. There are research facilities scattered throughout the university. Sports facilities are limited on campus because of space constraints; however, the university has a swimming pool, gymnasium and a multi-purpose sports hall which is equipped with a rock wall. The university has campus-wide wireless LAN networks. The university had leased the former [MPH Building](/wiki/MPH_Bookstore), which housed the former flagship store of MPH Group until 2003, located at the junction of Stamford Road and Armenian Street from mid 2015 to mid 2019 to house SMU Labs. This provided collaborative learning spaces for the university's latest learning experiment, known as SMU-X, in which lessons are centred on solving real-world problems through projects. The new SMU Connexion building, built to link the School of Law and School of Accountancy, opened in 2020 as a permanent home to SMU-X and SMU Labs. ## Notable alumni ### Business - Lai Shanru – [ShopBack](/wiki/ShopBack) Founder - Joshua Chan – Ergotune Founder - Marcus Wee – [Aftershock PC](/wiki/Aftershock_PC) Founder - Joe Wee – [Aftershock PC](/wiki/Aftershock_PC) Founder - Aaron Tan - Carro Founder - Karl Mak – [SGAG](/wiki/SGAG), MGAG & PGAG Founder - Adrian Ang – [SGAG](/wiki/SGAG), MGAG & PGAG Founder - Willis Wee – [Tech in Asia](/wiki/Tech_in_Asia) Founder - Lai Chang Wen – [Ninja Van](/wiki/Ninja_Van) Founder ### Entertainment - [Nandita Banna](/wiki/Nandita_Banna) – Miss Universe Singapore 2021 - [Adithya Srinivasan](/wiki/Adithya_Srinivasan) – Indian singer - [Rebecca Lim](/wiki/Rebecca_Lim) – Singaporean actress - [Jade Seah](/wiki/Jade_Seah) – Singaporean actress - [Chantalle Ng](/wiki/Chantalle_Ng) – Singaporean actress - [Pornsak Prajakwit](/wiki/Pornsak_Prajakwit) – Singaporean/Thai actor - [Jasmine Sokko](/wiki/Jasmine_Sokko) – Singaporean singer - [Hubert Ng](/wiki/Hubert_Ng) – Singaporean songwriter ### Politics - [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)) – Singaporean politician, [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) - [Nadia Ahmad Samdin](/wiki/Nadia_Ahmad_Samdin) – Singaporean politician - [Zhulkarnain Abdul Rahim](/wiki/Zhulkarnain_Abdul_Rahim) – Singaporean politician - [Louis Chua](/wiki/Louis_Chua) – Singaporean politician ### Sports - [Yip Pin Xiu](/wiki/Yip_Pin_Xiu) – Singaporean swimmer, seven-time Paralympics Gold medallist - [Russell Ong](/wiki/Russell_Ong) – Singaporean swimmer - [Poh Seng Song](/wiki/Poh_Seng_Song) – Singaporean athlete - [Jason Goh Koon-Jong](/wiki/Jason_Goh_Koon-Jong) – Singaporean chess player - [Shanti Pereira](/wiki/Shanti_Pereira) – Singaporean athlete - Singapore Management University - Singapore Management Alumni\n",
  "language": "en",
  "processed_at": "2026-01-12T11:57:15.992879",
  "title": "Singapore Management University",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Management_University"
}