{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:59:52.034336"
  },
  "content": "World Trade Organization working groups The term \"**Singapore issues**\" refers to the work of four working groups set up during the [World Trade Organization](/wiki/World_Trade_Organization)'s [Ministerial Conference of 1996](/wiki/WTO_Ministerial_Conference_of_1996) in [Singapore](/wiki/Singapore). These groups are tasked with the following issues: - transparency in [government procurement](/wiki/Government_procurement), - [trade facilitation](/wiki/Trade_facilitation) (customs issues), - [trade](/wiki/Trade) and [investment](/wiki/Investment), and - the interaction between [trade](/wiki/Trade) and [competition](/wiki/Competition). As of August 2004[update], only trade facilitation remained a live issue within the [Doha Development Agenda](/wiki/Doha_Development_Agenda). ## Adoption of the issues These issues were pushed at successive Ministerials by the [European Union](/wiki/European_Union), [Japan](/wiki/Japan) and Korea, and opposed by most developing countries. The United States was indifferent about the inclusion of these issues, indicating that it could accept some or all of them at various times, but preferring to focus on market access. Disagreements between largely developed and developing economies prevented a resolution in these issues, despite repeated attempts to revisit them, notably during the 2003 Ministerial Conference in [Cancún](/wiki/Canc%C3%BAn), [Mexico](/wiki/Mexico), whereby no progress was made. Since then, some progress has been achieved in the area of trade facilitation. In July 2004, WTO Members formally agreed to launch negotiations. Under the mandate of the so-called \"July package\", Members are directed to clarify and improve GATT Article V (Freedom of Transit), Article VIII (Fees and Formalities connected with Importation and Exportation), and Article X (Publication and Administration of Trade Regulations). The negotiations also aim to enhance technical assistance and capacity building in this area and to improve effective cooperation between customs and other appropriate authorities on [trade facilitation](/wiki/Trade_facilitation) and customs compliance issues. To date, Members have submitted a great number of proposals under the mandate that provide the basis for the initial negotiations. The negotiations were expected to be completed under the overall Doha Development Agenda timeline.[*needs update*] However, in practice, negotiations have been interrupted. - http://www.wto.org/english/thewto_e/whatis_e/tif_e/bey3_e.htm - https://web.archive.org/web/20050408153526/http://www.ictsd.org/pubs/dohabriefings/doha6-singaporeIssues.pdf This [international trade](/wiki/International_trade) related article is a stub. You can help Wikipedia by expanding it. - v - t - e This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:59:52.033972",
  "title": "Singapore issues",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_issues"
}