{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:57:35.262550"
  },
  "content": "Public transport operator in Singapore **Singapore One Rail** ([abbreviation](/wiki/Abbreviation): **SOR**) is a [public transport](/wiki/Public_transport) operator in Singapore, formed in joint venture between Singapore public transport operator [SBS Transit](/wiki/SBS_Transit) and [RATP Dev Asia](/wiki/RATP_Dev_Asia). A majority of its shares are owned by Singaporean bus and rail operator [SBS Transit Ltd](/wiki/SBS_Transit) at 75.01%, with RATP Dev holding the remaining 24.99%. ## History In 2023, SBS Transit entered into partnership with French transit group RATP Dev for tender bids to operate the [Jurong Region Line](/wiki/Jurong_Region_Line) and [Cross Island Line](/wiki/Cross_Island_Line) in Singapore as a joint venture. Both tenders are limited to existing rail operators in Singapore, while foreign operators will be allowed to participate as minority partners of joint ventures with existing rail operators. On 28 November 2024, the joint venture under the submitted name SRJV, was awarded the contract at a bid of [S$](/wiki/Singapore_dollar)750 million to operate the line for nine years, with an optional two-year extension. The bid was reported to be 8 per cent lower than the competing bid made by [SMRT Trains](/wiki/SMRT_Trains). Singapore One Rail Pte Ltd was officially incorporated on 15 January 2025. ## Trains Singapore One Rail is set to operate the [Jurong Region Line](/wiki/Jurong_Region_Line) (JRL) when it opens in 2027. The JRL would span 24 kilometers and consist of 24 stations in the [West region](/wiki/West_Region,_Singapore) of Singapore over three opening phases, serving [Choa Chu Kang](/wiki/Choa_Chu_Kang_MRT/LRT_station) in the north, [Jurong Pier](/wiki/Jurong_Pier_MRT_station) in the south, [Peng Kang Hill](/wiki/Peng_Kang_Hill_MRT_station) in the west and [Pandan Reservoir](/wiki/Pandan_Reservoir_MRT_station) in the east. An extension via [West Coast](/wiki/West_Coast_MRT_station) on the [Cross Island Line](/wiki/Cross_Island_Line) to [Kent Ridge](/wiki/Kent_Ridge_MRT_station) on the [Circle Line](/wiki/Circle_Line_(Singapore)), is set be completed in the 2030s to 2040s. The JRL is fully automated and driverless and consists of a fleet of 62 [Hyundai Rotem](/wiki/Hyundai_Rotem) [J151](/wiki/Hyundai_Rotem_J151) trainsets. The JRL would be the first in Singapore rail network to operate South Korean manufactured rolling stocks. NameImageMaximum speed (km/h)Trains builtCars builtCars per setLines servedBuiltNumber in serviceIntroductionDesignService[J151](/wiki/Hyundai_Rotem_J151)70TBA621863[Jurong Region Line](/wiki/Jurong_Region_Line)2022‍–‍202602027 - The trains are classified as contracts unlike other countries which use \"class\". This [Singaporean corporation or company](/wiki/List_of_companies_of_Singapore) article is a stub. You can help Wikipedia by expanding it. - v - t - e This transport corporation-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:57:35.262178",
  "title": "Singapore One Rail",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_One_Rail"
}