{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:57:55.600164"
  },
  "content": "Singaporean lottery operator **Singapore Pools (Private) Limited** is a [state-owned](/wiki/Government-owned_corporation) [lottery](/wiki/Lottery) [subsidiary](/wiki/Subsidiary) company in [Singapore](/wiki/Singapore). As a wholly owned subsidiary of the Tote Board, it is the only operator that is legally allowed to run lotteries in Singapore. ## History Singapore Pools was incorporated on 23 May 1968 to curb illegal [gambling](/wiki/Gambling) in Singapore. It provided Singaporeans with a legal avenue to bet on lotteries, countering the rampant illegal betting syndicates that were present. Since 1 May 2004, Singapore Pools is owned by Tote Board, a statutory board under the [Ministry of Finance](/wiki/Ministry_of_Finance_(Singapore)). Singapore Pool's products and services are regulated by the [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) and the [Ministry of Social and Family Development](/wiki/Ministry_of_Social_and_Family_Development). The company was set up as a 'not for profit organisation' and the surplus from revenue earned are channeled to the Tote Board, which are then used to fund a profile of causes and charities. The funds handled by Tote Board is also used for promoting the local sports and arts scene and also infrastructure projects in Singapore. Some notable infrastructure projects funded by the company includes, the [Former National Stadium](/wiki/Former_National_Stadium,_Singapore), [Singapore Indoor Stadium](/wiki/Singapore_Indoor_Stadium), the [Esplanade](/wiki/Esplanade_%E2%80%93_Theatres_on_the_Bay) and [Gardens by the Bay](/wiki/Gardens_by_the_Bay). ## Gambling operations ### Lotteries Singapore Pools currently operates four lottery games: - [Toto](/wiki/Toto_(lottery)) – a 6 out of 49 lottery drawn on every Monday and Thursday/Friday - Toto Match - a bet type essentially requires you to select one to four different numbers (depending on your bet type) for the purposes of matching with the Winning Numbers drawn for a particular draw of the TOTO Game. You will win a prize if there is a successful match between your selected numbers with the Winning Numbers. - [4D](/wiki/4-Digits) – a 'pick four' lottery drawn on every Wednesday, Saturday and Sunday - Singapore Sweep – [sweepstakes](/wiki/Sweepstakes)/raffle-style lottery drawn on the first Wednesday of every month ### Sports betting In addition, Singapore Pools is the sole legal bookmaker and totalisator for [association football](/wiki/Association_football) and [motor racing](/wiki/Motor_racing) betting. ### Remote Gambling On 29 September 2016, the Ministry of Home Affairs announced that Singapore Pools would be granted an exemption under the Remote Gambling Act 2014, allowing it to offer online and telephone gambling for 4D and TOTO lotteries, football and motor-racing, subject to strict regulatory conditions and safeguards to prevent illegal gambling activities. - [Gambling in Singapore](/wiki/Gambling_in_Singapore) - Official site - Singapore responsible gambling - Promotes responsible gaming and contributes a significant portion of its earnings to charitable causes across the nation This [Singaporean corporation or company](/wiki/List_of_companies_of_Singapore) article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:57:55.599823",
  "title": "Singapore Pools",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Pools"
}