{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:17.600134"
  },
  "content": "Flight attendants on the eponymous airline **Singapore Girl** is a consistent visual [advertising](/wiki/Advertising) [slogan](/wiki/Slogan) applied to depictions of [flight attendants](/wiki/Flight_attendant) of [Singapore Airlines](/wiki/Singapore_Airlines) (SIA) dressed in the distinctive *[sarong](/wiki/Sarong) [kebaya](/wiki/Kebaya)* SIA uniform, in use since 1972, and remains a prominent element of SIA's [marketing](/wiki/Marketing). Singapore Airlines' cabin service has been recognized with awards from magazines, travel and tourism industries, including the 'World's Best Cabin Crew Service' by the Business Traveller Asia-Pacific Awards for 23 consecutive years. ## Origins The images and branding of the Singapore Girl were first established in 1972 when Singapore Airlines took over as successor of its predecessor [Malaysia-Singapore Airlines](/wiki/Malaysia-Singapore_Airlines) (MSA). The joint Malaysia and Singapore airline were set up to develop and expand an intercontinental network. An earlier traditional version of the \"Sarong Kebaya\" uniform was first introduced by MSA and worn by the flight attendants since 1968. Subsequently, political acrimony between Singapore and Malaysia led to the split of Malaysia-Singapore Airlines. MSA ceased operations on 1 October 1972 and Singapore Airlines took over as its successor in Singapore. Initially, when Singapore Airlines was created, its advertising and branding was handled by the start-up Batey Inc, of Ian Batey. *Singapore Girl* was coined in 1972 when [Pierre Balmain](/wiki/Pierre_Balmain), a [French](/wiki/France) [haute couture](/wiki/Haute_couture) designer, was hired to construct and update the \"[Sarong Kebaya](/wiki/Sarong)\" as part of the cabin crew's uniform. Since then, the uniform has gained worldwide recognition as part of the airline's branding. Since 1972, the image of the Singapore Girl has appeared in advertisements for the company. The theme music for the television advertising campaign was composed by [Kevin Peek](/wiki/Kevin_Peek). ### Global icon The Singapore Girl has become a visual [trademark](/wiki/Trademark) and [brand](/wiki/Brand) for Singapore Airlines together with the slogan \"A Great Way to Fly\". The Singapore Girl is said to engender \"Asian values and hospitality\" and has been described as \"caring, warm, gentle, elegant and serene\". A [wax figure](/wiki/Wax_figure) of the Singapore Girl was created and shown at [Madame Tussaud's](/wiki/Madame_Tussaud%27s) [Wax Museum](/wiki/Wax_Museum) in [London](/wiki/London) in 1994, as the first figure to represent a commercial undertaking. This sculpture was sent to the [Delta Air Lines](/wiki/Delta_Air_Lines) shuttle concourse at [LaGuardia Airport](/wiki/LaGuardia_Airport) in [New York City](/wiki/New_York_City) in 1995. A second wax figure was unveiled in Singapore in March 2015. In March 2004, the Singapore Girl won the \"Outstanding Contribution to Tourism\" award for the 18th Singapore Tourism Board's Tourism Award. Since 2014, Singapore Airlines has been sponsoring the [Singapore Grand Prix](/wiki/Singapore_Grand_Prix). Since then, Singapore Airlines' assignment crew have been regularly deployed at the annual event. ## Recruitment As part of efforts to build the image of the \"Singapore Girl\", the airline runs a rigorous training program for cabin and flight crew. The airline's repute, and the resulting prestige of the job, has allowed it to be highly selective during its recruitment process as it receives numerous applications locally and from around the region. Singapore Airlines used to recruit only Singaporeans and Malaysians as cabin crew, but since 1995, in line with its global expansion, recruitment extended to other countries such as [China](/wiki/China), [India](/wiki/India), [Indonesia](/wiki/Indonesia), [Japan](/wiki/Japan), [Korea](/wiki/Korea), [Taiwan](/wiki/Taiwan) and [Thailand](/wiki/Thailand). This minimises language barriers between cabin crew and travellers and also maintains its essence as an Asian carrier. A training batch typically consists of 20 cabin crew trainees, and the training spans three-and-a-half months. This is one of the longest training programmes in the industry. Trainees undergo classes in flight safety and security, first aid, service, etiquette, grooming, deportment, communication and wine appreciation among others. During the training, Flight Stewardess trainees are assigned the hair styles, makeup colours and nail polish colours they are required to use when in uniform. ### Uniform There are four kebaya colours that represent the ranking of the Singapore Girls: - Blue – \"Flight Stewardess\" - Green – \"Leading Stewardess\" - Red – \"Chief Stewardess\" - Purple– \"Inflight Manager\" Although the uniform of the Singapore Girl has remained largely unchanged (aside from the addition of the green kebaya in 1992), the uniform for male cabin crew was updated on 30 June 2008. All male cabin crew wear the same, distinctive [navy blue](/wiki/Navy_blue) suits to complement the Singapore Girl's cobalt blue *kebaya*, their ranks differentiated by the colours of their ties. The four tie colours that distinguish male cabin crew: - Blue Stripes – \"Flight Steward\" - Green Stripes – \"Leading Steward\" - Red Stripes – \"Chief Steward\" - Purple Stripes – \"In-Flight Supervisor\" This update replaces the previous uniform of business jackets and grey trousers, with jackets distinguishing their ranks: - Light Blue – \"Flight Steward\" - Sky Blue – \"Leading Steward\" - Navy Blue – \"Chief Steward\" - Grey – \"In-Flight Supervisor\" In April 2001, the shoes were replaced by Pierre Balmain-designed safety shoes, in light of safety reviews after the [Singapore Airlines Flight 006](/wiki/Singapore_Airlines_Flight_006) crash where flight attendants complained of missing sandals.[*citation needed*] ## Criticisms The Singapore Girl marketing concept has been criticized as being [sexist](/wiki/Sexism) – apart from the inaccuracy of the term Girl, the concept has been accused of being a [stereotype](/wiki/Stereotype) of Asian women as being subservient. However, the marketing concept is unlikely to be replaced altogether in any future marketing campaigns: > \"To remove the Singapore Girl icon from SIA is like removing [Mickey Mouse](/wiki/Mickey_Mouse) from [Disneyland](/wiki/Disneyland)...\" — Singapore's *[The Straits Times](/wiki/The_Straits_Times)* - Singapore portal - Fashion portal - The Singapore Girls, Audio reportage by Jayne Clark of *[USA Today](/wiki/USA_Today)* in [Flash](/wiki/Adobe_Flash) format. - Video clip of SQ cabin crews on [YouTube](/wiki/YouTube_video_(identifier))\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:17.599822",
  "title": "Singapore Girl",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Girl"
}