{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:07.873243"
  },
  "content": "Statutory board under the Ministry of Education of the Government of Singapore The **Singapore Examinations and Assessment Board** (**SEAB**) is a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) of the [Government of Singapore](/wiki/Government_of_Singapore). SEAB was established on 1 April 2004 as a statutory board overseeing national-based examinations in [Singapore](/wiki/Singapore), including the provisions of examinations and assessment services, and the publishing of major examination results such as the [Primary School Leaving Examination](/wiki/Primary_School_Leaving_Examination), [GCE 'N' Level](/wiki/Singapore-Cambridge_GCE_Normal_Level), [GCE 'O' Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) and [GCE 'A' Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level). ## Regulated examinations The following national examinations are regulated by the Singapore Examinations and Assessment Board. NameLevelExamination periodResult periodRemarks[Primary School Leaving Examination](/wiki/Primary_School_Leaving_Examination) (PSLE)Primary 6August–October of current yearNovember of current yearAlso offers International Primary School Examination (iPSLE) for international students.[Singapore-Cambridge GCE Normal Level](/wiki/Singapore-Cambridge_GCE_Normal_Level) (GCE N-Level)Secondary 4 Normal streamJuly–October of current yearDecember of current yearOffers either the Technical or Academic level depending on stream. Final examination year will be in 2026 as the national examination will be replaced by Secondary Education Certificate in 2027.[Singapore-Cambridge GCE Ordinary Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) (GCE O-Level)Secondary 4 Express stream/Secondary 5May–November of current yearJanuary of succeeding yearFinal examination year will be in 2026 as the national examination will be replaced by Secondary Education Certificate in 2027.[Singapore-Cambridge GCE Advanced Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) (GCE A-Level)Junior College Year 2 students/Millennia Institute Year 3 studentsMay–December of current yearFebruary of succeeding year ## Provisions SEAB oversees certain provisions and regulations on exam conduct to protect the integrity. The board also determines usage of certain [Scientific calculator](/wiki/Scientific_calculator) and [Electronic dictionary](/wiki/Electronic_dictionary) models, as well as monitoring current events such as [train disruptions](/wiki/Safety_on_the_Mass_Rapid_Transit_(Singapore)) to minimize unplanned disruptions when exams are underway, and archival of examination papers including the [ten year series](/wiki/Ten_year_series) editions. ## Organisation Structure SEAB is governed by a board which is led by a chairman. The Chief Executive is the professional head of the organisation. Under the Chief Executive are various divisions organised into two clusters: Assessment and Exam Cluster and Corporate Cluster. Divisions in each cluster are led by Directors/Deputy Directors. - SEAB Website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:07.872960",
  "title": "Singapore Examinations and Assessment Board",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Examinations_and_Assessment_Board"
}