{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:00:19.165406"
  },
  "content": "Support of Iraq by Singapore during the Iran–Iraq war [Singapore](/wiki/Singapore), a major commercial hub with loose export controls on weapons, both served as a transshipment point for weapons destined for Iraq, as well as providing chemical warfare precursors and being a site for manufacture, under license, of foreign-designed weapons. ## Export controls Speaking in the British [House of Commons](/wiki/House_of_Commons_of_the_United_Kingdom), Roger Barry commented that the only truly important thing in arms control is being certain the end user, on the end user certificate, is accurate. \"There is no point the [Department of Trade and Industry](/wiki/Department_of_Trade_and_Industry_(United_Kingdom)) (DTI) ticking the box and saying, \"They say this is going to our friendly neighbour [Austria](/wiki/Austria),\" or, \"This is going to our dear old friend Singapore.\" ## Mine warfare Some of the most vivid images of the [Iran–Iraq War](/wiki/Iran%E2%80%93Iraq_War) were of Iranian volunteers charging into minefields, to clear them by sacrificing their own lives. Mine warfare in the Persian Gulf was one of the U.S. justifications for direct military action against Iran. It is relevant, then, to identify the sources of those mines. ### Italian mine warfare technology Italy exported land and naval mines both to Iraq and Iran before and during the Iran–Iraq War. Its mine industry revolved around three small companies: Valsella, Misar, and Tecnovar. The latter two were formed by former Valsella employees. All three specialized in landmines and mine-related products and were involved in direct exports and licensed overseas production. Most of their revenues came from exporta, driven by favorable banking and export controls, and public support of military development. Given the importance of minefields, sometimes cleared with nothing but Iranian bravery, the significance of mines cannot be underestimated. See [Italian support for Iraq during the Iran-Iraq war](/wiki/Italian_support_for_Iraq_during_the_Iran-Iraq_war) for the original Italian role when it directly exported mines, which, after the Italian government enforced export controls, moved its manufacturing to Singapore, using explosives from [Oerlikon](/wiki/Oerlikon_Contraves) of [Switzerland](/wiki/Switzerland). ### Move of Italian work to Singapore \"With the outbreak of the Iran–Iraq War in September 1980, Valsella began receiving government authorizations for exports to Iraq. A total of seven were granted, the last one issued in 1982 and expiring in January 1984. The overall value of the exports amounted to more than US $110 million. But political pressures resulted in increasing restrictions on exports to Iraq. To skirt these restrictions, the company set up a new branch abroad in Singapore, where assembled mines with Vasella components and explosive from [Bofors](/wiki/Bofors) in [Sweden](/wiki/Sweden), for shipment to Iraq in 1982. Mines were exported to Iraq until 1986. In 1984, Fiat gradually gained control over Valsella and Misar. By this time Valsella mainly focused on the R&D of increasingly sophisticated landmines (like electronic mines and mines with remote control activation, with radio crypto-coded signals), while Misar carried out considerable research and development of naval mines, though not to the exclusion of land systems ## Chemical warfare In December 2002, Iraq's 1,200 page Weapons Declaration revealed a list of Eastern and Western corporations and countries—as well as individuals—that exported chemical and biological materials to Iraq in the past two decades. By far, the largest suppliers of precursors for chemical weapons production were in Singapore (4,515 tons). The Kim Al-Khaleej firm of Singapore supplied more than 4,500 tons of [VX](/wiki/VX_(nerve_agent)), [sarin](/wiki/Sarin), and [mustard gas](/wiki/Mustard_gas) precursors and production equipment to Iraq. \"Chief U.N. weapons inspector [Hans Blix](/wiki/Hans_Blix) came to similar conclusions on Jan. 27, when he delivered an \"update\" to the U.N. Security Council based on his inspection efforts in Iraq according to Timmerman, \"...Blix's recent report to the United Nations documented many other instances in which Iraq has failed to disclose prohibited weapons. The Iraqi documents, revealed here for the first time, portray a worldwide procurement network that relied on top-drawer assistance from governments and major banks in Europe, Asia and the Middle East. Iraq's suppliers range from huge multinational corporations... little-known entities, such as an outfit identified by the Iraqis as \"Kim Al-Khalleej\" of Singapore, which they claimed supplied more than 4,500 tons of VX-, sarin- and mustard-gas precursors and production equipment.\" The Iraqi disclosure mentioned various companies that have acted as third-country buyers for Iraq...\"during the Iran–Iraq War [India](/wiki/India) delivered precursors for warfare agents to Iraq—and later was found to have delivered quantities of the same materials to Iran. Baghdad's middleman at the time, an Iraqi with a German passport, founded a company in Singapore expressly for this purpose.\" - [International aid to combatants in the Iran–Iraq War](/wiki/International_aid_to_combatants_in_the_Iran%E2%80%93Iraq_War)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:00:19.164995",
  "title": "Singapore support for Iraq during the Iran–Iraq war",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_support_for_Iraq_during_the_Iran%E2%80%93Iraq_war"
}