{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:00.481084"
  },
  "content": "Creole language spoken in SingaporePart of a series on the[Culture of Singapore](/wiki/Culture_of_Singapore)[History](/wiki/History_of_Singapore) - [Singaporeans](/wiki/Singaporeans) - [Immigration](/wiki/Immigration_to_Singapore) - [Holidays](/wiki/Public_holidays_in_Singapore) - [Languages](/wiki/Languages_of_Singapore) - [Multiculturalism](/wiki/Demographics_of_Singapore) - [Symbols](/wiki/National_symbols_of_Singapore) - [Women](/wiki/Women_in_Singapore) [Topics](/wiki/Outline_of_Singapore) - [Architecture](/wiki/Architecture_of_Singapore) - [Art](/wiki/Visual_art_of_Singapore) - [Cinema](/wiki/Cinema_of_Singapore) - [Cuisine](/wiki/Singaporean_cuisine) - [Festivals](/wiki/List_of_festivals_in_Singapore) - [Hawker centre](/wiki/Hawker_centre) - [Literature](/wiki/Singaporean_literature) - [Media](/wiki/Media_of_Singapore) - [Music](/wiki/Music_of_Singapore) - [National Service](/wiki/National_service_in_Singapore) - [Politics](/wiki/Politics_of_Singapore) - [Religion](/wiki/Religion_in_Singapore) - [Sports](/wiki/Sports_in_Singapore) - Singlish - [Television](/wiki/Television_in_Singapore) Research - [Bibliography](/wiki/Bibliography_of_Singapore) Symbols - [Anthem](/wiki/Majulah_Singapura) - [Flag](/wiki/Flag_of_Singapore) - [Flower](/wiki/Papilionanthe_Miss_Joaquim) - [Symbol](/wiki/Merlion) - [Oath Of Allegiance](/wiki/Singapore_National_Pledge) - Singapore portal - v - t - e **Singlish** (a [portmanteau](/wiki/Portmanteau) of *[Singapore](/wiki/Singapore)* and *[English](/wiki/English_language)*), formally known as **Colloquial Singaporean English**, is an [English-based creole language](/wiki/English-based_creole_languages) originating in Singapore. Singlish arose out of a situation of prolonged [language contact](/wiki/Language_contact) between speakers of different languages in Singapore, including [Malay](/wiki/Malay_language), [Cantonese](/wiki/Yue_Chinese), [Hokkien](/wiki/Hokkien), [Mandarin](/wiki/Mandarin_language), [Teochew](/wiki/Teochew_dialect), and [Tamil](/wiki/Tamil_language). Singlish is spoken alongside [Standard Singapore English](/wiki/Singapore_English#Standard_Singapore_English) in a [diglossic](/wiki/Diglossia) manner, and represents the colloquial register of English used between locals. As such, Singlish is not regarded as a separate language from [English in Singapore](/wiki/Singapore_English), but rather, a sub-variety of it, forming a [lectal continuum](/wiki/Post-creole_continuum) with the standard language. The term *Singlish* was first recorded in the early 1970s. Singlish has similar roots and is highly mutually intelligible with the [Manglish](/wiki/Manglish) spoken in [Peninsular Malaysia](/wiki/Peninsular_Malaysia). Like all languages, Singlish and other creole languages show consistent internal logic and grammatical complexity, and are learnt natively within a community. As with many other creoles, it is sometimes perceived to be a \"broken\" form of the [lexifier](/wiki/Lexifier) language—in this case, English. Due in part to this perception of Singlish as \"broken English\", the use of Singlish is greatly frowned on by the Singaporean government. In 2000, the government launched the [Speak Good English Movement](/wiki/Speak_Good_English_Movement) in an attempt to discourage the use Singlish, although more recent Speak Good English campaigns are conducted with tacit acceptance of Singlish as valid for informal usage. Several current and former Singaporean prime ministers have publicly spoken out against Singlish. However, the prevailing view among contemporary linguists is that, regardless of perceptions that a dialect or language is \"better\" or \"worse\" than its counterparts, when dialects and languages are assessed \"on purely linguistic grounds, all languages—and all dialects—have equal merit\". In addition, there have been recent surges in the interest of Singlish internationally, sparking several national conversations. In 2016, the [Oxford English Dictionary](/wiki/Oxford_English_Dictionary) (OED) added 19 new \"Singapore English\" items such as \"[hawker centre](/wiki/Hawker_centre)\", \"shiok\", and \"sabo\" to both its online and printed versions. Several Singlish words were previously included in the OED's online version, including \"lah\" and \"kiasu\". Reactions were generally positive for this part of Singaporean identity to be recognised on a global level, and Singlish has been commonly associated with the country and is considered a unique aspect of Singaporean culture. ## Creole continuum Singlish and [English in Singapore](/wiki/Singapore_English) exist along a [creole continuum](/wiki/Post-creole_continuum), ranging from standard English with local pronunciation on one end, to the most colloquial [registers](/wiki/Register_(sociolinguistics)) of Singlish on the other. 1. **[Acrolectal](/wiki/Acrolect)**: Acrolectal Singaporean English is very similar to Standard English as spoken in other English-speaking countries, with some [differences in pronunciation](/wiki/Singapore_English#Overview_of_Singaporean_accents)—notably, DRESS and TRAP are often merged, so *letter* and *latter* have identical pronunciations. Singapore English is also prominently distinguished by an intonational system governed by [pitch accent](/wiki/Pitch-accent_language). 2. **[Mesolectal](/wiki/Mesolect)**: An intermediate form between [Standard English](/wiki/Standard_English) and basilectal Singlish. At this level, a number of grammatical features and syntax structures not found in standard English begin to emerge. For example, the use of [topic-prominent](/wiki/Topic-prominent_language) syntax and discourse particles. 3. **[Basilectal](/wiki/Basilect)**: This is the most colloquial form of speech. All of the unique [phonological](/wiki/Phonology), lexical, and [grammatical](/wiki/Grammar) features of Singlish are present at this level. Many of these features can be attributed to the influence of different [Chinese varieties](/wiki/Varieties_of_Chinese), [Malay](/wiki/Malay_language), and Indian languages such as [Tamil](/wiki/Tamil_language), though some features appear to be innovations unique to Singlish. Both the basilect and mesolect are referred to as \"Singlish\". Basilectal speech is characteristic of older and less educated working-class Singaporeans, typically those who are less capable of speaking in standard English. Nowadays, basilectal speech is uncommon among the younger generation, and its prevalence continues to dwindle as English becomes more institutionalised in the country. 4. **[Pidgin](/wiki/Pidgin)**: This represents the first stage of development of the Singlish language, before [creolisation](/wiki/Creole_language) took place and solidified Singlish as a fully-formed creole. As with all [pidgins](/wiki/Pidgin), speakers of the pidgin form of Singlish speak another language as a first language and Singlish as a second language. However, since a substantial number of people today learn Singlish natively, the number of speakers at the \"pidgin\" level of Singlish is dwindling. This is because by definition, a [pidgin](/wiki/Pidgin) is not learnt natively. Since many Singaporeans can speak Standard English in addition to Singlish, [code-switching](/wiki/Code-switching) can occur very frequently along the continuum. In addition, as many Singaporeans are also speakers of [Chinese languages](/wiki/Varieties_of_Chinese), [Malay](/wiki/Malay_language), or Indian languages such as [Tamil](/wiki/Tamil_language) and [Malayalam](/wiki/Malayalam), code-switching between English and other languages also occurs dynamically. Code-switching may extend to three languages—it is natural for some older Chinese Singaporeans to be able to switch between English, [Mandarin](/wiki/Singaporean_Mandarin) and a [southern Chinese language](/wiki/Varieties_of_Chinese), like [Hokkien](/wiki/Singaporean_Hokkien), within the same conversation. ### Example The examples below demonstrate how English is spoken in Singapore at different levels of the creole continuum. **Basilect** *All the document need to check meh? Si beh lor sor leh...***Mesolect** *Damn inconvenient sia, no need to review every single document what...***Acrolect (\"Standard\")** Do we really need to review every single document? It's too much of a hassle. ## Origin and development Singlish originated with the arrival of the British and the establishment of [English language education](/wiki/Language_education_in_Singapore) in Singapore. Elements of English quickly filtered out of schools and onto the streets, resulting in the development of a [pidgin language](/wiki/Pidgin_language) spoken by non-native speakers as a [lingua franca](/wiki/Lingua_franca) used for communication between speakers of the many different languages used in Singapore. Singlish evolved mainly among the working classes who learned elements of English without formal schooling, mixing in elements of their native languages. After some time, this new pidgin language, now combined with substantial influences from [Peranakan](/wiki/Baba_Malay), southern [varieties of Chinese](/wiki/Varieties_of_Chinese), Malay, and Tamil, became the primary language of the streets. As Singlish grew in popularity, children began to acquire Singlish as their native language, a process known as [creolisation](/wiki/Creolisation). Through this process of creolisation, Singlish became a fully-formed, stabilised and independent [creole language](/wiki/Creole_language), acquiring a more robust vocabulary and more complex grammar, with fixed [phonology](/wiki/Phonology), [syntax](/wiki/Syntax), [morphology](/wiki/Morphology_(linguistics)), and [syntactic embedding](/wiki/Dependent_clause). ## Usage in society The [Infocomm Media Development Authority](/wiki/Infocomm_Media_Development_Authority)'s free-to-air TV code states that the use of Singlish is only permitted in interviews, \"where the interviewee speaks only Singlish,\" but the interviewer must refrain from using it. Despite this, in recent years the use of Singlish on television and radio has proliferated as localised Singlish continues to be popular among Singaporeans, especially in the 2 popular Singaporean local [sitcoms](/wiki/Sitcom) *[Under One Roof](/wiki/Under_One_Roof_(Singaporean_TV_series))* and *[Phua Chu Kang Pte Ltd](/wiki/Phua_Chu_Kang_Pte_Ltd)*. Singlish is sometimes used by ordinary people in street interviews broadcast on TV and radio on a daily basis, as well as occasionally in newspapers. Although Singlish is officially discouraged in [Singaporean schools](/wiki/Education_in_Singapore), in practice, there is often some level of [code-switching](/wiki/Code-switching) present in the classroom. This is rather inevitable given that Singlish is the home language of many students, and many teachers themselves are comfortable with the variety. However, due to influence from speaking Standard English in schools, many [21st century](/wiki/21st_century) children and teenagers speak a more subtle version of Singlish which may retain definite articles and keep SVO word order. In many [white-collar](/wiki/White-collar_worker) workplaces, Singlish is avoided in formal contexts, especially at job interviews, meetings with clients, presentations or meetings, where Standard English is preferred. Nevertheless, selected Singlish phrases are sometimes injected into discussions to build rapport or for a humorous effect, especially when the audience consists mainly of locals. In informal settings, such as during conversation with friends, or transactions in [kopitiams](/wiki/Kopi_tiam) and shopping malls, Singlish is used without restriction. For many students, using Singlish is inevitable when interacting with their peers, siblings, parents and elders. Singapore humour writer [Sylvia Toh Paik Choo](/wiki/Sylvia_Toh_Paik_Choo) was the first to put a spelling and a punctuation to Singlish in her books *Eh Goondu* (1982) and *Lagi Goondu* (1986), which are essentially a glossary of Singlish, which she terms 'Pasar Patois'. This was later followed by the publishing of a few other Singlish books including *Coxford Singlish Dictionary* (2002) by [Colin Goh](/wiki/Colin_Goh), *An Essential Guide to Singlish* (2003) by [Miel Prudencio Ma](/wiki/Miel_Prudencio_Ma) and *The Three Little Pigs Lah* (2013) by Casey Chen, and *Spiaking Singlish: A companion to how Singaporeans Communicate* (2017) by [Gwee Li Sui](/wiki/Gwee_Li_Sui). In 2024, the online dictionary known as the *Chimbridge Dictionary of Singlish and Singapore English* was launched by Daniel Goh, the first of its kind to contain fully-researched etymologies of all its terms. It is, to date, the most complete and comprehensive dictionary of Singlish terms ever compiled. In recent times, Singlish is considered by [linguists](/wiki/Linguistics) to be an independent language with its own systematic grammar. Linguists from universities around the world have referred to local productions to demonstrate to students how Singlish has become a unique language variety. In 2016, the [Oxford English Dictionary](/wiki/Oxford_English_Dictionary) (OED) announced that it has added 19 new \"Singapore English\" items such as *ang moh*, *shiok* and *sabo* in both its online and printed versions. Several Singlish words had previously made it into the OED's online version, which launched in March 2000. Words such as *lah* and *sinseh* were already included in OED's debut, while *kiasu* made it into the online list in March 2007. Local celebrities were generally pleased for this Singaporean identity to be recognised on a global level. ## Phonology ### Variation Singlish [pronunciation](/wiki/Pronunciation), while built on a base of [British English](/wiki/British_English), is heavily influenced by Malay, Hokkien and Cantonese. There are variations within Singlish, both geographically and ethnically. Chinese, Native Malays, Indians, Eurasians, and other ethnic groups in Singapore all have distinct accents, and the accentedness depends on factors such as formality of the context and language dominance of the speaker. ### Consonants The consonants in Singlish are given below: [Labial](/wiki/Labial_consonant)[Dental](/wiki/Interdental_consonant)[Alveolar](/wiki/Alveolar_consonant)[Post- alveolar](/wiki/Postalveolar_consonant)[Palatal](/wiki/Palatal_consonant)[Velar](/wiki/Velar_consonant)[Glottal](/wiki/Glottal_consonant)[Nasal](/wiki/Nasal_consonant)[m](/wiki/Voiced_bilabial_nasal)[n](/wiki/Voiced_alveolar_nasal)[ŋ](/wiki/Voiced_velar_nasal)[Stop](/wiki/Stop_consonant) / [Affricate](/wiki/Affricate_consonant)[p](/wiki/Voiceless_bilabial_plosive)[b](/wiki/Voiced_bilabial_plosive)[t](/wiki/Voiceless_alveolar_plosive)[d](/wiki/Voiced_alveolar_plosive)[tʃ](/wiki/Voiceless_postalveolar_affricate)[dʒ](/wiki/Voiced_postalveolar_affricate)[k](/wiki/Voiceless_velar_plosive)[ɡ](/wiki/Voiced_velar_plosive)[Fricative](/wiki/Fricative_consonant)[f](/wiki/Voiceless_labiodental_fricative)[v](/wiki/Voiced_labiodental_fricative)([θ](/wiki/Voiceless_dental_fricative)[ð](/wiki/Voiced_dental_fricative))[s](/wiki/Voiceless_alveolar_fricative)[z](/wiki/Voiced_alveolar_fricative)[ʃ](/wiki/Voiceless_postalveolar_fricative)[ʒ](/wiki/Voiced_postalveolar_fricative)[h](/wiki/Voiceless_glottal_fricative)[Approximant](/wiki/Approximant_consonant)[l](/wiki/Voiced_alveolar_lateral_approximant)[r](/wiki/Voiced_alveolar_approximant)[j](/wiki/Voiced_palatal_approximant)[w](/wiki/Voiced_labial%E2%80%93velar_approximant) - Pronunciation of ⟨th⟩: As [onset consonants](/wiki/Syllable#Onset), the [dental fricatives](/wiki/Dental_fricative) – /θ/ and /ð/ – often merge with /t/ and /d/, so *three* is pronounced like *tree*, and *then* like *den*. As [coda consonants](/wiki/Syllable#Coda) (i.e., at the end of [syllables](/wiki/Syllable)), they are [fronted](/wiki/Th-fronting) to /f/ and /v/ respectively, so *north* is pronounced like *norf*, and *bathe* like *bave*. The contrast is usually maintained in acrolectal speech, though even among educated speakers there is some variation. - [Aspiration](/wiki/Aspirated_consonant): Onset /p/, /t/ and /k/ are sometimes [unaspirated](/wiki/Unaspirated), especially among Malays. Aspiration is retained in loanwords from [Chinese](/wiki/Sinitic_languages). - [L-vocalisation](/wiki/L-vocalisation): Word-final or preconsonantal /l/, as in *mai**l*** – realised as a [dark *l*](/wiki/Velarised_alveolar_lateral_approximant) in [Received Pronunciation](/wiki/Received_Pronunciation) and [American English](/wiki/General_American) – is often so [velarised](/wiki/Velarization) in Singlish that it approaches a [high](/wiki/Close_vowel) [back vowel](/wiki/Back_vowel), e.g. *sale* [seɤ̯ ~ seu̯]. The sound tends to be lost after the back vowels /ɔ, o, u/, and sometimes /ə/, which makes *mall* and *more*, *wall* and *war*, and *Saul* and *saw* [homophones](/wiki/Homophone). This is not the case for some speakers with Tamil or Malay accents who may use [clear or dark \"l\"s](/wiki/Voiced_dental,_alveolar_and_postalveolar_lateral_approximants) in these environments instead. - Lack of [syllabic consonants](/wiki/Syllabic_consonant): Sequences like /ən/ or /əm/ are never [syllabic consonants](/wiki/Syllabic_consonant) in Singlish, hence *taken* [ˈtekən], never *[ˈtekn̩]. - [Glottal stop](/wiki/Glottal_stop) insertion: A [glottal stop](/wiki/Glottal_stop) [ʔ] may be inserted at the beginning of words starting with a vowel, as in [German](/wiki/Standard_German_phonology). As a result, final consonants do not experience [liaison](/wiki/Liaison_(linguistics)), i.e. run onto the next word. For example, \"ran out of eggs\" is realised as [ɹɛn ʔau̯t ʔɔf ʔeks] for some speakers (compare [General American](/wiki/General_American) [ɹɛən‿aʊɾ‿əv‿ɛɡz]), with glottal stops in lieu of [null onsets](/wiki/Null_onset). This contributes to what linguists have described as the 'staccato effect' of Singapore English. - [Glottal replacement](/wiki/Glottalization#Glottal_replacement): Though uncommon in modern speakers, a glottal stop [ʔ] may replace final stop consonants (except /p, b/), especially in fast-paced speech: *Goodwood Park* becomes *Gu'-wu' Pa'* [ˈɡuʔ ˈwuʔ ˈpaʔ], *exist* is realised as [ɛʔˈzist], and there may be a glottal stop at the end of words like *back* and *out*. - [Final-obstruent devoicing](/wiki/Final-obstruent_devoicing): Word-finally, the distinction between voiced and voiceless sounds, i.e. /s/ – /z/, /t/ – /d/, etc., is sometimes not maintained. As a result, *cease* = *seize* /sis/ and *race* = *raise* /res/ for some speakers. - [Cluster reduction](/wiki/Cluster_reduction): Final consonant clusters may simplify, especially in fast speech. In general, [plosives](/wiki/Plosive), especially /t/ and /d/, are lost if they come after another consonant that is non-lateral, e.g. *want* = *one* /wan/, *tact* = *tack* /tɛk/. Additionally, /k/ may be deleted after /s/, e.g. *flask* /flas/. - Distinction between /l/ and /r/: While it may be believed that the distinction between /l/ and /r/ is not stable at the basilectal level, as TV personality [Phua Chu Kang](/wiki/Phua_Chu_Kang)'s oft-repeated refrain to \"*Use your blain!*\" (use your brain) and \"'Don pray pray!'\" (Don't play-play, i.e. Don't fool around) may seem to indicate, it is more of a self-deprecating, rather self-aware joke, like \"died-ed\".[*citation needed*] One might note, however, that both these examples involve initial consonant clusters (/bl/ and /pl/ respectively), and conflation of /l/ and /r/ is found less often when they are not part of a cluster. ### Vowels Broadly speaking, there is a one-to-many mapping of Singlish vowel [phonemes](/wiki/Phoneme) to British [Received Pronunciation](/wiki/Received_Pronunciation) vowel phonemes, with a few exceptions (as discussed below, with regard to *egg* and *peg*). The following describes a typical system. There is generally no distinction between the non-close front [monophthongs](/wiki/Monophthong), so *pet* and *pat* are pronounced the same /pɛt/. At the acrolectal level, the merged vowel [phonemes](/wiki/Phoneme) are distinguished to some extent. These speakers make a distinction between the tense vowels /i, u/ (FLEECE, GOOSE) and the lax vowels /ɪ, ʊ/ (KIT, FOOT) respectively. Some speakers introduce elements from [American English](/wiki/American_English), such as pre-consonantal [ɹ] (pronouncing the \"r\" in *bi**r**d*, *po**r**t*, etc.). This is caused by the popularity of American TV programming.[*citation needed*] Current estimates are that about 20 per cent of university undergraduates sometimes use this American-style pre-consonantal [ɹ] when reading a passage. Vowel phonemes [Front](/wiki/Front_vowel)[Central](/wiki/Central_vowel)[Back](/wiki/Back_vowel)laxtenselaxtenselaxtense[Close](/wiki/Close_vowel)([ɪ](/wiki/Near-close_near-front_unrounded_vowel))[i](/wiki/Close_front_unrounded_vowel)([ʊ](/wiki/Near-close_near-back_rounded_vowel))[u](/wiki/Close_back_rounded_vowel)[Mid](/wiki/Mid_vowel)[e](/wiki/Close-mid_front_unrounded_vowel)[ə](/wiki/Mid_central_vowel)[o](/wiki/Close-mid_back_rounded_vowel)[Open](/wiki/Open_vowel)[ɛ](/wiki/Open-mid_front_unrounded_vowel)[a](/wiki/Open_central_unrounded_vowel)[ɔ](/wiki/Open-mid_back_rounded_vowel)[Diphthongs](/wiki/Diphthong)ai au ɔi iə uə Vowel comparison between Singlish and English diaphonemic system: Singlish [phoneme](/wiki/Phoneme)WPas in/i//iː/m**ee**t/ɪ/p**i**t/e//eɪ/d**ay**/e, ɛ//ɛ/ (see below)l**e**g/ɛ//ɛ/s**e**t/ɛər/h**air**/æ/m**a**p/a/([trap-bath split](/wiki/Trap-bath_split))p**a**ss/ɑː/f**a**ther/ɑːr/c**ar**/ʌ/b**u**s/ɔ//ɒ/m**o**ck/ɔː/th**ough**t/ɔːr/c**our**t/o//oʊ/l**ow**/u//uː/f**oo**d/ʊ/p**u**t/ə/ – see below/ɜːr/b**ir**d/ə/ide**a**/ər/bett**er**/ai//aɪ/m**y**/a//aɪ/ (before /l/)m**i**le/au//aʊ/m**ou**th/ɔi//ɔɪ/b**oy**/iə//ɪər/h**ere**/uə//ʊər/t**our**/ɔ//ʊər/ (after /j/)c**ure**/ai.ə//aɪər/f**ire**/au.ə//aʊər/p**ower** - *Next*–*text* split: For many speakers, some words, including *leg* and *bed*, have the raised vowel /e/, instead of /ɛ/. This is not entirely predictable, as *egg* has a close vowel (so it rhymes with *vague*) while *peg* has an open vowel (and rhymes with *tag*); and similarly for most speakers *bed* has a close vowel (so it rhymes with *made*), while *fed* has a more open vowel (the same vowel as in *bad*). The word *next* has the raised vowel and does not rhyme with *text*. Which vowel occurs in each word therefore appears in these cases not to be predictable. This is illustrated by the fact that *red* /red/ and *read* (past tense) /rɛd/ are not [homophones](/wiki/Homophone) in Singlish. This split only applies to the diaphoneme /ɛ/. - /ai/ remains /ai/ in Singlish, except when followed by /l/, in which case it is the monophthong /a/. - Examples of words that have idiosyncratic pronunciations: *flour* /fla/ (expected: /flau.ə/ = *flower*); and *their* /ðja ⁓ dja/ (expected: /ðɛ ⁓ dɛ/ = *there*). *Flour*/*flower* and *their*/*there* are therefore not homophones in Singlish. - In general, Singlish vowels are tenser – there are no lax vowels (which RP has in *pit*, *put*, and so forth). - The vowels in words such as *day* /de/ and *low* /lo/ are pronounced with less glide than the comparable [diphthongs](/wiki/Diphthong) in RP, so they can be regarded as [monophthongs](/wiki/Monophthong) – i.e. vowels with no glide. - Where other varieties of English have an unstressed /ə/, i.e. a reduced vowel, Singlish tends to use the full vowel based on orthography. This can be seen in words such as ***a**ccept* /ɛksɛp/, ***e**xample* /ɛ(k)sampə(l), ɛ(k)zampə(l)/, *purch**a**se* /pətʃes/, *maint**e**nance* /mɛntenəns, mentenəns/, *pr**e**s**e**ntation* /prizɛnteʃən/, and so on. However, this does not mean that the reduced vowel /ə/ never occurs, as *about* and *again* have /ə/ in their first syllable. It seems that the letter 'a' is often pronounced /ə/, but the letter 'o' usually has a full vowel quality, especially in the *con-* prefix (*control*, *consider*, etc.). There is a greater tendency to use a full vowel in a syllable which is closed off with a final consonant, so a full vowel is much more likely at the start of ***ab**sorb* /ɛbzɔb/ than ***a**fford* /əfɔd/. - In loanwords from [Hokkien](/wiki/Min_Nan) that contain [nasal vowels](/wiki/Nasal_vowel), the nasalisation is often kept – one prominent example being the [mood](/wiki/Grammatical_mood) [particle](/wiki/Grammatical_particle) *hor*, pronounced [hõ˨]. ### Tone Singlish is tonal, as words of [Sinitic](/wiki/Sinitic_languages) origin generally retain their original tones in Singlish, notably [sentence-final discourse particles](/wiki/Sentence-final_particle), the vast majority of which derive from Cantonese. On the other hand, although English, Malay and Tamil words are non-tonal in origin, [tonogenesis](/wiki/Tone_(linguistics)#Origin) has occurred. It has been claimed that the tones assigned to the bulk of English vocabulary, with noticeable word- and phrase-final prominence, derive from the [prosody](/wiki/Prosody_(linguistics)) of [Bazaar Malay](/wiki/Malay_trade_and_creole_languages#Singapore_Bazaar_Malay), rather than from the explicitly tonal substrate languages of Sinitic origin. This has been cited as an example of [Peranakan](/wiki/Peranakan_Chinese) influence functioning as a [founder effect](/wiki/Founder_effect) within the linguistic ecology of the language's emergence. ### Prosody One of the most prominent and noticeable features of Singlish is its unique intonation pattern, which is quite unlike non-creole varieties of English. For example: - Singlish is [syllable-timed](/wiki/Timing_(linguistics)) compared to most varieties of English, which are usually stress-timed. This in turn gives Singlish a rather [staccato](/wiki/Staccato) feel. - In words with [lexical stress](/wiki/Lexical_stress), the syllable bearing the highest pitch within a [prosodic word](/wiki/Phonological_word) is normally the rightmost one, regardless of underlying stress. Words with no stress (e.g. *the*) and unstressed initial syllables (e.g. ***un**do*) have a low tone. Every other syllable, including stressed ones, is assigned a mid tone. For example, the word *redundant* [[ɹi˨ˈdan˧.dənt˦]](/wiki/Tone_letter), which has lexical stress on the second syllable, is pronounced with a low–mid–high pitch contour. In most compound words, e.g. *watermelon* [[ˈwɔ˧.tə˦ˌmɛ˧.lən˦]](/wiki/Tone_letter), tone assignment occurs individually in each constituent word (*water* and *melon*). These patterns are well-established in [Singapore English](/wiki/Singapore_English) and do not apply to loanwords from [Chinese](/wiki/Sinitic_languages) with [lexical tone](/wiki/Lexical_tone). - There is a tendency to use a rise-fall tone to indicate special emphasis. A rise-fall tone can occur quite often on the final word of an utterance, for example on the word *cycle* in \"I will try to go to the park to cycle\" without carrying any of the suggestive meaning associated with a rise-fall tone in British English. In fact, a rise-fall tone may be found on as many as 21 per cent of declaratives, and this use of the tone can convey a sense of strong approval or disapproval. - There is a lack of the de-accenting that is found in most dialects of English (e.g. British and American), so information that is repeated or predictable is still given full prominence. - There is often an 'early booster' at the start of an utterance, so an utterance like \"I think they are quite nice and interesting magazines\" may have a very high pitch occurring on the word *think*. - There may be greater movement over individual syllables in Singlish than in other varieties of English. This makes Singlish sound as if it has the [tones](/wiki/Tone_(linguistics)) of Chinese, especially when speakers sometimes maintain the original tones of words that are borrowed into Singlish from Chinese. Overall, the differences between the different ethnic communities in Singapore are most evident in the patterns of intonation. For example, Malay Singaporeans often have the main pitch excursion later in an utterance, unlike ethnically Chinese and Indian Singaporeans. Generally, these pronunciation patterns are thought to have increased the clarity of Singlish communications between pidgin-level speakers in often noisy environments, and these features were retained in creolisation. ## Grammar The grammar of Singlish has been heavily influenced by other languages in the region, such as [Malay](/wiki/Bahasa_Melayu) and [Chinese languages](/wiki/Chinese_languages), with some structures being identical to ones in Chinese varieties. As a result, Singlish has acquired some unique features, especially at the basilectal level.[*citation needed*] ### Topic prominence Singlish is [topic-prominent](/wiki/Topic-prominent_language), like [Chinese](/wiki/Chinese_language) and [Malay](/wiki/Malay_language). This means that Singlish sentences often begin with a topic (or a known reference of the conversation), followed by a comment (or new information). This contrasts with Standard English, which is subject-prominent and thus the [semantic](/wiki/Semantic) relationship between topic and comment is not as important there. In Singlish, nouns, verbs, adverbs, and even entire subject-verb-object phrases can all serve as the topic: Topic-prominence in Singlish SinglishStandard English**Dis country** weather very hot one.*The weather is very hot in this country.***Dat joker there** cannot trust.*You cannot trust the person over there.***Tomorrow** don't need bring camera.*You don't need to bring a camera tomorrow.***He play football** also very good one leh.*He's very good at playing football too.***Walau, I want to eat chicken rice***Damn, I am craving some chicken rice.***I go bus-stop wait for you***I will be waiting for you at the bus-stop.* The above constructions can be translated analogously into [Malay](/wiki/Malay_language) and [Chinese](/wiki/Chinese_language), with little change to the word order. The topic can be omitted when the context is clear, or shared between clauses. This results in constructions that appear to be missing a subject to a speaker of [Standard English](/wiki/Standard_English), and so called PRO-drop utterances may be regarded as a diagnostic feature of Singlish. For example: Omission of topic in Singlish SinglishStandard EnglishNo good lah.*This isn't good.*Cannot anyhow go like dat one leh.*You/it can't just go like that.*How come never show up?*Why didn't you/he/it show up?* (See the use of *never* in place of *didn't* under the \"Past tense\" section.)I like badminton, dat's why I every weekend go play.*I play badminton every weekend because I like it.*He sick, so he stay home sleep lor.*He's not feeling well, so he decided to rest at home and sleep!* ### Nouns Nouns are optionally marked for [plurality](/wiki/Plural). [Articles](/wiki/Article_(grammar)) are also optional. For example: - He can play **piano**. - I like to read **storybook**. - Your computer got **virus** or not? *– Does your computer have a virus?* - This one ten **cent** only. – *This one only costs 10 cents.* It is more common to mark the plural in the presence of a [modifier](/wiki/Grammatical_modifier) that implies plurality, such as *many* or *four*. Many nouns which seem logically to refer to a countable item are used in the plural, including *furniture* and *clothing*. Examples of this usage from corpus recordings are: - So I bought a lot of furnitures from [IKEA](/wiki/IKEA). - Where are all the stuffs I ordered? - I had to borrow some winter clothings. ### Copula The [copula](/wiki/Copula_(linguistics)), which is the verb *to be* in most varieties of English, is treated somewhat differently in Singlish: The copula is generally not used with adjectives or adjective phrases: - I damn naughty. Sometimes, an adverb such as *very* occurs, and this is reminiscent of [Chinese](/wiki/Chinese_language) usage of 很 (*hěn*) or 好 (*hǎo*): - Dis house **very** nice. It is also common for the [present participle](/wiki/Present_participle) of the verb to be used without the copula: - I still finding. - How come you so late still **playing** music, ah? - You **looking** for trouble, is it? The [zero copula](/wiki/Zero_copula) is also found, although less frequently, as an equative between two nouns, or as a [locative](/wiki/Locative): - Dat one his wife lah. – *That lady is his wife.* - Dis boy the class monitor. – *This boy is the class monitor.* - His house in [Toa Payoh](/wiki/Toa_Payoh). – *His house is in Toa Payoh.* In general, the [zero copula](/wiki/Zero_copula) is found more frequently after nouns and pronouns (except *I*, *he*, and *she*), and much less after a [clause](/wiki/Clause) (what I think is...) or a [demonstrative](/wiki/Demonstrative) (this is...). ### Past tense Past tense marking is optional in Singlish. Marking of the past tense occurs most often in [irregular verbs](/wiki/Regular_and_irregular_verbs), as well as verbs where the past tense suffix is pronounced /ɪd/. For example: - I **went** to Orchard Road yesterday. - He **accepted** in the end. Due to consonant cluster simplification, the past tense is most often unmarked when it is pronounced as /t/ or /d/ at the end of a [consonant cluster](/wiki/Consonant_cluster): - He **talk** so long, never **stop**, I **ask** him also never. – 'He talked for so long without stopping and wouldn't even stop when I asked him to.' The past tense is more likely to be marked if the verb describes an isolated event (it is a punctual verb), and it tends to be unmarked if the verb in question represents an action that goes on for an extended period: - When I young ah, I **go** school every day. - When he was in school, he always **get** good marks one. - Last night I **mug** so much, so sian already. – 'Last night I studied so much that I became very tired.' There seems also to be a tendency to avoid use of the past tense to refer to someone who is still alive: - The tour guide **speak** Mandarin. Note in the final example that although the speaker is narrating a story, they probably use the present tense in the belief that the tour guide is probably still alive. ### Aspect Instead of the past tense, the completion of an action or a change of state can be expressed by adding *already* or *liao* [ljau˩] to the end of the sentence, analogous to the [Chinese](/wiki/Chinese_language) 了 (*le*, [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *liáu*). This is not the same as the past tense, as it does not cover past habitual or continuous occurrences. Instead, *already* and *liao* are markers of [perfective](/wiki/Perfective_aspect) and [inchoative aspect](/wiki/Inchoative_aspect), and can refer to real or hypothetical events in the past, present or future. The frequent use of **already** (pronounced more like \"oreddy\" and sometimes spelt that way) in Singlish is probably a direct influence of the Hokkien *liao* particle. For example: - Aiyah, cannot wait any more, must go **already**. (Oh dear, I cannot wait any longer. I must leave immediately.) - Ah Song kena sai **already**, then how? (Ah Song has gotten into trouble, what will you do (now)?) - Your ice cream melt **already**. (Your ice cream is starting to melt / has melted.) Some examples of the direct use of **liao**: - He throw **liao**. (He has already thrown it away.) - I eat **liao**. (I ate *or* I have eaten.) - This new game, you play **liao** or not? (Have you played this new game yet?) ### Negation This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(October 2022)* *(Learn how and when to remove this message)* Negation works in general like English, with *not* added after *to be*, *to have*, or [modals](/wiki/Modal_verb), and *don't* before all other verbs. Contractions (*can't*, *shouldn't*) are used alongside their uncontracted forms. However, due to final cluster simplification, the -t drops out from negative forms, and -n may also drop out after nasalising the previous vowel. This makes nasalisation the only mark of the negative. - I do/don't ([dõ]) want. – 'I don't want to.' Another effect of this is that in the verb *can*, its positive and negative forms are distinguished only by the [vowel](/wiki/Vowel) (aside from [stress](/wiki/Stress_(linguistics))): - This one can /kɛn/ do lah. - This one can't /ˈkan/ do lah. Also, *never* is used as a negative past tense marker, and does not have to carry the English meaning. In this construction, the negated verb is never put into the past-tense form: - How come today you **never** (=didn't) hand in homework? - How come he **never** (=didn't) pay just now? ### Interrogative In addition to the usual[*which?*] way of forming [yes–no questions](/wiki/Yes%E2%80%93no_question), Singlish uses two more constructions: In a construction similar (but not identical) to [Chinese](/wiki/Chinese_language) [A-not-A](/wiki/A-not-A_question), *or not* is appended to the end of sentences to form yes/no questions. *Or not* cannot be used with sentences already in the negative: - You want this book **or not**? – *Do you want this book?* - Can **or not**? – *Is this possible / permissible?* The phrase *is it*, appended to the end of sentences, forms yes–no questions. *Is it* implies that the speaker is simply confirming something they have already inferred: - They never study, **is it**? (No wonder they failed!) - You don't like that, **is it**? (No wonder you had that face!) - Alamak, you guys never read newspaper **is it**? – \"What? Haven't you guys ever read a newspaper?\" (No wonder you aren't up to date!) The phrase *isn't it* also occurs when the speaker thinks the hearer might disagree with the assertion. There are also many discourse particles (such as *hah*, *hor*, *meh*, and *ar*) used in questions. (See the \"Discourse particles\" section elsewhere in this article.) ### Reduplication Another feature strongly reminiscent of [Chinese](/wiki/Chinese_language) and [Malay](/wiki/Malay_language), verbs are often repeated (e.g. TV personality Phua Chu Kang's \"don't pray-pray!\" *pray* = *play*). In general verbs are repeated twice to indicate the delimitative aspect (that the action goes on for a short period), and three times to indicate greater length and continuity: - You go **think think** a little bit, maybe den you get answer. ('Go and think over it for a while, and then you might understand.') - So what I do was, I sit down and I **think think think**, until I get answer lor. ('So I sat down, thought, thought and thought, until I understood.') The use of verb repetition also serves to provide a more vivid description of an activity: - Want to go Orchard **walk walk see see** (走走看看) or not? ('Let's go shopping/sightseeing at Orchard Road.') - Don't anyhow **touch** here **touch** there leh. ('Please don't mess with my things.') In another usage reminiscent of Chinese, [nouns](/wiki/Noun) referring to people can be repeated for intimacy. Most commonly, monosyllabic nouns are repeated: - My **boy-boy** is going to Primary One oreddy. ('My son is about to enter Year/Grade/Standard One.') - We two **fren-fren** one. ('We are close friends.') However, occasionally reduplication is also found with disyllabic nouns: - We **buddy-buddy**. You don't play me out, OK? - I'm the kind who is **buddy-buddy** person. [Adjectives](/wiki/Adjective) of one or two syllables can also be repeated for intensification: - You go take the **big-big** one ah. ('Retrieve the larger item, please.') - You want a raise from this boss? Wait **long long** ah. ('It will never happen.') ### Discourse particles In Singlish, discourse particles are minimal lexemes (words) that occur at the end of a sentence and that do not carry referential meaning, but may relate to linguistic modality, register or other pragmatic effects. They may be used to indicate how the speaker thinks that the content of the sentence relates to the participants' common knowledge or change the emotional character of the sentence. Particles are noted for keeping their [tones](/wiki/Tone_(linguistics)) regardless of the remainder of the sentence. Most of the particles are borrowed from southern Chinese varieties, with the tones intact. Research on Singlish discourse particles have been many but varied, often focusing on analysing their functions in the sentences they appear in. ### Singlish phrases ***Wah Lau / Walao*** *Wah lau* ([wâ lǎu]) is used as an interjection or exclamation at the beginning of a sentence, and it usually has a negative connotation. It is derived from a Hokkien or Teochew phrase that means 'my father' (我老), abbreviated form of \"my father's\" (我老的; *góa lāu--ê*). - **Wah lau**! I can't believe the teacher gave us so much work to do in such a tight deadline! #### *Kena* *Kena* ([kəna] or [kana]) can be used as an auxiliary to mark the passive voice in some varieties of Singlish. It is derived from a Malay word that means \"to encounter or to come into physical contact\", and is only used with objects that have a negative effect or connotation. Verbs after *kena* may appear in the infinitive form (i.e. without tense) or as a [past participle](/wiki/Past_participle). It is similar in meaning to passive markers in Chinese, such as Hokkien 著; *tio̍h* or Mandarin 被; *bèi*: - He **kena** scold/scolded. – 'He was scolded.' - Dun listen, later you **kena** punish/punished then you know. – 'If you don't listen to me, you will be punished, after which you will know that you were wrong.' *Kena* is not used with positive things: - *He **kena** praised. - *He **kena** lottery. - *He **kena** jackpot. Use of *kena* as in the above examples will not be understood, and may even be greeted with a confused reply: \"But strike lottery good wat!\" ('But it's a good thing to win the lottery!'). However, when used in sarcasm, *kena* can be used in apparently positive circumstances, though with an ironic modicum of success, for example: - He **kena** jackpot, come back to school after so long den got so much homework! ('He received a lot of homework upon returning to school after a long absence.') When the context is given, *kena* may be used without a verb to mean 'will be punished.' - Better do your homework, otherwise you **kena**. ('You will be punished unless you do your homework.') - Don't listen to me, later you **kena**. Using another auxiliary verb with *kena* is perfectly acceptable as well: - Better do your homework, otherwise you will **kena**. - Don't listen to me, later you will **kena**. #### *Tio* This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(October 2022)* *(Learn how and when to remove this message)* From Hokkien 著; *tio̍h**, tio* ([tiò]; pronounced with a low tone due to Hokkien tone [sandhi](/wiki/Sandhi)) can be used interchangeably with *kena* in many scenarios. While *kena* is often used in negative situations, *tio* can be used in both positive and negative situations. - He tio cancer. ('He was diagnosed with cancer.') - He tio jackpot. ('He struck the jackpot.') - He tio lottery. ('He struck lottery.') - Tio fined lor, what to do? ('I got fined, couldn't help it.') *Tio* has a lighter negative tone when used negatively, compared to *kena*. - Kena fined lor, what to do? - Tio fined lor, what to do? Both mean the same, but *kena* makes the speaker sound more unhappy with the situation than *tio*. *Tio* also sounds more sympathetic when talking about an unfortunate incident about someone close. - Her mum tio cancer. ('Her mum was diagnosed with cancer.') - Sad sia, so young tio cancer. ('How sad, he was diagnosed with cancer at such a young age.') Using *kena* in the following might not be appropriate, as they seem impolite, as if the speaker is mocking the victim. - Her mum kena cancer. - He kena cancer. #### *One* The word *one* is used to emphasise the [predicate](/wiki/Predicate_(grammar)) of the sentence by implying that it is unique and characteristic. It is analogous to the use of particles like 嘅 (*ge*) or 㗎 (*ga*) in Cantonese, 啲 (*e*) in Hokkien, は (*-wa*) in Japanese, or 的 (*de*) in some dialects of Mandarin. *One* used in this way **does not** correspond to any use of the word *one* in [Standard English](/wiki/Standard_English). It might also be analysed as a relative pronoun, though it occurs at the end of the relative clause instead of the beginning (as in Standard English). - Wah lau! So stupid **one**! – 'Oh my gosh! He's so stupid!' - I do everything by habit **one**. – 'I always do everything by habit.' - He never go school **one**. – 'He doesn't go to school (unlike other people).' - Is like that **one**. – 'It is how it is.' Some bilingual speakers of [Mandarin](/wiki/Mandarin_Chinese) may also use 的 (*de*) in place of *one*. #### *Then* **This section has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This section **may be confusing or unclear to readers**. Please help clarify the section. There might be a discussion about this on the talk page. *(November 2024)* *(Learn how and when to remove this message)*This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(February 2021)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* The word *then* is often pronounced or written as *den* /dɛn/. When used, it represents different meanings in different contexts. In this section, the word is referred to as *den*. **i)** *Den* can be synonymous with *so* or *therefore*. It is used to replace the Chinese grammatical particle 才; 纔; *cái* (see ii). When it is intended to carry the meaning of *therefore*, it is often used to explain one's blunder/negative consequences. In such contexts, it is a translation from Chinese 所以. When used in this context, the *den* is prolonged twice the usual length in emphasis, as opposed to the short emphasis it is given when used to mean *cái*. - Never do homework **den** (two beats with shifts in tone sandhi, tone 2) indicating replacement of 所以)[*clarification needed*] kena scold lor. – 'I did not do my homework, that's why (therefore) I got a scolding' - Never do homework (pause) **den** (two beats with shifts in tone sandhi, tone 2) indicating replacement of 然后; 然後)[*clarification needed*] kena scold lor. – 'I did not do my homework; I got a scolding after that' - Never do homework **den** (one beat with no shift in tone sandhi, indicating 才) kena scold lor. – 'It is only due to the fact that I did not do my homework that I was scolded.' However, *den* cannot be freely interchanged with *so*. The following examples are incorrect uses of *den*, which will sound grammatically illogical to a Singlish speaker: - I'm tired, **den** I'm going to sleep. - I'm late, **den** I'm going to take a taxi. The reason for this is that *den* often marks a negative, non-volitional outcome (either in the future or the past), while the above sentences express volition and are set in the present. Consider the following examples: - I damn tired **den** langgar the car lor. – 'I was really tired, which is why I knocked into [that] car.' - I late **den** take taxi, otherwise don't take. – 'When I'm late, [only] then do I take a taxi; otherwise I don't take taxis.' = 'I only take a taxi when I'm late.' (see usage vi) **ii)** *Den* is also used to describe an action that will be performed later. It is used to replace the Chinese particle 才; 纔; *cái*. When used in this context, the *den* is pronounced in one beat, instead of being lengthened to two beats as in (i). If shortened, the meaning will be changed or incorrectly conveyed. For example, \"I go home liao, **den** (two beats) call you\" will imbue the subtext with a questionable sense of irony, a lasciviousness for seduction (three beats), or just general inappropriateness (random two beats indicating a Hong Kong comedy-influenced moleitou 無理頭 Singaporean sense of humour). - I go home liao **den** call you. – 'I will call you when I reach home' - Later **den** say. – 'We'll discuss this later' **iii)** *Den* can be used at the beginning of a sentence as a link to the previous sentence. It often has the meaning \"after that\". In other cases, it carries a connotation of an exclamation. - We were doing everything fine, **den** he fuck everything up - I was at a park. **Den** hor, I was attacked by dinosaur leh! - I woke up at 10. **Den** boss saw me coming in late. So suay! **iv)** *Den* can be used to return an insult/negative comment back to the originator. When used in such a way, there must first be an insult/negative comment from another party. In such contexts, it is a translation from the Chinese 才; 纔; *cái*. - A: You're so stupid! - B: You **den** stupid la – 'You're the stupid one' - A: You're late! - B: You **den** late lor. – 'You're the late one' **v)** \"Den?\" can be used as a single-worded phrase. Even if *den* is used in a single-worded phrase, even with the same pronunciation, it can represent four different meanings. It can either be synonymous with \"so what?\", or it can be a sarcastic expression that the other party is making a statement that arose from his/her actions, or similarly an arrogant expression which indicating that the other party is stating the obvious, or it can be used as a short form for \"what happened then?\". [Synonymous with \"so what?\"] - A: I slept at 4 last night leh... - B: **Den?** [Sarcastic expression] Speakers tend to emphasise the pronunciation of 'n'. *Context: A is supposed to meet B before meeting a larger group but A is late for the first meeting* - A: Late liao leh... - B: **Dennn?** [Arrogant expression] Speakers have the option of using *den* in a phrase, as in \"Ah bu den\" or \"Ah den\". In this case it serves approximately the same purpose as 'duh' in American English slang. - A: Wah seh! You actually make this computer all by yourself ah? - B: Ah bu den! [Ah, but then? (What happened after that?)] - A: I found $100 today... - B: **Den** what? **vi)** *Den* can also indicate a conditional (an if-then condition), implying an omitted *if/when*: - I late **den** take taxi, otherwise dun take. – 'When I'm late, [only] then do I take a taxi; otherwise I don't take taxis.' = 'I only take a taxi when I'm late.' - You want to see [Justin Bieber](/wiki/Justin_Bieber) den go lah! – 'If you want to see Justin Bieber, then go [to the concert]!' #### *Oi* This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(October 2022)* *(Learn how and when to remove this message)* **Oi** originating from the Hokkien (喂, *oe*), is commonly used in Singlish, as in other English varieties, to draw attention or to express surprise or indignation. Some examples of the usage of *Oi* include: - Oi, you forgot to give me my pencil! - Oi! Hear me can! - Oi! You know how long I wait for you?! - Oi! Wake up lah! As *oi* has connotations of disapproval, it is considered to be slightly offensive if it is used in situations where a more polite register is expected, e.g. while speaking to strangers in public, people in the workplace or one's elders. #### *Lah* The ubiquitous word *lah* (/lá/ or /lâ/), sometimes spelled as *la* and rarely spelled as *larh*, *luh* or *lurh*, is used at the end of a sentence. It originates from the Chinese word (啦, [POJ](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *lah*) or the same word in Malay. It simultaneously softens the force of an utterance and entices solidarity, though it can also have the opposite meaning so it is used to signal power. In addition, there are suggestions that there is more than one *lah* particle, so there may be a stressed and an unstressed variant and perhaps as many as nine tonal variants, all having a special pragmatic function. In Malay, *lah* is used to change a verb into a command or to soften its tone, particularly when usage of the verb may seem impolite. To drink is *minum*, but 'Here, drink!' is *minumlah!*. Similarly, *lah* is frequently used with imperatives in Singlish: - Drink **lah**! – 'Just drink!' *Lah* also occurs frequently with *yah* and *no* (hence \"Yah lah!\" and \"No lah!...\"). This can, with the appropriate tone, result in a less-brusque declaration and facilitate the flow of conversation: \"No more work to do, we go home lah!\" However, if the preceding clause is already diminutive or jocular, suffixing it with *-lah* would be redundant and improper: one would not say \"yep lah\", \"nope lah\", or \"ta lah\" (as in the British *ta* for 'thank you'). - *Lah* with a low tone might indicate impatience. \"Eh, hurry up lah.\" *Lah* is often used with brusque, short, negative responses: - I dun have **lah**! – 'I don't have any of what you were requesting!' - Dun know oreddy **lah**! – 'Argh, I don't know any more than what I told you!' or 'I give up trying to understand this!' *Lah* is also used for reassurance: - Dun worry, he can one **lah**. – 'Don't worry, he will be capable of doing it.' - Okay **lah**. – 'It's all right. Don't worry about it.' *Lah* is sometimes used to curse people - Go and die *lah*! *Lah* can also be used to emphasise items in a spoken list, appearing after each item in the list. Although *lah* can appear nearly anywhere, it does not appear with a yes–no question. Other particles are used instead: - He do that **ah**? - Later free **or not**? - Don't tell me he punch her **ah**? #### *Wat* The particle *wat* (/wàt/), also spelled *what*, is used to remind or contradict the listener, especially when strengthening another assertion that follows from the current one: - But he very good at Maths **wat**. – 'But he is very good at mathematics.' (Shouldn't you know this already, having known him for years?) - You never give me **wat**! – (It's not my fault, since) 'You didn't give it to me!' (Or else I would have gotten it, right?) - I never punch him **wat!** – (I did not punch him) 'I did not punch him!' (Or else I am the one, right?) It can also be used to strengthen any assertion: - The food there not bad **wat**. Can try lah. This usage is noticeably characterised by a low tone on *wat*, and parallels the assertive Cantonese particle 嘛 in expressions like 冇錯嘛. #### *Mah* **Mah** (/má/), originating from Chinese (嘛, *ma*), is used to assert that something is obvious and final, and is usually used only with statements that are already patently true. It is often used to correct or cajole, and in some contexts is similar to English's *duh*. This may seem condescending to the listener: - This one also can work one **mah**! – 'Can't you see that this choice will also work?' - He also know about it **mah**! – 'He knew about it as well, [so it's not my fault!]' #### *Lor* *Lor* (/lɔ́/), also spelled *lorh* or *loh*, from Chinese (囖/咯; *lo1*), is a casual, sometimes jocular way to assert upon the listener either direct observations or obvious inferences. It also carries a sense of resignation, or alternatively, dismissiveness. that \"it happens this way and can't be helped\": - If you don't do the work, then you die liao **lor**! – 'If you don't do the work, then you're dead!' - Kay **lor**, you go and do what you want. – 'Fine, go ahead and do what you want.' - Dun have work to do, den go home **lor**. – 'If you're done working, you should go home.' (What are you waiting for?) - Ya **lor**. – Used when agreeing with someone #### *Leh* *Leh* or *lei* (/lɛ́/ or /lé/), from Chinese (咧; *leh*), is used to soften a command, request, claim, or complaint that may be brusque otherwise: - Gimme **leh**. – 'Please, just give it to me.' - How come you don't give me **leh**? – 'Why aren't you giving it to me?' - The ticket seriously ex **leh**. – 'Argh, the tickets are really expensive.' - But I believe safe better than sorry **leh**. – 'The thing is, I believe it's better to be safe than sorry.' Especially when on a low tone, it can be used to show the speaker's disapproval: - You call her walk there, very far **leh**. ('If you ask her to go there on foot, it will be a rather long distance.') In Singlish-to-English translations, *leh* is typically translated as 'What about?' #### *Hor* *Hor* (/hɔ̨̌/), from Hokkien (乎; *hō͘*), also spelled *horh*, is used to ask for the listener's attention and consent/support/agreement: It is usually pronounced with a low tone. - Then **hor**, another person came out of the house. – 'And then, another person came out of the house.' - This shopping center very nice **hor**? – 'This shopping centre is very nice, isn't it?' - Oh yah **hor**! – 'Oh, yes!' (realising something) - Like that can **hor**? – 'So can it be done that way?' #### *Ar* *Ar* (/ǎ/), also spelled *arh* or *ah*, is inserted between topic and comment. It often, but not always, gives a negative tone: - This boy **ah**, always so rude one! – 'This boy is so rude!' *Ar* (/ǎ/) with a rising tone is used to reiterate a rhetorical question: - How come like dat one **ah**? – 'Why is it like that? / Why are you like that?' *Ar* (/ā/) with a mid-level tone, on the other hand, is used to mark a genuine question that does require a response: (*or not* can also be used in this context): - You going again **ah**? – 'Are you going again?' #### *Hah*\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:00.480662",
  "title": "Singlish",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singlish"
}