{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:00:44.740046"
  },
  "content": "Measures taken by Singapore against MERS**An editor has nominated this article for deletion.** You are welcome to participate in **the deletion discussion**, which will decide whether to keep it.Feel free to improve the article, but do not remove this notice before the discussion is closed. For more information, see the guide to deletion. *Find sources:* \"Singaporean measures against Middle East respiratory syndrome\" – news **·** newspapers **·** books **·** scholar **·** JSTOR%5B%5BWikipedia%3AArticles+for+deletion%2FSingaporean+measures+against+Middle+East+respiratory+syndrome%5D%5DAFDThis article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)* **Singapore** has taken a series of **measures against Middle East respiratory syndrome (MERS)** and the potential threat of a [pandemic](/wiki/Influenza_pandemic). ## Status - 62 suspected MERS cases investigated, all negative reports [Ministry of Health (Singapore)](/wiki/Ministry_of_Health_(Singapore)) - Middle East Respiratory Syndrome Coronavirus (MERS-CoV) Health Advisory for July 2015 including a [YouTube](/wiki/YouTube) video. ### Risk assumption When planning the response, it is assumed that the first local human case is likely to be imported from affected countries and is difficult to prevent. The virus, which is more [infectious](/wiki/Infectious_disease) than [SARS](/wiki/SARS), is likely to spread quickly and has a high [morbidity](/wiki/Morbidity) and [mortality](/wiki/Death). ## Measures ### Health advisory Those who develop flu-like symptoms should seek medical help promptly, and inform the doctors of their travel history. ### Surveillance Surveillance for influenza involves monitoring for virus strains and disease activity. A nationwide reporting scheme for [acute respiratory infections](/wiki/Acute_respiratory_infection) has been established. The [National Influenza Centre](/wiki/National_Influenza_Centers) routinely carried out [virological](/wiki/Virological) testing of respiratory samples from hospitals and polyclinics. ### Hospital and medicine To tackle a possible outbreak of [Middle East respiratory syndrome](/wiki/Middle_East_respiratory_syndrome), Singapore is increasing its resource such as isolation facilities in hospitals and stockpiling medicine. ### Outbreak response plan In the event of the pandemic, Singapore will require health screening, [social distancing](/wiki/Social_distancing) and [contact tracing](/wiki/Contact_tracing) of all visitors, as during the 2003 [SARS](/wiki/SARS) crisis, [COVID-19 pandemic](/wiki/COVID-19_pandemic) and [quarantine](/wiki/Quarantine) suspected victims through the Stay-Home Notice (SHN). [DORSCON](/wiki/DORSCON) remains at Green at that stage in 2015.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:00:44.739674",
  "title": "Singaporean measures against Middle East respiratory syndrome",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singaporean_measures_against_Middle_East_respiratory_syndrome"
}