{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:58:07.853617"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore Repertory Theatre\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2021)* *(Learn how and when to remove this message)* **Singapore Repertory Theatre** (**SRT**), is a [non-profit](/wiki/Non-profit) professional [theatre](/wiki/Theatre) company founded in 1993. It is located at the KC Arts Centre – Home of SRT at 20 Merbau Road, Singapore. The current artistic director is Gaurav Kripalani while its [managing director](/wiki/Managing_director) is Charlotte Nors. ## History The SRT was founded in 1993. On 31 January 2024, the SRT announced its name change to **Singapore Theatre Company** (**STC**). The decision to change name was due to incompatibility of the name [Repertory theatre](/wiki/Repertory_theatre) as the company is not a repertory theatre in nature and that the general public do not know what it is. The name change was supported by the [National Arts Council](/wiki/National_Arts_Council,_Singapore) of Singapore. The name change drew criticisms from the Singaporean theatre community, such as children's theatre company Act 3 Theatrics and multilingual theatre company The Theatre Practice. Criticisms were mainly about the company taking on a name that it seeks to represent itself as the national theatre company while it is not. Kripalani, the artistic director of STC, rejected the criticisms as the name change was to remove the words repertory theatre from the company and had no other intentions. On 8 February, the company decided to change to another name, yet to be determined, after the community feedback. The new name is expected to be revealed before its next performance in August. On 31 July, it was announced that STC reverted to its original name of Singapore Repertory Theatre. Initial critics of the name change applauded the announcement, citing SRT \"for listening and taking the feelings of our theatre community to heart\" and \"was open to the concerns of different voices and had the courage to reverse their decision\". While reverting to the original name, SRT launched a new signage. ## Organisation The SRT group has five divisions: - Main Stage - The Little Company (TLC) - The Young Company (TYC) - Stage Two - Inclusive Young Company (iYC) SRT also conducts regular Education and Development programmes, as part of its Learning and Engagement (L&E) Department as well as fundraising activities. ## Main Stage SRT caters to different [audience](/wiki/Audience) segments, ensuring that a variety of performances are available with each season showcasing eight to ten [plays](/wiki/Play_(theatre)) and [musicals](/wiki/Musical_theatre). *Forbidden City: Portrait of An Empress* is one of the musicals staged by SRT in 2002 at the [Esplanade - Theatres on the Bay](/wiki/Esplanade_-_Theatres_on_the_Bay) as part of its opening festival. It was restaged in 2003, 2006 and is slated for another restaging in 2017. Other original musicals by SRT include *A Twist of Fate* (1998). SRT was the first to stage [Broadway musicals](/wiki/Broadway_musicals) in Singapore, such as *[RENT](/wiki/RENT)* (2001) and *[Avenue Q](/wiki/Avenue_Q)* (2008). Past productions also include *[The Pillowman](/wiki/The_Pillowman)* (2007, 2008), *[God of Carnage](/wiki/God_of_Carnage)* (2012) and *[Venus in Fur](/wiki/Venus_in_Fur)* (2013). SRT produced *The LKY Musical* (2015) for Metropolitan Productions. ### Shakespeare in the Park SRT has been presenting Shakespeare in the Park as part of its theatre tradition for close to two decades at [Fort Canning Park](/wiki/Fort_Canning_Park). The first staging was in 1997 with *[Hamlet](/wiki/Hamlet)*. Shakespeare in the Park subsequently became a biennial event from 2007 with *[A Midsummer Night's Dream](/wiki/A_Midsummer_Night%27s_Dream)*, and has been an annual affair since 2011. In 2016, *[Romeo and Juliet](/wiki/Romeo_and_Juliet)* was the ninth Shakespeare in the Park production, which attracted close to 30,000 attendees.[*citation needed*] In 2017, Shakespeare in the Park production was put on hold due to a lack of funding. A crowdfunding campaign, SOS (Save our Shakespeare) Campaign, was launched by SRT to raise funds to produce a show. in 2018. SRT managed to raise enough funds to stage *[Julius Caesar](/wiki/Julius_Caesar_(play))* at Fort Canning Park in May 2018. ### International productions 2007: In collaboration with Esplanade – Theatre on the Bay, SRT brought the [Royal Shakespeare Company](/wiki/Royal_Shakespeare_Company) to Singapore for a production of [William Shakespeare](/wiki/William_Shakespeare)'s *[King Lear](/wiki/King_Lear)* and [Anton Chekhov](/wiki/Anton_Chekhov)'s *[The Seagull](/wiki/The_Seagull)*, starring Sir [Ian McKellen](/wiki/Ian_McKellen). 2009: SRT co-commissioned The Bridge Project, a three-year trans-Atlantic project by Oscar-winning [Sam Mendes](/wiki/Sam_Mendes). The project premiered with *[The Winter's Tale](/wiki/The_Winter%27s_Tale)* (2009), starring [Ethan Hawke](/wiki/Ethan_Hawke), [Simon Russell Beale](/wiki/Simon_Russell_Beale) and Rebecca Hall. This was followed by *[The Tempest](/wiki/The_Tempest)* (2010), and *[Richard III](/wiki/Richard_III_(play))* (2011) starring [Kevin Spacey](/wiki/Kevin_Spacey). 2013: Together with Esplanade – Theatres on the Bay, SRT presented 3 Titans of Theatre: *Shun-kin*, *Musashi* and *The Suit*, directed by three legendary directors, [Simon McBurney](/wiki/Simon_McBurney), [Yukio Ninagawa](/wiki/Yukio_Ninagawa) and [Peter Brook](/wiki/Peter_Brook) respectively. 2014: Written and directed by [Yaël Farber](/wiki/Ya%C3%ABl_Farber), Mies Julie is an adaptation of [August Strindberg](/wiki/August_Strindberg)'s *[Miss Julie](/wiki/Miss_Julie)*, presented by SRT and [Cape Town](/wiki/Cape_Town)'s [Baxter Theatre Centre](/wiki/Baxter_Theatre_Centre) at the KC Arts Centre – Home of SRT. 2015: SRT co-commissioned Peter Brook's new play – *Battlefield*, based on the end of the Indian epic, *[The Mahabharata](/wiki/The_Mahabharata)*. *Battlefield* premiered at the [Théâtre des Bouffes du Nord](/wiki/Th%C3%A9%C3%A2tre_des_Bouffes_du_Nord) in [Paris](/wiki/Paris), followed by an international tour that premiered in Singapore. ## The Little Company The Little Company was founded in 2001 as a division of SRT. Three to four shows are staged annually for children aged three and above, with one being a Mandarin production. The shows reach up to 70,000 children and adults annually. Productions are written, designed and performed by professionals in the industry. Among several commissioned works by renowned international artistes, a [trilogy](/wiki/Trilogy) of musicals for children (*[The Three Little Pigs](/wiki/The_Three_Little_Pigs)*, *[The Three Billy Goats Gruff](/wiki/The_Three_Billy_Goats_Gruff)* and *[Goldilocks and the Three Bears](/wiki/Goldilocks_and_the_Three_Bears)*) was written and composed by [Laurence Olivier Award](/wiki/Laurence_Olivier_Award)-winning duo [George Stiles](/wiki/George_Stiles_(composer)) and [Anthony Drewe](/wiki/Anthony_Drewe). The Three Little Pigs has toured internationally. The show embarked on a UK Tour in 2015, before its [West End](/wiki/West_End_of_London) premiere at London's [Palace Theatre](/wiki/Palace_Theatre,_London). It has played at The [Greenwich Theatre](/wiki/Greenwich_Theatre) in [London](/wiki/London), The Emerald City Theatre in [Chicago](/wiki/Chicago), The [Sydney Opera House](/wiki/Sydney_Opera_House) in [Australia](/wiki/Australia), as well as [Finland](/wiki/Finland) and several major cities in [China](/wiki/China). SRT has also worked with London-based duo [Jake Brunger and Pippa Cleary](/wiki/Jake_Brunger_and_Pippa_Cleary) to present *[Red Riding Hood](/wiki/Red_Riding_Hood)* (2013) and *Treasure Island* (2015). Other past productions include: *[The Ugly Duckling](/wiki/The_Ugly_Duckling)* (2005, 2007, 2011), Dr. Seuss' *[The Cat in the Hat](/wiki/The_Cat_in_the_Hat)* (2012, 2015) and *Junior Claus* (2014) ## The Young Company The Young Company is a two-year [educational](/wiki/Educational) and [performing](/wiki/Performing) platform for 16 to 25 year-olds. Twenty young people are selected from open [auditions](/wiki/Auditions) to form the core of the company and receive practical training in all aspects of theatre. The Young Company also launched a [playwriting](/wiki/Playwriting) programme for [youths](/wiki/Youths) in 2012. Past productions include: *[The Trojan Women](/wiki/The_Trojan_Women)* (2013), *[The Laramie Project](/wiki/The_Laramie_Project)* (2014) and *[The Caucasian Chalk Circle](/wiki/The_Caucasian_Chalk_Circle)* (2015). ## Stage Two Stage Two is a theatre division that develops and stages original Singaporean work. It incorporates the Playwright Incubator Programme. Past productions include *Fried Rice Paradise*. ## KC Arts Centre - Home of SRT The KC Arts Centre – Home of SRT is located along the [Singapore River](/wiki/Singapore_River) at [Robertson Quay](/wiki/Robertson_Quay) along 20 Merbau Road. The 380-seat theatre is a hub for the [performing arts](/wiki/Performing_arts). This remains the only fully furnished [venue](/wiki/Theater_(structure)) run by a theatre company in Singapore. The KC Arts Centre is named after the Kewalram Chanrai Group in recognition of their donation to SRT. ## Education and development ### Education programme ### Student Education Fund The SRT Student Education Fund (SRTSEF) was set up in 2012 to reach young minds who may not otherwise have the opportunity to come to the theatre. The fund fully subsidises student [tickets](/wiki/Ticket_(admission)) to any production by the SRT Group, as well as covers transport costs for them, where needed, to and from the performance venue. [Beneficiaries](/wiki/Beneficiaries) include an [Alma Mater](/wiki/Alma_Mater) chosen by the donor, [underprivileged](/wiki/Underprivileged) children from local schools, [charity](/wiki/Charitable_organization) organisations or student care centres, and Arts Schools.[*citation needed*] ### Residency programme The National Arts Council and SRT has a shared focus on developing the young arts industry. Conceptualised in 2013, the SRT Residency Programme has four Singaporean individuals who are offered an 18-month position in a learning environment. They are mentored by SRT and its creative team, focusing on industry's areas of expertise such as direction, stage design, producing and musical composing/arranging. The programme provides a monthly [stipend](/wiki/Stipend) to assist the Resident for the duration of the skill development programme.[*citation needed*] ## Fundraising SRT is a [non-profit](/wiki/Non-profit) [charity](/wiki/Charitable_organization) granted Institutions of A Public Character (IPC) status, and issues [tax deductible](/wiki/Tax_deductible) receipts for [donations](/wiki/Donations) made. Friends of SRT is a [donor](/wiki/Donor) programme that offers benefits for donors that include complimentary tickets and backstage tours. ### The Theatre Ball The Theatre Ball is a fundraising event for SRT to continue to offer meaningful, high calibre theatre to a diverse audience and focus on grooming and nurturing the next generation of [actors](/wiki/Actors), [directors](/wiki/Film_director) and [designers](/wiki/Designers). In 2016, proceeds from the Theatre Ball went to a variety of initiatives including the SRT Student Education Fund.[*citation needed*]\n",
  "language": "en",
  "processed_at": "2026-01-12T11:58:07.853186",
  "title": "Singapore Repertory Theatre",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Repertory_Theatre"
}