{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:58:35.750401"
  },
  "content": "University in SingaporeThis article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(June 2024)* *(Learn how and when to remove this message)*‹ The template *Infobox university* is being considered for merging. › The **Singapore University of Social Sciences** (**SUSS**) is a [public](/wiki/Public_university) [autonomous university](/wiki/Autonomous_university) in [Singapore](/wiki/Singapore). Established in 2017, SUSS focuses on applied degree programmes primarily in the social sciences. In 2017, SUSS received its inaugural class of 2,137 graduates. SUSS is organised into five Academic Schools, [Institute for Adult Learning](/wiki/Institute_for_Adult_Learning) (IAL), SUSS Academy, College of Interdisciplinary and Experiential Learning and eight Centres. The Patron of SUSS is Singapore President [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam), the Chancellor is [Halimah Yacob](/wiki/Halimah_Yacob), and the Pro-Chancellor is [Richard Eu](/wiki/Richard_Eu). Key academic leaders include President Professor [Tan Tai Yong](/wiki/Tan_Tai_Yong) and Provost Professor Robbie Goh. The university is located at 463 Clementi Road (on the boundary of [Bukit Timah](/wiki/Bukit_Timah) and [Clementi](/wiki/Clementi,_Singapore)). SUSS also uses external premises to conduct lessons. ## History ### SIM University (2005–2017) In 2005, SIM University (UniSIM) was a private university under the [Singapore Institute of Management](/wiki/Singapore_Institute_of_Management) Group (SIM) established by Cham Tao Soon who became the first chancellor and chairman of UniSIM. On 12 October 2016, Acting Minister for Education (Higher Education and Skills) [Ong Ye Kung](/wiki/Ong_Ye_Kung) announced that the government invited UniSIM to become Singapore's sixth autonomous university. Subsequently, on 11 November 2016, the SIM governing council voted in favour to bring the university under the ambit of the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) (MOE). In 2017, UniSIM was restructured into the Singapore University of Social Sciences (SUSS) and ceased to be a member of the SIM Group. SUSS became Singapore's sixth autonomous university under the ambit of MOE. ### Establishment (2017–) From 17 March 2017, SIM University was renamed as Singapore University of Social Sciences (SUSS) and brought under the ambit of the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) (MOE). Ong moved a [bill](/wiki/Bill_(law)) in Parliament to confer SUSS autonomous status. This signalled the government's support for SUSS and was intended to assure the public of SUSS' credibility and standing. It also enabled the government to lead SUSS to meet national education objectives, economic and social development while monitoring its financial performances. SUSS was officially granted autonomous status by the Singapore Government on 11 July 2017. In 2017, SUSS conducted an exercise to issue SUSS certificates to those who was conferred with UniSIM certificates. A statement will indicate that the qualifications had been received under the former's name. In 2017, SUSS marked its inaugural graduation as an autonomous university, with the first batch of SUSS graduates receiving degrees in the name of SUSS. The university restructured to retain a \"limited offering\" in business and engineering programmes while increasing its offerings in social science programmes. All programmes will have curricula considering the social impacts on the community and have to partake a compulsory module in social sciences. In 2019, SUSS enrolled most students in the areas of social sciences and social services. From 1 April 2019, the [Institute for Adult Learning](/wiki/Institute_for_Adult_Learning) (IAL) was restructured into an autonomous institute within SUSS. They will work together in course design, development and teaching adult students. SUSS will have access to IAL's research findings on the learning needs of students, while IAL will be able to research using SUSS's student data and its adult student learning experience to train adult educators. The university will accredit and issue qualifications on tertiary programmes run by IAL. In January 2024, SUSS changed its Chinese name from 新加坡新跃社科大学 to 新加坡社科大学. In 2025, it was announced that SUSS will be relocated to the site of the former Rochor Centre. ## Programmes In 2014, SIM University started its full-time programmes that take on the applied degree pathway with emphasis on practice-oriented teaching. SUSS offers full-time undergraduate programs culminating in a direct honours degree. Programmes offer Professional Major and several Major-Minor combinations. SUSS offers part-time undergraduate programs that lead to either a basic degree or an honours degree. On 24 May 2017, SUSS became the first Singapore university to partner with all five polytechnics to offer the SkillsFuture Work-Study Post-Diploma (WSPostDip) For Poly Graduates programme, an articulation pathway to SUSS Part-time Undergraduate Degree Programmes. This initiative allows polytechnic graduates to enhance their skills through university-level courses, alongside on-the-job training. SUSS offers Bachelor of Laws (LLB) and Juris Doctor (JD) programmes specializing in Criminal Law or Family Law. Both degrees are recognized under the Legal Profession Act, with a minimum cGPA of 3.5 required for eligibility to sit Part B of the Bar Examinations. SUSS offers a range of postgraduate qualifications, including [graduate certificates](/wiki/Graduate_certificate), [graduate diplomas](/wiki/Graduate_diploma), [master's degrees](/wiki/Master%27s_degree), and [doctoral degrees (PhDs)](/wiki/Doctorate). The SUSS SkillsFuture Career Transition Programme is designed to help adults acquire industry-relevant skills, enhance employability, and transition to new sectors or job roles. The Alibaba Cloud-SUSS Entrepreneurship Programme was launched in July 2017 where students either receive a Certificate or Minor in Entrepreneurship. A series of Impact Startup Challenge were also curated where students travel to foreign countries as a three to five days entrepreneurship boot camp. One of the teams, Good for Food was featured by [Channel News Asia](/wiki/Channel_News_Asia) for creating a smart AI dustbin which can help the Food & Beverage sector to track and reduce [food waste](/wiki/Food_waste). ## Campus The campus is on rented premises from SIM located at Clementi Road. SUSS also uses external premises at BCA Academy, [Nanyang Academy of Fine Arts](/wiki/Nanyang_Academy_of_Fine_Arts), Ong Teng Cheong Labour Leadership Institute, NTUC Centre, Physical Education & Sports Teacher Academy, [Republic Polytechnic](/wiki/Republic_Polytechnic), Singapore Centre for Chinese Language, [Singapore Polytechnic](/wiki/Singapore_Polytechnic) and [Singapore Sports Hub](/wiki/Singapore_Sports_Hub) to conduct lessons. A 6-metre tall artwork by sculptor Sun I-Yu named 'Celebrate The Extraordinary' stands on the right side of Richard K.M. Eu Block C. The sculpture was created for the [2015 Southeast Asian Games](/wiki/2015_Southeast_Asian_Games) and donated to SUSS after the event. In 2020, its president Cheong Hee Kiat spoke to the media that SUSS was exploring with the Ministry of Education about a new type of campus that will bring its students and staff under a single roof. It will be located at the site of the former Rochor Centre. ## Admission The minimum education requirement is a GCE 'A' level, or Diplomas from the five local Polytechnic or two local Arts Institutions, or International Baccalaureate (IB) Diploma, or NUS High School Diploma. Applicants with good SAT1 scores may be considered for admission. Certain programmes may require additional admission requirements. The part-time programmes require applicants to acquire two years of full-time work experience, completed full-time National Service for male applicants or be currently employed on a full-time basis and be at minimum 21 years old. In 2018, SUSS received 5,700 applications for 700 full-time places. In 2016, 388 applicants competed for 60 places in the Law Programmes. Applicants into the part-time Accountancy programme will be assessed based on academic merit, relevant work experience and communication skills. ## Academic schools College/Schools**College/school****Founded**[S R Nathan School of Human Development](/wiki/S_R_Nathan_School_of_Human_Development)2018School of Business2018School of Humanities and Behavioural Sciences2018[School of Law](/wiki/SUSS_School_of_Law)2018[School of Science and Technology](/wiki/SUSS_School_of_Science_and_Technology)–School of Social Work and Social Development2025 The university currently offers more than 80-degree programmes through five schools. ### S R Nathan School of Human Development In 2018, School of Human Development and Social Services was renamed the S R Nathan School of Human Development (NSHD) in honour of Singapore's sixth president, [S. R. Nathan](/wiki/S._R._Nathan)'s advocacy of social and community causes when he was the patron of SUSS. The School offers a range of programmes in [Counselling](/wiki/Counselling), [Early Childhood Education](/wiki/Early_Childhood_Education), [Human Resource Management](/wiki/Human_Resource_Management) and Social Work. The [Gerontology](/wiki/Gerontology) programme is offered at the postgraduate level. ### School of Business SUSS School of Business (SBIZ) offers a range of Business and Management programmes. The [Bachelor of Accountancy](/wiki/Bachelor_of_Accountancy) (part-time included) is accredited by the [Accounting and Corporate Regulatory Authority](/wiki/Accounting_and_Corporate_Regulatory_Authority) (ACRA) and [Institute of Singapore Chartered Accountants](/wiki/Institute_of_Singapore_Chartered_Accountants) (ISCA). Similar to accountancy degrees from other Singapore autonomous universities, SUSS Accountancy degrees are eligible for direct entry into the Singapore CA Qualification's professional programme to become a [Chartered Accountant of Singapore](/wiki/Chartered_Accountant_of_Singapore). ### School of Humanities and Behavioural Sciences SUSS School of Humanities and Behavioural Sciences (SHBS) offers translation and interpretation bachelor's degree programmes. The school also provides certification for Professional Interpreters. In 2018, the School of Arts and Social Sciences (SASS) was renamed the School of Humanities and Behavioural Sciences (SHBS). ### School of Law In January 2017, [SUSS School of Law](/wiki/SUSS_School_of_Law) received its first 60 law students under its four-year LLB and JD programmes. Similar to other Singapore autonomous universities, both the LLB and JD programmes are recognised degrees under the Singapore Legal Profession Act and qualified persons with a minimum GPA of 3.5 are eligible to sit for the [Bar Examination](/wiki/Bar_Examination). The school also offers Master of Taxation in collaboration with the Tax Academy of Singapore. ### School of Science and Technology SUSS School of Science and Technology offers programmes in Aerospace Systems, Biomedical Engineering, Built Environment, Electronics Engineering, Military Studies and Technology. The Bachelor of Building and Project Management is accredited by the Singapore Institute of Surveyors and Valuers (SISV) and [Royal Institution of Chartered Surveyors](/wiki/Royal_Institution_of_Chartered_Surveyors) (RICS). The BSc Facilities and Events Management is accredited by the International Facilities Management Association (IFMA) and the RICS. Both the BEng Aerospace Systems and BEng Electronics are accredited by the Engineering Accreditation Board (EAB) of Singapore, Institution of Engineers Singapore (IES). ### School of Social Work and Social Development In the third quarter of 2025, the Singapore University of Social Sciences (SUSS) will launch the School of Social Work & Social Development (SSWSD) to address Singapore's growing need for social service professionals. The school will offer a range of programs, including the Bachelor of Social Work (full-time and part-time), Graduate Diploma in Social Work (part-time), and Master in Social Work (part-time). ## College of Interdisciplinary and Experiential Learning On 8 September 2018, SUSS launched the College of Lifelong and Experiential Learning (CLEL) which adopts a brand of education known as 'lifelong and experiential learning'. The initiative provides for learning before, during and after University education. SUSS LifE also represents SUSS's open and inclusive admissions approach. It was later renamed to College of Interdisciplinary and Experiential Learning with two sub-units: - Core Learning - Experiential Learning ## Institute for Adult Learning In December 2008, the [Institute for Adult Learning](/wiki/Institute_for_Adult_Learning) (IAL) was set up under SkillsFuture Singapore (SSG) to focus on training and developing Continuous Education and Training (CET) adult educators, research in workforce development and lifelong learning; and drive innovations in CET. On 1 April 2019, IAL was restructured as an autonomous institute within the SUSS. ## Centres C-three offers counselling services for SUSS students at no cost. The Centre for Applied Research (CFAR) undertakes, administers and facilitates research and related activities. It also serves as an incubation centre for research programmes and projects. CFAR, being SUSS's knowledge hub, maintains a repository of the knowledge output of all faculty, staff and students. The Centre for Chinese Studies @SUSS (CCS@SUSS), serves as the university's resource centre to monitor trends and developments in the wider Chinese-speaking world. The Teaching and Learning Centre aims to promote teaching excellence for SUSS' faculty. ## Marriage and Baby Bonus scheme In 2018, SUSS rolled out the Marriage and Baby Bonus scheme in support of marriage and parenthood to their part-time adult students. To qualify, they have to be Singaporeans or Singaporean Permanent Residents who has their marriages registered, or child's birth or adoption on or after July 2018. ## Notable alumni - [Kaesang Pangarep](/wiki/Kaesang_Pangarep) – Entrepreneur and the youngest son of [Joko Widodo](/wiki/Joko_Widodo), the 7th [President of Indonesia](/wiki/President_of_Indonesia) - Singapore University of Social Sciences\n",
  "language": "en",
  "processed_at": "2026-01-12T11:58:35.750132",
  "title": "Singapore University of Social Sciences",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_University_of_Social_Sciences"
}