{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:50.068914"
  },
  "content": "This article **does not cite any sources**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Singapore International School of Bangkok\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2021)* *(Learn how and when to remove this message)*School in Bangkok and Chiang Mai, Thailand Established in 2001 as the first Singapore International School in Thailand, the **Singapore International School of Bangkok** (SISB; [Chinese](/wiki/Chinese_language): 泰国新加坡国际学校; [pinyin](/wiki/Pinyin): *Tàiguó Xīnjiāpō Guójì Xuéxiào*, [Thai](/wiki/Thai_language): โรงเรียนนานาชาติสิงคโปร์, [RTGS](/wiki/Royal_Thai_General_System_of_Transcription): **Rong Rian Nana Chat Singkhapo**) launched SISB Ekkamai as its first campus and opened the Pracha Uthit campus in 2012, followed by the Suvarnabhumi campus in 2013 at Bangplee, Samutprakarn, Chiangmai and Thonburi campus in 2017. SISB has five campuses in Thailand, which adopt the Singapore and UK curricula as the foundation for teaching and learning. Currently, SISB is the only International School with 5 Campuses. ## Accreditations In 2016, SISB Pracha Uthit was appointed by the [Singapore Examinations and Assessment Board](/wiki/Singapore_Examinations_and_Assessment_Board) (SEAB) as the official examination centre for the Singapore International Primary School Examination (iPSLE). SISB Pracha Uthit is an approved centre certified by [Cambridge International Examinations](/wiki/Cambridge_International_Examinations)(CIE) to conduct the [IGCSE](/wiki/IGCSE), [AS](/wiki/Advanced_Subsidiary_level) and [A Levels](/wiki/A_Levels) examinations. SISB Pracha Uthit is a certified [Hanban](/wiki/Hanban) (Chinese proficiency) test centre. It is fully accredited by the Council of International Schools (CIS) and the [New England Association of Schools & Colleges](/wiki/New_England_Association_of_Schools_%26_Colleges) (NEASC). SISB was accepted as a member of the Thailand International Schools Activity Conference (TISAC) in June 2017. - Cambridge Checkpoint tests in Primary 6 and Year 9 - Singapore iPSLE in Primary 6 - Cambridge IGCSE in Year 11 - Cambridge AS / A Levels – Year 12 & 13 (Sixth Form) ## Alumni Jennis Oprasert, [BNK48](/wiki/BNK48) Member - Singapore International School of Bangkok (SISB) Portals: - Singapore - Thailand - Schools This Singapore school-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This Thailand school-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:50.068528",
  "title": "Singapore International School of Bangkok",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_International_School_of_Bangkok"
}