{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:53.470326"
  },
  "content": "* *Singapore Council of Women's Organisations Centre**, also known as **96 Waterloo Street**, is a historic bungalow on [Waterloo Street](/wiki/Waterloo_Street) in [downtown Singapore](/wiki/Central_Area,_Singapore). It currently houses the [Singapore Council of Women's Organisations](/wiki/Singapore_Council_of_Women%27s_Organisations). ## History In the 19th century, the building was leased by Salomon & Sons. A Dr. Paul lived in the bungalow in 1885, while a DM Martia lived in the bungalow in 1893. In 1908, it served as the residence of Conrad H. Clarke and his family. It came under the ownership of M. S. Mohamed Kassim Marican, and was among several properties auctioned off following his death in 1927. It was occupied by Mahua Construction Co. from 1945 to 1971, after which it was occupied by EIWA (S) Enterprise and Sey Lian Engineering Works. In July 1994, the [Singapore Council of Women's Organisations](/wiki/Singapore_Council_of_Women%27s_Organisations) announced that it had acquired a 30-year lease of the building from the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority). The council planned to spend $800,000 refurbishing the \"run-down\" building, which was to house around 20 affiliate associations in addition to the council itself. It was to serve as a \"one-stop counselling, resource, training and networking hub for Singapore women.\" Plans were later made by the council to spend $2.8 million to demolish the bungalow and erect a new four-storey building in its place, which was to house an auditorium named after [Nanyang](/wiki/Nanyang_Style) artist [Georgette Chen](/wiki/Georgette_Chen), whose trust fund donated $350,000 to the council, a research library dedicated to Justice Frederick Arthur Chua, a Family Crisis Centre which was to be run by both the council and the Society Against Family Violence, a counselling and mediation centre and eight affiliate associations which did not have their own premises, including the Singapore Association of Women Lawyers, the Singapore Association of Administrative Professionals (then known as the Singapore Association of Personal and Executive Secretaries) and the Home Economics Teachers Association. However, the Urban Redevelopment Authority told the council that it had been granted the lease on the condition that the bungalow be refurbished and not demolished. As the council was not able to demolish the bungalow, it instead chose to erect a four-storey building connected to the bungalow in addition to restoring the bungalow itself. The complex was to house a shelter for women, as well as office space for 40 affiliate organisations, administrative offices a recreational centre, the Georgette Chen hall and the research library, which was named the SAWL-Justice F. A. Chua Library. The groundbreaking ceremony, which was attended by former [President of Singapore](/wiki/President_of_Singapore) [Wee Kim Wee](/wiki/Wee_Kim_Wee) and then-[Minister for Community Development](/wiki/Ministry_of_Community_Development,_Youth_and_Sports) [Abdullah Tarmugi](/wiki/Abdullah_Tarmugi), was held on 18 May 1997. Construction on the complex was to be completed by June 1998. However, by August of that year, even though the renovations had been completed, the council still owed contractors $600,000 for the renovations, which they were unable to raise from donations due to the [1997 Asian financial crisis](/wiki/1997_Asian_financial_crisis). 1°17′58″N 103°51′06″E﻿ / ﻿1.29947°N 103.85176°E﻿ / 1.29947; 103.85176\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:53.469945",
  "title": "Singapore Council of Women's Organisations Centre",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Council_of_Women%27s_Organisations_Centre"
}