{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:37.001851"
  },
  "content": "Gondola link near Sentosa, Singapore The **Singapore Cable Car** is a [gondola lift](/wiki/Gondola_lift) in [Singapore](/wiki/Singapore), providing an aerial link from [Mount Faber](/wiki/Mount_Faber) (Faber Peak Singapore) on [Singapore Island](/wiki/Singapore_Island) to the resort island of [Sentosa](/wiki/Sentosa) across the [Keppel Harbour](/wiki/Keppel_Harbour). Opened on 15 February 1974, it was the second aerial ropeway system in the world to span a [harbour](/wiki/Harbor), after [Port Vell Aerial Tramway](/wiki/Port_Vell_Aerial_Tramway) in Barcelona, which opened already in 1931. However, it is not the first aerial ropeway system to span the sea. For instance, Awashima Kaijō Ropeway in Japan, built in 1964, goes over a short strait to an island. The system was built by the [Doppelmayr Garaventa Group](/wiki/Doppelmayr_Garaventa_Group). The system is a major tourist attraction, as it provides a panoramic view of the central business district. In 2020, a round-trip ticket cost SGD35 for adults and SGD25 for children. ## History The idea for a cable car system in Singapore was mooted in February 1968 as part of developments for [Mount Faber](/wiki/Mount_Faber). Four years later in 1972, construction on the S$5.8 million system commenced, and it was officially opened on 15 February 1974 by then Deputy Prime Minister, Dr. [Goh Keng Swee](/wiki/Goh_Keng_Swee). At opening, the system had 43 cabins which required cabin attendants to manually open and close the doors. The number of cabins was increased to 51 in 1976. An episode of the popular American TV show *[Hawaii Five-O](/wiki/Hawaii_Five-O_(1968_TV_series))* was filmed on the system in the late 1970s, while the world's first mass weddings on the cable cars were conducted in the late 1970s. There was a major breakdown on 27 March 1977, when eyewitnesses heard screams coming from a stranded cable car. In 1988, the system celebrated its 10 millionth rider. It played host to contestants from the [Miss World](/wiki/Miss_World) Pageant when it was held in Singapore in 1989, as well as the sportsmen and officials who were there for the [Southeast Asian Games](/wiki/Southeast_Asian_Games) in 1990. The system's cabins were replaced in 1994 at a cost of over S$11 million. The new cabins now numbered 81, including a VIP cabin and effectively doubled the system's capacity to 1400 passengers per hour in either direction from 700 passengers previously. The upgrade took 25 days to complete, during which time the system suspended operations. A year later in 1995, the system welcomed its 20 millionth rider, and quickly reached its 25 millionth visitor just two years later in 1997. The stations at Mount Faber and Sentosa were also upgraded in the same year, while [Lego](/wiki/Lego) presented to Singapore the world's only life-size cable car cabin made entirely of Lego, based on the Singapore cable car's design. In November 1999, the Singapore cable car system achieved another world's first when it added 6 glass-bottomed cabins at a cost of S$30,000 each. 10 more of these popular cabins were added in December 2000. For a week from 16 March 2004, as part of its 30th anniversary celebrations, the system conducted its 'Surviving the Sky' Challenge in which 34 two-person teams (2 teams withdrew at the last minute) from around Asia attempted to survive the longest in the cable car for 24 hours a day. A S$36 million rebuild of the entire system as a modern monocable detachable gondola started on 14 September 2009, and it re-opened on 21 July 2010. All the cabins were now metallic black cars with chrome trimming (the current design). There are 67 bigger cabins, including World's First 7* VIP Glass-Bottomed Cabin. The two cables were raised by 30 m to facilitate the bigger cabins, to stand 120 m above sea level. Seating capacity was also increased to eight passengers per cabin from six. There are also new [flip-up seats](/wiki/Folding_seat) and a new music system. The Sentosa Line, an intra-island cable car was opened on 14 July 2015 and is 890 metres in length, and the older line is now called the Mount Faber Line. The lines are not physically linked up, so all visitors must walk 3 to 5 minutes from the original Sentosa station to the Imbiah Lookout station. The new line links Siloso Point to the Merlion station, with the Merlion station also providing a link with the Sentosa Express. The Merlion station was renamed to Sensoryscape station after the Merlion was demolished and made way for the new Sensoryscape attraction in its place. The new S$78 million line has 51 eight-seater cabins and is able to move about 2,200 people per hour in one direction. Between 1 May 2023 and 30 September 2023, as part of the lead-up to its 50th anniversary, the system's operators (Mount Faber Leisure Group) collaborated with [The Pokémon Company](/wiki/The_Pok%C3%A9mon_Company) to redecorate the Mount Faber Line cabins with Poké Ball designs; the interiors also featuring Pokémon. On 20 March 2024, 7 new chrome-finished spherical SkyOrb glass-bottomed cabins entered the Mount Faber Line fleet as part of the 50th anniversary celebrations. 13 more of these cabins were added in November 2025. ## Incidents A serious incident occurred on the Singapore Cable Car system at about 6 p.m. on 29 January 1983, when the [derrick](/wiki/Derrick) of the *Eniwetok*, a Panamanian-registered [oil rig](/wiki/Oil_platform), passed under the aerial ropeway and struck the cable that stretched over the waterway between the Jardine Steps Station and the [Sentosa](/wiki/Sentosa) Station. As a result, two cabins plunged 55 metres (180 ft) into the sea, killing seven people. The oil rig was being towed away from [Keppel Wharf](/wiki/Keppel_Harbour) when it became entangled in the cable and caused it to snap. It also left 13 people trapped in four other cabins between [Mount Faber](/wiki/Mount_Faber) and Sentosa. This was the first incident involving death or injury since the [cable car](/wiki/Gondola_lift) system opened in February 1974. This disaster caused the entire system to shut down for almost seven months. In 2010, 20 passengers found themselves trapped in their cabins for 15 minutes after lightning triggered sensors which brought the cable cars to a sudden halt. In 2014, construction was underway on a new intra-island cableway on Sentosa when an empty car became dislodged and crashed. No one was hurt but a member of the staff in another cable car was trapped for several hours. On 27 July 2022, 18 people were left stranded in cable cars between Sentosa and Mount Faber due to system error. ## System The Singapore Cable Car system consists of two independent lines: Mount Faber Line, which provides services between Mount Faber and Sentosa stations across Singapore main island and Sentosa island; and Sentosa Line, which provides services between Siloso Point and Merlion stations on Sentosa Island. The system has a total of six stations; three per line. ## Specifications The monocable detachable-grip [gondola lift](/wiki/Gondola_lift) system has three stations, namely Mount Faber Station at the peak of [Mount Faber](/wiki/Mount_Faber), the HarbourFront Station (former Jardine Steps Station) at [HarbourFront](/wiki/HarbourFront_(Singapore)) and the Sentosa Station at Imbiah, Sentosa. Two supporting towers are located between each pair of stations. This distance between Mount Faber Station and the first tower is about 300 metres (980 ft); from the first tower to the HarbourFront Station is 400 metres (1,300 ft); from the HarbourFront Station to the second tower is 500 metres (1,600 ft), and from the second tower to the Sentosa Station is 450 metres (1,480 ft) long. The height of the track rope is as follows: - Mount Faber Station: 93 m (300 ft) above mean sea level - Tower 1 (Seah Im Road Tower): 80 m (260 ft) above mean sea level - HarbourFront Station (Harbourfront Tower 2): 69 m (225 ft) above mean sea level - Tower 2 (pulau balakang mati island Sentosa tower): 88 m (288 ft) above mean sea level - Sentosa Station: 47 m (154 ft) above mean sea level The Mount Faber system consists of 67 cabins, suspended at least 60 metres (197 ft) above the sea. Each cabin can carry a maximum of 8 adult passengers, while the whole system can support 2000 passengers per hour either way. Travelling at a speed of 5 metres per second (16 ft/s), it takes about 15 minutes for a continuous ride from Mount Faber to Sentosa. In addition, there are 27 red [overhead wire markers](/wiki/Overhead_wire_marker) mounted on a telephone rope just above the cableway to prevent low-flying aircraft from hitting it. - Official website Video - Cable car to Sentosa Video\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:37.001476",
  "title": "Singapore Cable Car",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Cable_Car"
}