{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:24.461813"
  },
  "content": "Singaporean government environmentalism plan The **Singapore Green Plan** (SGP) was created in 1992 to ensure that the economic growth model of [Singapore](/wiki/Singapore) does not compromise the environment. The SGP sets out the strategies, programs and targets for Singapore to maintain a quality living environment while pursuing economic prosperity. The focus areas in the SGP are led by a main coordinating committee and respective action program committees. Since 1992, the SGP has been continuously updated to ensure its relevance, releasing SGP 2012 in 2002 and SGP 2030 in 2021. The [United Nations](/wiki/United_Nations) (UN) [Sustainable Development Goals](/wiki/Sustainable_Development_Goals) (SDG) are correlated or mapped to the SGP. SGP 2012 encompassed six focus areas: Air and Climate Change, Water, Waste Management, Nature, Public Health and International Environmental Relations. SGP 2012 was led by the [Ministry of the Environment and Water Resources](/wiki/Ministry_of_the_Environment_and_Water_Resources) (MEWR). [SGP 2030](/wiki/Singapore_Green_Plan_2030) encompassed five focus areas: Energy Reset (scope includes solar energy, green transport and green buildings), Green Economy (scope includes decarbonisation and adoption of energy efficient technologies), City In Nature, Resilient Future (scope includes coastal and flood defences, food security and urban heat) and Sustainable Living (scope includes zero waste, eco-stewardship and green commute). SGP 2030 is led by five ministries: [Sustainability and the Environment](/wiki/Ministry_of_Sustainability_and_the_Environment) (MSE), [Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) (MIT), [Transport](/wiki/Ministry_of_Transport_(Singapore)) (MOT), [National Development](/wiki/Ministry_of_National_Development_(Singapore)) (MND) and [Education](/wiki/Ministry_of_Education_(Singapore)) (MOE). ## Milestones The major milestones in Singapore's green journey include the following: 1967: Initiated \"Garden City\" to turn Singapore into an urban city with abundant lush greenery and a clean environment. 1992: Initiated the first SGP, a ten-year plan in May 1992. Presented the SGP at the United Nations *Conference on Environment and Development* (a.k.a. *Earth Summit*) in June 1992. 2002: Added environmental targets to the SGP. Released the second SGP (SGD 2012) to chart the course of the next ten years. Presented at the *World Summit on Sustainable Development* in September 2002. 2005: Consulted stakeholders from the general public, civil and private sectors through surveys and a public exhibition. 2006: Revised the second SGP (SGD 2012 2006 edition). 2008: Formed the Inter-Ministerial Committee on Sustainability Development in January 2008. 2009: Mapped out the plans to maintain sustainability and set higher targets until year 2030 in the *Sustainable Singapore Blueprint* in April 2009. 2021: Released the third SGP (SGP 2030) to chart the course of the next ten-years in February 2021. ## Stakeholder Engagement ### 3-P Partnership Cooperation between Singapore's People, [Private](/wiki/List_of_companies_of_Singapore) and Public sectors is essential to forge an environmentally aware and responsible Singapore. ***People sector:*** Efforts by the individual are valuable since they can participate in environmentally friendly acts such as recycling, consuming environmentally friendly products and sorting out recyclables from their own trash. These efforts are strongly supported by non-governmental organisations like the [Nature Society (Singapore)](/wiki/Nature_Society_(Singapore)), Singapore Environment Council and the Waterways Watch Society to encourage [environmental consciousness](/wiki/Environmental_consciousness) in society. ***Private sector:*** Efforts by industries and companies towards establishing environmentally friendly manufacturing processes and materials to reflect their degree of responsibility as corporate residents of Planet Earth. Taking on efficient environmental measures in companies' operations greatly reduces pollution and saves valuable resources. ***Government:*** Represented by [Ministry of the Environment](/wiki/Ministry_of_the_Environment_and_Water_Resources), works towards facilitating and helping passionate groups and organisations find local and overseas partners for collaborations to enhance current and new environmental projects. Non-government and government organisations have held a myriad of programmes, inspiring and pushing to make environmental caring a lifelong interest and commitment. A few examples include: OrganisationProgramNational Environment AgencyClean & Green week[National Parks Board](/wiki/National_Parks_Board)Plant-A-Tree (PAT)Singapore Environmental Council Thumbs Up for Earth\"How Green is Your School?\"Green Volunteers NetworkUbin Day[Nature Society (Singapore)](/wiki/Nature_Society_(Singapore))Seashore Life ProgrammeWaterways Watch SocietyEnvirofestHabitat ForumFocus Discussion Groups[CapitaMall](/wiki/CapitaLand)Asia Green ## Clean air Singapore constantly monitors and review its [air quality standard](/wiki/Pollutant_Standards_Index) by setting new air quality aims and targets. Singapore uses Telemetric Air Quality Monitoring and Management System comprising 17 remote air monitoring stations linked electronically to a Central Control System. Fourteen of the stations monitor ambient air quality while three measure the quality of roadside air. These stations periodically measure the concentrations of main [pollutants](/wiki/Air_Pollution) such as [sulphur dioxide](/wiki/Sulphur_dioxide), [oxides of nitrogen](/wiki/Oxides_of_nitrogen), [carbon monoxide](/wiki/Carbon_monoxide), [ozone](/wiki/Ozone) and [respirable suspended particles](/wiki/Particulates). ### Prevention and monitoring Malaysia referred to the [National Environment Agency](/wiki/National_Environment_Agency) (NEA) for evaluation at the planning stage to ensure that sufficient [pollution control](/wiki/Pollution_control) measures are in place before implementation. Besides monitoring individual polluters, [NEA](/wiki/National_Environment_Agency) also checks the ambient air quality for signs of pollution so actions may be taken to prevent any problem from worsening. Inspections on industrial and trade premises are also conducted on a regular basis to ensure that environmental regulations, such as the Environmental Protection & Management Act (Air Impurities), are complied with. ### Education Greater environmental awareness through education has been strongly championed by Singapore's Ministries, especially Haze Management Measures. A sense of ownership by the public will lead to less pollution and reduce the need for enforcement. *Strategies taken up in ensuring clean air:* - Stringent emission standards for the registration of new vehicles; - Stringent standards on fuel used, such as [diesel](/wiki/Diesel_fuel) with [low sulphur content](/wiki/Low_sulfur_diesel) of 0.005% or less by weight, commonly known as [ultra-low-sulfur diesel](/wiki/Ultra-low-sulfur_diesel) (ULSD); - Requirement for all in-use vehicles to undergo mandatory periodic inspection and pass the smoke emission test; - Enforcement against smoky vehicles on the roads; - Educate vehicle owners on proper vehicle maintenance to prevent smoke emission ## Energy ### Energy efficiency Household appliances are labelled according to their energy efficiency levels, encouraging customers to buy [energy-efficient](/wiki/Efficient_energy_use) appliances and to reduce utility cost. These energy labels are part of the Green Label Scheme. To reduce [fuel consumption](/wiki/Fuel_consumption_in_automobiles), members of the public are encouraged to take Singapore's well-connected [public transport](/wiki/Transport_in_Singapore) instead of private vehicles. [Energy-efficiency](/wiki/Energy_conversion_efficiency) benchmarks and incentives are gradually introduced for offices, hotels, encouraging the private sector to be more energy efficient. ### Pursuing clean energy and reusing energy Singapore set its target to increase import of natural gases from [Malaysia](/wiki/Malaysia) by another 10 million cubic metres per day by 2009, with the target of 60 per cent of [Singapore's electricity](/wiki/Energy_in_Singapore) to be met by natural gas by 2012. Singapore focuses on increasing the percentage of natural gas usage as it is a [cleaner energy source](/wiki/Renewable_Energy), producing up to 65 per cent fewer emissions than coal per kilowatt hour and 25 per cent fewer emissions than oil. The first [compressed natural gas](/wiki/Compressed_natural_gas) (CNG) refuelling station in Singapore opened on 22 April 2002 and by the end of 2002, [SBS Transit](/wiki/SBS_Transit) operates 12 CNG buses serving Jurong East and Jurong Island. Since 1 December 2005, it is compulsory for all diesel-driven vehicle in Singapore to use only [ultra-low-sulfur diesel](/wiki/Ultra-low-sulfur_diesel) (ULSD). The [sulphur](/wiki/Sulphur) content in diesel has been reduced from 0.05 mg/litre to 0.005 mg/litre.[*citation needed*] Singapore also embarked on a project aiming to recover waste heat from the [petrochemical](/wiki/Petrochemical) plants on [Jurong Island](/wiki/Jurong_Island) to power a [centralised cooling system](/wiki/District_cooling) for the [Jurong](/wiki/Jurong) Industrial Estate, in which high-grade heat is used to generate electricity and lower-grade heat is channeled to be used for other process needs. ## Water ### Water supplies Two measures that Singapore Green Plan 2012 focus on are to increase Singapore's [water catchment area](/wiki/List_of_dams_and_reservoirs_in_Singapore) and to diversify Singapore's [source of water supply.](/wiki/Water_supply_and_sanitation_in_Singapore) Singapore plans to increase the land surface for water catchment from half to two-thirds and link up [reservoirs in Singapore](/wiki/List_of_dams_and_reservoirs_in_Singapore) to maximise the yield of the various catchment areas. To ensure sustainability, Singapore is moving increasingly towards [non-conventional sources of water](/wiki/Water_supply_and_sanitation_in_Singapore). These include [desalination](/wiki/Desalination) and [water reclamation](/wiki/Water_reclamation) aimed to meet at least 25 per cent of Singapore's water needs by 2012. The [Public Utilities Board](/wiki/Public_Utilities_Board) planned to secure 136,000 cubic metres of desalinated water per day by the year 2005 to produce [NEWater](/wiki/NEWater). By 2010, the supply of NEWater to the industrial and commercial sectors is expected to exceed 250,000 cubic metres a day, or more than 15 per cent of Singapore's total water need. ### Consumption The 2006 revised Green Plan targets to reduce per capita domestic water consumption to 155 litres/day by 2012 and to work with the 3P sectors to increase awareness of the importance to [conserve](/wiki/Water_conservation), value and enjoy water, developing a sense of shared ownership of the country's water resources. ## Waste management Singapore Green Plan 2012 set a goal of having \"zero landfill\", which aims to [minimise waste generation](/wiki/Waste_Management) and increasing recycling as much as possible. ### Recycling In 2022, the overall recycling rate increased to 57% largely due to the increased amount of construction and demolition waste. The non-domestic recycling rate increased to 72% (from 70% in 2021) while the domestic recycling rate fell to 12% (from 13% in 2021). NEA attributed the low domestic recycling rate (the lowest in more than a decade) to higher shipping costs associated with transporting materials overseas for recycling. Although the recycling blue bins are located within proximity of the HDB blocks, 40% of the collected items cannot be recycled due to contamination. In 2001, Singapore's recycling rates were at about 44% of its total waste. SGP 2012 targets to increase the country's overall recycling to 60% by 2012. To meet this target, the National Recycling Programme was launched in April 2001 to collect [recyclable materials](/wiki/Recyclable_materials) like paper, plastics and cans directly from households every fortnightly. Recycling bins for plastics, glass and cans are also placed at public places. A$20 million Innovation for Sustainability Fund (IES Fund) was set up in 2001 to encourage and fund companies to help grow the recycling industry and develop projects and technologies that help achieve the goal of environment sustainability. ### Incineration and landfill With the increase in recycling, SGP 2012 aims to reduce the need for additional [incineration plants](/wiki/Incineration_plants) from one new plant every 5 to 7 years to one in every 10 to 15 years or longer. Any incinerable waste is sent for incineration to reduce the amount of waste sent to the landfill. Non-incinerable waste, together with [Incineration](/wiki/Incineration) ash, are disposed of at [Semakau Landfill](/wiki/Pulau_Semakau). ***Successes:*** Between 2000 and 2005, Singapore’s overall recycling rate rose from 40% to 49% with [waste disposal](/wiki/Waste_Collection) levels falling from 7600 tons to 7000 tons a day. The projected lifespan for [Semakau Landfill](/wiki/Pulau_Semakau) increased from 25–30 years to 40 years and the need for additional incineration plants is reduced from one every 5 to 7 years to one every 7 to 10 years. ## Public health ### Food hygiene and control *Foodshop Grading System* Every food stall is graded based on criteria like housekeeping, cleanliness, [pest infestation](/wiki/Pest_Control), food hygiene as well as the personal hygiene of the stall handlers. This \"Grading System for Eating Establishments and Food Stalls\" system encourages stall owners to improve their stall hygiene standard to gain higher customer satisfaction. *Environmental Cleanliness* NEA uses [mechanical road and pavement sweeping machines](/wiki/Roadsweeper) to clean the streets and pavements. To educate the public, NEA launched the \"Singapore, Litter Free\" campaign in 2002 to encourage event participants to keep the site litter-free by disposing litter into bins. Large-scale public events with similar litter-free message include the [National Day Parade](/wiki/Singapore_National_Day_Parade), [World of Music and Dance (WOMAD)](/wiki/World_of_Music,_Arts_and_Dance), and Singapore River Regatta. ### Mosquito-borne disease [Dengue fever](/wiki/Dengue_fever) is the main [vector-borne disease](/wiki/Vector_(epidemiology)) that cause significant public health concern in Singapore. [Aedes](/wiki/Aedes) mosquito breeding to residents. In 2004, NEA launched a ‘Mozzie Attack’ programme in April 2004 together with grassroots organisations and [Community Development Councils](/wiki/Community_Development_Council) where volunteers organised exhibitions, door-to-door visits and talks to spread the message of preventing. In 2005, the Government launched ‘Campaign Against Dengue’ to raise awareness and rally people behind the anti-dengue fight. Every household received the ‘10-Minute Mozzie Wipeout’ pamphlet on basic measures to take against [mosquito breeding](/wiki/Mosquito_control). Volunteers were mobilised to search and get rid of Aedes mosquitos breeding ground in over 10,000 [HDB](/wiki/Housing_and_Development_Board) blocks and private estates, more than 1,000 mosquito breeding sites were eradicated and 8,500 potential breeding spots were identified. The number of dengue cases per week fell from a high of 713 in September 2005 to 62 in January 2006. ## Nature conservation Through the use of careful planning in the Concept Plan 2001, Singapore sought to balance the nation's land use needs with environmental preservation to ensure sufficient green spaces for recreation purposes without compromising its [urban development](/wiki/Urban_development). In 2005, [NParks](/wiki/NParks) developed 17.5 hectares of new [parks](/wiki/List_of_parks_in_Singapore) and 7.4 km of [park connectors](/wiki/Park_connector), bringing the total area of parks and park connectors to 1924 hectares and 70 km respectively. ### Nature areas With the promotion of Sungei Buloh Nature Park and Labrador Nature Park to nature reserves in 2001, Singapore then had [four nature reserves](/wiki/Biosphere_reserves_in_Singapore) under the legal protection of the National Parks Act. The other two nature reserves are Chek Jawa and Bukit Timah and Central Catchment Nature Reserves. #### Chek jawa In January 2002, the government announced that [land reclamation](/wiki/Land_reclamation) would not be done on the island and will be deferred as long as the land is not needed for other development purposes. #### Sungei buloh wetland reserve Sungei Buloh Wetland Reserve was announced to be one of the two parks gazetted as nature reserves on 10 November 2001. As of 2006, [reforestation](/wiki/Reforestation) efforts led by NParks starting in 2001 have reforested 71.6 hectares of land in the wetland reserve, Pulau Ubin and the Central Nature reserves. #### Bukit timah and central catchment nature reserve Bukit Timah Nature Reserve and core areas in the Central Catchment Nature Reserve, are protected by strict conservation practices to sustainability and attract biodiversity research. Avenues such as new hiking trails and the HSBC Treetop Walk allows access to the forest canopy which was originally inaccessible by conventional means. #### Labrador nature reserve One of the few rocky shores left on mainland Singapore, the beach at Labrador Nature Reserve has a rich biodiversity of marine flora and fauna amidst the mixture of rocks, mud and patches of coral growth. ### Impact of development Singapore enforces strict[*clarification needed*] Pollution control measures on local companies and factories. They are required to comply with regulations pertaining to [air pollutants](/wiki/Air_pollution), [Effluent](/wiki/Effluent) discharge and [noise pollution](/wiki/Noise_pollution). Quantitative risk assessment studies and extensive[*clarification needed*] plans relating to management and disposal must also be done on hazardous and toxic chemicals. ## International co-operation ### Asean co-operation Singapore played a key role[*citation needed*] during planning and implementation of the Strategic Plan of Action on the Environment or SPAE (1999–2004), strategising common plans and environmental programmes aimed to realise the ASEAN Vision 2020. Over the years, Singapore has been actively supporting the ASEAN Vision 2020, covering concern issues such as [forest fires](/wiki/Southeast_Asian_haze), [transboundary haze](/wiki/Southeast_Asian_haze), coastal environment and biodiversity within the Asia-Pacific region. ### Collaboration with neighbouring countries Singapore initiated many regional environmental programmes, relating to water and waste water engineering, [environmental technology](/wiki/Environmental_technology) and [urban transport planning and design](/wiki/Transportation_planning), [solid waste](/wiki/Waste_management) and [wastewater management](/wiki/Wastewater_treatment), pollution control, coastal and environmental management. A few examples include: 1. The Singapore Technical Assistance Programme for [Sustainable Development](/wiki/Sustainable_Development), launched in 1997 launch. 2. The [Third Country Training Programme](/wiki/Singapore_Cooperation_Programme), signed collaboration with different countries over the years. 3. The [Small Island Developing States](/wiki/Small_Island_Developing_States) [Technical Co-operation Programme](/wiki/Singapore_Cooperation_Programme), launched in 1999. ### Collaboration with inter-governmental organisations *United Nations Environment Programme* Singapore has a long-standing relationship with both the [United Nations Environment Programme](/wiki/United_Nations_Environment_Programme) (UNEP) and the [Economic and Social Commission for Asia and the Pacific](/wiki/United_Nations_Economic_and_Social_Commission_for_Asia_and_the_Pacific) (ESCAP), participating actively in the \"East Asian Seas Regional Programme\" of the 1974 UNEP-initiated Regional Seas Programme. *Global Ministerial Forums* Singapore attends both the UNEP's Global Ministerial Environment Forum, which looks at current global issues like Global Environmental Governance, and ESCAP's Ministerial Conferences on Environment and Development, which give environment ministers in the Asia Pacific region a forum to share their perspectives on regional environmental concerns and priorities. *Multilateral Treaties* Singapore is involved in [multilateral treaties](/wiki/Multilateral_treaty) including the [Montreal Protocol](/wiki/Montreal_Protocol) on Substances that Deplete the Ozone Layer, and the [Basel Convention](/wiki/Basel_Convention) on the Control of Transboundary Movements of Hazardous Wastes. - [Climate change in Singapore](/wiki/Climate_change_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:24.461424",
  "title": "Singapore Green Plan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Green_Plan"
}