{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:27.942500"
  },
  "content": "The **Singapore Biennale** is a large-scale biennial [contemporary art](/wiki/Contemporary_art) exhibition in [Singapore](/wiki/Singapore), serving as the country’s major platform for international dialogue in contemporary art. It seeks to present and reflect the vigour of artistic practices in Singapore and [Southeast Asia](/wiki/Southeast_Asia) within a global context, fostering collaboration and engagement between [artists](/wiki/Artist), arts organisations, and the international arts community. First organised in September 2006 as an anchor cultural event for the [Singapore 2006](/wiki/Singapore_2006) series of events, subsequent Biennales have been held once every two or three years, usually lasting around four months. These events include public engagement and education programmes such as artist and [curator](/wiki/Curator) talks and tours, school visits and workshops, and community days. The 2006 and 2008 editions of the Singapore Biennale were organised by the [National Arts Council, Singapore](/wiki/National_Arts_Council,_Singapore). The Council then commissioned the [Singapore Art Museum](/wiki/Singapore_Art_Museum) to organise the 2011, 2013 and 2016 editions. The Singapore Art Museum currently serves as the Singapore Biennale organiser from the 2019 edition onwards. As of 2019, six editions of the Singapore Biennale have been held, with a seventh slated for October 2022. ## History The beginnings of the Singapore Biennale has been traced to Singapore's Renaissance City Plan (RCP). Announced in [Singapore Parliament](/wiki/Parliament_of_Singapore) in 2000, the plan for the promotion of the country's arts and culture famously sought to position Singapore as a \"global arts city.\" Later in 2002, the Creative Industries Development Strategy report was released to chart the development of the arts and culture, design and media industries in Singapore. One of the report's recommendations included the transformation of the Nokia Singapore Art series into the Singapore Biennale, which would be the major visual arts event in Singapore featuring local and international artists. Based on this report, the 2005 Renaissance City Project 2.0 would involve the organisation of the first Singapore Biennale the next year. ### 2006 The inaugural Singapore Biennale employed the conceptual framework of \"BELIEF\", seeking to examine the relationship between contemporary art and beliefs, commencing on 4 September 2006 and ending 12 November 2006. The event was scattered over 19 sites, with [City Hall](/wiki/City_Hall,_Singapore), Tanglin Camp, and the then-newly refurbished [National Museum of Singapore](/wiki/National_Museum_of_Singapore) as its main three venues. Artworks were also exhibited in seven major religious sites in Singapore, such as the [Kwan Im Thong Hood Cho Temple](/wiki/Kwan_Im_Thong_Hood_Cho_Temple) and the [Sri Krishnan Temple](/wiki/Sri_Krishnan_Temple), chosen to reflect Singapore’s multiracial and multicultural society, as well as the role of architecture in the construction of society's beliefs. Other locations included [Orchard Road](/wiki/Orchard_Road), the [National Library](/wiki/National_Library,_Singapore), [Tanjong Pagar Railway Station](/wiki/Tanjong_Pagar_Railway_Station), and [Singapore Management University](/wiki/Singapore_Management_University). Prime Minister Lee Hsien Loong opened the biennale on 1 September 2006 with a free public party held at the Padang in front of the City Hall Building. SB 2006 chose the artworks by [Jenny Holzer](/wiki/Jenny_Holzer) and [Usman Haque](/wiki/Usman_Haque) as the main works for the opening because of their work's scale and sense of wonder. Holzer presented *For Singapore*, a projection on City Hall. The 2006 Biennale featured 195 artworks from 95 [artists](/wiki/Artist) and collectives from 38 different countries. Some artists included [Ilya and Emilia Kabakov](/wiki/Ilya_Kabakov), [Fujiko Nakaya](/wiki/Fujiko_Nakaya), [Ho Tzu Nyen](/wiki/Ho_Tzu_Nyen), [Mariko Mori](/wiki/Mariko_Mori), [Shigeru Ban](/wiki/Shigeru_Ban), [Yayoi Kusama](/wiki/Yayoi_Kusama), and Takashi Kuribayashi. The Curatorial Team for the Singapore Biennale was headed by renowned curator [Fumio Nanjo](/wiki/Fumio_Nanjo). The other curators involved were Roger McDonald (Japan), Sharmini Pereira (Sri Lanka/United Kingdom) and Eugene Tan (Singapore). The biennale was part of the [Singapore 2006](/wiki/Singapore_2006) series of events which included the 2006 Annual Meetings of the [International Monetary Fund](/wiki/International_Monetary_Fund) and the [World Bank Group](/wiki/World_Bank_Group) held at the [Suntec Singapore International Convention and Exhibition Centre](/wiki/Suntec_Singapore_International_Convention_and_Exhibition_Centre). The first Singapore Biennale was organised by the [National Arts Council](/wiki/National_Arts_Council_Singapore) (which also organised the annual [Singapore Arts Festival](/wiki/Singapore_Arts_Festival)) in conjunction with the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)). The result of 18 months’ planning, the Biennale had a budget of nearly S$8 million and was attended by about 883,000 people. ### 2008 The second edition of the Singapore Biennale, themed \"Wonder\", was held from 11 September to 16 November 2008, with artistic director Fumio Nanjo reprising his role. Nanjo saw the theme as a challenge towards a world that neither questioned nor allowed things and events to awe individuals, with contemporary art a means of allowing ourselves to be \"surprised, awed, tantalized, challenged.\" The 2008 edition was an event concurrent with the Singapore Grand Prix Season, a series of events organised in relation to the 2008 [Formula One](/wiki/Formula_One) race in Singapore. A total of 137 artworks by 66 artists from 36 countries were exhibited during the Biennale, featuring names such as [Apichatpong Weerasethakul](/wiki/Apichatpong_Weerasethakul), Cheo Chai-Hiang, [Dinh Q. Lê](/wiki/Dinh_Q._L%C3%AA), [E Chen](/wiki/E_Chen), [Fujiko Nakaya](/wiki/Fujiko_Nakaya), [Shigeru Ban](/wiki/Shigeru_Ban), [Shubigi Rao](/wiki/Shubigi_Rao), and [Tromarama](/wiki/Tromarama). The 2008 edition had a budget of S$6 million, attracting a total of 505,200 visitors, with three exhibition venues: City Hall, [Marina Bay](/wiki/Marina_Bay,_Singapore), and South Beach Development. Compared with the 19 venues used in the previous edition, the 2008 Biennale was scaled down to allow greater ease of visiting and experiencing all the artworks, according to chairman of the 2008 Biennale, Lee Suan Hiang. The programme featured education and outreach activities, such as the dialogue session Encounters, an educational arts programme for children aged 7 to 12 named the Kids Biennale, and educational resources for [secondary school](/wiki/Secondary_school) and [junior college](/wiki/Junior_college_(Singapore)) students. Parallel programmes such as the Showcase Singapore art fair, were also held. ### 2011 The third Singapore Biennale, themed \"Open House\", was held from 12 March to 15 May 2011 and led by Singaporean artistic director Matthew Ngui and curators Russell Storer and Trevor Smith. The 2011 Biennale featured 60 artists from 30 countries, seeking to examine multiple perspectives and myriad creative approaches to questions of how we move across borders, see other points of view, and form connections with others. A key feature of the 2011 Biennale was the *Merlion Hotel*, a temporary hotel built around the iconic Merlion statue by Japanese artist [Tatzu Nishi](/wiki/Tatzu_Nishi). Other names featured included Arin Rungjang, [Ceal Floyer](/wiki/Ceal_Floyer), [Charles Lim](/wiki/Charles_Lim), [Genevieve Chua](/wiki/Genevieve_Chua), [Ming Wong](/wiki/Ming_Wong), [Tan Pin Pin](/wiki/Tan_Pin_Pin), [ruangrupa](/wiki/Ruangrupa), [Sheela Gowda](/wiki/Sheela_Gowda), [Simon Fujiwara](/wiki/Simon_Fujiwara), Song-Ming Ang, [Sopheap Pich](/wiki/Sopheap_Pich), [The Propeller Group](/wiki/The_Propeller_Group), [Tiffany Chung](/wiki/Tiffany_Chung), [Danh Vō](/wiki/Danh_V%C5%8D). The artworks were mainly exhibited at the Singapore Art Museum, National Museum of Singapore and the former [Kallang Airport](/wiki/Kallang_Airport) building. Costing S$6 million to organise, the 2011 Biennale was attended by 912,897 people. ### 2013 The fourth Singapore Biennale, titled *If the World Changed*, ran from 26 October 2013 to 16 February 2014, overseen by a programme advisory committee and project director, Tan Boon Hui. Featuring works by 82 artists and artist collectives from 13 countries, the fourth Biennale sought to harness the energy of the Southeast Asian region, bringing to the fore unique practices, concerns, and the myriad perspectives of artists from the region. Drawing on the combined expertise of its team of 27 curators from Southeast Asia, a significant 93% of works are by artists or collectives from the region, resulting in the greatest amount of representation from Asia in comparison to earlier editions of the Singapore Biennale. Some artists featured included [Jeon Joonho](/wiki/Jeon_Joonho), [Boo Junfeng](/wiki/Boo_Junfeng), [Kiri Dalena](/wiki/Kiri_Dalena), [Lee Wen](/wiki/Lee_Wen), [Marisa Darasavath](/wiki/Marisa_Darasavath), [Moon Kyungwon](/wiki/Moon_Kyungwon), [Nguyen Huy An](/wiki/Nguyen_Huy_An), [Nguyen Trinh Thi](/wiki/Nguyen_Trinh_Thi), [Po Po](/wiki/Po_Po), Raqs Media Collective, [Royston Tan](/wiki/Royston_Tan), [Suzann Victor](/wiki/Suzann_Victor), [TeamLab](/wiki/TeamLab_(art_collective)), and [Robert Zhao Renhui](/wiki/Robert_Zhao_Renhui). ### 2016 The fifth edition of the Singapore Biennale, titled *An Atlas of Mirrors*, took place from 27 October 2016 to 26 February 2017. [Susie Lingham](/wiki/Susie_Lingham) served as creative director, shaping and facilitating curatorial discussions and overseeing the biennale's creative content. Exploring shared histories and current realities within and beyond the region, Singapore Biennale 2016 strove to present a constellation of artistic perspectives that provided unexpected ways of seeing the world and ourselves. The international contemporary art exhibition featured artworks by more than 60 artists across Southeast Asia, East Asia, and South Asia. Featured were artists such as Ade Darmawan, [Do Ho Suh](/wiki/Do_Ho_Suh), [Nguyen Phuong Linh](/wiki/Nguyen_Phuong_Linh), [Nilima Sheikh](/wiki/Nilima_Sheikh), [S. Chandrasekaran](/wiki/S._Chandrasekaran) and [Qiu Zhijie](/wiki/Qiu_Zhijie). The Biennale sought to cultivate deeper public engagement with contemporary visual arts through its accompanying public engagement and education programmes. Retaining a collaborative curatorial framework, the biennale was led by a curatorial team of Singapore Art Museum Curators: Joyce Toh, Tan Siuli, Louis Ho, Andrea Fam and John Tung, as well as four Associate Curators who are invited by the museum: Suman Gopinath (Bangalore, India); Nur Hanim Khairuddin (Ipoh, Malaysia), Michael Lee (Singapore), and Xiang Liping (Shanghai, China). Venues included Singapore Art Museum and [SAM at 8Q](/wiki/SAM_at_8Q), [Asian Civilisations Museum](/wiki/Asian_Civilisations_Museum), National Museum of Singapore, the [Peranakan Museum](/wiki/Peranakan_Museum), and the [Singapore Management University](/wiki/Singapore_Management_University). ### 2019 The sixth Singapore Biennale, titled *Every Step in the Right Direction*, was held from 22 November 2019 to 22 March 2020, led by Philippines-based curator Patrick Flores as artistic director. This edition of the biennale considered the steps required to \"consider current conditions and the human endeavour for change,\" while considering how the \"spectacularity of Singapore as a Potemkin metropolis in Southeast Asia inflects the intuition of biennial spectacle.\" The biennale took place at [National Gallery Singapore](/wiki/National_Gallery_Singapore), [Gillman Barracks](/wiki/Gillman_Barracks), and other cultural venues in Singapore. Some participating artists included Arnont Nongyao (Thailand), [Alfonso A. Ossorio](/wiki/Alfonso_A._Ossorio) (USA), [Amanda Heng](/wiki/Amanda_Heng) (Singapore), Boedi Widjaja (Indonesia/Singapore), Busui Ajaw (Thailand), Gary-Ross Pastrana (Philippines), Hu Yun (China / Serbia), Kray Chen (Singapore), Marie Voignier (France), Min Thein Sung (Myanmar), Okui Lala (Malaysia), Post-Museum (Singapore), [Ray Albano](/wiki/Ray_Albano) (Philippines), Soyung Lee (South Korea), Vandy Rattana (Cambodia), [Wu Tsang](/wiki/Wu_Tsang) (USA) and Zai Tang (Singapore/UK); as well as the artist collective Phare, The Cambodian Circus (Cambodia), and the collaboration between Zakkubalan (USA), and [Ryuichi Sakamoto](/wiki/Ryuichi_Sakamoto) (Japan). The curatorial team, led by Flores, consisted of a combination of Singapore-based and international curators, including Singapore Art Museum assistant curators Andrea Fam and John Tung, [National Gallery Singapore](/wiki/National_Gallery_Singapore) assistant curator Goh Sze Ying, Manila-based independent researcher and curator Renan Laru-an, art historian and Seoul-based independent curator Anca Verona Mihulet, and Bangkok-based independent curator Vipash Purichanont. ### 2022 The seventh Singapore Biennale took place from 16 October 2022 to 19 March 2023, led by co-Artistic Directors [Binna Choi](/wiki/Binna_Choi), Nida Ghouse, [June Yap](/wiki/June_Yap), and [Ala Younis](/wiki/Ala_Younis). Instead of a theme, this edition of the Biennale was given the name *Natasha*, that in naming the event, \"a world comes into being\" and \"forges relations with what is around.\" This edition of the biennale was described by art critic Adeline Chia as pursuing the \"question of non-human and possibly inaccessible subjectivities.\" Chia describes the biennale as \"capturing the post-pandemic mood, [...] the tender, humbled, exhausted-yet-hopeful feelings of a convalescent humankind recognising its frailty and the interconnectedness of all existence,\" with works examining nonhuman perspectives such as from animals, plants, water, spirits, and AI. The biennale was held across several floors of the Tanjong Pagar Distripark, where the Singapore Art Museum is now based. It was further held at sites beyond traditional gallery spaces to encourage audiences to wander, imagine, rest, and participate, such as in public libraries, Yan Kit Playfield, [International Plaza](/wiki/International_Plaza_(Singapore)), the [Singapore Flyer](/wiki/Singapore_Flyer), and beyond Singapore's coastline at the [Southern Islands](/wiki/Southern_Islands). The artist list included names such as Aarti Sunder, Ali Yass, [Araya Rasdjarmrearnsook](/wiki/Araya_Rasdjarmrearnsook), Donghwan Kam, [Erika Tan](/wiki/Erika_Tan) and curator Adele Tan, [Haegue Yang](/wiki/Haegue_Yang), Natasha Tontey, No Ghost Just a Shell (featuring works by [Angela Bulloch](/wiki/Angela_Bulloch) & Imke Wagener, Lili Fleury, [Liam Gillick](/wiki/Liam_Gillick), [M/M Paris](/wiki/M/M_Paris), [Pierre Huyghe](/wiki/Pierre_Huyghe), [Philippe Parreno](/wiki/Philippe_Parreno), [Richard Phillips](/wiki/Richard_Phillips_(American_painter)), and [Rirkrit Tiravanija](/wiki/Rirkrit_Tiravanija)), Pratchaya Phinthong, [Ranu Mukherjee](/wiki/Ranu_Mukherjee), Shin Beomsun, Sawangwongse Yawnghwe, Shooshie Sulaiman, Trevor Yeung, [Walid Raad](/wiki/Walid_Raad), Wu Mali, and Zarina Muhammad. ### 2025 The eighth Singapore Biennale is anchored by the concept of *pure intention*, exploring Singapore’s ever-changing urban landscape within broader global artistic narratives around development, historical contradictions, and speculative realities. Taking place 31 October 2025 to 29 March 2026, it is curated by Duncan Bass, Hsu Fang-Tze, Ong Puay Khim and Selene Yap. Invited contributors span independent organisations and curatorial collectives, such as Hyphen— (Indonesia), [Asian Film Archive](/wiki/Asian_Film_Archive) (Singapore), Hothouse (Singapore) and The Packet (Sri Lanka). ## Awards Since 2016, the Benesse Prize has been presented as the official award of the Singapore Biennale, in collaboration with Singapore Art Museum. Previously awarded ten times from 1995 to 2013 to artists participating at the [Venice Biennale](/wiki/Venice_Biennale), such as [Cai Guo-Qiang](/wiki/Cai_Guo-Qiang), [Olafur Eliasson](/wiki/Olafur_Eliasson), and [Rirkrit Tiravanija](/wiki/Rirkrit_Tiravanija), the prize was created to recognise outstanding artists, supporting artistic practices embodying the corporate philosophy of the Benesse Group, which is 'well-being'. The award involves both a cash prize of JPY 3 million and an artwork commission to be exhibited at the Benesse Art Site Naoshima, [Japan](/wiki/Japan), or the opportunity to have their works collected by them. ### 2016 At the Asian debut of the prize for the 2016 Singapore Biennale, the 11th edition of the Benesse Prize was awarded to Pannaphan Yodmanee (Thailand), with Zulkifle Mahmod (Singapore) also honoured as the recipient of the Soichiro Fukutake Prize—a special award presented on the occasion of the inaugural Asian edition of the Benesse Prize. ### 2019 For the 2019 Singapore Biennale, [Amanda Heng](/wiki/Amanda_Heng) (Singapore) was awarded the 12th Benesse Prize, the first Singaporean to win. ### 2022 South Korean artist [Haegue Yang](/wiki/Haegue_Yang) was awarded the 13th Benesse Prize for the 2022 Singapore Biennale. ## Controversy At the 3rd Singapore Biennale in 2011, Japanese-British artist [Simon Fujiwara](/wiki/Simon_Fujiwara)’s work, *Welcome to the Hotel Munber* (2010), was censored by the [Singapore Art Museum](/wiki/Singapore_Art_Museum) despite appropriate advisory notices put up by the museum itself as the organiser of the Biennale. The homoerotic content of the work was considered to contravene the law on pornography by the museum, and contextually relevant gay pornographic magazines were removed from the installation without prior consultation with either the artist, biennale director Matthew Ngui or curators Russell Storer and Trevor Smith. While the curatorial team and artist were informed a little later, extended discussions and negotiations took so long that the temporary closure of the work, called for by the artist, became permanent as the Biennale came to an end. - [Culture of Singapore](/wiki/Culture_of_Singapore) - [Singapore International Festival of Arts](/wiki/Singapore_International_Festival_of_Arts) - [Singapore Art Museum](/wiki/Singapore_Art_Museum) - [Singapore Art Show](/wiki/Singapore_Art_Show) - Singapore Biennale Official Website - National Arts Council Website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:27.942235",
  "title": "Singapore Biennale",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Biennale"
}