{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:55:20.596743"
  },
  "content": "The **Singapore Art Show** was a biennial festival for [visual art in Singapore](/wiki/Visual_art_of_Singapore), first organised by the [National Arts Council](/wiki/National_Arts_Council_(Singapore)) in 2005 as a platform for Singaporeans to engage with local artists. The Singapore Art Show was planned to be held on alternating years with the [Singapore Biennale](/wiki/Singapore_Biennale). The Art Show had a national focus on Singaporean and Singapore-based artists, while the [Singapore Biennale](/wiki/Singapore_Biennale), launched in 2006, has a broader scope of [Southeast Asian](/wiki/Southeast_Asia) [contemporary art](/wiki/Contemporary_art) in the international sphere. Instead of having a single theme like the Biennale, the Art Show had sought to feature a large number of exhibitions by local artists without an overarching curatorial theme. The inaugural Singapore Art Show was launched on 23 September 2005, which included exhibitions, public art projects, and the television premiere of a commissioned work, *4x4—Episodes of Singapore Art* by [Ho Tzu Nyen](/wiki/Ho_Tzu_Nyen). A main platform of the Art Show was the Singapore Art Exhibition, which was held at the [Singapore Art Museum](/wiki/Singapore_Art_Museum). ## History The Singapore Art Show was organised as a platform for [Singaporean](/wiki/Singapore) artists to showcase their artworks and to foster public appreciation of the visual arts practices found locally. While the Singapore Art Show was organised with a national focus on Singaporean and Singapore-based artists, the [Singapore Biennale](/wiki/Singapore_Biennale), launched in 2006, focusses on Southeast Asian contemporary art in the international sphere. The Singapore Art Show was intended to take place every two years, held on alternating years with the [Singapore Biennale](/wiki/Singapore_Biennale). Instead of having a single theme like the Biennale, the Art Show sought to feature a large number of exhibitions by local artists without an overarching curatorial theme. ### 2005 The inaugural month-long Singapore Art Show was launched on 23 September 2005, including exhibitions, public art projects, and the television premiere of a commissioned work by [Ho Tzu Nyen](/wiki/Ho_Tzu_Nyen), *4x4—Episodes of Singapore Art,* on the [Mediacorp](/wiki/Mediacorp) [TV12 Arts Central](/wiki/Central_(TV_channel)) channel. Over 400 artworks by 200 artists were exhibited across 11 venues. News coverage of the event sees the Singapore Art Show in relation to the slew of large-scale art events being held in Singapore in the lead-up to the [Singapore Biennale](/wiki/Singapore_Biennale), such as Seni Singapore in 2004 and the Singapore Art series, seeing the Art Show as a positive step. ### 2007 The second Singapore Art Show was held from 2 August to 8 October 2007. Taking place over 2 months across 47 different venues, it featured a main platform, the Singapore Art Exhibition 2007, as well as 31 partner programmes and 5 satellite events. The Singapore Art Exhibition 2007 at the [Singapore Art Museum](/wiki/Singapore_Art_Museum) featured an invited section titled *Imagining the City*, with works from artists such as [Chua Ek Kay](/wiki/Chua_Ek_Kay), [Goh Beng Kwan](/wiki/Goh_Beng_Kwan), [Lim Tze Peng](/wiki/Lim_Tze_Peng) and Francis Ng, while the open section exhibited works from emerging artists selected through an open call. ### 2009 The third Singapore Art Show was held 21 August to 4 October 2009, featuring 6000 works with 600 artists across 60 venues. Its main platform, the Singapore Art Exhibition 2009, was held at the Singapore Art Museum with the theme of *Art Buffet*, featuring 30 works from artists such as [Chng Seok Tin](/wiki/Chng_Seok_Tin), [Dawn Ng](/wiki/Dawn_Ng), and Wang Ruobing. The works were selected by an open call and categorised through a \"spread\" of four themes: ‘humour’, ‘order’, ‘time’, and ‘space’. Participating artist Chun Kaifeng's work was selected as the winning submission of the Singapore Art Exhibition and he was awarded the Singapore Art Exhibition Prize, a $50,000 grant. In a 1 September 2009 article titled \"Gorging on art\" from Singapore newspaper [Today](/wiki/Today_(Singapore_newspaper)), the Singapore Art Show is criticised for its lack of focus and daunting number of exhibitions, or coming across as merely \"filling in the gap\" in the intervening years between Biennales. The article suggests simply incorporating the Art Show within the Singapore Biennale. ## Discontinuation No further editions of the Singapore Art Show were organised by the [National Arts Council](/wiki/National_Arts_Council,_Singapore) after 2009. The Singapore Biennale continued to be held, with its third edition taking place in 2011. In 2013, the annual Singapore Art Week was launched by the National Arts Council to create hype around the art fair, [Art Stage Singapore](/wiki/Art_Stage_Singapore), functioning as a similar platform for a loose collection of art events in Singapore. - [Singapore Biennale](/wiki/Singapore_Biennale) - [Singapore International Festival of Arts](/wiki/Singapore_International_Festival_of_Arts) - [Visual art of Singapore](/wiki/Visual_art_of_Singapore) - [Culture of Singapore](/wiki/Culture_of_Singapore) - National Arts Council Website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:55:20.596396",
  "title": "Singapore Art Show",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Art_Show"
}