{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:58:37.893960"
  },
  "content": "Public university in Tampines, SingaporeThis article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(February 2016)* *(Learn how and when to remove this message)*‹ The template *Infobox university* is being considered for merging. › The **Singapore University of Technology and Design** (**SUTD**) is a [public](/wiki/Public_university) [autonomous university](/wiki/Autonomous_university) in [Singapore](/wiki/Singapore). ## History The founding president is [Thomas L. Magnanti](/wiki/Thomas_L._Magnanti), who is a professor associated with the [Massachusetts Institute of Technology](/wiki/Massachusetts_Institute_of_Technology) (MIT). SUTD's founding provost, Professor Chong Tow Chong, took over as the university's second president in 2018. The university's current president [Phoon Kok Kwang](/wiki/Phoon_Kok_Kwang) took over from 1 August 2024. ## Campuses SUTD's interim campus was at the former [ITE College Dover](/wiki/ITE_College_West) campus in [Dover](/wiki/Dover,_Singapore) from its founding in April 2012 until December 2014. Its permanent campus, which opened in January 2015, is located near the [Changi Business Park](/wiki/Changi_Business_Park), and is served by [Upper Changi Station](/wiki/Upper_Changi_MRT_station) on the [Downtown MRT line](/wiki/Downtown_Line). As of 2018, it is the only university to be located in the eastern part of Singapore. Through an open selection process, SUTD appointed [DP Architects Pte. Ltd.](/wiki/DP_Architects), in collaboration with [UNStudio](/wiki/UNStudio) from Amsterdam, to design the academic cluster of its permanent campus in Upper Changi. ## Academics ### Undergraduate programmes A four-year full-time undergraduate programme is offered at SUTD. Students have the option to choose between five available degree programmes: Computer Science and Design (CSD), Engineering Product Development (EPD), Engineering Systems and Design (ESD), Architecture and Sustainable Design (ASD), and Design and Artificial Intelligence (DAI). ### Graduate programmes A two-year full-time MIT–SUTD Dual master's degree programme was offered in collaboration with MIT to talented graduates with a keen interest in research in one of the following areas: Civil and Environmental Engineering, Supply Chain Management, or Engineering in Manufacturing. Graduate opportunities also include the SUTD PhD Programme. Candidates will spend up to one year in the United States and the other year in Singapore, receiving master's degrees from both MIT and SUTD. With MIT, SUTD has launched joint postgraduate programmes to jump-start research at the university. The PhD programme has a strong emphasis on interdisciplinary and collaborative research and is enhanced by opportunities for industry internships, overseas research attachments, and teaching experience. The initial intake in 2012 included ten post-doctoral researchers. Post-doctorate fellows spend one year at MIT and then another year at SUTD where they conduct research and teach. As of 2025, there are no active formal collaborations between SUTD and MIT. ### Academic pillars ### Research initiatives #### Design Innovation Singapore In 2015, as part of the IDC, the Design Innovation @ Singapore (DI) platform was formed to organise and drive Design- and Technology-centred Innovation programs and initiatives for Singapore and beyond. In 2021, the DI team was integrated with the SUTD Academy to enhance offerings as a provider of Continuing Education and Training (CET). #### SUTD–MIT International Design Centre The International Design Centre (IDC) is based both in Singapore at SUTD, and in Cambridge, Massachusetts, at MIT, with academic and industrial partners from around the world. The IDC has more than a hundred projects that involve approximately 270 faculty, researchers and students. IDC was part of a collaboration agreement between SUTD and MIT. #### Lee Kuan Yew Centre for Innovative Cities The Lee Kuan Yew Centre for Innovative Cities (LKY CIC) is one of the research centers in SUTD. #### iTrust Research Centre iTrust is a multidisciplinary research center which was established collaboratively by SUTD and the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)). The focus of iTrust is on cybersecurity. Systems of interest include large infrastructure of national importance (such as power grids, water treatment plants and oil refineries) as well as cyber-devices used in healthcare, including pacemakers, defibrillators, insulin pumps and [vagus nerve stimulation](/wiki/Vagus_nerve_stimulation) implants. #### O-Lab O-Lab comprises academics and practitioners interested in understanding and enhancing design practices. #### Temasek Labs at SUTD Temasek Labs at SUTD (TL@SUTD) undertakes research and development. The current focus is on areas of defense system design and development, such as unmanned systems, information systems, soldier systems, and engineering systems. TL@SUTD complements the work that is currently undertaken at the [DSO National Laboratories](/wiki/DSO_National_Laboratories), NUS, NTU, and other research establishments. #### City Form Lab The City Form Lab (CFL) is an urban design research group led by a group of architects, city planners, spatial analysts, programmers, sociologists, and artists. It was founded by Andres Sevtsuk at MIT in 2010 as the City Form Research Group, and moved to SUTD in fall 2011. The lab develops software tools for researching urban form and land use patterns. CFL's recent projects include the open-source Urban Network Analysis Toolbox for [ArcGIS](/wiki/ArcGIS), the SUTD Gridshell Pavilion, samples of urban fabric in [Bugis](/wiki/Bugis_Street) and [Punggol](/wiki/Punggol) in Singapore, and the exhibit at the 2013 Tallinn Architecture Biennale. - Official website of the Singapore University of Technology and Design\n",
  "language": "en",
  "processed_at": "2026-01-12T11:58:37.893639",
  "title": "Singapore University of Technology and Design",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_University_of_Technology_and_Design"
}