{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:59:48.111265"
  },
  "content": "This article needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(December 2025)*Failed 2001 Jemaah Islamiyah terror plotPart of a series on the[History of Singapore](/wiki/History_of_Singapore)[Early history](/wiki/Early_history_of_Singapore) (pre-1819)[Srivijaya](/wiki/Srivijaya)650–1377[Temasek](/wiki/Temasek), [Long Ya Men](/wiki/Long_Ya_Men), [Ban Zu](/wiki/Ban_Zu)c.14th century[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)1299–1398[Majapahit](/wiki/Majapahit)1398–1400[Malacca Sultanate](/wiki/Malacca_Sultanate)1400–1528[Johor Sultanate](/wiki/Johor_Sultanate)1528–1819British colonial era (1819–1942)[Founding](/wiki/Founding_years_of_modern_Singapore)1819–1826[Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements)1826–1867[Crown colony](/wiki/Singapore_in_the_Straits_Settlements#Crown_colony_(1867–1942))1867–1942[Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) (1942–1945)[Fall of Singapore](/wiki/Fall_of_Singapore)1942[Sook Ching](/wiki/Sook_Ching)1942[Double Tenth incident](/wiki/Double_Tenth_incident)1943[Post-war period](/wiki/Colony_of_Singapore) (1945–1962)[First Legislative Council](/wiki/History_of_Singapore#First_Legislative_Council_(1948–1951))1948–1951[Maria Hertogh riots](/wiki/Maria_Hertogh_riots)1950[Second Legislative Council](/wiki/History_of_Singapore#Second_Legislative_Council_(1951–1955))1951–1955[Anti-National Service Riots](/wiki/1954_National_Service_riots)1954[Internal self-government](/wiki/Self-governance_of_Singapore) (1955–1963)[Hock Lee bus riots](/wiki/Hock_Lee_bus_riots)1955[Singapore Glass Factory strikes](/wiki/Singapore_Glass_Factory_strikes)1960[Pulau Senang prison riots](/wiki/Pulau_Senang_prison_riots)1963[Merger with Malaysia](/wiki/History_of_the_State_of_Singapore_(Malaysia)) (1963–1965)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)1962[Operation Coldstore](/wiki/Operation_Coldstore)1963[Race riots in Singapore](/wiki/1964_race_riots_in_Singapore)1964[MacDonald House bombing](/wiki/MacDonald_House_bombing)1965[Republic of Singapore](/wiki/History_of_the_Republic_of_Singapore) (1965–present)[ASEAN Declaration](/wiki/ASEAN_Declaration) ([ASEAN](/wiki/Association_of_Southeast_Asian_Nations))1967[1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore)1969[Laju incident](/wiki/Laju_incident)1974[Operation Spectrum](/wiki/Operation_Spectrum)1987[Asian financial crisis](/wiki/1997_Asian_financial_crisis#Singapore)1997Embassies attack plot2001[H1N1 pandemic](/wiki/2009_swine_flu_pandemic_in_Asia#Singapore)2009–2010[Bus drivers' strike](/wiki/2012_Singapore_bus_drivers%27_strike)2012[Little India riot](/wiki/2013_Little_India_riot)2013[2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit)2018[COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore)2020–2022By topic - [Timeline](/wiki/Timeline_of_Singaporean_history) - [Riots](/wiki/List_of_riots_in_Singapore) - [Military](/wiki/Military_history_of_Singapore) Singapore portal - v - t - e The **Singapore embassies attack plot** was a plan in 2001 by [Jemaah Islamiyah](/wiki/Jemaah_Islamiyah) (JI) to [bomb](/wiki/Bomb) the [diplomatic missions](/wiki/Diplomatic_missions) and attack [personnel](/wiki/Personnel) of the [United States](/wiki/United_States), [Australia](/wiki/Australia), the [United Kingdom](/wiki/United_Kingdom), and [Israel](/wiki/Israel) based in [Singapore](/wiki/Singapore). There were also several other targets. The plot was uncovered in December 2001 and as many as 15 people were arrested in Singapore within a month. Further investigation and intelligence prompted the detention of another 26 persons from 2002 to 2005. As of 2006, 37 of them were still being detained without trial, under the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)). Four had been released on restriction orders. ## JI branch in Singapore The Singapore JI branch was started as early as 1993, when Ibrahim Maidin underwent military training in Afghanistan and was subsequently appointed leader of JI in Singapore. By conducting religious classes, Maidin began recruiting other members into the JI organisation. At least eight of the sleeper cell members had received training in Afghanistan. [Riduan Isamuddin](/wiki/Riduan_Isamuddin), the leader of JI who is better known as Hambali, had arranged their travels to Pakistan, using false documents and cover stories that they were accepted by a religious school for religious studies. They stayed in an [al-Qaeda safe house](/wiki/Al-Qaeda_safe_house) in Pakistan before travelling to Afghanistan, where they received training in the use of [AK-47s](/wiki/AK-47), [mortars](/wiki/Mortar_(weapon)), and military tactics. Several members also attended a training camp in southern Philippines, known as Camp Hudaybiyya, set up by [Moro Islamic Liberation Front](/wiki/Moro_Islamic_Liberation_Front) (MILF) and run by Indonesian JI members. The Singapore branch of JI was organised into at least three groups. The first cell, which was called \"*Fiah Ayub*\" (first cell) and the second cell was called \"*Fiah Musa*\". The Singapore branch was headed by Ibrahim Maidin and Faiz bin Abi Bakar Bafana was the second in command. The Singapore branch was under the command of a Malaysia-based leadership structure called a regional *shura* (consultative council), within the larger network of JI organisation in Southeast Asia. Members of the cell did not attend local mosque or made little contact with other mainstream [Islamic](/wiki/Islam) organisations in the country. The group operated in tight secrecy and were using code words in their communication. ## Surveillance activities According to investigations, the cell had conducted survey for other targets as early as 1997, when the cell was planning to target [Yishun MRT station](/wiki/Yishun_MRT_station), where American troops and their families used to take shuttle rides to the US Navy site at [Sembawang](/wiki/Singapore_Naval_Base#American_presence) for recreation activities at a sports complex coincidentally known as the \"Terror Club\", named after the Royal Navy shore accommodation establishment [HMS *Terror*](/wiki/List_of_ships_named_HMS_Terror). In 1999, a member of the Singapore cell, Khalim Jaffar travelled to Afghanistan and presented the plan to Al Qaeda's leaders. [Mohammed Atef](/wiki/Mohammed_Atef), a close aide of [Osama bin Laden](/wiki/Osama_bin_Laden), gave JI the go-ahead for the attack. In April 2001, a member of the cell, who was working at [ST Aerospace](/wiki/ST_Aerospace), took photographs of American military aircraft and personnel at [Paya Lebar Airbase](/wiki/Paya_Lebar_Airbase), and distributed them to other cell members. The cell had also surveyed other potential targets including water pipelines at the [Johor-Singapore Causeway](/wiki/Johor-Singapore_Causeway), [Singapore Changi Airport](/wiki/Singapore_Changi_Airport), the Singapore Air Traffic Control Center at Biggin Hill Road, Sembawang Wharves and the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) at [Bukit Gombak](/wiki/Bukit_Gombak). ## Embassies attack plot In early October 2001, [Fathur Rahman al-Ghozi](/wiki/Fathur_Rahman_al-Ghozi), also known as Mike, and [Mohammed Jabarah](/wiki/Mohammed_Jabarah), also known as Sammy, flew to Singapore and directed the sleeper cell to conduct \"final reconnaissance\" and video recordings of potential targets. The two operatives gave instructions to the cell to prepare for attacks in Singapore. Among the targets were U.S. and Israeli Embassies, British and Australian High Commissions, the Singapore American School, and commercial buildings housing US firms. They planned to launch the attacks in December 2001/January 2002 or April/May 2002. Philippine authorities said that al-Ghozi, a bombmaker, had three Philippine passports and an Indonesian passport. Investigators later revealed al-Ghozi's ties with [Abu Bakar Bashir](/wiki/Abu_Bakar_Bashir), the alleged spiritual head of [Jemaah Islamiyah](/wiki/Jemaah_Islamiyah). al-Ghozi had studied in Bashir's religious school in Indonesia for six years. The other man, Sammy, was later identified as Mohd Mansour Jabarah, a Canadian national of Arab descent, who was in US custody (as of 2003) and sentenced to life in prison in 2008. The cell members then set off to procure 17 tons of explosives, especially that of precursor [ammonium nitrate](/wiki/Ammonium_nitrate), along with trucks and [chemicals](/wiki/Chemical). JI has close ties with Kumpulan Militan Malaysia (KMM), a militant group in Malaysia. [Yazid Sufaat](/wiki/Yazid_Sufaat), a KMM member, had purchased 4 tons of ammonium nitrate which were already made available to the Singapore cell for the bombings. In an interview on PBS, [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) pointed out that each bomb would be twice the size of the [one detonated](/wiki/Oklahoma_City_bombing) by [Timothy McVeigh](/wiki/Timothy_McVeigh) at the [Alfred P. Murrah building](/wiki/Alfred_P._Murrah_Federal_Building) in [Oklahoma City](/wiki/Oklahoma_City). ## Failure of plot After the [11 September 2001 attacks](/wiki/11_September_2001_attacks), an informant told the [Internal Security Department](/wiki/Internal_Security_Department_(Singapore)) about Muhammad Aslam Yar Ali Khan, who is a Singaporean citizen of Pakistani descent and had made claims of having ties with Al-Qaeda. Khan was placed under surveillance, but he abruptly left Singapore for Pakistan on 4 October. He was later captured by [United Islamic Front for the Salvation of Afghanistan](/wiki/United_Islamic_Front_for_the_Salvation_of_Afghanistan) officials. His interrogation led investigators to the Singaporean cell. Singapore authorities conducted the first raid on 8 December 2001, arresting six people. A total of 15 people were arrested within a month. During the raids, the police seized documents of the attack plots and bomb making information, as well as photographs and surveillance video of the intended targets including the embassies. Fake passports and forged immigration documents were also found. Soon after, a JI-made surveillance video was recovered among the rubble of a house that was bombed by US coalition forces in [Kabul](/wiki/Kabul), Afghanistan. It was the home of [Mohammed Atef](/wiki/Mohammed_Atef), a close aide of [Osama bin Laden](/wiki/Osama_bin_Laden). The video showed a narrator in Singapore, Hashim bin Abas, describing how bombs could be hidden to attack United States interests. Besides the [embassies](/wiki/Embassies), the plotters were also planning to target [United States Air Force](/wiki/United_States_Air_Force) [warplanes](/wiki/Warplane) that were stationed at [Paya Lebar Air Force Base](/wiki/Paya_Lebar_Airbase), as well as several United States companies and businesses. There were also plans to attack U.S. Navy [warships](/wiki/Warship) along Singapore's coastlines, similar to the [USS Cole bombing](/wiki/USS_Cole_bombing) in Yemen in October 2000. The JI group were also plotting to attack [United States Navy](/wiki/United_States_Navy) personnel and their families who often traveled between the [Yishun MRT station](/wiki/Yishun_MRT_station) and [Sembawang](/wiki/Sembawang) [Wharf](/wiki/Wharf) via shuttle buses. The video also detailed how bombs could be planted in the [sewers](/wiki/Sanitary_sewer) and drains near the Yishun MRT Station in order to cause massive casualties when targeting United States personnel. The video also showed a man describing how explosives could be strapped on bicycles and be transported without raising suspicion. Investigators in Singapore had found similar tapes at the residence of Mohamed Khalim bin Jaffar, one of arrested JI members. The Singapore government presented these material as evidence of a direct link between the JI group and Al-Qaeda. On 15 January 2002, [Fathur Rahman al-Ghozi](/wiki/Fathur_Rahman_al-Ghozi) was arrested by authorities in the Philippines. He gave police information that led to a cache of rifles, explosive and bomb-making material in Southern Philippines. These were believed to be part of the embassies attack plot. In August 2002, ISD conducted another major security operation and arrested 18 persons, most of them were members of JI, while two were members of the [Moro Islamic Liberation Front](/wiki/Moro_Islamic_Liberation_Front) (MILF), a militant separatist group in the Philippines. ## Aftermath ### Heightened security Following the arrests, the U.S., British, and Australian embassies in Singapore were placed on heightened alert. Members of the elite [Gurkha Contingent](/wiki/Gurkha_Contingent) of the [Singapore Police Force](/wiki/Singapore_Police_Force) were posted at the embassies to enhance their security. ## Timeline Timeline of plot, arrests and related incidents. - 1993 – Sleeper cell began to form in Singapore. - 1997 – Cell conducted surveillance at Yishun MRT station - April 2001 – Cell conducted surveillance at [Paya Lebar Airbase](/wiki/Paya_Lebar_Airbase). - 11 September 2001 – [Coordinated series of terrorist attacks in the United States](/wiki/September_11th_attacks) by [Al-Qaeda](/wiki/Al-Qaeda). - September 2001 – An informant told [Internal Security Department](/wiki/Internal_Security_Department_(Singapore)) of Muhammad Aslam Yar Ali Khan's ties with Al-Qaeda. Ali Khan was placed under surveillance. - 4 October 2001 – Muhammad Aslam Yar Ali Khan left for Pakistan, he was soon captured by [Northern Alliance](/wiki/Afghan_Northern_Alliance). - 7 October 2001 – [U.S. invaded Afghanistan](/wiki/War_in_Afghanistan_(2001%E2%80%93present)). - 7 October 2001 – [Fathur Rahman al-Ghozi](/wiki/Fathur_Rahman_al-Ghozi) and Sammy arrived in Singapore to direct sleeper cell. - 8 December 2001 – ISD conducts its first raid, arresting 6 people. A total of 15 people would be arrested in December 2001. - January 2002 – 2 people were released on Restriction Order - 15 January 2002 – Al-Ghozi was arrested in the Philippines, a large cache of explosives was uncovered - August 2002 – ISD arrested another 21 people - September 2002 – 3 people were released on Restriction Order - 12 October 2002 – [Bali bombing](/wiki/2002_Bali_bombing) by Jemaah Islamiyah. ## In literature A book *Bullets and Train* is about an Al-Qaeda terrorist plot in Singapore which discusses the videos, making them a part of the central plot.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:59:48.110995",
  "title": "Singapore embassies attack plot",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_embassies_attack_plot"
}