{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:54:34.152845"
  },
  "content": "Singaporean version of the A-level exams The **Singapore-Cambridge General Certificate of Education Advanced Level** (or **Singapore-Cambridge GCE A-Level**) is a [GCE Advanced Level](/wiki/GCE_Advanced_Level) examination held annually in [Singapore](/wiki/Singapore) and is jointly conducted by the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) (MOE), [Singapore Examinations and Assessment Board](/wiki/Singapore_Examinations_and_Assessment_Board) (SEAB) and the [University of Cambridge Local Examinations Syndicate](/wiki/UCLES) (UCLES). The examination is taken by school students upon the completion of their pre-university education at [junior colleges](/wiki/Junior_college_(Singapore)) (JC)s and [centralised institutes](/wiki/Centralised_institutes_(Singapore)), and is also open to private candidates. The Singapore-Cambridge GCE A-Level examination has been de-linked from the British [A-Level](/wiki/GCE_Advanced_Level) examinations since 2002, when the MOE took over the management of its national examination, owing to differences between the education systems of the two countries. The Singapore-Cambridge GCE A-Level is recognised internationally by universities as a university entrance examination. The standards and grading for the subjects are determined by SEAB and MOE in consultation with [Cambridge International Examinations](/wiki/Cambridge_Assessment_International_Education), a subsidiary of UCLES. Localised subjects, including Mother Tongue subjects such as Chinese, Malay and Tamil are marked locally. ## Curriculum In 2006, the Singapore's A-Level curriculum was revised and enhanced to better suit Singapore's education requirement. It replaced the earlier system of ‘AO’, ‘A’ and ‘S’ papers modelled after the United Kingdom education system. It is designed to emphasise multi-disciplinary learning, breadth of learning as well as flexibility, and it aims to prepare students well for the approaches being taken in university education, and for the demands of an innovation-driven world of the 21st century. The Singapore's A-Level differ in exam structure and subject content from GCE A-Level in other countries such as the United Kingdom. Under the new curriculum, candidates select subjects from three levels of study, namely Higher-1 (H1), Higher-2 (H2) and Higher-3 (H3). Subjects at H1 level constitutes one academic unit, subjects at H2 level constitutes two academic units, and H3, if taken, is not counted as an additional unit as it is an in depth extension of H2. Subjects are divided into knowledge skills and content-based subjects. Knowledge skills subjects include General Paper, Knowledge and Inquiry and Project Work; content-based subjects are divided into languages, humanities and the arts, and mathematics and sciences. These changes took effect beginning with the batch taking the A Levels in 2007. ### General Paper and Knowledge & Inquiry General Paper (or GP) at H1 level or Knowledge & Inquiry (or KI) at H2 level are academic subjects offered at the Singapore-Cambridge GCE Advanced Level examination in the Singapore education system. All pre-university students in Singapore undertaking the Singapore-Cambridge GCE Advanced Level examination are required to offer either of the subjects. General Paper aims to develop in students the ability to think critically, to construct cogent arguments and to communicate their ideas using clear, accurate and effective language. In addition, General Paper encourages students to explore a range of key issues of global and local significance and provides students with a good foundation to thrive in a fast-changing world. In early 2023, it was announced by the MOE that GP will be compulsory for all JC and MI (Millennia Institute) students, starting with the 2024 intake. KI will still be offered, but not as a substitute of GP. For the 2022 A-level exams, around 100 students took KI instead of GP. ### Subject combination Subjects at H1 level constitutes one academic unit, subjects at H2 level constitutes two academic units, while subjects taken at H3 level are not counted as additional unit because they are deemed as extension and in-depth study of H2. Students are invariably required to sit for either H1 General Paper or H2 Knowledge and Inquiry, and may opt to elect any combination and number of H1 and H2 subjects, up to a maximum of twelve academic units (AUs). A maximum of two H3 subjects can be applied. Subject examination of the H3 level subjects were previously offered as [\"Special papers\"](/wiki/Scholarship_level) (or \"S-Papers\") under the Cambridge GCE Advanced Level before 2006. Under the Ministry of Education's regulations, students sitting for the A-Level in a junior college are required to take at least one subject that is from a contrasting discipline. They are also required to fulfil additional academic requirements of Singapore's education system, such as having to take Project Work and a Mother Tongue Language. ## Grading system H1 and H2 subjects are graded alphabetically in the following manner. GradeRemarkAAbove Singapore-Cambridge GCE Advanced Level pass BCDESBelow Singapore-Cambridge GCE Advanced Level pass Ungraded Notes: - Candidates who pass at least one subject at H1 or H2 level will receive a Singapore-Cambridge General Certificate of Education (Advanced Level). - Grade 'S' denotes a sub-pass. - Grades 'S' and 'Ungraded' indicate that the candidate has failed to obtain a pass in the particular subject. These two grades do not appear on the certificate but will be shown on the result slip. - Subject(s) taken by the candidate under special arrangements will be annotated in the certificate. - H3 subjects are graded as either **Distinction, Merit, Pass or Ungraded**. ### University Admission Score (UAS) University Admission Score (UAS) is used by the [universities in Singapore](/wiki/List_of_universities_in_Singapore) to grant admission. To calculate the UAS, students first need to convert their A-level grades to rank points accordingly, and the UAS is the sum of all rank points. The maximum UAS currently is 90 points. However, it will be decreased to 70 points from 2025 onwards, after which the \"Project Work\" (PW) and the fourth content-based subject (H1 or H2) will no longer be counted in the UAS calculations. A-level grade to Rank Points A-level GradeH1 SubjectH2 SubjectA1020B8.7517.5C7.515D6.2512.5E510S2.55U00 ## Candidate Performance In 2010, the number of school candidates who sat for the examination was 14,280, out of which 90.8% of them scored at least three Higher 2 (H2) passes, with a pass in General Paper (GP) or Knowledge and Inquiry (KI). In 2023, this number was 93.9%, the highest since the curriculum was revised in 2006. In 2021, this number was 93.5% despite the COVID-19 pandemic disruptions. In 2018, this number was 93.3%, then reportedly the best performance since curriculum was revised in 2006. - [Education in Singapore](/wiki/Education_in_Singapore) - [General Certificate of Education](/wiki/General_Certificate_of_Education) - [GCE Advanced Level](/wiki/GCE_Advanced_Level) - [Singapore-Cambridge GCE Ordinary Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) - [Singapore-Cambridge GCE Normal Level](/wiki/Singapore-Cambridge_GCE_Normal_Level) - [Junior college (Singapore)](/wiki/Junior_college_(Singapore)) - [Millennia Institute](/wiki/Millennia_Institute) - [Centralised institutes (Singapore)](/wiki/Centralised_institutes_(Singapore)) - Singapore-Cambridge GCE A-Level on the SEAB website - Press release: Results of the 2010 Singapore-Cambridge GCE Advanced Level\n",
  "language": "en",
  "processed_at": "2026-01-12T11:54:34.152536",
  "title": "Singapore-Cambridge GCE Advanced Level",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore-Cambridge_GCE_Advanced_Level"
}