{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:02.406019"
  },
  "content": "Vocabulary of colloquial English in Singapore [Singlish](/wiki/Singlish) is the English-based [creole](/wiki/Creole_language) or [patois](/wiki/Patois) spoken colloquially in [Singapore](/wiki/Singapore). English is one of Singapore's official languages, along with Malay (which is also the National Language), Mandarin, and Tamil. Although English is the [lexifier language](/wiki/Lexifier), Singlish has its unique [slang](/wiki/Slang) and [syntax](/wiki/Syntax), which are more pronounced in informal speech. It is usually a mixture of English, Hokkien, Cantonese, Malay, and Tamil, and sometimes other Chinese languages like Teochew, Hainanese, Hakka, Hockchew, and Mandarin. For example, *pek chek* means to be annoyed or frustrated, and originates from [Singaporean Hokkien](/wiki/Singaporean_Hokkien) 迫促 ([POJ](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): pek-chhek). It is used in casual contexts between Singaporeans, but is avoided in formal events when certain Singlish phrases may be considered unedifying. [Singapore English](/wiki/Singapore_English) can be broken into two subcategories: Standard Singapore English (SSE) and Colloquial Singapore English (CSE) or Singlish as many locals call it. The relationship between SSE and Singlish is viewed as a [diglossia](/wiki/Diglossia), in which SSE is restricted to be used in [situations of formality](/wiki/Formality_scale) where Singlish/CSE is used in most other circumstances. Some of the most popular Singlish terms have been added to the Oxford English Dictionary (OED) since 2000, including *wah*, *sabo*, *lepak*, *shiok* and *[hawker centre](/wiki/Hawker_centre)*. On 11 February 2015, *kiasu* was chosen as OED's Word of the Day. ## Word origins Singlish vocabulary formally takes after [British English](/wiki/British_English) (in terms of spelling and abbreviations), although naming conventions are in a mix of [American](/wiki/American_English) and British ones (with American ones on the rise). For instance, local media have \"sports pages\" (*sport* in British English) and \"[soccer](/wiki/Soccer) coverage\" (soccer—originally slang for *as**soc**iation football*—while used in Britain, is more usually called just *football*). Singlish also uses many words borrowed from [Hokkien](/wiki/Min_Nan), the non-Mandarin Chinese language native to more than 75%[*citation needed*] of the [Chinese in Singapore](/wiki/Chinese_Singaporeans), and from [Malay](/wiki/Malay_language). In many cases, English words take on the meaning of their Chinese counterparts, resulting in a shift in meaning. Vocabulary is also taken from Indian words such as *dai* meaning 'hey', *goondu* meaning 'fat', etc. This is most obvious in such cases as *borrow*/*lend*, which are functionally equivalent in Singlish and mapped to the same Chinese word, 借 (Hokkien *chioh*, Cantonese *ze3*, Mandarin *jiè*), which can mean to lend or to borrow. For example: \"Oi, can I borrow your calculator?\" / \"Hey, can you lend me your calculator?\" ## Singlish dictionaries and word lists There have been several efforts to compile lexicons of Singlish, some for scholarly purposes, but most for entertainment. Two early humorous works were [Sylvia Toh Paik Choo](/wiki/Sylvia_Toh_Paik_Choo)'s *Eh, Goondu!* (1982) and *Lagi Goondu!* (1986). In 1997 the second edition of the *Times-Chambers Essential English Dictionary* was published. To date, this is the only formally-published English dictionary also containing a substantial number of Singaporean English terms. Such entries and sub-entries are arranged alphabetically amongst the standard English entries. A list of common words borrowed from local languages such as Hokkien and Malay appears in an appendix. It appears that no subsequent editions have been published. 2002 saw the publication of the *Coxford Singlish Dictionary*, a light-hearted lexicon which was developed from material posted on the website Talkingcock.com. In 2004, the website *A Dictionary of Singlish and Singapore English*, was launched to document the actual usage of Singlish and Singapore English in published material, in the way that the [Oxford English Dictionary](/wiki/Oxford_English_Dictionary) does for standard English. Compiled by Jack Lee, an amateur [lexicographer](/wiki/Lexicographer), the *Dictionary* was one of the first dictionaries to deal exclusively with Singlish and Singapore English in a professional or academic voice. In 2024, a much more modern and updated web project was launched by Daniel Goh, another amateur lexicographer. Known as the *Chimbridge Dictionary of Singlish and Singapore English*, it is (among other features) also the first to contain fully-researched etymologies of all its terms. While it is also written in a professional and academic style, the dictionary documents usage in not just published material, but also casual contexts such as online forums. It is, to date, the most complete and comprehensive dictionary of Singlish terms ever compiled, with up to several thousands more entries than its predecessors. The [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) and tourism-related businesses have also produced short lists of commonly used Singlish terms, ostensibly to allow foreigners visiting Singapore to comprehend the local language better. Such lists have been printed in brochures or booklets, and also published on websites. The lack of an officially printed version of a Singlish dictionary is due to the fact that the Singapore government frowns upon the use of Singlish, their official stance being that the speaking of Singlish will make Singaporeans difficult to understand when communicating with foreigners who are not familiar with Singlish. Thus, the government has made an effort to quash the use of Singlish and to promote the use of standard English through the [Speak Good English Movement](/wiki/Speak_Good_English_Movement) over the past few years. Though failing to discourage the use of Singlish, it has resulted in Singlish having a bad reputation in recent years, further stalling efforts to document actual Singlish usage. Letters contributed to the forum of *[The Straits Times](/wiki/The_Straits_Times)*, the main local newspaper, by readers have called for Singlish to be kept alive in Singapore. Community efforts to do so include the aptly named \"Speak Good Singlish Movement\". The idea of promoting Singlish was raised as part of a larger debate on creating a uniquely Singaporean identity. However, the government has yet to officially change its stand regarding Singlish. A list of Singlish terms and expressions widely used in Singapore is set out below. It is not exhaustive nor fully accurate, and is meant to provide some representative examples of Singlish usage in Singapore. The origins of the Singlish terms are indicated where possible, and literal translations are provided where necessary. More comprehensive and accurate information may be found in the various dictionaries and compilations previously mentioned above. ## Phonological sounds used in Singlish Below are the phonological sounds used from the [International Phonetic Alphabet](/wiki/International_Phonetic_Alphabet) used in Singlish. Consonants used in Singlish vocabulary BilabialLabio-dentalDentalAlveolarPost-alveolarPalatalVelarGlottalNasalmnŋPlosivep bt dk gFricativef vθ ðs zʃ ʒhApproximantɹLaterallwVowels used in Singlish vocabulary FrontCentralBackCloseiuClose-mideəoOpen-midɛəɔOpena ## List of Singlish words ### 0–9 - ***4D*** – Local 4 digit lottery game run by [Singapore Pools](/wiki/Singapore_Pools). - ***5Cs*** – Refers to the [5 Cs of Singapore](/wiki/5_Cs_of_Singapore) (cash, car, credit card, condominium, country club membership). Commonly associated with [materialistic](/wiki/Economic_materialism) success in modern Singapore. - ***11B*** – Official [Singapore Army](/wiki/Singapore_Army) vernacular meaning '11 basic information'. Refers to the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) identity card held by servicemen during their National Service. ### A - **abit** – (From English) A little bit. Usually used sarcastically. As in \"*You abit fast ah*\" when the person in question is deemed to be slow ([sarcasm](/wiki/Sarcasm)). - **abuden** – (From English and Hokkien 'Ar bo, then?') Obviously; what else could it have been? Equivalent to \"duh\". - **ACBC** – (From English and Hokkien) Acronym for \"act cute, *buay* cute.\" Refers to a person who is behaving in an exaggeratedly cutesy manner, but instead comes across as annoying. (*buay* – see entry below – is a negative prefix, conveying 'not' or 'un-'.). - **act blur** – (From English) To feign ignorance. - **act cute** – (From English) A phrase which describes behaving in a cutesy manner. Can be used as both a verb and an adjective. See also *ACBC* above. - **action** – (From English) Refers to a person who is perceived as arrogant or haughty. - **agak agak / agak-agak** – (From Malay) An estimate. Not to be mistaken as \"agar-agar\" which means jelly/jello. - **agak-ration** – (From Malay and English) An estimate or estimation. Also pronounced as \"agar-ration\". - **[Ah Beng](/wiki/Ah_Beng)** – (From Hokkien 阿明 *a-bêng*) A hillbilly, or someone with poor dress sense. Also used to refer to a gangster. Originates from the common Chinese male name 'Ah Beng'. - **Ah Seng** – (From Hokkien 阿成 *a-sêng*) Ah Beng's sidekick. Also used to refer to a gangster. Originates from the common Chinese male name 'Ah Seng'. - **ah** – (From Chinese 啊) 1. Exclamation. E.g. \"Heng ah!\" (How lucky!) 2. (... ah?) An alternative spelling of \"ar\". Used at the end of a sentence to express doubt. - **ah gua / ah kwa / ah qua** – (From Hokkien 阿倌 *a kuann*) A transvestite, often assumed to be a Thai transsexual. Used to refer to men who appear to be effeminate. - **[Ah Lian](/wiki/Ah_Lian)** – (From Hokkien 阿蓮/阿莲 *a-lián*) A hillbilly, someone with little dress sense; female form of *Ah Beng*. Also used to refer to a gangster. The expressions came about because Ah Lian is a common Chinese female name. - **Ah Huay** – (From Hokkien 阿花/阿花 *a-hoe*) Ah Lian's sidekick; female form of *Ah Seng*. Also used to refer to a gangster. The expressions came about because Ah Huay is a common Chinese female name. - **Ah Long** – 1. (From Cantonese 阿窿 *aa3 lung1*, which is a shortened form of 大耳窿 *daai3 ji5 lung1*) Slang term for a [loan shark](/wiki/Loan_shark). 2. Sometimes used to mistranslate [Lee Hsien Loong](/wiki/Lee_Hsien_Loong). - **ah neh** – (From Hokkien/Tamil. [Tamil](/wiki/Tamil_language): அண்ணன் /aṇṇaṉ/) means older brother; a shortened version of a racial slur (see below). - **ah pu neh neh** – (From Hokkien) A racial slur for Indians. - **ah tiong** – (From Hokkien 阿中 *a-tiong*) Sometimes used simply as *Tiong*. A derogatory term for Chinese nationals. - **ai see** – (From Hokkien/Teochew 愛死/爱死 *ài-sí*, Mandarin equivalent: 要死) Used to describe someone on thin ice. - **ai see buay see** – (From Hokkien 愛死袂死/爱死袂死 *ài-sí buē-sí*, Mandarin equivalent: 要死不死) Used to describe someone on thin ice. - **aiseh** - An exclamation made in awe of something. E.g. \"Aiseh, he driving a Ferrari sia.\" - **ai swee mai m'niah** – (From Hokkien, lit. 'love beauty until death') Used on a person who is so vain their life or wellbeing is compromised - **ai sui** – (From Hokkien, 愛媠/爱媠 'love beauty') Refers to a person who is beauty conscious. (Usually used of women.). - **ai tzai** / **ai zai** – (From Hokkien 愛在/爱在 *ài tsāi*, lit. 'must be firm, calm and solid') Used in a reassuring manner to calm people down. - **Aiya(h) / Aiyo(h)** – (From Chinese 哎呀 *Āiya* / 哎唷 *Āiyo* or Tamil ஐயோ *Aiyō*) \"Oh no!\" \"Oh dear!\" Also used in 'Aiyo(h), so embarrassing!', a [catchphrase](/wiki/Catchphrase) popularized by Aunty Lucy, a role [Mediacorp](/wiki/Mediacorp) artiste [Dennis Chew](/wiki/Dennis_Chew) portrayed in *[Paris and Milan](/wiki/Paris_and_Milan).* - **Aiyoyo / Ai-yoh-yoh** – (From Tamil ஐயையோ) Extreme version of *Aiyo(h)*, popularized by the role played by [Chen Liping](/wiki/Chen_Liping) in the [SBC](/wiki/Mediacorp) drama series *[Good Morning, Sir!](/wiki/Good_Morning,_Sir!)* - **akan datang** – (From Malay) Means 'coming soon', as seen in movie trailers. Used to reassure an impatient person. - **alamak** – (From Malay) Phonetically close to the Chinese term \"Oh, my mother!\" It expresses shock or surprise, and also dismay. Popularized by the catchphrase [Henry Thia](/wiki/Henry_Thia)'s court clerk character used in the popular TV variety show Comedy Nite. - **alibaba** – Means 'missing' or 'stolen', a reference to the book *[Ali Baba and the Forty Thieves](/wiki/Ali_Baba_and_the_Forty_Thieves)*, in which Ali Baba, a woodcutter, discovers a group of thieves with a secret stash of riches that can only be accessed by saying [a magic word](/wiki/Open_sesame) to open a secret door. - **amacam** – (From Malay) A contraction of the Malay word 'Apa macam', which is used as a greeting, similar to \"What's up?\" - **[ang mo(h)](/wiki/Ang_mo)** – (From Hokkien 紅毛/红毛 *âng-moo*, lit. 'red hair') A term for people of European descent. Based on the perceived hirsutism of Europeans with red or blonde-colored bodily hair. The term is neutral, but some may perceive it as mildly derogatory. - **ang mo(h) pai** – (From Hokkien 紅毛派/红毛派, lit. 'Red Hair Faction') A term used among Chinese Singaporeans to insult those who speak good English but whose Chinese language skills are lacking, or whose mannerisms are perceived as too Western. The term suggests they are more \"Red Hair\"/Westernised than Chinese. - **ang pau / ang pow** – (From Hokkien/Teochew 紅包/红包. Pronounced *hóng bāo* in Mandarin) [Red packet](/wiki/Red_packet) with money to be given on [Chinese New Year](/wiki/Chinese_New_Year) or during some occasion like wedding, birthday party and so on as a wish to the receiver. Also hong bao. - **an zhua?** – (From Hokkien 按怎 *án-chuáⁿ*) Hokkien equivalent of \"What's up?\" - **ar** – 1. (From Cantonese 啊) (... ar?) Used at the end of a sentence where opinions and affirmations are being sought. 2. (From Hokkien) Used as either a noun or a verb to denote a very cozy, non-sexual relationship with someone that might result in special considerations or leeway not available to anyone else without such a relationship. As in \"I ar with the boss because I'm his golf buddy so I can occasionally come to work later without getting into trouble with him.\" Or \"You got ar with him or not?\" to inquire as to the status of the relationship between two people. Similar to the American slang expression \"having juice with someone.\" - **ar bo** – (From Hokkien/Teochew 阿無/阿无 *á-bô*) Means \"What else?\" or \"How else?\" Usually used as an answer to a question with an obvious answer. - **atas** – (From Malay, lit. 'above') 1. Used to describe a snobbish and arrogant person. 2. Used to describe a \"high class\", well-to-do or sophisticated person. - **ayam** – (From Malay, lit. 'chicken') Used to describe someone who is easily intimidated. - **ay / aye / ayy** – (From American slang) To express a bit of ‘yeah’ feeling. ### B - **balik kampong / balek kampung** – (From Malay) Pack up one's things and go home. The term also refers to returning to one's hometown. - **[bakkwa](/wiki/Bakkwa) / bak kwa** – (From Hokkien 肉乾/肉干 *bah-koaⁿ*; *ròugān* in Mandarin) *[Rougan](/wiki/Rougan)* or *roupu* (肉脯), a [Chinese](/wiki/Chinese_cuisine) salty-sweet [dried meat](/wiki/Dried_meat) product similar to [jerky](/wiki/Jerky). - **bao toh** – (From Hokkien 包刀, lit. 'wrapped knife') The act of backstabbing someone, usually in an office or political context. - **barang barang** – (From Malay) Personal belongings. - **basket** - Replacement for the word \"Bastard\". Used to appear being less vulgar. - **berak** – (From Malay) To defecate. See pang sai. - **belanja** – (From Malay) To treat or pay for someone. - **bird bird** - Penis. See kuku jiao / kuku bird. - **bo cheng sa -** shirtless / half-naked - **blur** - Someone who is forgetful, clumsy, or oblivious. - **bodoh** – (From Malay) Idiot, ignorant. - **bo(h) be(h) zao** – (From Hokkien/Teochew 無馬走/无马走 *bô bé cháu*, lit. 'no horse run') From horse racing jargon. Used to describe something that is of unrivalled excellence See also \"no horse run\". - **bo(h) bian / bo(h) pien** – (From Hokkien/Teochew 無變/无变 *bô-piàn*) No choice. - **bo(h) chup** – (From Hokkien) 無插/无插 Hokkien for to not care/ disregard something. - **bo(h) eng** – (From Hokkien 無閒/无闲 *bô-êng*, lit. 'no free time') To have little or no time on one's hands. - **bo(h) gay / bo(h) ge(h)** – (From Hokkien/Teochew 無牙/无牙 *bô-gê*, lit. 'no teeth') Usually used to describe someone with a missing tooth. - **bo(h) jio / bojio** – (From Hokkien/Teochew 無招/无招) You didn't invite me. - **bo(h) liao** – (From Hokkien/Teochew 無聊/无聊 *bô-liâu*, lit. *boredom*; Mandarin: wúliáo) A slang expression to describe being in a situation of idleness. Also used to describe an act of doing something silly. - **bo(h) ta bo lan pa** – (From Hokkien 無焦無𨶙脬/无焦无𨶙脬 *bô-ta-bô-lān-pha*, lit. '[if it's] not dry [you have] no testicles') Usually used in drinking for \"bottoms up\". - **bo(h) tao bo(h) be(h)** – (From Hokkien 無頭無尾/无头无尾, lit. 'no head no tail / no beginning no end') A story that has no linkage. - **bo(h) tuah bo(h) suay** – (From Hokkien, lit. 'no big no small') Ignorant or unaware of who is the 'senior' or 'junior'. - **bo(h) zheng hu** – (From Hokkien/Teochew 無政府/无政府, lit. 'no government, [anarchy](/wiki/Anarchy)') Used to describe a lack of governance or authority. - **boleh** – (From Malay) Can; possible. Sometimes used sarcastically to refer to one's inability to do something. - **botak** – (From Malay) Used to describe someone bald. This term inspired the famous [Botak Jones](/wiki/Botak_Jones) in Singapore. - **buay** – (From Hokkien 𣍐 or 袂 *buē*) Means 'cannot'. - **buaya** – (From Malay) lit. 'crocodile'. Refers to a womanizer or flirt. - **buay pai** – (From Hokkien 袂歹 *buē-pháiⁿ*, lit. 'not bad', Mandarin equivalent: 不錯/不错) This is commonly used for food, saying that it isn't very bad or not bad. It can also be applied to other things. - **buay song** – (From Hokkien 袂爽 *buē-sóng*, Mandarin equivalent: 不爽) To be unhappy or angry about something. - **buay gan/kan** – (From Hokkien 袂幹/袂干 *buē-gan*, Mandarin equivalent: 不會幹/不会干) Useless. - **buay steady** – (From Hokkien and English) Usually used to reply to someone whose conduct spoils the pleasure of others. A spoilsport. See steady. - **buay tahan** – (From Hokkien *buay* and Malay *tahan*) Means 'unable to withstand' or colloquially \"cannot stand it\" i.e. intolerable. See *tahan*. ### C - **cabut** – (From Malay) To run off, flee or escape. - **catch no ball** – unable to understand something that someone says. Directly translated from Hokkien term *liek boh kiew / liak bo kiu*. - **Calefare** – An extra (actor playing a minor role). Originally from [Hong Kong Cantonese](/wiki/Hong_Kong_Cantonese) 茄哩啡 (ke1 le1 fe1, “extra; background actor”), a loanword from English carefree. It was popularised by the [2008 comedy series of the same name](/wiki/Calefare). - **CB** – May refer to either the Hokkien vulgarity jibai / chee bye / ci bai / chee bai, Chio bu or the [Circuit Breaker lockdown](/wiki/2020%E2%80%9321_Singapore_circuit_breaker_measures) back in 2020. - **cert** – (From English) Abbreviation of 'certificate'. E.g. \"Can copy your cert or not?\" - **chao / chow** – (From Hokkien/Teochew 臭 *chhàu*, lit. 'smelly') 1. Used to refer to foul smells. 2. Used to describe cheating or playing foul (*jiak chao*) in a game. Darned. - **chao keng** – (From Hokkien) Feigning sickness or injury. Commonly used during National Service to describe recruits who pretend to be unwell to avoid participating in certain activities. Sometimes shortened to *Keng*. - **chao mugger** – (From Hokkien and English, lit. darned mugger) Someone who frequently crams for tests for fear of failure. - **chap lau chu** – (From Hokkien) A colloquial term to describe 10-storey flats. - **char bor / zha bo** – (From Hokkien/Teochew 查某 *cha-bó*) Girl/Woman. - **chee bai/ci bai** – (From Hokkien 膣屄 *chi-bai*, lit. 'vagina-cunt') *CB* for short. Means vagina but used mainly as a swear word. See *jibai*. - **chee ko pek** – (From Hokkien/Teochew) Hokkien or Teochew slang for 'pervert' or 'dirty old man'. Sometimes used by children on riding an object. - **cheena** – (From Peranakan/Malay) Originated from Malay spelling \"Cina\". A slur used to denote Chinese people exhibiting very unpolished behaviour or mannerisms, deriding their Chineseness. Basically to denote the uncultured (from an Anglophone standpoint), any occasionally be used to denote Chinese people. - **'cher / Tcher** – Corruption & abbreviation of \"teacher\". - **chey / cheyyy** – Used when you are disappointed or unimpressed. - **chicken business** – (From English and Cantonese) Direct translation of the Cantonese slang 做鸡 (lit. 'do chicken'), which means to prostitute oneself (\"chicken\" is the slang term for a prostitute). - **chi fan** – (From Mandarin 吃饭 *chī-fàn*) To eat. - **chim / cheem** – (From Hokkien/Teochew 深, lit. 'deep') Used to describe something or a situation that is extremely hard to understand or comprehend. \"Wah you hear how he talk, so chim hor!\" - Variants include nouns such as *chim-ness* and *chimology* (\"Wah this homework damn chimology man!\") and *chiminology* (also cheeminology) (\"Ooi! Wat you say I dun understand lah, stop using chiminology can or not!\"). [Ghil'ad Zuckermann](/wiki/Ghil%27ad_Zuckermann) defines *chiminology* as \"something intellectually bombastic, profound and difficult to understand\" and explains the suffix *-inology* (rather than -ology) as being based on the English pattern X↔Xinology deriving from Latin-based pairs such as *crime↔criminology* and *term↔terminology*. - **chin chai** – (From Hokkien/Teochew 凊彩 *chhìn-chhái*) When applied colloquially, it means 'anything' or 'whatever'. Used in situations when someone does not feel like making a decision and wants another to help them make a decision. Can also be applied to situations to do something in a half-hearted manner. - **chio bu** – (From Hokkien 𪁎母 *chhio-bú* or *tshio-bú*). The word 𪁎 *tshio* in Hokkien describes how females (esp. animals) are being sexually receptive (such as during an [estrous cycle](/wiki/Estrous_cycle)) when mating and has some form of sexual connotation.[a] When 𪁎 *tshio* is combined with 母 *bú* (female), it means the girl is horny or excited when having sex. The word 𪁎母 *chhio-bú* generally means \"a fuckable girl\" or \"buxom woman\". It's used to describe a woman in a derogatory manner. However, today, many teenagers do not know the original vulgar meaning and often use it to genuinely describe/compliment a pretty girl/woman. - **chiong** – (From Hokkien 衝/冲) To rush or to charge. - **chiong sua** – (From Hokkien 衝山/冲山, lit. 'charge up a hill') Otherwise used as a more exaggerated form of \"chiong\". In National Service or the Singaporean military context, the literal meaning may be implied. - **chop** – (From Malay *cap*, which is from Hindi छाप *ćhāp*, lit. stamp) Refers to stamp or seal. - **chop chop** – (From English) Used to tell someone to do something fast. - **chope** – Slang for reserving a seat. Derived from chop; to leave a mark. Singaporeans have a habit of leaving objects on seats or tables to reserve places (usually tissue packets). Sometimes also pronounced as simply \"chop\". - **chui** - Something that is broken / or something that has gone wrong / Lousy. No real equivalent in English that carries what is implied; meaning varies by context. (This hotel damn chui. \"This hotel is very lousy / poor\") (My handphone chui liao. \"My handphone is not working properly / spoilt\") (This guy sibei chui sia. \"This guy cmi\") - **chiu kana kah, kah kana lum pah** – (From Hokkien 手敢若跤，跤敢若𨶙脬, lit. 'hands like feet, feet like testicles') Used to describe a clumsy person. See also *kah kenna chiu, chiu kenna kah*. - **cik** – (From Malay) lit. 'Miss' in Malay. When used in a military context, it is used to address female warrant officers in the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces). Also spelled as \"cek\". - **cmi** – (From English) An acronym for \"can't make it\", pronounced letter by letter (c m i). - **cockanaathan** – (From Tamil) Similar meaning to 'cock fella'. Extreme term for useless or stupid. - **corright** – (From English) Shortened corruption/amalgamation of the words \"correct\" and \"right\". To confirm that something is correct and right. Rarely used. ### D - **da bao / da pao / da pau** – (From Cantonese 打包 *daa2 baau1*) Take away (used only when cooked food is concerned). E.g. \"da bao food\" - **damn** – (From English) Very. - **dao** – (From Chinese) aloof - **dey** – 1. (From Tamil) To call someone in a friendly informal way. Same as \"Hey!\". Only to be used towards friends or someone of the same age. E.g. \"Dey! what are you doing?\" 2. They. - **diam** – See \"t(h)iam / diam\". - **doneded** - Past tense of the word done. - **don't play play** – Telling others to be serious or even saying ”don't fool around”. This is a catchphrase from [Gurmit Singh](/wiki/Gurmit_Singh)'s titular character [Phua Chu Kang](/wiki/Phua_Chu_Kang_Pte_Ltd) in the TV sitcom drama programme of the same name. - **du lan** – (From Hokkien 杼𡳞, lit. 'poke dick') 1. A swear term that means 'very pissed.' 2. Used to describe someone who is very picky and who insists on following the rules literally and blindly with no accommodation for circumstances. - **dunnid** – A corruption of 'don't need'. - **double confirm** – Confirm and reconfirm. Used to emphasize the confirmation. Also to emphasize the seriousness of the topic, 'Triple Confirm' is also used. ### E - **echerly** – Corruption of 'actually'. - **eeyer** – (From Colloquial Chinese) To express disgust. - **encik** – (From Malay) lit. 'Mister' in Malay. When used in a military context, it is used to address male warrant officers in the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces). Also spelled as \"encek\". - **eye power** – (From English) Sarcastic remark to describe someone who does not contribute in group work and merely watches on; this term is often associated with military officers. The term probably originated from the [X-Men](/wiki/X-Men) character [Cyclops](/wiki/Cyclops_(Marvel_Comics)) from [Marvel Comics](/wiki/Marvel_Comics). ### F - **falali** **/ ferlali** - Bastardisation of the car marque \"Ferrari\". - **fatty bom bom** – (From English/Malay) 1. To refer to someone who is fat. 2. A fast food restaurant in Singapore. - **foto** – Misspelling of photo. Also from the Malay word 'foto' - **fone** – Misspelling of phone. ### G - **gabra** – (From Malay *gelabah*) Used to describe confusion or disorganisation. - **gahmen** – Mispronunciation of the word \"government\"; the omitted \"v\" is especially common among people from Chinese-speaking backgrounds. In the modern context, it is used as a substitute for the actual word when criticizing the government in written form to prevent possible legal action being taken against the writer. - **garang** – (From Malay, lit. 'fierce') Used to describe someone as courageous or enthusiastic. - **geh geh** – (From Hokkien) Means faking. Usually used to describe those who are hypocritical. - **geh kiang** – (From Hokkien 假勥), lit. 'fake smart') May be used to describe someone who makes rash decisions without thinking or someone who pretends to know what they are doing. - **ger** – Corruption of 'girl'. - **get/giat** – (From Hokkien 孽) Very cheeky; mischievous. E.g. \"Eh you know my son very 'get' one hor. When he young that time he broke a lot of my things one, you leh?\" - **gila** – (From Malay) Crazy or mad. - **gone-case** – (From English) Means that one is doomed. - **goondu** – (From Tamil, குண்டு, lit. 'fat') Local meaning \"idiot\". - **gor chiam tua guay gu chia leng** – (From Hokkien 五占大過牛車輦/五占大过牛车辇, lit. 'five cents coin bigger than cart wheel') To think that one's money can go further than it can actually afford. - **goreng** – (From Malay) To brainwash. - **gostan** – (From English *go astern*) To reverse or go in the backward direction. - **guai lan / kwai lan** – (From Hokkien 怪𡳞, lit. 'strange dick') Arrogant. ### H - **handphone** – Mobile phone. Also used in other SE Asian countries. - **hantu** – (From Malay) Ghost. - **hao lian** – (From Teochew 好臉/好脸 *haon3 liêng2*, lit. 'love to boast/show off') Slang term for \"boast\" or to describe someone that is narcissistic. - **heng** – (From Hokkien/Teochew 幸) To be lucky or fortunate. Commonly used in conjunction with \"ah\", i.e. \"heng ah\". - **helication** – Corruption of \"education\". - **horlan** – (From English) Deliberate mispronunciation of \"Holland\". Of uncertain origin, the term is used to denote finding oneself in a far-off place, or unexpected consequence, usually unpleasant. It is also used to describe the situation where one is physically lost, and is most prominently used in the military. - **ho liao** – (From Hokkien 好了) It means done. - **hong bao / hongbao** – (From Mandarin 紅包/红包. Pronounced *ang bao* in Hokkien) See *ang pau / ang pow*. - **hong gan (liao) / hong kan (liao)** – (From Hokkien 仾姦(了)/仾奸(了), lit. 'get fucked').[b]Used when very angry or disappointed. \"We are screwed.\" - **hosei / ho seh / ho say** – (From Hokkien 好勢/好势) Good; well. - **Ho seh bo?** – (From Hokkien 好勢嘸/好势呒) An greeting meaning \"How Are You?\" See [How Are You? (TV series)](/wiki/How_Are_You%3F_(TV_series)). - **hosei liao** – (From Hokkien 好勢了/好势了) The phrase means 'very good' or 'excellent' and carries the positive connotation of respite. E.g. \"Eh wah the cher never come today ah? Hosei liao, I never do her homework sia!\" Can also be used sarcastically. E.g. \"Walao you never study for your final papers then still don't want pon? Hosei liao!\" - **huat** (From Hokkien 發/发 *hoat*) To prosper. Commonly used in conjunction with \"ah\", i.e. \"huat ah\". - **hum ji / humji / hum chi / humchi** – (From Hokkien, lit. 'no balls' or 'shrunken balls') A phrase that denominates cowardly behaviour. Usually used on men. E.g. \"Walao don't humji la go ask her out!\" \"James damn humji sia he see cockroach only he piss his pants sia really cmi.\" ### I - **ini macam** – (From Malay) \"Like this\", also \"That's how\" ### J - **jelak** – (From Malay) To be overly satiated by food to the point you are repulsed by it, particularly food that is too rich. - **jiak** – (From Hokkien/Teochew 食) To eat. - **jiak cao** – (From Hokkien/Teochew 食草 *chia̍h chháu*, lit. 'to eat grass') 1. Being in a situation of having no money for daily expenses (i.e., broke). - **jiak chao** – (From Hokkien/Teochew 食臭 *chia̍h chhau*, lit. 'to eat foul) 1. To play foul in a game. - **jiak zua** – (From Hokkien/Teochew 食蛇, lit. 'to eat snake') Used of a person who slacks while on duty. - **jiak kantang** – (From Hokkien *jiak* (eat) and Malay *kentang* (potato), lit. 'eat potato') A pejorative term referring to pompous condescending intellectuals who are slightly more educated about Western cultures. \"Eating more potato\" means more westernized than being Asian (eating rice). - **jiak liao bee** – (From Hokkien/Teochew 食) Means this younger generation (son or daughter) is raised to nothing. - **jia lat / jialat** – (From Hokkien/Teochew, 食力, lit. 'sapping strength') Used to describe being in trouble or a terrible situation. - **jibaboom / jibabom** - The sound of an explosion, indicating something has spoilt. - **jibai / chee bye / ci bai / chee bai** – (From Hokkien 膣屄 *chi-bai*, lit. 'vagina-cunt') Vulgar term for the female sexual organ; or the English equivalent of 'cunt'. Also a general negative expletive/interjection in colloquial speech. Abbreviates to \"CB\" in digital communication. - **jibra** – Corruption of \"zebra\". - **jio** – (From Hokkien 招) Invite. Could also mean asking someone out. - **jilo / jiro / zilo** – Corruption of \"zero\". - **jiuhu** – (From Hokkien 州府, lit. 'Administrative divisions') [Malaysia](/wiki/Malaysia). Originated from colonial times, from the Chinese translation for the term '[Straits Settlement](/wiki/Straits_Settlement)'. - **jom** – (From Malay) Let's go. ### K - **kae ang moh** – (From Hokkien/Teochew 假紅毛/假红毛, lit. 'fake red hair') Used of someone who tries to act like a Westerner. - **kah kenna chiu, chiu kenna kah** – (From Hokkien 跤敢若手，手敢若跤, lit. 'hands like feet, feet like hands') Used to describe a clumsy person. See also chiu kana kah, kah kana lum pah. - **kana sai** – (From Hokkien/Teochew 敢若屎, lit. 'bearing resemblance or comparable to shit') bullshit. - **khao peh khao bu** – (From Hokkien 哭爸哭母, lit. 'cry father cry mother' ). Means to complain terribly. - **kenz** – (From Malay) Short form of kena. - **[kampong](/wiki/Kampong) / kampung** – (From Malay) Means 'village'. Figuratively used to refer to one's hometown or place of origin. - **kaninia** – (From Hokkien/Teochew 幹你娘) Abbreviated as 'KNN\". - **kar chng** – (From Hokkien/Teochew 尻川 *kha-chhng*) Buttocks. - **kar pak** – Parking lot; Car park. - **kaypoh** – (From Hokkien 雞婆/鸡婆 *ke-pô*) A busybody. Sometimes abbreviated to *kpo*. - **[kayu](/wiki/Jalan_Kayu)** – (From Malay) Traditionally used to accuse that soccer matches have been fixed with shouts of \"referee kayu\" or soccer fans (i.e., that the referee was so blind to foul play from the opposing team by refusing to penalize them that he might as well have been a block of wood). Also used to describe lack of spontaneity or wooden behaviour (lit. 'wood'). - **kee siao** – (From Hokkien/Teochew) To go mad. Usually, this phrase is used in the context of scolding people. - **keling kia** – (From Hokkien) Used as a racial slur. An old name for Tamil Indians. *Keling* or *kling* may have origins to the [Kalinga empire](/wiki/Kalinga_(historical_region)) which had contact with ancient [Singapore](/wiki/Singapore), and *kia* means people or person. - **kena** – (From Malay) Means to be afflicted with or to suffer from something. Also pronounced as \"kana\" or spelled as \"gena/genna/kenna\". - **kena sai** – (From Malay *kena*, which means 'to be afflicted with', and Hokkien 屎 *sai*, which means 'shit') Means to \"get into deep shit\" or get into deep trouble. - **kerlik** – Corruption of colleague. - **ki chia/khi chia** – (From Hokkien) Die. Refers to the loading of a [coffin or casket](/wiki/Coffin) into a [hearse](/wiki/Hearse). The English equivalent is “up (the) lorry”. - **kiam** – (From Hokkien/Teochew 鹹/咸 *kiâm*) 1. Salty. 2. Used to describe a stingy or frugal person. - **khiam pa(h)** – (From Hokkien 欠拍, lit. 'owe a beat') Used to say that (the appearance or actions of) an individual evokes a desire to physically hit them. - **kiasi** – (From Hokkien 驚死/惊死, lit. 'afraid of dying') Used in the same manner as \"kiasu\". - **kiasu** – (From Hokkien/Teochew 驚輸/惊输) lit. 'to be afraid of losing'. - **kilat** – (From Malay, lit. 'shining') Means 'excellent'. Commonly used in the military. - **kong ka kiao** – (From Hokkien/Teochew 吭跤翹) Die. - **kopi** – (From English/Malay/Colloquial Tamil, காபி) [Coffee](/wiki/Coffee). E.g. *lim kopi* (drink coffee). See #Types of coffee. - **[kopi tiam](/wiki/Kopi_tiam) / kopi-tiam / kopitiam** – (From Malay and Hokkien 咖啡店 *ka-pi-thìam*) lit. 'coffee shop'. 'Coffee shop' in Singapore refers to \"food centre\". - **koyah** – means that an object is torn or spoiled. - **kuku bird/kuku jiao** – A crude term to refer to the male genitalia. See Bird Bird. ### L - **la(h)** – (From Chinese/Cantonese 啦) Interjection. Tagged at the end of a sentence as an exclamation but pronounced differently in questions. Used mainly at the end of both phrases and sentences. Most speakers prefer \"ah\" at the end of questions. - **lan jiao** – (From Hokkien/Teochew 𨶙鳥/𨶙鸟 or 卵鳥/卵鸟 *lān-chiáu*) Refers to male genitalia (crude). See also Si mi lan jiao. - **lao lan** – Arrogant; egoistic; pretentious, the same meaning as xia lan. - **lao pei huet** – (From Hokkien/Cantonese 流鼻血) To have a nosebleed. Typically used as a reaction upon seeing a pretty girl. - **lao sai** – (From Hokkien/Teochew 拉屎) To get diarrhoea. - **la sai** – (From Hokkien/Teochew, lit. 'stir shit') Create trouble. - **lagi** – (From Malay) Means to want more of something. - **leh** – (From Hokkien 咧) Tagged at the end of a sentence in a similar manner as \"lah\", used to emphasize the sentence. - **leh chey** – (From Malay *leceh*) A gnarly, troublesome problem or situation. - **lepak** – (From Malay) To relax. E.g.: \"Let's go lepak one corner.\" - **liao** – (From Hokkien 了, Hokkien: *liáu*, Mandarin: *liǎo*) Means 'already' or 'over', or generally indicates the past tense. Sometimes used as a substitute for the \"already\" used in Singlish, especially by Chinese-speaking people. Not that when 了 is used in this sense in Standard Mandarin, it is pronounced *le* (neutral tone) rather than *liǎo*, but in Hokkien it is pronounced *liáu*. - **liek boh kiew / liak bo kiu** – (From Hokkien 掠無球/掠无球, lit. 'catch no ball'). Used when one is unable to comprehend what others are saying. See *catch no ball*. - **liddat** – (From English) Like (akin to) that. E.g. \"Liddat oso can!?\" - **limbu / lim bu** – (From Hokkien 恁母 *lín-bú*, lit. 'your mother') An arrogant way to say \"I\" (female). - **limpeh / lim peh / limpei** – (From Hokkien 恁爸 *lín-pē*, lit. 'your father') An arrogant way to say \"I\" (male). - **lin lao hia / lin nao hia** – (From Hokkien 你老哥, 'your big brother') A vulgarity meaning of \"damn it\" - **lobang** – (From Malay) Malay word which means 'hole', 'gap' or \"opening'; also used to describe an opportunity, chance or favour. - **lombang** – (From Hokkien/Chinese) Pronounced with a round \"o\" (\"lomh-bang\") is from Malay *tumpang* which means 'to hitch a ride'. May also be pronounced and written as \"lobang\". - **long zhong / long zong** – (From Hokkien/Teochew 攏總/拢总) Altogether. - **lor** – (From Cantonese 囉/啰 *lo1*) Tagged at the end of a sentence in a similar manner as *lah*. Used to emphasize and indicate that what was said should be obvious to the listener, self-evident or to express inevitability. - **luan** – (From Hokkien 亂/乱) Hokkien word which means very messy. E.g. \"Eh you very luan ah. You everytime lose your things, siao meh?\" - **lun zun** – (From Cantonese 遴迍 *leon6 zeon6*) Means careless or clumsy. ### M - **mabuk** – (From Malay) drunk - **macam** – (From Malay) Like; Means to resemble something. - **mader** – Corruption of \"mother\". - **mafan** – (From Cantonese 麻煩/麻烦) Troublesome. - **mah** – (From Cantonese 嘛 *mā*) Usually tagged at the end of a sentence to seek agreement or argue a point. For example, \"Cannot like that, mah.\" - **makan** – (From Malay) To eat. - **makcik** – (From Malay) An auntie persona. - **malu** – (From Malay) Embarrassing. Usually used when someone makes a fool of themself. - **mampat** – (From Malay) Tight/firm. Usually referring to a woman's posterior or clothing. - **mang zang** – (From Cantonese 䒐䒏 *mang2 zang2*) Means irritable or easily annoyed. - **masak-masak** – (From Malay) Child's play. *Masak* by itself refers to cooking. - **Mat** – a [Malay](/wiki/Malay_people) man. \"Mat\" is a short form of the name [Muhammad](/wiki/Muhammad_(name)), which is a very common name among Muslim Malay men. - **[Mat Salleh](/wiki/Mat_Salleh)** – a [white person](/wiki/White_people) (usually a man). Possibly a corruption of \"mad sailor\" which came to be conflated with the name of the leader of [a historic rebellion](/wiki/Mat_Salleh_Rebellion) against the British in [North Borneo](/wiki/North_Borneo). - **mati** – (From Malay) lit. 'to die'. \"Die\" in the Singaporean slang context means to be doomed. - **mata** – (From Malay) lit. 'eye'. Used as a reference to the police. - **meh** – (From Cantonese 咩 *me1*) Usually tagged at the end of a negative question to indicate someone is exploiting a possible loophole as in \"Mata said cannot park here but I'm parking over there. Cannot, meh?\" Or to (somewhat derisively) indicate capabilities heretofore unknown as in \"Just because you never see me running, you think I cannot, meh?\" - **mong cha cha** – (From Cantonese 矇查查 *mung4 caa4 caa4*) To behave in a \"blur\" manner and be unaware of what is going on around. - **mug** – (From English) To cram (for academic tests). Used interchangeably with/instead of the word \"study\". ### N - **neh neh** – (From Hokkien 奶奶) A woman's chest or breasts. - **neh neh pok** – (From Hokkien 奶奶扑) Nipples. - **ngeow** – (From Hokkien/Teochew 貓/猫, lit. 'cat') 1. Used to describe someone who is overly meticulous or tries to find fault in everything. 2. Used to refer to someone stingy. - **nia** – (From Teochew) Common used to depict the meaning of \"only\". It is of a belittling tone. May also be used to downplay intensity. - **nia gong** – (From Teochew) Direct Translation of 'your grandfather'. - **nia gong de ji dan** – (From Hokkien/Teochew) Direct translation of \"your grandfather's egg\". - **no eye see** – A literal translation of the Cantonese expression 冇眼睇 or Mandarin expression 没眼看. Means cannot bear to look at/ do not want to know. - **no horse run** – Original Hokkien expression 无马走 (*bô bé cháu*) used in horse racing jargon to describe a champion horse which is way ahead of the field. Used to describe things (food usually) which are ahead of their peers. See also \"boh beh zao\". - **nua(h)** – ('Rotten' in Hokkien) - Lazing around, or resting. ### O - **O$P$** – \"Owe Money Pay Money\". An English translation of the Chinese expression 欠钱还钱. Used in threats from [loan sharks](/wiki/Loan_shark) who would usually scrawl this in markers or spray paint outside debtors' units. - **[Obasan](/wiki/Obasan)** – (From Japanese お婆さん *obāsan*) Used to describe someone sloppily dressed and out of fashion. Usually women in an old faded T-shirt and cheap shorts carrying a plastic bag. - **obiang/orbit** – (English/Hokkien) a corrupted version of English term \"off-beat\". Used to describe someone or something that is desperately out of fashion. - **orbi** – (Unknown etymology) May be used as a single term or combined to form \"orbi quek\" or \"orbi good\", which means 'serves you right'. - **[ORD](/wiki/National_service_in_Singapore)** – (From English) Short-form of \"Operationally Ready Date\", which refers to the date on which a [full-time National Serviceman](/wiki/National_service_in_Singapore) completes his full-time stint of National Service. It was also what older National Servicemen called their \"ROD\" or \"Run Out Date.\" - **[ORD loh](/wiki/National_service_in_Singapore)** – Army slang. An exclamation made by NSFs close to completing their two-year [NS stint](/wiki/National_service_in_Singapore) in the army to jokingly provoke their counterparts who have yet to see the end of their NS stint. - **owadio** – Corruption of \"ORD loh\". Also pronounced \"wadio\". - **orh** – (From Chinese 哦) Yes; okay. Used to express acknowledgement. - **orh hor** – Used when someone has done something wrong, and will now be in trouble. - **oso** – (From English) Also. - **ownself** – (by) himself, herself, myself, yourself, oneself, etc. ### P - **pai kia** – (From Teochew 歹囝 *pháiⁿ-kiáⁿ*, lit. 'bad kid') Teochew slang for 'hooligan' or 'gangster'. Commonly used to scold kids who don't appreciate their parents. - **pai seh / paiseh** – (From Hokkien 歹勢/歹势 *pháiⁿ-sè*) Means to be embarrassed. Usually used as an apology after making an embarrassing mistake. - **pak chiu cheng (pcc)** – (From Hokkien 拍手銃/拍手铳, lit. 'fire handgun') To masturbate. - **pak zam** – (From Hokkien/Teochew 拍針/拍针) lit. 'needle injection'. Used to describe something faulty or not usable. - **pak tor / paktor** – (From Cantonese 拍拖) To go on a date. Colloquially refers to general physical intimacy. - **pang chance** – (From Hokkien/Teochew) To give chance. May also be spelt and written as Pang Chan or Pun Chan. - **pang sai** – (From Hokkien/Teochew 放屎 *pàng-sái*) To defecate. See berak. - **pang seh** – (From Hokkien 放生) Hokkien slang for \"to be stood up\" (at an appointment), or cancelled upon at the last minute. Not to be confused with 'pang sai'. - **pang jio** – (From Hokkien/Teochew 放尿) To urinate. - **pariah** – (From Tamil) 1. Used to describe something unsightly or disgusting. 2. Used to describe the lowest and most unsightly caste ([paraiyar](/wiki/Paraiyar), gravediggers and sewerage in ancient India). 3. In modern times, it is also used to describe something or someone of low quality. - **pasar** – (From Malay) Market. Terms derived from pasar include [pasar malam](/wiki/Pasar_malam) (night markets) and pasar language (market language). - **photostat** – (From English) Photocopy. - **pia** – (From Hokkien/Teochew 拼 *piànn*) To work hard at something, or to rush something (such as homework). - **piak piak** – (From Hokkien) To have sexual intercourse. - **pian yi dao lao sai** - (From Mandarin 便宜到 *pián yi dào* + Hokkien 拉屎 *lao sai*, lit. 'so cheap that one gets diarrhea', or 'cheap until get diarrhea' as in Singlish) A very low price. - **pok kai** – (From Cantonese 仆街 *puk1 gaai1*, lit. 'to fall into the street') 1. To go broke. 2. Used to curse people. - **pon** – (From Malay) Short form of 'ponteng'. To play truant. E.g. \"Want pon school today?\" - **powderful** – Corruption of \"powerful\". - **pai tao** – To make plans with your friends and decide to not show up. - **puki** – (From Malay) - Vulgar term for female genitalia. - **pundek**– (From Tamil) - Vulgar term for female genitalia. ### R - **rabak** – (From Malay) A situation out of hand. - **rabz** – (From Malay) Short form of *rabak*. - **rabz-kebabz** – (From Malay) An out-of-control situation, usually with negative connotations. \"Everyone was so drunk, damn rabz-kebabz.\" ### S - **sabo** – (From English *sabotage*) To play a trick on someone, with a related meaning of \"getting someone else in trouble\". - \"Because he sabo me, now boss mad at me!\" - **sakar** – (From Malay) To flatter, to lick one's boots. Derived from a Malay term meaning 'sugar' (although the Malay word for sugar is actually *gula*), which may have been derived from Hindi 'sakar' or 'Sakkar' meaning 'sugar' and 'sweet words', and ultimately from Persian 'shakar' meaning 'sugar', 'sweet'. - **saman** – (From Malay) Used for traffic summons. Derived from the English word [summons](/wiki/Summons). (lit. 'to fine'/'summon'). - **sampat** – (From Hokkien) Mainly used to describe a female who is a combination of silly, crazy, wacky, sassy, ditzy, etc. Different from 38. - **samseng** – (From Hokkien/Teochew 三牲 *saⁿ-seng*) Gangster. Also *samseng kia* (三牲囝, *saⁿ-seng-kiáⁿ*). Also *samseng* (三星, *sam-seng*) refers to the three star emblem used by the communist pro-independence fighters of the [Malayan National Liberation Army](/wiki/Malayan_National_Liberation_Army) (MNLA) during the Anti–British National Liberation War (1948–1960), a guerrilla war and terror campaign against the general populace, including both the Chinese and the Malays in British Malaya. - **sargen** – Corruption of 'sergeant'. - **scorching eagle** – A high flyer at work. - **sei** – (From Hokkien 勢/势) Steady. - **see first** – A short form of \"wait and see what happens; we’ll see.\" Most often used when procrastinating and putting off plans to be considered later. A variant of this phrase is \"see how first\". - **see me no up** – (Literal translation of Chinese 看不起我) Means to be looked down upon by someone. - **see you very up** – (Literal translation of Chinese 看得起你) Means worthy of you. - **sekali** – (From Malay) Lest, what if. Pronounced SCAR-ly. - **selamat** – (From Malay) ‘Hello’ or ‘Good’. - **shame shame** – Childish slang meaning of \"very disgraceful\" or \"embarrassing\". - **shiok** – (From Punjabi/Malay) To express sheer delight with an experience, especially when eating great food. Popularly exclaimed in a single word \"Shiok!\", or combined with another. E.g. \"Shiok man!\" \"So shiok!\" - **showflat** – (From English) An event held by an estate agency that spans several weeks to promote a housing project, usually condominiums. - **sia(h)** – (From Malay) An exclamation. - **siam** – (From Hokkien/Teochew 閃/闪 *siám*) \"Get out of the way!\" Considered rude but effective. - **sian / sien** – (From Hokkien/Teochew 𤺪 *siān*) Bored, tired, or sick of something. - **siao** – (From Hokkien/Teochew 痟) 1. Crazy. Used in response to a silly suggestion. 2. An offensive term used to address a friend. 3. Used to refer to somebody who is a fanatic. \"He siao bicycles\" is saying that someone is crazy about bicycles. - **sia suay** – See *xia suay*. - **sibe(h) / si be(h)** – (From Teochew 死父 *si2-bê6*, lit. a curse vulgar word meaning 'dead father') Similar to 'very'. Interchangeably used in [Singaporean Hokkien](/wiki/Singaporean_Hokkien) and Singlish. - **simi / si mi** – (From Hokkien 甚物 *sím-mi̍h*, may also be written as 啥物 or 啥咪, Mandarin equivalent: 什麼/什么) \"What?\" - **X (verb) simi X** – A literal translation of X什么X in Chinese. \"What/why are you...\" in a derogatory sense. E.g. \"Kwa simi kwa!? / Look simi look!?\" (What are you looking at!?) - **Si mi lan jiao** – (From Hokkien 甚物𨶙鳥/甚物𨶙鸟 or 甚物卵鳥/甚物卵鸟, lit. 'What dickhead?') A much more derogatory term of \"What's up?\". Abbreviated as \"SMLJ\". - **Si mi tai dzi** – (From Hokkien 甚物代誌) Taiwan equivalent 啥物代誌／啥物代志 meaning \"What's up?\" When accommodated with a lah at the end, it could also mean \"what again?\" in an irritated manner. - **slow-po(ke)** A person who is extremely slow. - **smoke** To confuse and convince someone or an entity (group/organisation/class of people). - **sod** – (From Cantonese/English) Used to express a machine, person, or object that has gone mental or haywire. Localization of the word \"short\" from English term \"short circuit\". - **solid** - Very good. \"This chicken rice solid leh\" (This chicken rice is very good). - **solid bird bird** - So good that you get an erection. \"This bag got so many pockets. Solid bird bird leh\" (This bag is extremely good because it has many pockets). - **song** – (From Hokkien/Cantonese 爽, lit. 'refreshing') Used to express pleasure or excitement. Same meaning as *shiok*. - **sozai / sor zai** – (From Cantonese 傻仔 *so4 zai2*, lit. 'silly guy') used to express 'silliness'. Example: \"These people are so sor zai one.\" - **sotong** – (From Malay, lit. 'squid') 1. Forgetful or not knowing what is going on. E.g. \"blur like sotong\" (extremely clueless) 2. Spineless or without principles, like the cuttlefish. - **stay on topic** – (Western English) meaning to tell the person not to change the subject. E.g. \"oi, stay on topic lah you!\" (meaning \"this is not relevant\") - **steady pom pi pi** — (From Unknown) Used to describe someone who keeps their cool under pressure or in the face of a massive crisis. - **suay** – (From Hokkien/Teochew 衰 *soe*) Unlucky. - **suka** – (From Malay) Like. - **suku** – (From Malay/Teochew) From the Malay for a quarter. Meaning of \"silly\" or \"foolish\", or \"only a quarter there\". - **sui / swee** – (From Hokkien 媠/水) 1. nicely/just right/perfect. 2. Clean, neat & tidy. 3. Pretty; beautiful (often used to describe a pretty woman). Written as 美 in Standard Chinese. - **swaku** – (From Hokkien 山龜/山龟 *soaⁿ-ku*, lit. 'mountain tortoise') Not well informed or backward; a country bumpkin. ### T - **tahan** – (From Malay) Handle; tolerate, commonly used as 'I cannot tahan' meaning \"I can't bear it\" or \"I cannot tolerate\". - **ta** – (From Malay 'tahan') To Handle, bear with, commonly used as \"Can you ta for me?' Or \"I will ta for you\" - **tai ko / tyco** – (From Hokkien) Lucky (only used sarcastically). lit. 'leper'. - **tak boleh** – (From Malay) Cannot. - **tak boleh tahan** – (From Malay) lit. 'cannot endure'. Used when someone is suffering from pain, or couldn't wait upon something. - **talk cock / tok kok** – Vulgarity meaning of talking nonsense/senselessly and gibberish or engage in idle banter. Probably originated from the English expression \"[cock and bull story](/wiki/Cock_and_bull_story)\" or its equivalent, talking \"[gibberish](/wiki/Gibberish)\" — English slang for talking nonsense. - **tan ku ku** – (From Hokkien 等久久, lit. 'wait long long') Hokkien phrase meaning \"Forget it, it won't happen\". - **ta pau / ta pao** – See *da bao*. - **tau pok** – (From Chinese) lit. 'fried tofu'. By students who throw themselves on one another in a pile, usually for fun or to bully. Special cases with vertical tau pok where a person gets squashed against a vertical object, found in MRTs on a crowded day. - **teh** – (From Malay) [Tea](/wiki/Tea). Refer to \"Kopi/coffee\" for more information about the different types of orders for tea and coffee common in Singapore. - **tekan** – (From Malay) Bully/torture/put under pressure. Military slang for punishments. - **terbalik / tembalik** – (From Malay) Opposite/upside-down/inside-out. Also pronounced \"dom-ba-lek\". - **terok** - (From Malay) Bad - **thambi / tambi** – (From Tamil, தம்பி) Meaning ‘little brother’. - **t(h)iam / diam** – (From Hokkien/Malay) If used as an imperative, a very rude way of saying \"shut up!\" or \"please be quiet\"; lit. 'quiet'. Can be used to describe silence like in \"Doing guard duty on holidays is very sian but also very diam since nobody is here.\" - **tio** – (From Hokkien/Teochew 著 *tio̍h*, Mandarin equivalent: 中 *zhòng*) 1. To get. (Synonym: *kena*, though it is used in different but overlapping contexts). Usually used as a verb. E.g. \"He tio scolded by teacher.\" \"The car owner tio saman.\" 2. To accurately choose something. E.g. \"He always play [4D](/wiki/4-Digits) (lottery) and this time he tio so he won big jackpot.\" - **tir ko pek** – (From Hokkien) A lecherous man. - **toot** – Stupid/silly [person]. - **towkay / tow kay** – (From Hokkien 頭家/头家 *thâu-ke*) head of the house, or the company; which is also borrowed into Malay *tauke*, meaning Boss. - **tsai / zai** – (From Hokkien 在 *tsāi* lit. *(of a person)* steady; solid; confident and collected under pressure; possibly also conflated with Hokkien 才 *tsâi* - \"very talented\") to be very skilled at something. - **tuang** – means to hang out and not do anything, commonly used in reference to not going to classes. - **twa kee** – (From Hokkien 大枝) Used to describe big or famous people. ### U - **ulu** – (From Malay) Used to describe a rural or remote area or country bumpkin. Commonly found in road names around Singapore as well (e.g. [Ulu Pandan](/wiki/Ulu_Pandan_Depot)). - **un** – (From English/Cantonese) Abbreviation for 'understand', was once used widely in Hong Kong. - **understooded** – (From English) Corruption of understood. - **up lorry** - (From Hokkien/Malay) - Used to describe a person who has already died or an item that is spoilt and can no longer be used. See also ki chia. - **use your brain / use your blain** - Think it through properly. Made popular by Phua Chu Kang. ### V - **very the** – (From English/Chinese) Singlish phrase emphasising 'very', directly transliterated from the Chinese 非常地 (*fēi cháng de*), which means the same. Usually employed with a clearly sarcastic tone. - **vomit blood** – A literal translation of the Chinese expression 吐血, which usually means to experience an extreme or unendurable difficulty or irritation. \"Vomit\" is often pronounced \"womit\". ### W - **wa(h) lan (eh)** – (From Hokkien/Teochew 我𡳞, lit. 'oh, my penis') Crude derivative of *Wah Lau*. - **wa(h) lao (eh) / walao (eh) / wah lau (eh) / walau (eh)** (From Hokkien/Teochew 我老, lit. 'my elderly') – Exclamation of shock; \"WTF”. - **wa(h) kao / wakao** – (From Chinese 哇靠 *wà kào*) Exclamation of shock. \"What the hell just happened?” - **wa(h) se(h)** – (From Hokkien/Teochew 哇塞 *wah seh*) Exclamation of shock. \"What the hell\". - **wayang** – (From Malay) lit. \"puppetry\", \"theatrical\". Means 'acting' or 'for show'. - **where got** – ‘This won’t happen’, ‘When did it happen?’ - **white horse** – (From English) The son of a government official and/or some other influential person. The term is derived from the drawing of a white horse that used to appear at the bottom left-hand corner of the computer screen displaying patient information when said scion visits his camp's Medical Officer. - **womit** – Mispronunciation of 'vomit'. ### X - **xia lan** – (From Hokkien) Arrogant; egoistic; pretentious. - **xia suay / sia suay** – (From Hokkien/Teochew 瀉衰/泻衰 *sià-soe*) Disgrace; embarrassment. Unlucky. ### Y - **yandao** – (From Hokkien 緣投/缘投 *iân-tâu*) A handsome man. - **yaya papaya** – Used to describe someone who's proud, arrogant, or showing off; often with disappointing outcomes, i.e., \"Our football team's striker is damn yaya papaya, always try to solo dribble until lose the ball\". - **your grandfather's road ah?** - \"Does your grandfather own this road?\". Used as a rhetorical question on a person who is road hogging or doing something inappropriate on the road. (\"Kanina! This one your grandfather's road ah? Cannot see got people driving ah!?\") - **your head** – Mild, rebellious curse used to disabuse someone of an erroneous assumption. Directly transliterated from Chinese 你的头 or 你个头. Often used in conjunction with the word *ah*, i.e. \"your head ah\". ### Z - **zai** – See *tsai / zai*. - **zao hor** – (From Hokkien) Impressive. - **zao kng** – (From Hokkien) To accidentally expose oneself. - **zha bo** – See *char bor*. - **zhun** – (From Chinese 準/准, Hokkien: *chún*, Mandarin:*zhǔn*) Accurate. - **zhun bo** – (From Hokkien/Teochew 準無/准无 *chún-bô*, lit. 'Accurate or not?') Means \"Are you sure or not?\" - **zilo** – Zero. See *jilo / jiro / zilo*. - **zi siao** – (From Hokkien 恥笑/耻笑 *thí-siâu*) To disturb, ridicule or tease. ### Food and beverages Singlish is prominently used in local coffee shops, or *[kopitiams](/wiki/Kopi_tiam)* (the word is obtained by combining the Malay word for coffee and the Hokkien word for 'shop'), and other eateries. Local names of many food and drink items have become Singlish and consist of words from different languages and are indicative of the multi-racial society in Singapore. For example, *teh* is the Malay word for 'tea' which itself originated from [Hokkien](/wiki/Hokkien_(dialect)), *peng* is the Hokkien word for 'ice', *kosong* is the Malay word for 'zero' to indicate no sugar, and *C* refers to '[Carnation](/wiki/Carnation_(trademark))', a brand of [evaporated milk](/wiki/Evaporated_milk). #### Food Names of common local dishes in Singapore hawker centres are usually referred to in local dialect or language. However, as there are no English words for certain food items, the dialect terms used for them have slowly evolved into part of the Singlish vocabulary. Ordering in Singlish is widely understood by the hawkers. Some examples of food items which have become part of Singlish: - **[char kway teow](/wiki/Char_kway_teow)** – (From Hokkien/Teochew) Fried flat rice noodles with bean sprouts, Chinese sausages, eggs and cockles, in black sweet sauce, with or without chilli. - **[chwee kueh](/wiki/Chwee_kueh)** – (From Teochew 水粿) Cup-shaped steamed rice flour cakes topped with preserved vegetables (usually radish) and served with or without chilli. - **[Hokkien char mee](/wiki/Hokkien_mee#Hokkien_Char_Mee)** – (From Hokkien 福建炒麵/福建炒面, lit. 'Fujian fried noodles') Refers to the Kuala Lumpur Hokkien noodle. It is a dish of thick yellow noodles braised in thick dark [soy sauce](/wiki/Soy_sauce) with pork, squid, fish cake and cabbage as the main ingredients and cubes of pork fat fried until crispy. - **[Hokkien hae mee](/wiki/Hae_mee)** – (From Hokkien 福建蝦麵/福建虾面, lit. 'Fujian prawn noodles') Refers to either the Penang prawn noodle or Singapore prawn noodle. Soup-based (Penang) and stir-fried (Singapore). Egg noodles and rice noodles with no dark soya sauce used. Prawn is the main ingredient with slices of chicken or pork, squid and fish cake. Kang Kong (water spinach) is common in the Penang version. - **[ice kacang](/wiki/Ais_kacang)** – (From Malay) Crushed ice with flavoured syrup poured into them. Beans and jelly are usually added as well. - **kangkong / kangkung** – (From Malay) Water spinach ([Ipomoea aquatica](/wiki/Ipomoea_aquatica)). - **[kaya](/wiki/Kaya_(jam))** – (From Malay) Local jam mixture made of coconut, sugar and egg of Straits Chinese origins. - **roti-kaya** – (From Malay) Toasted bread with Kaya. - **mee goreng** – (From Chinese/Malay) Malay fried noodles. - **otah** – (From Malay) Fish paste wrapped in banana leaf or coconut leaves and cooked over a charcoal fire. Southeast Asian influence - you can find similar versions in Thailand, Indonesia and Malaysia. - **[popiah](/wiki/Popiah)** – (From Hokkien) Chinese spring rolls (non-fried). Various condiments and vegetables wrapped in a flour skin with sweet flour sauce. Condiments can be varied, but the common ones include turnip, bamboo shoots, lettuce, Chinese sausage, prawns, bean sprouts, garlic and peanut. Originates from China. Hokkien and Straits Chinese (Nonya) popiah are the main versions. - **[rojak](/wiki/Rojak)** – (From Malay) local salad of Malay origins. A mixture of sliced cucumber, pineapple, turnip, dried beancurd, Chinese doughsticks ([Youtiao](/wiki/Youtiao)), bean sprouts with prawn paste, sugar, lotus buds and assam ([tamarind](/wiki/Tamarind)). - **roti john** – (From Malay/English) Indian version of western hamburger consisting of two halves of French loaves fried with egg and minced beef/mutton. Colonial origins. - **tauge / taoge / taugeh / taugey** – (From Hokkien 豆芽 *tāu-gê*) [Bean sprout](/wiki/Bean_sprout). - **tau gee** – (From Hokkien 豆枝 *tāu-ki*) Dried bean stick; dried beancurd strips in sticks or rolls. - **[tze char](/wiki/Tze_Char)** – (From Hokkien 煮炒 *tsír-tshá*) lit. meaning cook and fry. A general term for food served by mini restaurants in local hawker stalls serving restaurant-style Chinese dishes, like fried noodles, sweet and sour pork, claypot tofu, etc. #### Beverages ##### Types of tea - **teh** – (From Hokkien/Malay 茶 *tê*) Tea. - **teh-O** – (From Hokkien 茶烏/茶乌 *tê-o*, lit. 'black tea') Tea without milk but instead with sugar. - **teh-O-ice-limau** – (From Hokkien-English-Malay) Home brewed iced lemon tea. - **teh-C** – (From Hokkien/Hainanese) Tea with evaporated milk. The *C* refers to the evaporated milk, derived from Hainanese *See/Xi* which sounds like alphabet 'C', in Hainanese *See Gu-Nin* refers to Evaporated or Fresh (*See/C*) Milk (*Gu-Nin*) e.g. King of Kings or Carnation as many Coffeeshops and related businesses are operated by Hainanese people in earlier days and even today. - **teh-cino** – (From Hokkien) Milk layered with tea on top (similar to [latte macchiato](/wiki/Latte_macchiato)), though its name hints towards a tea version of cappuccino. - **teh-peng** – (From Hokkien 茶冰 *tê-peng*) Iced milk tea sweetened with condensed milk. - **teh-poh** – (From Hokkien 茶薄 *tê-po̍h*) Weak or thin tea. - **teh-kosong** – (From Hokkien/Malay) Plain Tea. - **teh-kah-dai** – (From Hokkien/Cantonese 加底 *gaa1 dai2*, lit. 'add base') Milk tea sweetened with condensed milk, with more sugar. - **teh-siu-dai** – (From Hokkien/Cantonese 少底 *siu2 dai2*, lit. 'less base') Milk tea sweetened with condensed milk, with less sugar. - **teh-pua seo** – (From Hokkien 茶半燒/茶半烧 *tê puànn-sio*) Lukewarm tea. - **teh-O-kah-dai** – (From Hokkien/Cantonese 加底 *gaa1 dai2*, lit. 'add base') Tea with more sugar. - **teh-O-siu-dai** – (From Hokkien/Cantonese 少底 *siu2 dai2*, lit. 'less base') Tea with less sugar. - **teh-C-kah-dai** – (From Hokkien/Hainanese/Cantonese 加底 *gaa1 dai2*, lit. 'add base') Milk tea with more sugar. - **teh-C-siu-dai** – (From Hokkien/Hainanese/Cantonese 少底 *siu2 dai2*, lit. 'less base') Milk tea with less sugar. - **teh-packet or Teh-pao** – (From Hokkien 茶包 *tê pau*) Tea to go. - **[teh-tarik](/wiki/Teh_tarik)** – (From Malay) 'Pulled' tea with milk, a Malay specialty. - **[teh-halia](/wiki/Teh_halia)** – (From Malay) Tea with ginger extract. - **teh-halia tarik** – (From Malay) Pulled tea with milk (*teh tarik*) and ginger. - **tiao he / tiau hir** – (From Hokkien 釣魚/钓鱼 *tiò-hî*, lit. 'fishing') Teabag in hot water. Refers to dipping the teabag. ##### Types of coffee - **kopi** – (From Malay/Hokkien 咖啡 *ka-pi*) Coffee. - **kopi-O** – (From Malay/Hokkien 咖啡烏/咖啡乌 *ka-pi-o*, lit. 'black coffee') Coffee with sugar but no milk. - **kopi-C** – (From Malay/Hainanese) Coffee with evaporated milk. The *C* refers to the evaporated milk, derived from Hainanese *See\"/\"Xi* which sounds like alphabet \"C\", in Hainanese *See Gu-Nin* refers to Evaporated or Fresh (*See/C*) Milk (*Gu-Nin*) e.g. King of Kings or Carnation as many Coffeeshops and related businesses are operated by Hainanese people in earlier days and even today. - **kopi kosong** – (From Malay) Substitutes condensed for evaporated milk. Plain coffee. - **kopi-peng** – (From Malay/Hokkien 咖啡冰 *ka-pi-peng*) Coffee with ice. - **kopi-packet / kopi-pao** – (From Malay/Hokkien 咖啡包 *ka-pi-pau*) Coffee to go. - **kopi-pua seo** – (From Malay/Hokkien 咖啡半燒/咖啡半烧 *ka-pi-pua-sio*) Lukewarm coffee. - **kopi-gao** – (From Malay/Hokkien 咖啡厚 *ka-pi kāu*) Thick coffee. - **kopi-poh** – (From Malay/Hokkien 咖啡薄 *ka-pi-poh*) Weak or thin coffee. - **kopi-kah-dai** – (From Malay/Cantonese 加底 *gaa1 dai2*, lit. 'add base') Coffee with more sugar. - **kopi-siu-dai** – (From Malay/Cantonese 少底 *siu2 dai2*, lit. 'less base') Coffee with less sugar. These terms can be combined. For example, strong iced coffee with evaporated milk and sugar would be called “kopi-c gau peng.” ##### Other beverages - **bandung (drink)** – (From Malay) Rose syrup-milk drink, of Indian origins. (Goat's milk was traditionally used.) - **ice kosong** – (From English-Malay) Iced water. - **horlick-dinosaur** – (From English) Iced [Horlicks](/wiki/Horlicks) with extra scoop of Horlicks powder on top. - **horlick-sio** – (From Hokkien-English) Hot Horlicks. - **horlick-peng** – (From Hokkien-English) Iced Horlicks. - **milo-sio** – (From Hokkien-English) Hot [Milo](/wiki/Nestl%C3%A9_Milo). - **milo dinosaur** – (From English) Iced Milo with extra scoop of undissolved Milo powder on top. - **milo-peng** – (From Hokkien-English) Iced Milo. - **tak kiu** – (From Hokkien 踢球, lit. 'play football' or 'play soccer') Milo; Nestlé Milo often uses soccer and other sports as the theme of its advertisement. - **tak kiu-peng** – (From Hokkien) Iced Milo. The above list is not complete; for example, one can add the \"-peng\" suffix (meaning \"iced\") to form other variations such as *Teh-C-peng* (tea with evaporated milk and ice) which is a popular drink considering Singapore's warm weather. ### English words with different meanings in Singlish - **arrow** – to delegate an unpleasant or boring task to someone. The term derives from the military and government's practice of stamping a tiny arrow next to the name of the person in official documents. - **auntie** – a middle-aged or elderly woman; a young woman who dresses very unfashionably. From Chinese equivalent 阿姨. - **banana** – westernised Chinese Singaporean who lives distinctively like a Westerner (lifestyle, religion, dress code, food, activities, English proficiency etc.) and usually cast aside or reject Chinese folk religions and traditions. The point of comparison is that both are \"yellow on the outside and white on the inside\". - **blur** – clueless; in a daze; unaware of what is going on. Also commonly used in the phrase \"act blur\", which refers to the act of intentionally playing innocent. - **blur like sotong** – lit. 'blur like a squid'. To be extremely clueless. Squids squirt ink as a self-defence mechanism to get away. The ink makes it hard to see, thus \"blur\": \"Wah! You damn blur leh! Liddat also dunno!\" - **can** – Used extensively as both a question particle and an answer particle. The negative is \"cannot\". E.g. \"Can or not?\" (Can you do that?) —\"Can!\" (Sure!) - **confirm** – For sure. - **confirm plus guarantee got chop / confirm plus chop** – Extremely sure of something (derives from [National Service/Military](/wiki/National_Service_in_Singapore) situations where one needs to be absolutely sure about something; \"guarantee got chop\" denotes that the action and whatever subsequent paperwork, if any, will be approved). Basically \"officially sanctioned.\" - **earpiece** – [earphones](/wiki/Earphones), headphones. \"Ah boy, don't wear your earpiece while crossing the road!\" - **follow** – to come along/accompany or to understand. E.g. \"Can follow anot?\" - **got** – (The past tense is always used.) 1. there is/are... 2. have. E.g. \"Now got [pandemic](/wiki/COVID-19_pandemic), [got nothing to do at home one](/wiki/2020-21_Singapore_circuit_breaker_measures).\" - **help (lah)** – please, do lend me a hand by desisting from whatever it is you are doing; help me out here. E.g. \"Help lah, stop [hitting on](/wiki/Flirting) my sister.\" (Please, stop flirting with my sister.) - **ice cream** – not up to par or expectation. E.g. \"Wah a simple task you also fail, you damn ice-cream sia.\" - **jam** – can also mean traffic congestion. A shortcut of the word \"traffic jam\". - **last time** – previously, in the past. E.g. \"I last time want to go Africa, but now don't know 'ready.\" - **lightbulb** – an unwelcome companion in a couple; a third wheel. Originates from colloquial Cantonese term 电灯胆 (lit. electric light bulb). E.g., \"You two go ahead lah, I don't want to be lightbulb.\" - **mug** – to study. Derived from British 'mug up'. Common expression amongst all students. Instead of \"He's mugging *up*...\", locally used as \"He's mugging *for*...\" Confused with the Americanism, meaning [assault with intent to rob](/wiki/Robbery). - **smug** – to study ([SMU](/wiki/Singapore_Management_University) students). The term smugging or smugger refers to mugging by SMU students. Derived from SMU and mugger. - **marketing** – going to the market or shops to buy food. E.g. \"My dad may help in the marketing side, by going to the market to get some things.\" - **never** – did not yet. \"you never tell me\". - **next time** – in the future. E.g. \"Next time when you get married, you'll know how to cook.\" - **one** – used as a way to aggressively exaggerate/place emphasis on one's opinion E.g. \"You confirm can one lah!\" or \"I never say one hor.\" - **on, off** – to switch on/off. E.g. \"I on the TV\". - **on ah** – It's settled then? - **open** – to turn on electric appliances. E.g. \"I open the light.\" (Derived from Chinese 開/开, which can mean both \"to open\" and \"to turn on\".) - **pass up** – to hand in. (From Chinese 交上 *jiāo shàng*) E.g. \"Pass up your homework.\" (Although once common, usage is now discouraged in schools.) - **power** – Usually means to praise someone or something. - **PRC** – a Chinese national (abbreviation of \"[People's Republic of China](/wiki/People%27s_Republic_of_China)\"). Often used disparagingly. See also cheena. - **return** – to give back. Direct translation from the Chinese phrase. Commonly used in business emails. - **revert** – to reply. Often used in emails and text messages. \"Please revert your decision to us\" doesn't mean \"Please change your decision\", but rather \"Please get back to us with your decision.\" - **send** – to take (i.e. drive) somebody somewhere. E.g.: \"I send you to the airport lah.\" \"She gets her maid to send the boy in a cab.\" - **solid/steady** – capable; excellent. E.g. \"Solid sia, that movie.\" See also kilat. - **spoil** – Broken down. - **stay** – To live (in a place). From Malay *tinggal*. E.g. \"My grandmother, my aunt and uncle also stay next door.\" - **step** – Act like (person). E.g. \"Eh, don't step Ah Beng.\" - **steady** – 1. attached (in relationships). 2. agreeing over something, usually over an appointment. E.g. \"Eh u two steady liao ah?\", \"Today, come 3 o'clock? Steady.\" 3. cool, capable (to praise integrity or strength) E.g. \"Wa you sick also turn up for work ah? Steady!\" - **stone** – to space out; to do nothing. - BAKED. - **stun** – To steal. See: Cope. Can be used as part of \"Gostan\". See *gostan*. - **take** – to eat; to have a meal. E.g. \"Have you taken your lunch?\" \"I don't take pork.\" - **uncle** – a man who is middle-aged or older, especially not well acquainted; a younger person who behaves/dresses in an uncool/unfashionable manner. Comes from the Chinese languages, which refer the same group of men as 叔叔. - **until** – To such an extent that. A direct translation of the Chinese expression 到. Usually used after an adjective or a verb to express an extraordinary extent. E.g. \"bad until like that\" (so bad), \"Hot until ah.\" (It's so hot.) - **world** – nonsense; bullshit. ## Expressions - **Don't fly my kite/aeroplane** – Originated from the Cantonese slang 放飛機/放飞机 (Mandarin equivalent: 放鸽子, lit. \"release the pigeon\"). In the past, letters were sometimes sent by pigeon. When one arranges to meet (via pigeon mail) and fails to turn up, it is said that the person has failed to keep the appointment. Rare expression. 'Do not go back on your word' or 'Do not stand me up' - **Don't play play!** – Uncommon expression, popularised by the local comedy series [Phua Chu Kang Pte Ltd](/wiki/Phua_Chu_Kang_Pte_Ltd). Used only to evoke humour. Means 'Don't fool around' or 'Better take things seriously'. - **Got problem ah?** – an aggressive, instigating challenge. Or an expression of annoyance when someone is disturbed. 'Do you have a problem?' - **Having here** – To eat in at a restaurant. The antonym is \"take away\" or \"tah-bao\". Used by eatery or restaurant staff as in, \"Having here or take away?\" (Are you eating in here or do you want to have it for take-away?) - **He still small boy one** – a remark (Often offensive) made against someone who is not of a legally minimum age allowed by the law. Or expression used to excuse someone because he is either immature or still too young to know the difference. - **Issit/Izzit?** – Abbreviated form of \"is it?\" used as a standard [tag question](/wiki/Tag_question). E.g.: You going home now issit? E.g.: You not going home issit? E.g.: Someone comments: \"You look good today.\" Answer: \"Issit??\" - **Last time policemen wear shorts!** – A retort made against a person who refers to how policies were made in the past, or in response to something which is passe. Direct reference to the three-quarter khaki pants standard in Singapore police uniforms until 1969. - **Liddat oso can!?** – (English - Like that also can?) In response to feats of achievement or actions which are almost impossible, or unexpected. Usually with tinge of awe, sarcasm or scepticism. - **My England not powderful!** – (English - My English is not powerful (good)) Uncommon expression, used only to evoke humour. Means 'My English is not good'. - **no fish prawn oso can** – (From the Hokkien idiom 無魚蝦嘛好/无鱼虾嘛好 *bo hir hay mah hoh*. lit. \"no fish, prawns also ok\") accepting a lesser alternative. - **Not happy, talk outside!** – Used as a challenge to a fight to settle an argument, by taking it outside. (Hokkien: Ow buay gong (settle it at the back/alley way)) - **On lah!/On!/Set!** – \"It's on!\" An expression used to voice enthusiastic agreement or confirmation (of an arranged meeting, event etc.) - **Relak lah!** – (Malay-English for Relax) Expression used to ask someone to chill, cool it. 'Relak one corner' means to skive, or to literally go chill out in one corner. - **..then you know!** – Expression used at the back of a sentence to emphasise consequence of not heeding the advice. 'Tell you not to park double yellow line, kena summon then you know!' - **Wake up your idea!** – Expression used to tell someone to get a grip or stay focused. 'Recruit! Better wake up your idea!' - **Why you so liddat ar?** – (English - Why are you so \"like that\"?) 'an appeal made to someone who is being unreasonable.' - **You think, he think, who confirm? / You think, I thought, who confirm?** – Military expression used during organisational foul-ups. Generally used as a response to \"I thought...\" or \"I think...\" when something goes wrong. - **You want 10 cent?** – Means to \"buzz off!\" Refers to public phones that require 10 cents per call. - **Your grandfather's place/road ah?, Your father own this place/road?** – Used to cut someone down to size in terms of their obnoxious boorish behaviour, behaving as if they owned the place. - **You play where one?** – Used to challenge someone to state their gang affiliations (if any). - [List of Singapore abbreviations](/wiki/List_of_Singapore_abbreviations) ## Notes - Ho Mian Lian; John Talbot Platt (1993). *Dynamics of a Contact Continuum: Singapore English*. Oxford: Clarendon Press; New York: Oxford University Press. [ISBN](/wiki/ISBN_(identifier)) 0198248288. - Lisa Lim (2004). *Singapore English: A Grammatical Description*. Amsterdam; Philadelphia: John Benjamins. [ISBN](/wiki/ISBN_(identifier)) 1588115763. - Mark Newbrook (1987). *Aspects of the Syntax of Educated Singaporean English: Attitudes, Beliefs, and Usage*. Frankfurt am Main; New York: P. Lang. [ISBN](/wiki/ISBN_(identifier)) 3820498869. - John Talbot Platt; Heidi Weber (1980). *English in Singapore and Malaysia: Status, Features, Functions*. Kuala Lumpur: Oxford University Press. [ISBN](/wiki/ISBN_(identifier)) 0195804384. - The Coxford Singlish Dictionary @ Talkingcock.com - A Dictionary of Singlish and Singapore English - Potential influences of Chinese on English - Singapore Speak Good Singlish Movement\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:02.405619",
  "title": "Singlish vocabulary",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singlish_vocabulary"
}