{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:54:24.111829"
  },
  "content": "Public-education mascot in Singapore ***Singa the Kindness Lion*** is a mascot used for various public education campaigns in [Singapore](/wiki/Singapore). It was created to educate the public on courtesy and kindness. A public education campaign featuring Singa the Kindness Lion was launched in 1982 as the official mascot for Singapore's [National Courtesy Campaign](/wiki/National_Courtesy_Campaign_(Singapore)) (NCC). From 2009, Singa the Kindness Lion was adopted as the official mascot of the [Singapore Kindness Movement](/wiki/Singapore_Kindness_Movement). ## Origins Singa the Kindness Lion was initially created by a team of artists working under what was then the Ministry of Information & the Arts (MITA) – now known as [Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts). The creation of Singa was overseen by Basskaran Nair, a civil servant, who headed the National Courtesy Campaign in its early years. The team tasked with creating Singa consisted of chief artist Joseph Teo, Ahmad Asran and Eileen Wat. The team created Singa within a period of 6 weeks. The initial design of Singa was of a 'fierce-looking' lion and the subsequent revisions were overtly gentle in design. The final version of Singa was only conceived after more than a hundred revisions. The final design depicts Singa as a golden lion with a bright and welcoming smile. Singa was introduced during a time where most campaigns were slogan driven. Singa's introduction paved the way for other mascots to be introduced into various public campaigns. The Singapore Productivity campaign followed suit and adopted 'Teamy' the bee to address issues of productivity in the Singapore workforce. ## As popular character Since its introduction, Singa the Kindness Lion has been made into a host of items ranging from stickers, iron-on transfers, hand-puppets, stuffed toys, badges, documentaries, jingles, songs, posters and banners, debates, contests, talks, exhibitions, courtesy courses, leaflets, handbooks and pamphlets. Singa soon became a familiar face with regular appearances in community events and advertisement campaigns. The success of Singa the Kindness Lion was revealed in the Singa City exhibition held in 1987. Some 600,000 visitors visited the month-long exhibition held in Raffles City. Additionally, Singa the Kindness Lion has been made into a popular board game of the 1980s, 'Courtesy Snakes And Ladders', in which discourteous animals will impede the progress of players through acts of discourtesy while landing on courteous animals. In 2001, the NCC was incorporated into the Singapore Kindness Movement (SKM). Singa then became the new mascot for the movement. Statues of Singa were erected next to the [Ministry of Information, Communications and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts) building in Fort Canning Road. ## Singa's resignation On the 15th of May 2013, Singapore Kindness Movement posted on its website announcing Singa's resignation, effective immediately. The mascot wrote an open letter to Singapore announcing that they had quit. > Dear Singapore, > > I quit. > > I need a long break, and you could probably use a break from me too. I get it. No one likes being nagged at, even if it's about being kind and gracious. > > I suppose it's about time. After all, I've been doing this for over 30 years - first, as the Courtesy Lion, and more recently, as your mascot for kindness. I'm just too tired to continue facing an increasingly angry and disagreeable society. > > It's been said that kindness shouldn't be a campaign. That kindness should be a part of values education. That people in authority - at work, in school, at home and in government- should lead by example. > > Fair enough. I suppose it's time for real people to step up, and for the mascot to step aside. > > It's not that we aren't a gracious society, or that kindness is not innate in all of us. but some days it feels like not very many of us believe in or care about expressing kindness. We say, \"We have so many problems. How can we be kind?\". Or \"Fix my problems first, then we can talk about being kind.\" > > Should we let kindness and graciousness disappear while we fix these \"bigger\" problems? Is kindness only for the good times? Does graciousness come with terms and conditions? If we can only be nice if other people are nice to us first, who will start the ball rolling? Or can we rise above our differences and be gracious, even in challenging times? > > A final word before I go. Let's be responsible for our actions. We can refuse to give up our seats on the train if we don't want to, but let's not blame it on the crowd. We can let our anger and disagreement dictate the kind of people and society we want to be, or we can decide to be gracious, even when frustrated. > > We are responsible for the sort of society we encourage and create. It is our choices that determine who we are. > > All the best, Singapore. > > Your friend, > > Singa — Singa the Lion, Singapore Kindess Movement website, Subject: Open Letter to Singapore - I Quit The letter resulted in mainstream coverage. On 22nd of May, General Secretary of the Singapore Kindness Movement Dr William Wan responded to a blog post titled 'Upset Singaporean on Singa'. > Just to clarify, we didn’t say it was a publicity stunt. It is unfortunate the media called it such. Singa is gone, and in the upcoming Kindness Day SG on May 31st, you will not see Singa at a Singapore Kindness Movement initiative for the first time since Singa became SKM’s mascot. > Our intention was to invite people such as yourself to talk about where we are as a country and what we can do about it, which you have eloquently done. We do hope you continue to encourage and inspire kindness in your readers. It is our opinion that Singapore today needs all of us to find the Singa in us, and that is the message we hope will resonate with people. — Dr William Wan, Singapore Kindness Movement website, Letter in response to ‘Upset Singaporean on Singa’ ## Project Singa Project Singa was launched in 2010 as a project to commemorate World Kindness Day. A series of 2.5 inch tall vinyl collectible figurines of Singa the Kindness Lion were created in collaboration with Singapore-based toy maker Play Imaginative and various local artists. Additionally, a design contest was also held in which winning entries would be made into figurines. A total of 34 designs were designed and developed to promote messages of graciousness and kindness in society. ## Intellectual property rights The image of Singa the Kindness Lion and the word 'Singa' are the registered trademarks of the Singapore Kindness Movement. The use of the trademarks are subjected to conformance to the Singapore Copyright Act (Chapter 63) and has to be approved by the Singapore Kindness Movement. - Singapore Kindness Movement\n",
  "language": "en",
  "processed_at": "2026-01-12T11:54:24.111516",
  "title": "Singa the Lion",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singa_the_Lion"
}