{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:54:43.784762"
  },
  "content": "* *Singapore 2006** was a group of several concurrent events that were held in [Singapore](/wiki/Singapore) in support of the [61st Annual Meetings](/wiki/Annual_Meetings_of_the_International_Monetary_Fund_and_the_World_Bank_Group) of the Boards of Governors of the [International Monetary Fund](/wiki/International_Monetary_Fund) and the [World Bank Group](/wiki/World_Bank_Group). The [opening ceremony](/wiki/Opening_ceremony) and [plenary sessions](/wiki/Plenary_session) for the main meetings took place from 19–20 September 2006 at the [Suntec Singapore International Convention and Exhibition Centre](/wiki/Suntec_Singapore_International_Convention_and_Exhibition_Centre) (SSICEC) in [Marina Centre](/wiki/Marina_Centre). The [ministers](/wiki/Minister_(government)) of [G8](/wiki/G8), [G10](/wiki/Group_of_Ten_(economic)) and [G24](/wiki/Group_of_24) coincided with the event on 16 September. Registration for event delegates began on 11 September 2006 at [City Hall](/wiki/City_Hall,_Singapore), and the three-day Program of Seminars from 16 September 2006 at the [Pan Pacific Singapore](/wiki/Pan_Pacific_Singapore). Other concurrent events at various venues included the [Singapore Biennale 2006](/wiki/Singapore_Biennale) (4 September – 12 November), the Raffles Forum 2006 (14–15 September), Indonesia Day (17 September) and the Global Emerging Markets Investors Forum and Networking Reception in (18 September). Event organisers expected a turnout of about 16,000 delegates and observers, but saw a record 23,000 delegates and 300 [finance ministers](/wiki/Finance_minister) registering themselves, the largest turnout for an overseas annual meeting. It is the largest meeting in Singapore's history, and other meetings include the [117th IOC Session](/wiki/117th_IOC_Session) and the [WTO Ministerial Conference 1996](/wiki/WTO_Ministerial_Conference_1996). Main topics of discussion were the prospects of recession and the risk to the [global economy](/wiki/Economic_globalization). The primary outcome was reform of the IMF system. ## Preparations On 30 September 2002, [Lim Hng Kiang](/wiki/Lim_Hng_Kiang) who was then the [Second Minister for Finance](/wiki/Minister_for_Finance_(Singapore)), [Minister for Health](/wiki/Minister_for_Health_(Singapore)) and the Deputy Chairman for the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore), announced Singapore as the host of the annual meetings for 2006. The [Memorandum of Understanding](/wiki/Memorandum_of_Understanding) was signed on 23 September 2003 at [Dubai International Convention Centre](/wiki/Dubai_International_Convention_Centre) by Lim, [International Monetary Fund](/wiki/International_Monetary_Fund) [managing director](/wiki/Managing_director) [Horst Köhler](/wiki/Horst_K%C3%B6hler), and president of the [World Bank Group](/wiki/World_Bank_Group) [James Wolfensohn](/wiki/James_Wolfensohn). ### Venue and logistics Pico Art International, a local event [marketing](/wiki/Marketing) corporation, was assigned to prepare the event venue. Pico had participated in major past events such as the [117th IOC Session](/wiki/117th_IOC_Session), [2006 Commonwealth Games](/wiki/2006_Commonwealth_Games) and the [2004 Summer Olympics](/wiki/2004_Summer_Olympics). They built over a thousand double storey offices in 35 days, or three office units per hour. The structures within the convention centre were taken down nine days after the meetings. These double storey offices were [air-conditioned](/wiki/Air-conditioner), equipped with [lighting](/wiki/Light), [telephones](/wiki/Telephone) and [internet connection](/wiki/Internet_connection). It had 41 [staircases](/wiki/Staircase) and five [elevators](/wiki/Elevator). One thousand tons of [steel](/wiki/Steel), over 100,000 pieces of [wall](/wiki/Wall) panels, 25,000 m² of [carpeting](/wiki/Carpet), 32,000 pieces of ceiling boards, 3,000 [lights](/wiki/Light) and 15,000 pieces of [furniture](/wiki/Furniture) were needed for the construction of these offices. The main venue, [Suntec Singapore International Convention and Exhibition Centre](/wiki/Suntec_Singapore_International_Convention_and_Exhibition_Centre), received a [facelift](/wiki/Facelift) with an upgraded [lobby](/wiki/Lobby_(room)), entrance and a [facade](/wiki/Facade) which was lighted at [night](/wiki/Night). 100,000 [flowers](/wiki/Flower) and [shrubs](/wiki/Shrub) were used to beautify the [landscape](/wiki/Landscape) around the area as well as other parts of the island, including [Orchard Road](/wiki/Orchard_Road), Suntec's vicinity as well as the [East Coast Parkway](/wiki/East_Coast_Parkway). These plants included [frangipani](/wiki/Frangipani) trees, fox palms and [heliconias](/wiki/Heliconia), as well as other types of plants, coming in different colours, shapes and sizes, planted along [pavements](/wiki/Sidewalk) and road dividers. This showcased the tropical plants of the island to the world as well. [Flyovers](/wiki/Overpass) and the [City Hall](/wiki/City_Hall,_Singapore) undergone repainting and works to repave the areas near Suntec City were pushed forward to prepare for the annual meetings. Also, [walkways](/wiki/Walkway) have been resurfaced by the [Land Transport Authority](/wiki/Land_Transport_Authority). At [Singapore Changi Airport](/wiki/Singapore_Changi_Airport), posters were put around the terminals of the airport to welcome the delegates from different countries. ### Publicity and logo A campaign known as *[Four Million Smiles](/wiki/Four_Million_Smiles)* was launched in July 2006 by [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) to prepare the service sector for the event. Lim Hwee Hwa is the minister appointed to lead the organising committee of the event. The emblem for the 2006 annual meetings of the IMF and the World Bank Group was a stylised golden bud. According to the event organisers, the color gold represented finance and the bud represented potential for growth. ## Security The Singaporean government maintained tight security in and around the conference due to concerns about terrorism and violent protests. The [Singapore Police Force](/wiki/Singapore_Police_Force) was entrusted with planning and implementing security arrangements, with the support of private security companies [Aetos](/wiki/Aetos_Security_Management) and [CISCO Security](/wiki/Certis_Group) as auxiliary police. Security arrangements included oversight of the main venue's operations, border security, as well as island-wide operations. Over 10,000 police officers, including reserve members of the [Singaporean national service](/wiki/National_service_in_Singapore) and officers from the [Volunteer Special Constabulary](/wiki/Volunteer_Special_Constabulary), were deployed at event venues and the [Marina Centre](/wiki/Marina_Centre) area.[*citation needed*] Officers from the [Gurkha Contingent](/wiki/Gurkha_Contingent) and the Key Installation Protection Unit were deployed to patrol the vicinity and at entrances to barricaded areas.[*citation needed*] Security for [Suntec City](/wiki/Suntec_City) and the convention centre were handled by the Singapore Police Force and CISCO Security. Roads leading to the conference centre were temporarily [barricaded](/wiki/Barricade) and traffic police deployed at key junctions to direct traffic.[*citation needed*] The SSICEC, several car park entrances to the Suntec City mall, and the [overhead bridge](/wiki/Overhead_bridge) from [CityLink Mall](/wiki/CityLink_Mall) to [Suntec City](/wiki/Suntec_City) were all closed to public during the convention.[*citation needed*] A security office was temporarily constructed at the main entrance of Suntec City Mall with [metal detectors](/wiki/Metal_detector) and [x-ray](/wiki/X-ray) machines.[*citation needed*] These machines have also been installed at SICEC for the delegates and CSO protestors.[*citation needed*] ## Leadup to conference Road closures in the vicinity of event venues came into effect on the night of 10 September 2006, with police presence increased substantially within SICEC and in adjoining hotels. There was a notable drop in traffic volume around the area even during the morning peak hours, and traffic remained relatively smooth. Meeting delegates commenced officially at City Hall on 11 September 2006, 0800 hours ([SST](/wiki/Singapore_Standard_Time)).[*citation needed*] Reportedly, approximately 200 to 300 technical and maintenance crew members at SICEC were unable to access their workplaces due to issues with entry passes. According to a worker who spoke to the media anonymously, some temporary passes had expired without being replaced. Other workers did not receive permanent passes despite correct paperwork. Other passes were printed with errors. Reportedly, shops and restaurants at Suntec City Mall inside the convention centre saw a large drop in business after the area was secured on the evening before the convention. Nearby [Marina Square](/wiki/Marina_Square) mall was also affected. To promote sales during the convention, Suntec City created promotions for shoppers and delegates alike. ## Meetings Meetings and other events officially commenced on 13 September, with 23,000 delegates registered to attend. At the [Organization of the Petroleum Exporting Countries](/wiki/Organization_of_the_Petroleum_Exporting_Countries) seminar, then-IMF chief [Rodrigo de Rato](/wiki/Rodrigo_de_Rato) criticised attempts made by some wealthy nations to reduce [fuel](/wiki/Fuel) prices, instead advocating for a price increase to reflect scarcity and high [crude oil](/wiki/Crude_oil) prices worldwide. The IMF warned that global markets faced a possible recession, including an economic downturn in the United States, falling [home](/wiki/Home) prices, further surge in oil prices, interest rate rises to contain [inflationary](/wiki/Inflation) pressures. On 14 September, the inaugural Raffles Forum was held at [Raffles City Convention Centre](/wiki/Raffles_City_Convention_Centre), with one plenary session on this day. At SSICEC, there was a [World Economic Outlook](/wiki/World_Economic_Outlook) meeting. The IMF predicted that the growth in the economy will increase, but there could be global imbalances. On 15 September, the [United Kingdom](/wiki/United_Kingdom)'s group of delegates arrived in Singapore, including [Chancellor of the Exchequer](/wiki/Chancellor_of_the_Exchequer) as well as chairman of the [International Monetary and Financial Committee](/wiki/International_Monetary_and_Financial_Committee) (IMFC) [Gordon Brown](/wiki/Gordon_Brown) and [Mervyn King](/wiki/Mervyn_King_(economist)), the Governor of the [Bank of England](/wiki/Bank_of_England). There were also [press briefings](/wiki/News_conference) by both the IMF and the World Bank Group.[*citation needed*] On 16 September, the [G7](/wiki/G8) finance ministers met at the [Raffles Hotel](/wiki/Raffles_Hotel) to discuss the world's economy. The three-day Program of Seminars commenced, attended by [private sector](/wiki/Private_sector) representatives, [government](/wiki/Government) delegates, civil society representatives and senior officials from the International Monetary Fund and the World Bank. 161 speakers discussed topics included economic growth, the future of [China](/wiki/China) and [India](/wiki/India), regional issues and faster economic growth of the [Pacific Islands](/wiki/Pacific_Islands), [ageing](/wiki/Ageing) population in Asia, [petrol](/wiki/Petrol) prices, preventing a financial crisis, oil trade, poverty, [trade agreements](/wiki/Trade_agreement) and other Asian issues.[*citation needed*] The [G24](/wiki/Group_of_24) ministers meeting was held at SSICEC.[*citation needed*] 17 September marked the second day of the Program of Seminars, as well a meeting of the IMFC.[*citation needed*] Several African finance ministers, Gordon Brown, and de Rato held press conferences at SSICEC.[*citation needed*] The World Bank announced that they will provide a [US$](/wiki/United_States_dollar)15 million grant to combat [bird flu](/wiki/Avian_influenza) in [Indonesia](/wiki/Indonesia). Seven lenders[*who?*] including the IMF and the World Bank signed an anti-corruption agreement.[*citation needed*] Prime Minister Lee Hsien Loong and [Senior Minister](/wiki/Senior_Minister_of_Singapore) [Goh Chok Tong](/wiki/Goh_Chok_Tong) attended meetings on 18 September.[*citation needed*] It was the final day of the Program of Seminars.[*citation needed*] The IMF approved a plan to give more powers and voting rights to China, [Mexico](/wiki/Mexico), [South Korea](/wiki/South_Korea) and [Turkey](/wiki/Turkey), with 90.6% support. World Bank president [Paul Wolfowitz](/wiki/Paul_Wolfowitz) called for support for developing nations, and the IMF and World Bank called for anti-corruption measures in those countries. [Plenary sessions](/wiki/Plenary_session) commenced on 20 September with an opening ceremony hosted by Goh Chok Tong at [Esplanade – Theatres on the Bay](/wiki/Esplanade_%E2%80%93_Theatres_on_the_Bay). 5,000 official delegates were hosted at an official [reception](/wiki/Party) that included performances by local groups and a multimedia presentation about Asian identity called \"Diaspora\". The IMF and World Bank heads agreed on the need for systematic reform to empower developing countries. IMF adopted a multilateral consultation process to address global payment imbalances. On the final day, 20 September, more than 3,000 people were in attendance. During the event, \"the second stage of reforms to revise the quota formula\" were approved by IMF representatives. ## List of venues This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(June 2023)* *(Learn how and when to remove this message)* - [Suntec Singapore International Convention and Exhibition Centre](/wiki/Suntec_Singapore_International_Convention_and_Exhibition_Centre) (main venue) - [City Hall](/wiki/City_Hall,_Singapore) (registration) - [Esplanade - Theatres on the Bay](/wiki/Esplanade_-_Theatres_on_the_Bay) (official opening ceremony) - [The Pan Pacific Singapore](/wiki/The_Pan_Pacific_Singapore) (seminars) - [Istana](/wiki/Istana_Singapore) (banquet for governors and spouses) - [Raffles Hotel](/wiki/Raffles_Hotel) ([G8](/wiki/G8) meeting) - [Raffles City Convention Centre](/wiki/Raffles_City_Convention_Centre) (Raffles Forum) - [Mount Faber](/wiki/Mount_Faber) (the Jewel Box; welcome tea for delegates' spouses) - [Asian Civilisations Museum, Empress Place](/wiki/Empress_Place_Building) (lunch for governors spouses) - [Shangri-La Hotel Singapore](/wiki/Shangri-La_Hotel_Singapore) ([Institute of International Finance](/wiki/Institute_of_International_Finance) annual membership meeting and dinner) ## Activism and demonstrations Singaporean authorities denied entry of several accredited [civil service organisations](/wiki/Civil_service_organisation) (CSO) representatives whom they regarded as \"troublemakers\", despite appeals from the IMF and World Bank to permit them entry. On 11 September, when civic activists began arriving in Singapore, 28 activists were denied entry and had to leave the country. Police stated they had been denied entry for their involvement in previous violent protests. The IMF and World Bank stated that they had secured permission for accredited activists and protestors to attend the meetings, and they considered this denial a breach of that agreement. The convention's organising committee later condemned the restrictions as \"authoritarian\". Two unaccredited Filipino activists were deported on 13 September, and one Indian national was deported on 14 September. On 15 September 2006, part-way through the conference, the Singaporean government announced that 22 of the banned would be allowed entry. On 20 September, they stated that their changed stance had been a result of an internal review and was not a reaction to the IMF/World Bank criticism. As with the Dubai 2003 meetings, [outdoor demonstrations](/wiki/Demonstration_(people)) were not permitted, as they are illegal under [Singaporean law](/wiki/Law_of_Singapore). The government rejected requests to suspend the prohibitions for security reasons. Demonstrations from representatives of registered CSOs were granted permission to demonstrate in a small area on the ground floor of Suntec Singapore. Police pushed the start date of these demonstrations from 11 September to 13 September. The [One Campaign](/wiki/One_Campaign) in Singapore produced videos about world poverty and anticipated playing them at screens at the convention centre. An activist from [Action Aid International](/wiki/Action_Aid_International) held a solo protest on 14 September, and her group staged a silent protest the day after. Thirty people from [Global Call to Action Against Poverty](/wiki/Global_Call_to_Action_Against_Poverty) wore white [t-shirts](/wiki/T-shirt) and gags with \"no voice\" written on them during a protest on 15 September. Some CSOs accused the IMF/World Bank of deliberately choosing Singapore to host the meetings because of its [authoritarian](/wiki/Authoritarian) reputation. On 6 September 2006, the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) (SDP) announced plans for a protest on 16 September, called the Empower Singaporeans Rally and March. It would include members of the Singapore opposition including the SDP. On 11 September, it was reported that the police were investigating the planned rally. The police also reportedly denied two applications for the planned protest and confiscated leaflets about it that were handed out at [Raffles City](/wiki/Raffles_City_Singapore). The Rally began as planned at 11 am at the [Speakers' Corner](/wiki/Speakers%27_Corner#Singapore) at [Hong Lim Park](/wiki/Hong_Lim_Park), but was denied permission to travel to other planned stops at [Parliament House](/wiki/Parliament_House,_Singapore), [Suntec City](/wiki/Suntec_City), and the [Istana](/wiki/The_Istana). SDP member [Chee Soon Juan](/wiki/Chee_Soon_Juan) gave a speech at the parkk. On 17 September, the protesters announced that they would continue their protest until the morning of 19 September, after Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong)'s speech before the WB-IMF meeting. To circumvent the Singaporean ban, approximately 1,000 delegates from various organisations planned to hold outdoor demonstrations from 11–18 September in [Batam](/wiki/Batam), [Indonesia](/wiki/Indonesia). Indonesian law permits outdoor demonstration as long as authorities are informed three days in advance. Indonesian CSOs opposed the protests as they believed they would deter investment in the country. Indonesian authorities were reportedly not supportive of the planned demonstrations, and city police advised organisers that their demonstration would not be permitted for economic, political, and security reasons. On 11 September, Indonesian police granted a permit for a three-day indoor forum in Batam, but refused to allow outdoor demonstrations. ## Impact A survey amongst delegates found a high satisfaction level with regards to the efficiency of event organisation, and of Singapore as a whole. - [Annual Meetings of the International Monetary Fund and the World Bank Group](/wiki/Annual_Meetings_of_the_International_Monetary_Fund_and_the_World_Bank_Group) - [Economy of Singapore](/wiki/Economy_of_Singapore) - [Four Million Smiles](/wiki/Four_Million_Smiles) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:54:43.784360",
  "title": "Singapore 2006",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_2006"
}