{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:00:56.248888"
  },
  "content": "Ethnic group **Singaporeans in Malaysia** refers to people that are holding [Singaporean citizenship](/wiki/Singaporean_nationality_law) or are of [Singaporean](/wiki/Singaporeans) descent who reside or were born in [Malaysia](/wiki/Malaysia). With a population of 91,002 in 2019, according to the [United Nations Department of Economic and Social Affairs](/wiki/United_Nations_Department_of_Economic_and_Social_Affairs), they are the largest community of [overseas Singaporeans](/wiki/Overseas_Singaporean). ## Overview Most Singaporeans residing in Malaysia are usually expatriates as professionals are sought out for a niche expertise in various industries within the country. They are usually [white collar workers](/wiki/White-collar_worker) with positions in [upper management](/wiki/Senior_management) or [middle management](/wiki/Middle_management) within companies, as such most Singaporean residents are usually concentrated near large urban centres such as [Kuala Lumpur](/wiki/Kuala_Lumpur), [Selangor](/wiki/Selangor), [Malacca](/wiki/Malacca) and [Johor Bahru](/wiki/Johor_Bahru). According to a 2014 estimate by the Johor-Singapore Community Care Association, there are about 5,000 Singaporean families living in Johor. Under the [Malaysia My Second Home](/wiki/Malaysia_My_Second_Home) programme, Singaporean retirees and some Singaporeans working or studying in Singapore have chosen to reside in Johor due to the lower cost of living and they are also allowed to import one car into Malaysia or buy a locally made car with duty and sales tax exemptions, although Singaporeans cannot drive Malaysia-registered cars in Singapore. - Malaysia portal - Singapore portal - [Malaysians in Singapore](/wiki/Malaysians_in_Singapore) - [Malaysia–Singapore relations](/wiki/Malaysia%E2%80%93Singapore_relations) This [Malaysia](/wiki/Malaysia)-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This Singapore-related article is a stub. You can help Wikipedia by expanding it.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:00:56.248529",
  "title": "Singaporeans in Malaysia",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singaporeans_in_Malaysia"
}