{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:56:45.880322"
  },
  "content": "* *Singapore International Festival of Arts** (**SIFA**) is an annual arts festival held in [Singapore](/wiki/Singapore). It is organised by Arts House Limited for the [National Arts Council](/wiki/National_Arts_Council_Singapore). The festival is usually held in mid-year for a stretch of one month and incorporates [theatre arts](/wiki/Theatre_arts), [dance](/wiki/Dance), [music](/wiki/Music) and [visual arts](/wiki/Visual_arts), etc. Besides local participants, many of the events are by international artists. It began as **Singapore Arts Festival,** ([Chinese](/wiki/Simplified_Chinese): 新加坡艺术节) organised by the National Arts Council, in 1977, and was a biennial event until 1999. Since 2012 it has been called Singapore International Festival of Arts, run by Arts Festival Limited, and commissioned by the National Arts Council. The Festival Director is currently Chong Tze Chien. ## History The Singapore Arts Festival started in 1977 as a national arts festival to celebrate local arts from the diverse communities in Singapore. It was a biennial event until 1999 when the Festival of Asian Performing Arts and the Festival of Arts were merged as an annual event. In 2012, an independent company, Arts Festival Limited, was set up by the [National Arts Council](/wiki/National_Arts_Council_Singapore) to take over the organising of the festival and it was renamed Singapore International Festival of Arts. It is commissioned by the National Arts Council. ## Festival Directors - 1982, 1984: Anthony Steele - 1986, 1988: Robert Liew - 1990: Tisa Ho (Ng) - 1992, 1994, 1996, 1998, 1999: Liew Chin Choy - 2000–2009: Goh Ching Lee - 2010–2012: Low Kee Hong - 2014–2017: Ong Keng Sen - 2018–2021: Gaurav Kripalani - 2022–2025: Natalie Hennedige - 2026–2028: Chong Tze Chien ## Local Commissions In addition to international acts, Singaporean productions (some in collaboration with overseas partners) in previous Arts Festivals include [ECNAD](/wiki/ECNAD)'s Missing In Tall Pillars (2002), [Mark Chan](/wiki/Mark_Chan)'s Little Toys (2003), Opiume (2004) and Dreaming of Kuanyin Meeting Madonna (2007). ## Editions ### 2008 The Singapore Arts Festival focused on water in 2008, with both the opening and closing shows being performed on water. The opening show of 2008, Water Fools, was performed by the French group Ilotopie. It was held from 23 to 25 May at [Boat Quay](/wiki/Boat_Quay). The entire performance was performed in the [Singapore River](/wiki/Singapore_River). The closing show, Hydro Sapiens, was performed by The Lunatics from the [Netherlands](/wiki/Netherlands). It was held in [Bedok Reservoir](/wiki/Bedok_Reservoir) from 20 to 22 June. ### 2010 The 2010s theme, Between You and Me, was about getting closer to the arts. For the first time, the Festival planned an outreach programme called com.mune. The festival included international performances. ### 2011 Singapore Arts Festival 2011 was held from 13 May to 5 June 2011 and its theme was 'I Want To Remember'. The opening show was When a Gray Taiwanese Cow Stretched, by [Ishinha](/wiki/Ishinha). About the migration of people from the South Sea islands to South East Asia, Taiwan and Japan, it was Singapore Arts Festival's largest-ever outdoor performance at the [Esplanade Park](/wiki/Esplanade_Park). ### 2019 The 2019 edition runs from 16 May to 2 June. The festival director is Gaurav Kripalani. ### 2020 In response to the Singapore government's measures in light of the [COVID-19 pandemic](/wiki/COVID-19_pandemic), Arts House Limited and the [National Arts Council](/wiki/National_Arts_Council,_Singapore) announced the cancellation of the SIFA. ### 2021 The 2021 edition defined a working model for arts festivals amidst a pandemic – a landmark achievement capping Festival Director Gaurav Kripalani’s final term. Held from 14 May to 20 June, the Festival marked a milestone as one of the largest arts festivals in the world to be staged since the outbreak of the global pandemic in 2020. ### 2022 SIFA 2022 marked the start of Natalie Hennedige's three-year tenure as Festival Director, till 2024. Held from 20 May to 5 June with the title The Anatomy of Performance – Ritual, the 2022 festival featured new commissioned works by a mix of local and international artists. The SIFA 2022 journey was also extended through the new virtual venue, Life Profusion. - [Singapore Biennale](/wiki/Singapore_Biennale) - [Culture of Singapore](/wiki/Culture_of_Singapore) - [Music of Singapore](/wiki/Music_of_Singapore) - [Dance in Singapore](/wiki/Dance_in_Singapore) - [Singapore Arts Street](/wiki/Singapore_Arts_Street) - Official website - Music You Can See: Singapore Arts Fest 2007\n",
  "language": "en",
  "processed_at": "2026-01-12T11:56:45.879917",
  "title": "Singapore International Festival of Arts",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_International_Festival_of_Arts"
}