{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:54:56.636196"
  },
  "content": "Military of Singapore The **Singapore Armed Forces** (**SAF**) are the [military](/wiki/Military) of the [Republic of Singapore](/wiki/Republic_of_Singapore), responsible for protecting and defending the security interests and the sovereignty of the country. A component of the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) (MINDEF), the armed forces have four [service branches](/wiki/Military_branch): the [Army](/wiki/Singapore_Army), [Navy](/wiki/Republic_of_Singapore_Navy), [Air Force](/wiki/Republic_of_Singapore_Air_Force), and [Digital and Intelligence Service](/wiki/Digital_and_Intelligence_Service). An [integrated force](/wiki/Combined_arms), it is the most capable, robust, technologically sophisticated and powerful military in the Southeast Asia region. The SAF is headed by the [chief of defence force](/wiki/Chief_of_Defence_Force_(Singapore)), appointed by the [president](/wiki/President_of_Singapore), on the advice of the [Cabinet](/wiki/Cabinet_of_Singapore). Since its inception, the SAF has been involved in various operations, both domestically and abroad. These include peacekeeping missions in places such as [Afghanistan](/wiki/Afghanistan), [Iraq](/wiki/Iraq) and [Timor Leste](/wiki/Timor_Leste) as well as disaster relief operations in various countries, including the [1970 Bhola cyclone](/wiki/1970_Bhola_cyclone), [2004 Indian Ocean earthquake and tsunami](/wiki/2004_Indian_Ocean_earthquake_and_tsunami), [Hurricane Katrina](/wiki/Singaporean_response_to_Hurricane_Katrina), [2008 Sichuan earthquake](/wiki/2008_Sichuan_earthquake), [April 2015 Nepal earthquake](/wiki/April_2015_Nepal_earthquake), [Hurricane Harvey](/wiki/Hurricane_Harvey), among others. In addition, the SAF has assisted the [United Nations](/wiki/United_Nations) to oversee and supervise the electoral process in countries such as [Cambodia](/wiki/Cambodia), [Ethiopia](/wiki/Ethiopia), [Namibia](/wiki/Namibia) and [South Africa](/wiki/South_Africa). It has an approximate active strength of over 51,000 full-time personnel and is capable of mobilising over 252,500 [reservists](/wiki/Reservist) (also known as National Servicemen, or NSmen) in the event of national exigencies or a full-scale war. It also has a large pool of [conscripts](/wiki/National_Service_in_Singapore) (also known as Full-time National Servicemen, or NSFs) in the active and reserve forces, with about 50,000 reaching military age annually. In recent years, the SAF has also taken on a more active role in counter-terrorism efforts. ## History ### Pre-independence Prior to Singapore attaining its independence as a [nation state](/wiki/Nation_state), the British colonial force defended Singapore. The [Singapore Volunteer Rifle Corps](/wiki/Singapore_Volunteer_Corps) (SVRC) was first created in 1854 as a private organisation, with the [governor](/wiki/List_of_governors_of_Singapore) serving as its first [Colonel](/wiki/Colonel). It was later gazetted in 1857. However, participation in the SVRC was weak and it was disbanded on 16 December 1887 in favour of forming an artillery corps instead. This was to be the [Singapore Volunteer Artillery](/wiki/Singapore_Volunteer_Corps) (SVA), which was formed in 1888 to operate the gun emplacements around Singapore, and is also considered to be the predecessor of the artillery formation of the Singapore Armed Forces. In 1901, additional non-artillery units were set up, including a Chinese infantry company, Eurasian infantry company, and the Singapore Volunteer Engineers, leading to the force being renamed as the [Singapore Volunteer Corps](/wiki/Singapore_Volunteer_Corps) (SVC). It assisted in suppressing the [1915 Singapore Mutiny](/wiki/1915_Singapore_Mutiny). In 1921, the SVC was combined with other volunteer forces from Malacca and Penang as the [Straits Settlements Volunteer Force](/wiki/Straits_Settlements_Volunteer_Force) (SSVF). During [World War II](/wiki/World_War_II) the voluntary military forces of Singapore sustained heavy casualties. The voluntary military force of Singapore was reestablished in 1949. ### Post-independence In 1965 an Israeli military advisory team arrived in Singapore, which would remain in the country for the next nine years. Under the guidance of the Israeli military advisory team, the SAF established its organisation, doctrine, training, as well as its equipment, and [arsenal](/wiki/Arsenal). The SAF in Singapore benefited from [conscription](/wiki/Conscription) and massive public spending. In the mid-1970s, the SAF in Singapore had a force of 300,000 soldiers, including regular soldiers, conscript soldiers, as well as reserve force soldiers. The political purpose of the SAF in Singapore was to pose a reasonable deterrence to the two historically hostile neighbours of Singapore. Singapore became known as the \"most heavily armed country on earth\" when it purchased [light tanks](/wiki/Light_tank), [M113](/wiki/M113) [armoured personnel carriers](/wiki/Armoured_personnel_carrier), [A-4 Skyhawks](/wiki/A-4_Skyhawk), and [F-5](/wiki/Northrop_F-5) [fighter aircraft](/wiki/Fighter_aircraft) in the mid-1970s. In the 1980s the SAF in Singapore armed itself to attain the capability to defend Singapore's maritime lifeline. In the mid-1980s Singapore purchased eight [F-16](/wiki/F-16) [fighter-bombers](/wiki/Fighter-bomber), demonstrating the intent to maintain the SAF as unrivalled in [Southeast Asia](/wiki/Southeast_Asia). In the early 1990s the SAF in Singapore attained the military force necessary to defend Singapore up to 1,000 miles at sea, and therefore respond if necessary to any conflict in the region. ### 21st century Singapore has been described as \"a military powerhouse with the best air force and navy in Southeast Asia.\" Singapore's wealth allows it to acquire and make the best equipment available as well as incorporate high-end technological equipment into its nation's military forces. The SAF is also called \"the most technologically advanced armed forces across the Association of Southeast Asian Nation states\". A recent example is Singapore's decision in the early 2020s to acquire twenty [Lockheed Martin F-35 Lightning II](/wiki/Lockheed_Martin_F-35_Lightning_II) aircraft, comprising twelve F-35Bs and eight F-35As. Singapore distinguishes itself from the rest of Southeast Asia through its advanced technology and equipment, described as operating \"at a very high level of capability\" and being \"integrated into a single cohesive fighting force.\" It will also be the only air force in Southeast Asia to possess F-35s. On 1 July 2018, the Minister for Defence [Ng Eng Hen](/wiki/Ng_Eng_Hen) announced that the SAF would transition from its current third-generation technologies to next-generation technologies by overhauling its [arsenal](/wiki/Arsenal). On 27 February 2019, the office of Inspector-General of the Armed Forces was set up to ensure that safety protocols are applied and enforced throughout the military following the death of [Aloysius Pang](/wiki/Aloysius_Pang), who was the fourth training related fatality in 18 months after 2017. [Armed Forces Day](/wiki/Armed_Forces_Day) is commemorated by the SAF annually on 1 July, with a [parade](/wiki/SAF_Day_Parade) held at the [SAFTI Military Institute](/wiki/SAFTI_Military_Institute). The SAF celebrated its 60th anniversary on 1 July 2025. ### Recent years #### Contribution in national crises On 15 March 1986, the six-storey [Hotel New World](/wiki/Collapse_of_Hotel_New_World) collapsed. SAF soldiers aided in rescue operations, working alongside members of the [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) to remove the rubble. RSAF UH-1H helicopters were on standby at the nearby Farrer Park football field to evacuate rescued victims to the Singapore General Hospital. On 26 March 1991, [Singapore Airlines Flight 117](/wiki/Singapore_Airlines_Flight_117) was hijacked by four [Pakistanis](/wiki/Pakistanis) en route to Singapore. Upon landing in [Changi Airport](/wiki/Changi_Airport) at 8:15pm SGT, the hijackers demanded the release of several [Pakistan People's Party](/wiki/Pakistan_Peoples_Party) members. Negotiations faltered, and after the hijackers gave their ultimatum to have their demands fulfilled at 6.15am SGT of the following morning, [commandos](/wiki/Commandos_(Singapore_Army)) from SAF's [Special Operations Force](/wiki/Special_Operations_Force_(Singapore)) (SOF) stormed the plane, killing all hijackers and rescuing the hostages. During the [SARS outbreak](/wiki/2002-2004_SARS_outbreak) in 2003, SAF paramedics were deployed at [Changi Airport](/wiki/Changi_Airport) to screen incoming passengers from places hit by SARS. The SAF also deployed 220 servicemen with operations such as screening, contact tracing and enforcing home quarantine orders. The team also managed other major operations, such as the quarantine of 1,500 staff from the Institute of Mental Health. In 2004, the Singapore Armed Forces also responded to the [2004 Indian Ocean earthquake and tsunami](/wiki/2004_Indian_Ocean_earthquake_and_tsunami). During the [COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore) since 2020, SAF servicemen were called upon to pack and transport masks, conduct tracing calls, and check compliance with stay home notices. MINDEF personnel also ran the National Call Centre to address public queries on the collection of reusable masks. The SAF also deployed manpower to assist in manning thermal imagery machines at the airport to screen travellers with symptoms. The SAF was also involved in managing COVID-19 cases in foreign worker dormitories and at isolation facilities ## Defence policy [Deterrence](/wiki/Deterrence_theory) and [diplomacy](/wiki/Diplomacy) have been the fundamental tenets of Singapore's military defence policy. Through the years, the SAF in Singapore has developed extensive links with armed forces from other countries. In recent years, there has also been an increased emphasis on [peacekeeping](/wiki/Peacekeeping) and international emergency relief operations. Notable are the SAF's contribution to the peacekeeping operations in [Afghanistan](/wiki/Afghanistan), [East Timor](/wiki/East_Timor), the [Persian Gulf](/wiki/Persian_Gulf), as well as the [disaster response](/wiki/Disaster_response) in the [2004 Indian Ocean earthquake](/wiki/2004_Indian_Ocean_earthquake), the [2005 Nias–Simeulue earthquake](/wiki/2005_Nias%E2%80%93Simeulue_earthquake), the [2006 Yogyakarta earthquake](/wiki/2006_Yogyakarta_earthquake), [Hurricane Katrina](/wiki/Singaporean_response_to_Hurricane_Katrina), and the [2008 Sichuan earthquake](/wiki/2008_Sichuan_earthquake).[*citation needed*] Singapore's spending on military hardware has enabled the SAF to advance from a defensive and defeatist \"poisoned shrimp\" strategy to a forward defence military strategy in tandem with sustained [economic growth](/wiki/Economic_growth). Since the 1980s the [government of Singapore](/wiki/Government_of_Singapore) has maintained the SAF as a modern and technically proficient armed force that is capable of [conventional warfare](/wiki/Conventional_warfare) on land. The SAF's declared mission statement is to \"enhance Singapore’s peace and security through deterrence and diplomacy, and should these fail, to secure a swift and decisive victory over the aggressor\". The SAF's policy towards [Malay people](/wiki/Malays_(ethnic_group)), who share religious and ethnic ties with Singapore's largest neighbours, Malaysia and Indonesia, has been a source of controversy over the years. Malays were virtually excluded from [conscription](/wiki/Conscription) from the beginning of the draft in 1967 until 1977 and, after the policy was eased, were assigned mainly to serve in the [Singapore Police Force](/wiki/Singapore_Police_Force) and the [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force), and not active combat roles. In 1987, [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) (then Second Minister for Defence) stated that \"If there is a conflict, if the SAF is called to defend the homeland, we do not want to put any of our soldiers in a difficult position where his emotions for the nation may be in conflict with his religion.\" Military analyst Sean Walsh claimed that \"official discrimination against the Malay population remains an open secret\". The Ministry of Defence contests the charge, noting that there are \"Malay pilots, commandos and air defence personnel\" and stating that \"the proportion of eligible Malays selected for specialist and officer training is similar to the proportion for eligible non-Malays.\" ## National Service Women are exempt from full-time National Service in Singapore, but can sign on as a career soldier in both combat and non-combat roles. The range of positions available to women has been expanded gradually. In July 2007, the SAF held an exhibition highlighting the contributions of women in the armed forces. In recent years, some women have taken higher positions, such as BG [Gan Siow Huang](/wiki/Gan_Siow_Huang), who is the highest ranking female officer and the first female General in the SAF. In 2014, a governmental Committee to Strengthening NS established a [SAF Volunteer Corps](/wiki/SAF_Volunteer_Corps) (SAFVC). The SAFVC enables women, first generation Permanent Residents and new citizens to contribute to national defence and strengthen support for NS. Volunteers undergo a four-week course to gain basic military skills and values. Under the [Enlistment Act 1970](/wiki/Enlistment_Act_1970), conscription is mandatory for all \"persons subject to [the] act\", defined as those who are not less than 16 years and 6 months of age and not more than 40 years of age, with some exemptions and with no specific bias to gender. In practice however, it is only compulsory for all Singaporean men who have reached 18 years of age, and are not deferred or exempted for certain reasons, to be conscripted in military service. NS was initially three years for [commissioned officers](/wiki/Commissioned_officer) and two years for other ranks, but it was later revised to two years and six months for soldiers with the rank of [Corporal](/wiki/Corporal) and above, and two years for those with the rank of [Lance Corporal](/wiki/Lance_Corporal) or lower. In June 2004, NS was shortened to two years for all Full-time National Servicemen (NSFs), regardless of rank, due to changes in population demographics, manpower requirements and technological advancements. Combat fit NSFs who obtain a silver or gold standard in a physical fitness test have an additional two months reduction, serving 22 months of NS effectively. Upon completion of their NSF stint, servicemen are considered as having reached their Operationally-ready Date (ORD) and are known as Operationally-ready National Servicemen (NSmen). Almost all NSmen go through a 10-year reservist cycle of military training with their assigned unit deployment. Almost all NSmen are obliged to be called up annually for a maximum of 40 days per workyear for national duties, refresher trainings, mobilisations, upgrading courses and [individual physical fitness tests](/wiki/Individual_physical_proficiency_test) and conditioning, depending on their NS unit deployment. ### Training Prior to enlistment, pre-enlistees (recruits) are required to attend a medical examination ([PULHHEEMS](/wiki/PULHHEEMS)) to determine their medical status to assess vocational suitability postings. They will then be issued a \"Physical Employment Status\" (PES), which will be used as a guideline to determine for which vocation groupings they are deemed suitable. PES A and PES B1 (combat-fit) recruits go through a nine-week [Basic Military Training](/wiki/Recruit_training) (BMT) program, held at the [Basic Military Training Centre](/wiki/Basic_Military_Training_Centre) (BMTC) on the offshore island of [Pulau Tekong](/wiki/Pulau_Tekong). Recruits who are considered [obese](/wiki/Obesity), are required to attend a 19-week PES Bp BMT weight-loss program. PES B2 formally PES C1 (fit for some combat vocations) recruits will go through a nine-week modified BMT programme at BMTC. PES C and PES E recruits (non-combat-fit) undertake a nine-week modified BMT program in BMTC School V at Kranji Camp II, where serviceman undergoing a four-week modified BMT programme before being deployed to various combat service support vocations such as Admin Support Assistant (ASA), Transport Operator (TO), and Supply Assistant (SA). All servicemen, with the exception commandos, naval divers and service support vocation units, will complete their BMT at BMTC. ### Military education Initially, [commissioned officers](/wiki/Officer_(armed_forces)) were drawn exclusively from the ranks of Singaporeans who had completed their [GCE A levels](/wiki/GCE_Advanced_Level) or embarked on tertiary studies. While the requirements have since been revised, the SAF has still been criticised for \"using a promotion system that is based more on education and scholarships than on proven competence\". ## Foreign defence relations Singapore is part of the [Five Power Defence Arrangements](/wiki/Five_Power_Defence_Arrangements), whose other members include the [United Kingdom](/wiki/United_Kingdom), [Australia](/wiki/Australia), [New Zealand](/wiki/New_Zealand) and [Malaysia](/wiki/Malaysia). Designed to replace the former defence role of the British in Singapore and Malaysia, the arrangement obliges members to consult in the event of external threat against Malaysia and Singapore. To this end, an Integrated Air Defence System is set up in Butterworth, Malaysia involving the stationing of officers from the 5 countries at its headquarters. In 1975, President [Chiang Ching-kuo](/wiki/Chiang_Ching-kuo) and Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) signed an agreement code-named \"Project Starlight\" (星光計畫, also known as Hsing Kuang), wherein Singaporean troops could conduct training exercises in Taiwan. These exercises, engaging as many as 10,000 troops at any one time, provided officers a chance to simulate wartime conditions more closely and gain experience in the command and control of operations involving several battalions. Singapore has consistently supported a strong [US military](/wiki/United_States_armed_forces) presence in the Asia-Pacific region. In 1990, the US and Singapore signed a [memorandum of understanding](/wiki/Memorandum_of_understanding) (MOU) which allows the US access to Singapore facilities at [Paya Lebar Air Base](/wiki/Paya_Lebar_Air_Base) and the [Sembawang](/wiki/Sembawang) wharves. Under the MOU, a [US Navy](/wiki/United_States_Navy) logistics unit was established in Singapore in 1992; US fighter aircraft deploy periodically to Singapore for exercises, and a number of US military vessels visit Singapore. The US Navy's [Task Force 73/Commander, Logistics Group Western Pacific](/wiki/Task_Force_73/Commander,_Logistics_Group_Western_Pacific) is now located at Sembawang. The MOU was amended in 1999 to permit US naval vessels to berth at [Changi Naval Base](/wiki/Changi_Naval_Base), which was completed in early 2001. Singapore's defence resources have also been used for international humanitarian aid missions. They included United Nations [peacekeeping](/wiki/Peacekeeping) missions in areas such as [Kosovo](/wiki/Kosovo), Kuwait and [East Timor](/wiki/East_Timor), participation in the [Multi-National Force – Iraq](/wiki/Multi-National_Force_%E2%80%93_Iraq), sending military equipment and personnel to assist in the humanitarian rescue and relief efforts in Indonesia after the [2004 Indian Ocean earthquake and tsunami](/wiki/2004_Indian_Ocean_earthquake_and_tsunami), and the [United States after Hurricane Katrina](/wiki/Singaporean_response_to_Hurricane_Katrina), sending medical supplies and personnel in response to the earthquake in Nepal and establishing medical and dental assets for use by the [Afghan](/wiki/Afghanistan) people. The Republic of Singapore Navy contributes to anti-piracy efforts in the Gulf of Aden off the eastern coast of Somalia as part of the 25 nations coalition [Combined Maritime Forces](/wiki/Combined_Maritime_Forces). Several of the SAF's top officers have thus overseas operational military experience. Singapore was the only Asian country to contribute assets and personnel to the Global Coalition to Defeat ISIS and had participated in Operation Gallant Phoenix since May 2017. Many of the Singapore's air units are located abroad such as: [No. 130 Squadron](/wiki/RAAF_Base_Pearce) in Australia, [No. 150 Squadron](/wiki/Cazaux_Air_Base) in France, or joint [USAF](/wiki/USAF)-[RSAF](/wiki/RSAF_(Singapore)) [425th](/wiki/425th_Fighter_Squadron) and [428th Fighter Squadron](/wiki/428th_Fighter_Squadron). Since 2009, up to 90 soldiers annually are sent to Germany for exercises of a maximum of seven weeks each time at the [Bergen-Hohne Training Area](/wiki/Bergen-Hohne_Training_Area) and other locations. ## Legislation Under the Singapore Armed Forces Act, the [president of Singapore](/wiki/President_of_Singapore) has the authority to raise and maintain the SAF. The president also has the power to form, disband or amalgamate units within the SAF. The Armed Forces Council (AFC) administers matters relating to the SAF under the Singapore Armed Forces Act. The AFC consists of: - [Minister for Defence](/wiki/Ministry_of_Defence_(Singapore)#Ministers) and other ministers who are responsible for defence matters or has been assigned to assist them; - the Permanent Secretaries of the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)); - the [Chief of Defence Force](/wiki/Chief_of_Defence_Force_(Singapore)) (CDF); - the Chief of Army (COA); - the Chief of Air Force (CAF); - the Chief of Navy (CNV); - the Chief of Digital and Intelligence Service (CDI) and - not more than four other members as the president may appoint if the president, acting in their discretion, concurs with the advice of the [prime minister](/wiki/Prime_Minister_of_Singapore). ### Military offences Military offences are governed by the SAF and the Enlistment Act in the Singapore Statutes. However, civilian offences (e.g. against the Penal Code) may also amount to a military offence. Offences may be prosecuted by military prosecutors, through the military justice system, or through the civilian judicial system. ## Organisation ### Services The SAF consists of four service branches: - [Army](/wiki/Singapore_Army) (3 combined arms divisions - 3 Div, 6 Div & 9 Div; 2 army operational reserve divisions - 21st Div and 25th Div; 1 island defence command - 2nd People's Defence Forces) - [Air Force](/wiki/Republic_of_Singapore_Air_Force) (6 commands and 4 air bases) - [Navy](/wiki/Republic_of_Singapore_Navy) (5 commands, 8 flotillas, and 2 naval bases) - [Digital and Intelligence Service](/wiki/Digital_and_Intelligence_Service) (inaugurated in 2022) ### Task forces The SAF comprises seven standing task forces: - [Army Deployment Force](/wiki/Army_Deployment_Force) - Island Defence Task Force - Joint Task Force - [Special Operations Task Force](/wiki/Special_Operations_Task_Force); an integrated joint command formed in 2009, to combat common terrorist threats. It comprises selected members of the [1st Commando Battalion](/wiki/Commandos_(Singapore_Army))'s [Special Operations Force](/wiki/Special_Operations_Force_(Singapore)), [Naval Diving Unit](/wiki/Naval_Diving_Unit_(Singapore))'s [Special Warfare Group](/wiki/Special_Warfare_Group_(Singapore)) and other forces - [Maritime Security Task Force](/wiki/Maritime_Security_Task_Force) - Air Defence Task Force - Cybersecurity Task Force ### Defence agencies Supporting the combat role of the SAF are other governmental organisations of MINDEF, such as the Defence Policy Group, the Defence Management Group, the Defence Technology Group, and the Defence Science & Technology Agency. Within these groups are the [Central Manpower Base](/wiki/Ministry_of_Defence_(Singapore)#Departments_&_divisions), Defence Cyber Organisation, and the [Military Security Department](/wiki/Ministry_of_Defence_(Singapore)#Departments_&_divisions). Domestic technology companies also play a role in building up Singapore's military capabilities, particularly the government-linked [ST Engineering](/wiki/ST_Engineering) (formerly known as Chartered Industries of Singapore), which has designed and built SAF weaponry and equipment. ### Chief of Defence Force (CDF) The position of [Chief of Defence Force](/wiki/Chief_of_Defence_Force_(Singapore)) was established in 1990, with the inaugural holder being [Winston Choo](/wiki/Winston_Choo), who was previously Chief of the General Staff. The SAF is headed by the CDF, a three-star [General](/wiki/General_officer) by establishment and the only active SAF General that can hold three-star rank. He is assisted by the four chiefs of the respective services, who are two-star generals/admirals by establishment. The SAF has a Sergeant Major who currently holds the rank of CWO. The CDF is also supported by the Chief of Staff, Joint Staff, the Joint Operations Directorate, Joint Plans & Transformation Department, the Joint Manpower Department, the Joint Logistic Department, the Joint Intelligence Directorate, and Office of the Inspector-General of the Armed Forces. ### Ranks The Singapore Armed Forces (SAF) has five rank schemes for active and reservist personnel, with a sixth for the [auxiliaries](/wiki/Auxiliaries) of the [SAF Volunteer Corps](/wiki/SAF_Volunteer_Corps). The SAF has a unique rank structure as an integrated force, ranks are the same in the [Singapore Army](/wiki/Singapore_Army), the [Republic of Singapore Navy](/wiki/Republic_of_Singapore_Navy) (RSN), the [Republic of Singapore Air Force](/wiki/Republic_of_Singapore_Air_Force) (RSAF), and the [Digital and Intelligence Service](/wiki/Digital_and_Intelligence_Service) (DIS). ## Technology The SAF utilises technology as \"[force multipliers](/wiki/Force_multiplication)\", especially in the area of [C4I](/wiki/C4ISTAR) integration, which will enable its various units to fight in an integrated manner. The Army, Air Force and Navy are linked via advanced data-links and networks to enable coordinated attacks and support for various units and forces. Technology is an important element in the SAF's transformation into a 3rd Generation Fighting Force. The SAF acknowledges that technology is crucial for overcoming the limitations of Singapore's small population. Having consistently had one of the largest defence budgets in the Asia-Pacific region, Singapore has focused on maintaining its spending on sophisticated and superior weaponry. Research and experimentation to develop a technological edge began as early as 1971, even though the SAF then had only rudimentary capabilities. The effort started off with a three-man team. At present, the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) (MINDEF) is one of the largest employers of engineers and scientists in Singapore and the SAF continues to devote considerable resources to defence research and development (R&D) and experimentation—5% and 1% of the defence budget, respectively. [Singapore's education system](/wiki/Education_in_Singapore) has also produced national servicemen who can be trained to operate SAF's sophisticated platforms and systems. In Sep 2008, the SAF officially opened its [Murai Urban Training Facility](/wiki/Murai_Urban_Training_Facility) (MUTF) to hone the SAF's networked urban operations capability. The MUTF resembles a typical town and allows the soldiers to train realistically in an urban setting. In the same month, the SAF's new combat uniform, as well as the [Advanced Combat Man System](/wiki/Advanced_Combat_Man_System), were also unveiled for the first time. The country also has an established military manufacturing industry that is responsible for the design and development of the following military hardware: - [PRIMUS](/wiki/SSPH_Primus) – Self-propelled Howitzer - [Bionix II](/wiki/Bionix_AFV#Production_models) – Infantry Fighting Vehicle (an upgrade of the [Bionix AFV](/wiki/Bionix_AFV)) - [MATADOR](/wiki/MATADOR_(weapon)) – Unguided Short Range Anti-Armour Weapon - [Terrex](/wiki/Terrex_ICV) I, II, III – Infantry Carrier Vehicle - [PEGASUS](/wiki/SLWH_Pegasus) – Light Weight Howitzer - [SAR 21](/wiki/SAR_21) & [Bullpup multirole combat rifle](/wiki/BR18) – [Bullpup](/wiki/Bullpup) Assault Rifle - [Formidable-Class Stealth Frigate](/wiki/Formidable_class_frigate) – warships designed with stealthy characteristics, equipped with advanced combat systems and with longer endurance - [Independence-class littoral mission vessel](/wiki/Independence-class_littoral_mission_vessel) – warships designed for [littoral](/wiki/Littoral_warfare) and [coastal warfare](/wiki/Coastal_warfare) ### Uniforms The SAF's first-generation army uniform was named *Temasek Green* from the simple flat green uniform, with brown and blue colours being used for the navy and air force's uniforms respectively. This was followed by the second-generation uniform, which used a patchy camouflage pattern for the army, while using [overalls](/wiki/Boilersuit) for the army and navy. The third and current generation of combat uniforms, commonly known as the No. 4, uses [digital camouflage](/wiki/Multi-scale_camouflage) with base colours green, blue, light grey and dark grey for the army, air force, navy and DIS respectively. In June 2018, the SAF introduced a new variant of the uniform for combat units, which provides more effective cooling in a manner similar to the ones issued to US army personnel for tropical climates. The SAF's desert-camouflage uniforms are only issued to personnel deployed overseas to countries such as Iraq and Afghanistan. ### Salary SAF Career Officer Pay Grades RankMonthly pay (approx., SGD) RefLieutenant-Colonel9,000-12,000Major7,000-9,000CaptainDegree holders: 5,400 – 6,940LieutenantDegree holders: 4,970 – 6,1602nd LieutenantNon-degree holders: 2,820 – 3,590Officer Cadet TraineeDegree holders: 4,650 – 5,840 Non-degree holders: 2,620 – 3,360 - Singapore portal - [Singapore Armed Forces ranks](/wiki/Singapore_Armed_Forces_ranks) - [National service in Singapore](/wiki/National_service_in_Singapore) - [SAFTI Military Institute](/wiki/SAFTI_Military_Institute) - [SAF Medical Training Institute](/wiki/SAF_Medical_Training_Institute) - [Singapore Armed Forces Band](/wiki/Singapore_Armed_Forces_Band) - [RSAF Black Knights](/wiki/RSAF_Black_Knights) - [SAF Volunteer Corps](/wiki/SAF_Volunteer_Corps) (SAFVC) - [National Cadet Corps](/wiki/National_Cadet_Corps_(Singapore)) (NCC) - [Awards and decorations of the Singapore Armed Forces](/wiki/Awards_and_decorations_of_the_Singapore_Armed_Forces) - [Singapore Armed Forces Best Unit Competition](/wiki/Singapore_Armed_Forces_Best_Unit_Competition) - [Singapore Armed Forces Merit Scholarship (Women)](/wiki/Singapore_Armed_Forces_Merit_Scholarship_(Women)) - [Singapore Armed Forces Overseas Scholarship](/wiki/Singapore_Armed_Forces_Overseas_Scholarship) - [List of Singapore Armed Forces bases](/wiki/List_of_Singapore_Armed_Forces_bases) - \"Singapore Ministry of Defence\". [Ministry of Defence (Singapore)](/wiki/Ministry_of_Defence_(Singapore)). Retrieved 8 July 2005. - \"MINDEF/SAF Organisation\". [Ministry of Defence (Singapore)](/wiki/Ministry_of_Defence_(Singapore)). Retrieved 19 April 2018. - \"Singapore Budget 2018\". [Ministry of Finance (Singapore)](/wiki/Ministry_of_Finance_(Singapore)). Retrieved 19 April 2018. - \"Singapore Key Stats\". Singapore Department of Statistics. Archived from the original on 3 March 2005. Retrieved 19 April 2018. Library resources about **Singapore Armed Forces** - Resources in your library - Resources in other libraries - Official websites: MINDEF, Singapore Army, Singapore Navy, Singapore Air Force - The 3rd Generation SAF - SAF Documentaries on MINDEF ([YouTube](/wiki/YouTube) channel) - Journal of the Singapore Armed Forces – Contains scholarly articles on military issues, including those pertaining to the SAF's transformation into a 3rd Generation Fighting Force - GlobalSecurity.org Overview of Singapore's military forces, facilities, and equipment. - [MINDEF](/wiki/MINDEF), The NS Portal, Retrieved 23 October 2006. - Ranks and Paramilitary Ranks of Singapore Archived 7 August 2010 at the [Wayback Machine](/wiki/Wayback_Machine), Retrieved 23 October 2006.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:54:56.635960",
  "title": "Singapore Armed Forces",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Singapore_Armed_Forces"
}