{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:05.959504"
  },
  "content": "Asian hybrid architecture style **Sino-Portuguese architecture**, also known as **Chinese Baroque,** **Straits/Singapore Eclectic architecture** or **[Peranakan](/wiki/Peranakan) architecture** is an Asian hybrid style incorporating elements of both [Chinese](/wiki/Chinese_architecture) and [Portuguese](/wiki/Architecture_of_Portugal) [architectural styles](/wiki/Architectural_styles). It is common in urban centers where Chinese settlers lived in [southern China](/wiki/Southern_China) and the Peranakans of the [Malay Peninsula](/wiki/Malay_Peninsula), with examples found and most prominently conserved and maintained in [Singapore](/wiki/Singapore). Historical areas with such architecture can also be found throughout [Malay Peninsula](/wiki/Malay_Peninsula), [Southern Thailand](/wiki/Southern_Thailand) (primarily [Phuket](/wiki/Phuket)), [Macau](/wiki/Macau), [Medan](/wiki/Medan), [Vietnam](/wiki/Vietnam) and [Hainan](/wiki/Hainan) (primarily [Haikou](/wiki/Haikou)). In many of these places however, such structures have either been demolished or are in a state of disrepair. ## Sino-Portuguese style The characteristics of Sino-Portuguese architecture is a mix of European and Chinese styles or simply [colonial architecture](/wiki/Colonial_architecture). These older buildings were built by the Chinese [coolies](/wiki/Coolies). The building has the design (painting) in Chinese format, but the structure is Portuguese. Typically, the building is a one or two storey mixed commercial-residential building. The wall has strength due to the weight of the tiles on the roof. The roof is clad in curved tiles of Chinese provenance. In contemporary Singapore, such structures are conserved and maintained regularly, making them a huge tourist attraction for foreigners unacquainted with such structures. Its historical heritage as well as its location in the city-centre also makes them highly valuable. ## Sino-Portuguese history in Phuket The [old town](/wiki/Phuket_Old_Town) in [Phuket](/wiki/Phuket_City) has a history as the center of a [tin mining](/wiki/Tin_mining) and trading province. In the era of [Western imperialism](/wiki/Western_imperialism_in_Asia), after 1511 (2054 [BE](/wiki/Buddhist_calendar)), Portuguese settlers came to Phuket and to the trade port of Malacca. The settlers brought Western culture with them, including their technologies, religion, and their own architectural styles. Portuguese settlers employed Chinese workers to build their houses and establishments. These structures mixed Portuguese and Chinese art styles together, giving rise to Sino-Portuguese architecture. ## Gallery - Architecture portal - Singapore portal - [Architecture of Singapore](/wiki/Architecture_of_Singapore) - [Bahay na Bato](/wiki/Bahay_na_Bato) - [Malay houses](/wiki/Malay_houses) - [Nipa hut](/wiki/Nipa_hut) - [Rumah adat](/wiki/Rumah_adat) - [Shophouse](/wiki/Shophouse) - [Tong lau](/wiki/Tong_lau) - Old Phuket Houses. Retrieved 3 October 2016, from www.phuket.com - Phuket's Old Town Movement. Retrieved 3 October 2016, from lestariheritage.net - Sino-Portuguese Architecture. Retrieved 3 October 2016, from www.roughguides.com\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:05.959059",
  "title": "Sino-Portuguese architecture",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sino-Portuguese_architecture"
}