{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:10.678685"
  },
  "content": "Buddhist temple in SingaporePart of a series on[Buddhism](/wiki/Buddhism) - [Glossary](/wiki/Glossary_of_Buddhism) - [Index](/wiki/Index_of_Buddhism-related_articles) - [Outline](/wiki/Outline_of_Buddhism) [History](/wiki/History_of_Buddhism) - [Timeline](/wiki/Timeline_of_Buddhism) - [The Buddha](/wiki/The_Buddha) - [Pre-sectarian Buddhism](/wiki/Pre-sectarian_Buddhism) - [Councils](/wiki/Buddhist_councils) - [Silk Road transmission of Buddhism](/wiki/Silk_Road_transmission_of_Buddhism) - [Decline in the Indian subcontinent](/wiki/Decline_of_Buddhism_in_the_Indian_subcontinent) - [Later Buddhists](/wiki/List_of_Buddhists) - [Buddhist modernism](/wiki/Buddhist_modernism) - [Dharma](/wiki/Dharma) - [Concepts](/wiki/Glossary_of_Buddhism) - [Four Noble Truths](/wiki/Four_Noble_Truths) - [Noble Eightfold Path](/wiki/Noble_Eightfold_Path) - [Dharma wheel](/wiki/Dharmachakra) - [Five Aggregates](/wiki/Skandha) - [Impermanence](/wiki/Impermanence_(Buddhism)) - [Suffering](/wiki/Du%E1%B8%A5kha) - [No-self](/wiki/Anatt%C4%81) - [Dependent Origination](/wiki/Prat%C4%ABtyasamutp%C4%81da) - [Middle Way](/wiki/Middle_Way) - [Mettā](/wiki/Maitr%C4%AB) - [Emptiness](/wiki/%C5%9A%C5%ABnyat%C4%81) - [Morality](/wiki/Buddhist_ethics) - [Karma](/wiki/Karma_in_Buddhism) - [Rebirth](/wiki/Rebirth_(Buddhism)) - [Saṃsāra](/wiki/Sa%E1%B9%83s%C4%81ra_(Buddhism)) - [Cosmology](/wiki/Buddhist_cosmology) [Buddhist texts](/wiki/Buddhist_texts) - [Buddhavacana](/wiki/Buddhavacana) - [Early Texts](/wiki/Early_Buddhist_texts) - [Tripiṭaka](/wiki/Tripi%E1%B9%ADaka) - [Mahayana Sutras](/wiki/Mahayana_sutras) - [Pāli Canon](/wiki/Pali_Canon) - [Sanskrit literature](/wiki/Sanskrit_Buddhist_literature) - [Tibetan canon](/wiki/Tibetan_Buddhist_canon) - [Chinese canon](/wiki/Chinese_Buddhist_canon) - [Post-canon](/wiki/Post-canonical_Buddhist_texts) [Practices](/wiki/Threefold_Training) - [Three Jewels](/wiki/Refuge_in_Buddhism) - [Buddhist paths to liberation](/wiki/Buddhist_paths_to_liberation) - [Five precepts](/wiki/Five_precepts) - [Perfections](/wiki/P%C4%81ramit%C4%81) - [Meditation](/wiki/Buddhist_meditation) - [Philosophical reasoning](/wiki/Buddhist_philosophy) - [Devotional practices](/wiki/Buddhist_devotion) - [Merit making](/wiki/Merit_(Buddhism)) - [Recollections](/wiki/Anussati) - [Mindfulness](/wiki/Sati_(Buddhism)) - [Wisdom](/wiki/Praj%C3%B1%C4%81_(Buddhism)) - [Sublime abidings](/wiki/Brahmavihara) - [Aids to Enlightenment](/wiki/Bodhipakkhiy%C4%81dhamm%C4%81) - [Monasticism](/wiki/Buddhist_monasticism) - [Lay life](/wiki/Householder_(Buddhism)) - [Buddhist liturgy](/wiki/Buddhist_liturgy) - [Buddhist chant](/wiki/Buddhist_music) - [Pilgrimage](/wiki/Buddhist_pilgrimage_sites) - [Vegetarianism](/wiki/Buddhist_vegetarianism) [Nirvāṇa](/wiki/Nirvana_(Buddhism)) - [Awakening](/wiki/Enlightenment_in_Buddhism) - [Four Stages](/wiki/Fruits_of_the_noble_path) - [Arhat](/wiki/Arhat) - [Pratyekabuddhayāna](/wiki/Pratyekabuddhay%C4%81na) - [Bodhisattva](/wiki/Bodhisattva) - [Buddha](/wiki/Buddhahood) [Traditions](/wiki/Schools_of_Buddhism) - [Theravāda](/wiki/Theravada) - [Pāli](/wiki/Pali_Canon) - [Mahāyāna](/wiki/Mahayana) - [Hinayana](/wiki/Hinayana) - [Chinese](/wiki/Chinese_Buddhism) - [Vajrayāna](/wiki/Vajrayana) - [Tibetan](/wiki/Tibetan_Buddhism) - [Navayana](/wiki/Navayana) - [Newar](/wiki/Newar_Buddhism) [Buddhism by country](/wiki/Buddhism_by_country) - [Bhutan](/wiki/Buddhism_in_Bhutan) - [Brazil](/wiki/Buddhism_in_Brazil) - [Cambodia](/wiki/Buddhism_in_Cambodia) - [China](/wiki/Buddhism_in_China) - [India](/wiki/History_of_Buddhism_in_India) - [Indonesia](/wiki/Buddhism_in_Indonesia) - [Japan](/wiki/Buddhism_in_Japan) - [Korea](/wiki/Korean_Buddhism) - [Laos](/wiki/Buddhism_in_Laos) - [Malaysia](/wiki/Buddhism_in_Malaysia) - [Mongolia](/wiki/Buddhism_in_Mongolia) - [Myanmar](/wiki/Buddhism_in_Myanmar) - [New Zealand](/wiki/Buddhism_in_New_Zealand) - [Russia](/wiki/Buddhism_in_Russia) - [Singapore](/wiki/Buddhism_in_Singapore) - [US](/wiki/Buddhism_in_the_United_States) - [Sri Lanka](/wiki/Buddhism_in_Sri_Lanka) - [Taiwan](/wiki/Buddhism_in_Taiwan) - [Thailand](/wiki/Buddhism_in_Thailand) - [Tibet](/wiki/Tibetan_Buddhism) - [Vietnam](/wiki/Buddhism_in_Vietnam) - Buddhism portal - v - t - e **Siong Lim Temple**, also known as **Lian Shan Shuang Lin Monastery** ([traditional Chinese](/wiki/Traditional_Chinese_characters): 蓮山雙林寺; [simplified Chinese](/wiki/Simplified_Chinese_characters): 莲山双林寺), is a [Buddhist](/wiki/Buddhist) monastery located in [Toa Payoh](/wiki/Toa_Payoh), [Singapore](/wiki/Singapore), next to the [Pan Island Expressway](/wiki/Pan_Island_Expressway). The temple was founded in 1898, but the construction of the premises only began in 1902 by [Low Kim Pong](/wiki/Low_Kim_Pong) and was completed in 1907. The monastery was gazetted as a national monument in 1980 and subsequently underwent a decade-long restoration that began in 1991. The temple now boasts a seven storey gold-topped pagoda which is a replica of the 800-year-old Shanfeng temple pagoda in Fujian. The temple also consist of a columbarium for [Qing Ming Festival](/wiki/Qing_Ming_Festival) visit. ## Etymology Siong Lim Temple is the common [Hokkien](/wiki/Min_Nan) or Fukien name of the **(Lian Shan) Shuang Lin Monastery** ([Chinese](/wiki/Chinese_language): （蓮山）雙林寺; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Liân-san-siang-lîm-sī*), [pinyin](/wiki/Pinyin): (Lián Shān) Shuāng Lín sì), which literally means \"Twin Grove of the Lotus Mountain Temple\". The name of the monastery refers to the twin groves of sala trees located at the [Bodh Gaya](/wiki/Bodh_Gaya) in India, where [Lord Buddha](/wiki/Lord_Buddha) was believed to have attained [Enlightenment](/wiki/Enlightenment_in_Buddhism). It is also commonly referred to as Siong Lim Temple or, in the past, Low Kim Pong’s Temple after its founder.[*citation needed*] ## History The [Buddhist temple](/wiki/Buddhist_temple) was built on a 40,000 square metres site owned by [Low Kim Pong](/wiki/Low_Kim_Pong) (劉金榜), a wealthy Chinese [Hoklo](/wiki/Hoklo_(ethnic_group)) (Hokkien) merchant and devout Buddhist. When Low Kim Pong was sixty, he had a dream where he saw a golden light rising from the west over the sea (the west being symbolic of Buddhism which originated in [India](/wiki/India), and is west of China). He took the dream to be an omen, and went to the coast the next day. At dusk, he met an unusual Hokkien family arriving by boat. The entire family had taken Buddhist vows and were on their way home to [Fujian](/wiki/Fujian) after a pilgrimage to Sri Lanka. Low, moved by their devotion, tried to persuade them to stay in Singapore and spread the faith. He promised to build a temple for their use. The head of that family, Hsien Hui (賢慧), eventually became Siong Lim's first abbot. The funds used for its construction were raised by Low Kim Pong and Yeo Poon Seng, one of the saw mill pioneers during the period. In 1950s, the temple area was reduced to about 20,000 m² when part of the land was acquired by the Singapore Improvement Trust for public housing. Today, the temple still stands as a landmark amongst residential [HDB](/wiki/Housing_and_Development_Board) flats. The temple was gazetted a [national monument](/wiki/National_Monuments_of_Singapore) on 17 October 1980, symbolising the social and cultural roots of the early Chinese immigrants. ### Restoration works In 1910, the buildings of the temple started to deteriorate due to termite infestations, harsh tropical weather and wear and tear caused by worshippers. Major restoration works for the monastery were first carried out between 1918 and 1919 and a second time between 1950 and 1954. After being gazetted as a national monument in 1980, a structural safety check by the then Preservation of Monuments Board (now known as the Preservation of Sites and Monuments) uncovered cracks in the timber roofs and walls of the monastery, which prompted the formation of the Shuang Lin Restoration and Preservation Committee in 1990 to oversee the restoration works. Planning for the restoration of the temple started in 1991, where experts in China, Hong Kong and Taiwan were consulted about restoring the temple to its former glory without losing its authenticity. About 80 carpenters, sculptors and artisans were brought in from China to work on the restoration. The restoration took about a decade to be completed as the workers attempted to restore as much of the original architecture as possible. Materials that could withstand the tropical climate of Singapore were used during the restoration of the temple. To prevent termite infestation, termite-resistant timber was imported from Sarawak, and custom-made roof tiles that were more water-resistant were ordered from Japan. French lighting expert Louis Clair, who designed the lights for the [Istana Park](/wiki/Istana_Park) and [CHIJMES](/wiki/CHIJMES), was commissioned for the monastery’s lighting design. The final phase of the restoration was completed in 2001, following which the monastery was reopened to the public. Approximately S$40 million was spent for the entire restoration project. ## Architecture Although the architect of the temple is unknown, the temple is modelled after Xi Chan Si, a temple in Fuzhou, Fujian province. The temple and Xi Chan Si are examples of cong lin (literally “layers of forest” in Mandarin) styled temples, where a standardised layout of the buildings within the premises of the temple is adopted and the monks lead an ordered way of life practising Buddhist scriptures and following a strict daily routine. The complex comprises three main halls separated by two courtyards and arranged along a central north-south axis, with the main entrance facing south according to the Chinese principles of feng shui. The main gate of the temple, known as Shan Men (Mountain Gate), features majestic gates over 9 m tall, known as pai lou, which are supported by stone pillars decorated with Chinese calligraphy inscriptions and joined at the top by a wooden roof. The doors of the gates are decorated with brightly painted Buddhist guardians, and the central door features a bronze knocker held in the mouth of a snail-shaped creature that represents one of the nine sons of the dragon. The main entrance hall, known as [Tian Wang Dian](/wiki/Hall_of_Celestial_Kings) (Hall of Celestial Kings), features a half hip roof with 9 ridges and it also features granite wall panels depicting scenes from Chinese culture and history. The main hall, known as [Da Xiong Bao Dian](/wiki/Mahavira_Hall) (Mahavira Hall), has a two-tiered half hip roof with 9 ridges supported by colourful beams decorated with carvings of lotuses and dragons. The doors to the main hall feature carved lattice motifs of flowers, birds and Chinese symbols of longevity, while its exterior walls are decorated with tortoise-shell designs. Dharma Hall, which is situated at the back of the complex, houses the statue of the goddess Guanyin as well as ash urns. It is the oldest building in the complex and was rebuilt in 1978 as the original timber structure had deteriorated beyond repair. ### Design influence The original buildings of the temple was constructed by Chinese craftsmen using materials imported from Fujian province. With the craftsmen coming from different counties in Fujian, the architecture of the temple is a combination of three regional architectural styles: Fuzhou, Quanzhou and Zhangzhou. Fuzhou-style square beams and Quanzhou-style round beams can be found supporting the upper and lower tiers of the Da Xiong Bao Dian, while intricate Zhangzhou-style wood carvings are found on the roof of the Tian Wang Dian. Although the architectural style is primarily Fujian in origin, it also contains elements that reflect the styles of other dialect groups, such as the porcelain mosaic ornamentation, known as chien nien, found on the roof ridges of the Tian Wang Dian and Da Xiong Bao Dian is Teochew in origin. ## News articles - \"Monastery in Toa Payoh launches tome to commemorate its 120th anniversary\". [The Straits Times](/wiki/The_Straits_Times) (online). 31 December 2018. Retrieved 10 July 2022. - \"PM Lee opens replica of 1903 Dharma Hall at historic Lian Shan Shuang Lin monastery\". [The Straits Times](/wiki/The_Straits_Times) (online). 11 November 2016. Retrieved 10 July 2022. - \"Treasure trove of Chinese artefacts in Kim Keat temple\". [The Straits Times](/wiki/The_Straits_Times) (online). 10 November 2016. Retrieved 10 July 2022. - Official Website - Cultural Compass: Anthropological research of Shuang Lin Monastery - Infopedia\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:10.678224",
  "title": "Siong Lim Temple",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Siong_Lim_Temple"
}