{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:09.640992"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **may rely excessively on sources too closely associated with the subject**, potentially preventing the article from being verifiable and neutral. Please help improve it by replacing them with more appropriate citations to reliable, independent sources. *(November 2016)* *(Learn how and when to remove this message)*Some of this article's listed sources **may not be reliable**. Please help improve this article by looking for better, more reliable sources. Unreliable citations may be challenged and removed. *(November 2016)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Musical artist **Siong Leng Musical Association** is an arts company in [Singapore](/wiki/Singapore) that preserves and promotes the [Nanyin](/wiki/Nanguan_music) style of music. ## History ### Establishment as Heng Yun Ge Nanyin Association and as Yun Lu In 1901, Heng Yun Ge Nanyin Association (Horizon Cloud Pavilion), was founded by immigrants from [Southern Fujian](/wiki/Southern_Min), [China](/wiki/China) to meet the cultural need of the local Hokkien community in Singapore and the earliest Nanyin performances were then organised by the association. The association then became popular across [Malaya](/wiki/Malaysia). During the [Second Sino-Japanese War](/wiki/Second_Sino-Japanese_War), the association held fund-raising concerts for [China](/wiki/China). Due to the Japanese protesting against the fund-raising in Singapore, the British colonial government in Singapore stopped its activities as the British was neutral in the war. The disruption of activities caused internal conflicts within the association leading to its eventual disbanding. Some members of the association founded Yun Lu (Cottage of Cloud) Nanyin Association to continue to raise funds for China. The renewed fund-raising resulted in more protested by the Japanese, resulting the operating license of Yun Lu being withdrawn. ### Establishment as Siong Leng Musical Association In 1941, some of Yun Lu members established a new group in 1941 called Siong Leng Musical Association to promote Nanyin and [Liyuan opera](/wiki/Liyuan_opera). However, during the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore) during [World War II](/wiki/World_War_II), all activities were disrupted. After the war had ended, the group resumed its activities. Musical performances were organised to celebrate festivities or charity events. A musician most renowned for his contribution to Siong Leng during this time was [Quanzhou](/wiki/Quanzhou) born Teng Mah Seng (1915–1992). He composed many new Nanyin pieces and helped promoted Nanyin in Singapore. In 1970s he was appointed as chairman. As Siong Leng’s chairman, Teng worked to reform and revive Nanyin with Siong Leng by writing new lyrics and music that were livelier and more relatable. Teng received the [Cultural Medallion](/wiki/Cultural_Medallion) in 1987 due to his passion and love for Nanyin. In 1983, Siong Leng participated in the 37th [Llangollen International Musical Eisteddfod](/wiki/Llangollen_International_Musical_Eisteddfod) held in North [Wales](/wiki/Wales) and won third place in the folk solo category with Teng’s work “Reminiscence”, and fourth place in the folk ensemble category with the traditional Nanyin piece “Trotting Horse”. In 1994, Teng's son, Teng Hong Hai, took over as the chairman of Siong Leng. In 2010, Siong Leng took part in the [Llangollen International Musical Eisteddfod](/wiki/Llangollen_International_Musical_Eisteddfod) and won the first prize in the folk solo category with Teng’s work “Facets of Life”. In 2017, Siong Leng was the recipient of the inaugural Singapore Chinese Cultural Contribution Award awarded by the Singapore Chinese Cultural Centre. In 2021, Siong Leng was awarded The Stewards of Intangible Cultural Heritage Award by the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) of Singapore. Through participation in various folk and traditional music festivals around the world, the group has won many awards and international recognition. Siong Leng took part in annual performances at [Thian Hock Keng](/wiki/Thian_Hock_Keng) and the Chinese temple in [Kusu Island](/wiki/Kusu_Island), Siong Leng also regularly takes part in various contemporary music festivals in Singapore and abroad. The group also performed in their annual *Multi-sensory Banquet* with different and unique theme each year. ## Nanyin symposiums This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(May 2025)* *(Learn how and when to remove this message)* Siong Leng organised the inaugural Southeast Asia Nanyin Conference in 1977, the International Nanyin Concert & Symposium in 2000, International Youth Nanyin Concert and Symposium in 2015, as well as the International Youth Nanyin Festival in 2018. ## Performances and appearances - MAU: J-ASEAN Dance Collaboration, 2012. - Soul Journey – Cicada Zen, 2012. - Soul Journey – Nine Songs in [Esplanade Theatre Studio](/wiki/Esplanade_%E2%80%93_Theatres_on_the_Bay), 2015. - Music of the South in Cheah Kongsi, Penang, 2015. - Getai Soul, 2016. ## Awards - Third prize for Solo in [Llangollen International Musical Eisteddfod](/wiki/Llangollen_International_Musical_Eisteddfod), [Wales](/wiki/Wales), 1983. - Fourth prize for ensemble in Llangollen International Musical Eisteddfod, Wales, 1983. - First prize in Llangollen International Musical Eisteddfod 2010 with new composition by Teng Mah Seng, \"Facets of Life\". ## Publication - The Complete Book of Great Nanyin Melodies (three volumes) by Teng Mah Seng. - New Nanyin Songs: A Selection of Compositions by Teng Mah Seng. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:09.640748",
  "title": "Siong Leng Musical Association",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Siong_Leng_Musical_Association"
}