{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:14.349943"
  },
  "content": "Condominium Complex in Singapore **Sky Habitat** is a [condominium](/wiki/Condominium_(living_space)) complex located in [Bishan, Singapore](/wiki/Bishan,_Singapore). It is next to the condominium complex [Sky Vue](/wiki/Sky_Vue). ## History The site was acquired by [CapitaLand](/wiki/CapitaLand) in 2011 for $550 million, and architect [Moshe Safdie](/wiki/Moshe_Safdie) was hired to design the building. In March 2012, a month prior to the launch of the complex, based on preliminary prices received by marketing agents, the condominium was estimated to be among the most expensive suburban condominiums in Singapore. Weeks before the launch of the condominium, ERA Realty, a marketing agency, began an aggressive marketing campaign for the condominium, and were told to stop. On 11 April, it was announced that the price of the units of the condominium would drop. The building launched on 14 April, and saw almost 70% of the units sold by 15 April. However, the condominium did not sell well, having only sold an additional four units in May, and instead increased sales in other estates. The condominium relaunched in April 2014 with prices 10-15% lower than the original prices offered in 2012. The complex was completed in August 2015, with a party held on 1 August. The complex features two towers which are connected by three aerial walkways. The design of the complex allows for [cross-ventilation](/wiki/Cross_ventilation) and multiple exposures to each unit. The complex is inspired by [Habitat 67](/wiki/Habitat_67), which was also designed by Safdie. This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:14.349602",
  "title": "Sky Habitat",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sky_Habitat"
}