{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:17.995042"
  },
  "content": "Mixed-use skyscraper in Singapore **Skywaters Residences** is a 63-storey mixed-use [supertall](/wiki/Supertall) skyscraper currently under construction in the [Downtown Core](/wiki/Downtown_Core) district of [Singapore](/wiki/Singapore). Upon its completion in 2028, the 305 m (1,001 ft) tower will surpass [Guoco Tower](/wiki/Guoco_Tower) to become the [tallest building](/wiki/List_of_tallest_buildings_in_Singapore) in Singapore and the first in the country to qualify as a supertall. The development will include office spaces, retail outlets, residential units and a hotel. ## Background Jointly developed by Singapore's Perennial Holdings and [Alibaba](/wiki/Alibaba_Group), the skyscraper stands on the site of the former [AXA Tower](/wiki/AXA_Tower), which became the [tallest building to ever be voluntarily demolished](/wiki/List_of_tallest_voluntarily_demolished_buildings). The redevelopment of the AXA Towers were first announced on 7 July 2022, when redevelopment plans for a new 63-storey building with a height of 1,001 feet (305 metres) were approved by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) for a consortium consisting of Alibaba, Perennial Holdings, and local partners. This marked the new building as the tallest skyscraper ever approved to be constructed in Singapore. The mixed-use building will be mostly made up of office, hotel, and residential spaces, with an observation level and some retail space. It is planned to be completed by 2028. ## Construction and design In May 2022, AXA Tower was closed and demolition began shortly after. The new building will retain the AXA tower's foundation, to reduce materials used in the construction and to reduce environmental impact during redevelopment. A [S$](/wiki/Singapore_dollar)3 billion real estate green loan was secured by Perennial Holdings and its partners in November 2022 for the development of the site, with [sustainability construction](/wiki/Green_building) being incorporated into the design and development of the new building. Designed by [Skidmore, Owings & Merrill](/wiki/Skidmore,_Owings_%26_Merrill) and Singapore's DCA Architects, the building will feature 148,000 square metres (1,590,000 sq ft) of floor space, with 3 storeys of retail spaces, 19 storeys of offices, 3 storeys of hotel suites and 36 storeys of residential units. The building will also feature 10,000 square metres (110,000 sq ft) of green spaces, as well as a rainwater irrigation system for plants located within the green spaces. - [List of tallest buildings in Singapore](/wiki/List_of_tallest_buildings_in_Singapore) - [List of buildings](/wiki/List_of_buildings) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:17.994804",
  "title": "Skywaters Residences",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Skywaters_Residences"
}