{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:22.915293"
  },
  "content": "Diet pill brand **Slim 10** ([Chinese](/wiki/Chinese_language): 御芝堂; [pinyin](/wiki/Pinyin): *Yuzhitang*) was a popular [dieting pill](/wiki/Dieting) produced by Yuzhitang Health Products of [Guangdong](/wiki/Guangdong), [People's Republic of China](/wiki/People%27s_Republic_of_China). In 2002, the product gained notoriety for cases of [thyroid](/wiki/Thyroid) problems, [liver failure](/wiki/Liver_failure), and deaths in [Asia](/wiki/Asia) as a result of its consumption. The product label claimed that the ingredients contained only natural extracts, and was originally cleared for sale by authorities. It was tested and found to contain [fenfluramine](/wiki/Fenfluramine) and [nicotinamide](/wiki/Nicotinamide) that was banned by authorities in several Asian countries but had not been discovered in previous tests—the authorities then ordered the product to be pulled from their shelves and conducted criminal investigation. Fenfluramine is a substance that was first outlawed in the [United States](/wiki/United_States) due to associations with severe health hazards. Consequences of the product's side-effects highlighted the issue of Asian women being under immense societal pressure to lose weight at any costs, and Asian countries reviews of regulations within the slimming and pharmaceuticals industries. In its aftermath, Singapore tested all its 45 slimming products for any potentially dangerous ingredients. The spotlight was also shone on Chinese health products, which were exported and sold cheaply and largely unregulated across Asia in pharmacies, beauty parlors and spas. The manufacturer defended itself by claiming that the products linked to the incidents were the result of [imitations](/wiki/Imitation). Its company's manufacturing license was eventually revoked by the Chinese government after Slim 10 was linked to one of its own citizen's death in Guangdong. ## Impact In [Singapore](/wiki/Singapore), the high-profile liver failure of television personality [Andrea De Cruz](/wiki/Andrea_De_Cruz) sent shockwaves across the local television industry, leading to several lawsuits. De Cruz eventually won S$900,000 (US$521,460) in damages against the importer and distributor. De Cruz received an emergency transplant from boyfriend, actor [Pierre Png](/wiki/Pierre_Png), who donated half of his liver, in an exceptional case allowed by the [Ministry of Health of Singapore](/wiki/Ministry_of_Health_(Singapore)) One woman, Selvarani Raja, died after suffering from liver failure. Japan authorities reported half of its 64 reported illnesses related to liver or thyroid requiring hospitalization, and four deaths resulting from the consumption of the pill. - *\"lang_zh-TW Slim 10减肥药诉讼余波未了 - 分销商到刘珂纶父母家张贴起诉状\"*, [Lianhe Zaobao](/wiki/Lianhe_Zaobao), 1 March 2007 (Archived) - *\"lang_zh-TW 被指出卖友情 - 爱丽激动 泪洒公堂*\", 黄惠玉 and 郑碧玉, [Lianhe Zaobao](/wiki/Lianhe_Zaobao), 24 June 2003 (Archived) - *\"怀疑服减肥药致死 广东查处“御芝堂清脂素”\"*, [China News Service](/wiki/China_News_Service) on [Xinhua News Agency](/wiki/Xinhua_News_Agency), 24 January 2002\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:22.914912",
  "title": "Slim 10",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Slim_10"
}