{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:25.601869"
  },
  "content": "Singaporean government initiative The **Smart Nation** is an initiative by the [Government of Singapore](/wiki/Government_of_Singapore) to harness infocomm technologies, networks and [big data](/wiki/Big_data) to create tech-enabled solutions. ## Overview The Smart Nation was an initiative launched by Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) on 24 November 2014. In financial year 2017, the government had set aside $2.4 billion to support the initiative, which involves the government purchasing services from technology startups rather than offering grants to support them. To support development, [open data](/wiki/Open_data) is made available at government portals such as Data.gov.sg. Some areas of focus include enhancing public transport networks, enabling successful aging and ensuring a secure but open data marketplace. The Smart Nation Sensor Platform (SNSP) tracks and analyses data related to housing, amenities and public infrastructure. Former civil servant, [Peter Ong](/wiki/Peter_Ong), explained that this *“encompasses hardware like lamp-posts and public cameras, as well as software that enables sensor data exchange and data and video analytics”*. An interconnected network of 110,000 lampposts with wireless sensors will collate data that will be used for urban and operational planning, maintenance and incident response. The Smart Nation and Digital Government Office (SNDGO) and [Government Technology Agency](/wiki/Government_Technology_Agency) (GovTech) under the [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)) (PMO) lead the development of a National Digital Identity framework for online transactions between citizens and businesses, building on the current SingPass system. ## Recognition Singapore emerged top in the 2017 Global Smart City Performance Index by Juniper Research and Intel. The ranking is based on the integration of [Internet of Things](/wiki/Internet_of_things) (IoT) technologies and connected services, and which the nation came out tops in all four of the key areas measured—mobility, healthcare, public safety and productivity. ## Ministerial committee The initiative is coordinated by the SNDGO and supported by other government agencies. [GovTech](/wiki/Government_Technology_Agency) is also placed under the [Prime Minister's Office](/wiki/Prime_Minister%27s_Office_(Singapore)) (PMO) as the implementing agency of SNDGO. Collectively, the SNDGO and GovTech form the Smart Nation and Digital Government Group (SNDGG). The SNDGG is overseen by a Ministerial Committee chaired by [Teo Chee Hean](/wiki/Teo_Chee_Hean). The other members of the Ministerial Committee are [Josephine Teo](/wiki/Josephine_Teo), [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan), [Chan Chun Sing](/wiki/Chan_Chun_Sing) and [Janil Puthucheary](/wiki/Janil_Puthucheary) and will also coordinate GovTech's strategy with [Info-communications Media Development Authority](/wiki/Info-communications_Media_Development_Authority)'s (IMDA) industry development efforts. ### Ministerial Committee NoNamePosition1[Teo Chee Hean](/wiki/Teo_Chee_Hean)[Senior Minister](/wiki/Senior_Minister_of_Singapore) [Coordinating Minister for National Security](/wiki/Coordinating_Minister_for_National_Security_(Singapore))2[Josephine Teo](/wiki/Josephine_Teo)[Minister for Communication and Information](/wiki/Ministry_of_Communications_and_Information_(Singapore)#Ministers) [Second Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) Minister-in-Charge of Smart Nation and Cyber Security3[Vivian Balakrishnan](/wiki/Vivian_Balakrishnan)[Minister for Foreign Affairs](/wiki/Ministry_of_Foreign_Affairs_(Singapore)#Ministers)4[Chan Chun Sing](/wiki/Chan_Chun_Sing)[Minister for Education](/wiki/Ministry_of_Education_(Singapore)#Ministers) Minister-in-Charge of Public Service5[Janil Puthucheary](/wiki/Janil_Puthucheary)[Senior Minister of State for Communication and Information](/wiki/Ministry_of_Communications_and_Information_(Singapore)) [Senior Minister of State of Health](/wiki/Ministry_of_Health_(Singapore)) [Minister In Charge of GovTech](/wiki/Government_Technology_Agency) ## Smart Nation Initiative As part of the Smart Nation initiative, the Government of Singapore has been introducing cashless payments on a large scale. Various efforts have been made to incorporate the use of cashless payment into citizens' lives. ### Next Generation [CEPAS](/wiki/CEPAS) Ticketing In March 2017, the [Land Transport Authority](/wiki/Land_Transport_Authority) (LTA) began the Next Generation CEPAS Ticketing (CEPAS 3.0) that allowed credit/debit users to use their debit and credit cards to pay for public transportation which was launched in April 2019, and stored value cards from January 2021. It was planned to be phased out by 1 June 2024 but the decision was overturned on 23 January 2024, thus allowing the system to operate until further notice. Also, cash top-ups at the MRT passenger service centres were announced to be removed which were completed by March 2018. Single-trip tickets are also completely phased out by 2022, and all machines were replaced with Top Up Kiosks by 2022. ### Cashless system at hawker centres During the National Day Rally speech in 2017, plans for a unified cashless payment system in Singapore were unveiled, especially in regard to payments at [hawker centres](/wiki/Hawker_centre). [DBS Bank](/wiki/DBS_Bank), [OCBC Bank](/wiki/OCBC_Bank) and [United Overseas Bank](/wiki/United_Overseas_Bank), which jointly own the existing electronic transaction system NETS, had collaborated with other banks such as [HSBC](/wiki/HSBC), [Maybank](/wiki/Maybank), [Standard Chartered](/wiki/Standard_Chartered) Bank and [Citibank](/wiki/Citibank) to unify the cashless system in Singapore. Consumer from all seven banks will be able to use Nets' [QR code](/wiki/QR_code) system to make payments at hawker stalls. More than 600 stalls had implemented the system in 2017. As a subsidiary of [Land Transport Authority](/wiki/Land_Transport_Authority), contactless transport payment card operator [EZ-Link](/wiki/EZ-Link) has also partnered up with NETS to introduce e-payment methods in local hawker centres. Starting from April 2018, payment at hawker centres can be carried out using EZ-Link or Nets card using a single Nets terminal. There were mixed responses from the food vendors. Several stall owners expressed their opinions on the efficiency of the system, stating that sometimes the cashless electronic transactions do not go through, causing delays in the queue of the business. Others mentioned that the new system can prevent hygiene issues, which might occur when cash is involved. ## Surveillance concerns and issues With the gradual implementation of the Smart Nation initiatives, there are new concerns raised by security experts that the ubiquitous surveillance, with the proposed \"Lamppost-as-a-Platform\" (LaaP) with extensive facial recognition technology, could undermine individual privacy. There were also concerns that the expectation of [mass surveillance](/wiki/Mass_surveillance) by the government could also result in \"self-surveillance, self-monitoring, self-censorship\", and a general aversion to \"improvise, innovate and take risks\". The government responded by stating that the Public Sector (Governance) Act passed in January 2018 clarifies when [data sharing](/wiki/Data_sharing) is allowed across government agencies, as well as which agency is responsible for the request and sharing of data. Public servants' data access rights is given based on security clearance and authorisation. The Act also criminalises the sharing of personal data without authorisation and the using of data for self-benefit or for the re-identification of anonymised data without authorisation. The government also stated that it has no plans to use the surveillance methods for the purposes of social credit scoring or [moral policing](/wiki/Moral_police). ## Cybersecurity The failure of the government in securing data in recent years, such as in the [SingHealth data breach](/wiki/2018_SingHealth_data_breach) in July 2018, is causing critics to push for a rethink of the Smart Nation drive. - Big Data and Internet of Things are the Keys to Singapore's Smart Nation Dream - Singapore is Part of the Digital Silk Road, a Test Bed for the World: Vivian Balakrishnan - Singapore Studies to get Smarter - Singapore Prime Minister Posts His Own Puzzle-Solving Computer Code - 4 Smart Cities That Put People First - 5 Amazing Healthcare Innovations coming out of Singapore - Smart Nation Not About Technology But Boosting Quality of Life: Vivian Balakrishnan - [Prime Minister's Office Singapore](/wiki/Prime_Minister%27s_Office_(Singapore)) - Official Website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:25.601493",
  "title": "Smart Nation",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Smart_Nation"
}