{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:49:45.749724"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"SME One Asia Awards\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2023)* *(Learn how and when to remove this message)* **SME One Asia Awards** is an event that is organised by The APF Group in Singapore. Currently in its fourth year, it has a total of 350 nominations and 191 winners, and has at least 1000 attendees for the awards dinner which is held at Marina Bay Sands every year. ## History The SME One Asia Awards was established in 2011 by the APF Group Pte Ltd to recognise the businesses and their leaders’ achievements of the [Small and Medium Enterprises](/wiki/Small_and_Medium_Enterprises) in [Singapore](/wiki/Singapore), particularly the companies that have implemented the business practices that contribute to the development of people, society and the environment. Through these developments, the awards promote [sustainable growth](/wiki/Sustainable_growth) in [Singapore](/wiki/Singapore) as well as overseas. ## Background The SME One Asia Awards targets SMEs with more than S$1 million and less than S$100 million in yearly revenue. Currently, SMEs are an important part in Asia, as they help generate economic growth in Asia. Furthermore, the awards are built on a branding and publicity programme dedicated to raising the profiles and awareness of its winners. The SME One Asia Awards is also a platform in which socially responsible business leaders are given the opportunity to connect with each other, share business ideas and practices as well as growing to become an active community of socially responsible leaders. In 2012, the SME One Asia Awards ranked and judged 120 submissions, which included nominations from [China](/wiki/China), [Cambodia](/wiki/Cambodia), [Philippines](/wiki/Philippines), [Malaysia](/wiki/Malaysia) and [Indonesia](/wiki/Indonesia), of which 66 companies were selected as winners across the six award categories. In 2013, the SME One Asia Awards spanned eleven industries with 27.3% of the companies coming from the [service industry](/wiki/Service_industry), 4.6% of the companies coming from the [information technology](/wiki/Information_technology) sector, 1.5% of the companies came from the entertainment and [tourism](/wiki/Tourism) sectors, another 1.5% of the companies came from [agriculture](/wiki/Agriculture) industry, 16.7% came from the [construction](/wiki/Construction) industry, 18.2% of the companies came from distribution and [wholesale](/wiki/Wholesale) sector, 4.6% came from the electronics and engineering sector, 6.1% of the companies came from the [manufacturing](/wiki/Manufacturing) industry, a further 6.1% of the companies were in the [F&B](/wiki/F%26B) sector, 3% of the companies came from the [logistics](/wiki/Logistics) and transport industry and last but not least, 10.6% of the companies came from the [real estate](/wiki/Real_estate) sector. ## Awards This award comprises six categories, defined by the number of years the participating company has been in operation. The Distinguished Awards, for companies that have been in operation for more than 15 years. The Prominent Awards are for companies who have been in operation for more than 9 years. The Notable Awards are for companies who have been in operation for more than 5 years. The Emerging Awards are for companies who have been in operation for more than 1 year but less than 4 years. Last but not least, the Foreign Enterprise Award is given to foreign companies with a local presence and the Overseas Enterprise Award which is given to overseas businesses. In 2012, there was the introduction of the special awards category. The awards were designed to acknowledge companies with significant contributions. The Avant -Garde award is awarded to companies with creative business innovation. There is also the Hoffen award which is awarded to companies which inspire community development. ### Avant-Garde Award The Avant-Garde Award recognises companies that display business innovation and creativity, as well as companies who have effectively introduced inspiring, new and revolutionary ideas to their business models, products and/or services. Furthermore, the implementation of the ideas has to be well defined and must contribute to the company's overall business performance. In addition to that, the idea has to be original and surprising and must be able to capture imagination of people as well as the industry. One Winner of this Award was [BreadTalk](/wiki/BreadTalk) Group, who won it in 2012 ### Hoffen Award The Hoffen Award recognises the faith and commitment of companies that bring new life and revival to living spaces, as well as honouring the companies which contribute to the betterment of the environment and people's lives. This award is meant to inspire people and social groups to make a difference, and for businesses to go beyond profit making. One winner of this Award was The Fullerton Heritage who won it in 2012. ## Judging Process The participating companies undergo both quantitative and qualitative assessment from a panel of judges. The judging criterion comprises the Companies’ Sales Turnover, their Brand Value, their [Profit Margin](/wiki/Profit_Margin) / Profit per Staff, Entrepreneur Spirit / [Business Model](/wiki/Business_Model), and whether there is Responsible Leadership. ## Judges The SMEs that have been nominated for this award will have to undergo a selection process with advice and assessment from a panel of Judges/Advisors. In addition to that, the appointed panel of judges will provide insights and opinions that would add a critical dimension that will help to develop SMEs across the region. Furthermore, impartiality and confidentiality of the judging and auditing processes is ensured as an independent panel of judges/advisors from various associations, institutions and industry leaders are selected. NamePositionCompanyMr Teng Theng DarDirectorBusiness Compass ConsultancyMs Susan TehCEOST Paramount Pte LtdMr Lee Tiong HengTax PartnerDeloitte & Touché LLPMs Amy LeeDirector[UOB-Kay Hian](/wiki/UOB-Kay_Hian)Mr Tony YeoDirector[Drew & Napier](/wiki/Drew_%26_Napier) LLCMr Colin GohCEOThe Old Parliament House LtdMs Fiona MacKinnonDirectorDirect Marketing Association of SingaporeMr Henn TanChairman[Trek 2000 International](/wiki/Trek_2000_International) LtdMr Sam ChiaCEOSC Coaching Asia Pte LtdMs Penny LowCo-Chairman[Social Enterprise Association](/wiki/Social_Enterprise_Association) of SingaporeDr Martin BlakeCEOBe Sustainable Pte LtdMr Sean LeeCEOMarco Polo Marine LtdMr Seah Moon MingCo-Chairman[Temasek Polytechnic](/wiki/Temasek_Polytechnic) ## Winners ### 2011 YearAwardNumber of WinnersAward of the Year2011Distinguished award14Low Lee Yong of MHC Medical Network Pte Ltd2011Notable Award12Eldwin Chua of Paradise Group Holdings2011Prominent Award14Thomas Bon of OKH Holdings Pte Ltd2011Emerging Award13Oh Cheng San of Pin Si Kitchen2011Foreign enterprise Award7Deepakjit Singh Chatrath of Encompass Digital Media (Asia) Pte Ltd2011Total Number of Awards60 ### 2012 YearAwardsNumber of WinnersAward of the Year2012Distinguished award18Lincoln Cheng of Zouk Club2012Notable Award10Victor Lim of Rotating Offshore Solutions2012Prominent Award15Nicholas Goh of Verztec consulting Pte Ltd Vincent Teo of CT-Tech Pte Ltd 2012Emerging Award10Marcus Ong of Powerpac International Pte Ltd2012Foreign Enterprise Award4Hans Henrik Friis of Dorier Asia2012Overseas Enterprise Award5Nil2012Special Award2George Quek of BreadTalk Group Ltd and Giovanni Viterale of The Fullerton Heritage2012Honouree Award2Nil2012Total Number of Awards66 ### 2013 YearAwardsNumber of WinnersAward of the Year2013Distinguished award18Teow Boon Ling of Cargo Community Network2013Notable Award11Lim Yew Soon of EL Development Pte Ltd2013Prominent Award8Jimmy Fong Teck Loon of Epicentre Pte Ltd2013Emerging Award17Alvin Lee of Amxon Constructors Pte Ltd2013Foreign enterprise Award3Nil2013Overseas Enterprise Award8Nil2013Total Number of Awards65 ## Awards Dinner The inaugural event was held at Marina Bay Sands Grand Ballroom on 28 October 2011. It attracted 110 nominations, of which 60 companies were winners. There were 1100 guests who attended the gala awards ceremony presided over by the Guest of Honour, Mr [Seah Kian Peng](/wiki/Seah_Kian_Peng) who presented the award trophies. Several ambassadors from various countries in Asia were present to witness the ceremony. In 2012, the second Awards Dinner was held at Marina Bay Sands, with 65 winners from 9 categories with a total of 1130 guests attending the event. The guests include the winners and their guests, as well as business owners and foreign delegates. Furthermore, the guest of honour for that year was Mr Seah Kian Peng. In 2013, the third Awards Dinner was held at Marina Bay Sands, with a total of 1180 guests attending the event, the guests include the Winners and their guests, business owners, distinguished guests, ambassadors, foreign delegates, members from trade associations, government institutions, sponsors as well as partners, media partners and journalists from the various newspapers. Below is the summary of the number of awards given out for each year, including significant winners YearNumber of Awards201160201266201365201441 ## Media coverage For the SME One Asia Awards Dinner, Channel News Asia was the official media partner for the SME One Asia Awards. Other supporting media partners include The Business Times, The Straits Times and Lianhe Zaobao. Also included are the various write ups that were featured in other publications. ## Regional expansion The SME One Asia Awards 2013 includes participants from [Malaysia](/wiki/Malaysia), [Philippines](/wiki/Philippines), [Indonesia](/wiki/Indonesia), [Cambodia](/wiki/Cambodia), [South Korea](/wiki/South_Korea) and [China](/wiki/China). Supporting regional partners and their media providers are also invited for the event. ## Supporting partners Supporting Organisation: Singapore Indian Chamber of Commerce and Industry (SICCI) Official Knowledge Management Partner: Singapore Institute of Management Official Design Partner: A.S. Louken Group Pte Ltd Official Trophy Co-Sponsor: Royal Selangor International Official Media Partner: CNBC - Palma, Gabriel; Ocampo, Jose Antonio (2005), *Four Sources of De-industrialization and a New Concept of the 'Dutch Disease'* (PDF), Stanford, Calif.: Stanford University Press, retrieved 31 March 2014\n",
  "language": "en",
  "processed_at": "2026-01-12T11:49:45.749222",
  "title": "SME One Asia Awards",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/SME_One_Asia_Awards"
}