{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:26.995934"
  },
  "content": "* *Smoking in Singapore** is subjected to restrictions enacted through various legislations such as the Smoking (Prohibition in Certain Places) Act, which was first enacted in 1970. ## Prevalence In the 2017 National Health Population Survey, conducted by the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) and [Health Promotion Board](/wiki/Health_Promotion_Board), it was found that 12% of the population surveyed, aged between 18-69 years, were daily smokers; a decline from 18.3% in 1992. ### Among the youths and young adults Smoking prevalence among students in secondary schools, polytechnics, and [Institute of Technical Education](/wiki/Institute_of_Technical_Education) dropped from 8% (survey period: 2011-13) to 4% (survey period: 2014-16). Among Singapore residents aged 18-29 years, 9.9% surveyed in 2017 smoked, a decline from 17.2% in 2007. The average age of smokers who started smoking daily was 18 years old in 2017. ## Legislative history Smoking was first [banned](/wiki/Smoking_ban) in buses, cinemas and theatres in September 1970, and it was extended to indoor locations where it is frequented by most people in August 1977. After the [King's Cross fire](/wiki/King%27s_Cross_fire) in 1987, smoking was banned in the [Singapore MRT](/wiki/Singapore_MRT). On 1 July 2005, the ban was extended to bus interchanges and shelters, public toilets and public swimming complexes whereas from 1 July 2006, the ban was extended to coffee shops and [hawker centres](/wiki/Hawker_centre). On 1 July 2007, the ban was extended to entertainment nightspots, including pubs, bars, lounges, dance clubs, and nightclubs. The owner of the premises is legally responsible for the non-smoking compliance of the customers. The law allows for the construction of designated smoking rooms which can take up to 10% of the total indoor space, or outdoor smoking areas that do not exceed 20% of the outdoor refreshment area. On 1 January 2009, the ban was extended to all children's [playgrounds](/wiki/Playground), exercise areas, markets, underground and multi-story car parks, ferry terminals and jetties. It was also extended to non-air-conditioned areas in offices, factories, shops, shopping complexes and lift lobbies, and within 5 metres (16 ft) of entrances and exits. On 22 November 2010, citizens of Singapore supported the Towards Tobacco-Free Singapore online campaign. The campaign promotes a proposal (which was published in the British medical journal *Tobacco Control*) to prevent the supply of tobacco to [Singaporeans](/wiki/Singaporeans) born from the year 2000 which would result in a gradual phasing-out of tobacco in Singapore. The launch was put forward by a team consisting of a [lung cancer](/wiki/Lung_cancer) surgeon, medical officers, a university professor and a civil servant. On 15 January 2013, the ban was extended to all common areas of the residential block including link ways from bus stops to residential blocks, void decks, corridors, stairwells, stairways and multi-purpose halls, in addition to covered walkways and link ways, all pedestrian overhead bridges, 5 m from the bus stops and hospital outdoor compounds. However, the residential block smoking ban was not mandatory as there are more people smoking except when during wakes or funerals. On 1 June 2016, the ban was extended to reservoirs, as well as parks managed by [JTC](/wiki/JTC_Corporation), town councils, and [NParks](/wiki/National_Parks_Board). The ban also includes [SAF](/wiki/Singapore_Armed_Forces) and [MHA](/wiki/Ministry_of_Home_Affairs_(Singapore)) camps, where smoking is already banned. From 30 June 2017, food & beverage outlets are no longer allowed new smoking corners. On 1 October 2017, the ban was extended to autonomous universities' compounds, private hire vehicles, private education institutes, within 5m of all educational institutions, excursion buses and trishaws. On 1 January 2019, smoking was banned along the Orchard Road shopping district. Smokers can only light up within designated smoking areas in the precinct. Smoking corners in eateries within the precinct were also removed. Smokers found flouting the rules are fined a minimum 200 [Singapore dollars](/wiki/Singapore_dollar) up to a maximum of S$1000 if convicted in court, while the managers of the establishments are fined S$200 for a first offence, and S$500 for a subsequent offence. Singapore is famous for being clean, with enforced penalties for [littering](/wiki/Littering); cigarette butt littering is one of the greatest high-rise littering problems. Staff working for certain government sectors, such as the National Recycling Program, are not allowed to smoke while carrying out their duties. ### Proposed ban in private residences In 2018, it was reported by MPs that they received many complaints from their residents about second-hand smoke entering their homes from neighbouring units. This became a serious issue during the [circuit breaker lockdown in 2020](/wiki/2020%E2%80%9321_Singapore_circuit_breaker_measures), which forced many people to spend much longer at home. At the same time, smokers were not allowed to leave their homes to smoke, as it was not considered an essential purpose. It was reported that the [National Environment Agency](/wiki/National_Environment_Agency) (NEA) received 11,400 complaints related to smoking in April 2020 or 2,000 cases more than the same period of 2019. In October 2020, the Government Parliamentary Committee (GPC) for Sustainability and Environment called for a ban on residents smoking near windows or at the balconies of HDB flats and private apartments. [Louis Ng](/wiki/Louis_Ng), head of the GPC and Member of Parliament (MP) for [Nee Soon Group Representation Constituency](/wiki/Nee_Soon_Group_Representation_Constituency) (GRC) argued that second hand smoke is a “public health concern”, while at the same time noting that some 383 people in Singapore had died from second hand smoke. [Amy Khor](/wiki/Amy_Khor), Senior Minister of State in the Ministry of Sustainability and the Environment, replied that the ban will not solve the issue but the government will help to increase \"greater social responsibility\", find more ways to mediate between neighbours in such incidents, and also related agencies to better address such incidents. Enforcement of the ban will be hard as more intrusive monitoring of residents' home will be required. ## Electronic cigarettes Singapore has banned the importation, sale and distribution of electronic cigarettes since 2018. Electronic cigarettes, or known as E-cigarettes or vapes, are currently prohibited under Section 16 (1) of the Tobacco (Control of Advertisements and Sale) Act, which is enforced by the [Health Sciences Authority](/wiki/Health_Sciences_Authority) (HSA). This legislation prohibits the importation, distribution, sale or offer for sale of any confectionery or other food product or any toy or other article that is designed to resemble a tobacco product or the packaging of which is designed to resemble the packaging commonly associated with tobacco products. Those guilty of the offence are liable to a fine of up to $5,000 upon conviction. According to [Health Minister](/wiki/Ministry_of_Health_(Singapore)) [Khaw Boon Wan](/wiki/Khaw_Boon_Wan), e-cigarettes are the industry's attempt to attract new users and were marketed to appeal to younger customers, including women. Possessing, using or buying vapes carries a maximum fine of $2,000. ### 2023 In 2023, MacPherson Youth Network launched an anti-vape campaign with youth charity Bilby Community Development. Smokers who voluntarily surrender their vaping devices received a $30 gift voucher each and will not be fined by the [Health Sciences Authority](/wiki/Health_Sciences_Authority) (HSA). The campaign ended in January 2024 with 70 vapes surrendered. The [Health Promotion Board](/wiki/Health_Promotion_Board) (HPB) launched an anti-vaping campaign,***Vape is the Toxic Friend You Don't Need.*** Digital platforms, like [social media](/wiki/Social_media), and physical channels, such as advert spaces around public transport, disseminate information about the illegality of vaping, health harms, common misconceptions and channels to seek help in vape cessation, such as **iQuit**. The campaigns target youth, a demographic that the government highlighted as susceptible to social pressures and vape-marketing. ### 2025 In June 2025, the HPB released a second anti-vaping campaign, ***Don’t Toy with Your Life,*** made in collaboration with a local media company, *TBWA\\Singapore*. It focuses on the deceptive nature of vape marketing and its health impacts. Similar to the previous campaign, it adopted a relatable approach through popular culture references, to cater to its young audience. Subsequently, a third campaign, ***The Horrors of Vaping Are Real***, was released in collaboration with government health agencies. Taking on a more sombre tone, it marks a shift toward more serious cautioning about the dangers of vaping in Singapore. As of December 2025, there has been no national study on the effectiveness of these campaigns, but some research suggests it has improved awareness about vape-related harms. In July 2025, vape disposal bins were installed within [community centres](/wiki/Community_centre) around Singapore to encourage smokers to surrender their vapes. The bins were secured to prevent tampering and theft of disposed vapes. Cameras were also installed to monitor the bins as a deterrent. There were concerns that the camera footages would be used against those who disposed of their vapes through monitoring or identification as during the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore), data from the contact tracing app and token [TraceTogether](/wiki/TraceTogether) was used in the investigation of the [Punggol Field murder](/wiki/Punggol_Field_murder). HSA later clarified that there they \"will not be tracing the identities of any persons who had binned the e-vaporisers\". The [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) also planned to classify [etomidate](/wiki/Etomidate), which is currently used to lace vape juices, as a Class C drug under the [Misuse of Drugs Act (Singapore)](/wiki/Misuse_of_Drugs_Act_(Singapore)). In August 2025, during the [Singapore National Day rally](/wiki/Singapore_National_Day_rally), [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lawrence Wong](/wiki/Lawrence_Wong) said that vaping will be treated as a drug issue and will impose stiffer penalties on vaping. On 28 August, Health Minister [Ong Ye Kung](/wiki/Ong_Ye_Kung) said a third of vapers in Singapore are under 18 years old, while more than half are below 30 years old. From 2022 to 2024, about 3,100 students from primary and secondary schools, junior colleges and Millenia Institute with 800 students from the institutes of higher learning were caught vaping annually. As of late August 2025, approximately 260 schools in Singapore have been provided with nicotine test kits. Selected campuses have also implemented the use of [metal detectors](/wiki/Metal_detector) to screen for vaping devices, and schools have promoted a 'peer vigilance culture', encouraging students to report instances of vaping among their classmates. Designated staff in schools are being trained and authorised to enforce rules against the use and distribution of vaping devices, while institutes of higher learning are increasing campus patrols. Starting from 1 September 2025, stronger penalties will be imposed on vaping. Vape users faced increased fines of $500 and $700 for under 18 and adults respectively. Second time offenders will need to attend rehabilitation programme while repeat offenders will be prosecuted and fined a maximum of $2,000. The [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) also allowed schools to \"mete out disciplinary action, adjust the conduct grade of the student offender, and take educative and rehabilitative measures\" on top of penalties provided by the law. Other additional penalties for civil servants were also introduced. - [Health in Singapore](/wiki/Health_in_Singapore) - FAQs on Smoking Ban in Public Places National Environment Agency of Singapore - For Public to Voice out on Smoking Issues Smoke For What (Based in Singapore) - Information on the proposal to prevent supply of tobacco to Singaporeans born from year 2000 Towards Tobacco-Free Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:26.995621",
  "title": "Smoking in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Smoking_in_Singapore"
}