{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:49:48.120515"
  },
  "content": "Public transport operator in Singapore **SMRT Corporation** is a multi-modal [public transport](/wiki/Public_transport) operator in [Singapore](/wiki/Singapore) operating bus and [rail](/wiki/Mass_Rapid_Transit_(Singapore)) services. A subsidiary of the [Government of Singapore](/wiki/Government_of_Singapore)'s [Temasek Holdings](/wiki/Temasek_Holdings), it was established on 6 August 1987 and listed on the [Singapore Exchange](/wiki/Singapore_Exchange) from 26 July 2000 until 31 October 2016. It is one of the two major operators of Singapore's rail services along with [SBS Transit](/wiki/SBS_Transit). Besides public transport, SMRT Corporation is involved in leasing advertising and commercial spaces within the [transport network](/wiki/Transport_network) it operates, as well as in engaging operations and maintenance services, project management and engineering consultancy in Singapore and overseas. It also operates other transport services under its subsidiary Strides. ## History ### Background In 1967, city planners forecast a need for a rail-based urban transport system in Singapore by 1992. Initial opposition by prominent ministers, among them Finance Minister [Goh Keng Swee](/wiki/Goh_Keng_Swee) and Trades and Industry Minister [Tony Tan](/wiki/Tony_Tan_Keng_Yam), nearly shuttered the program due to financial grounds and concerns of jobs saturation in the construction industry. Goh instead endorsed the idea of an all-bus system recommended by Harvard University specialists, who argued would reduce the cost by 50% compared to the proposed MRT system. Public opinion was split on the matter, with several expressing concerns on the high cost and others being more focused on increasing the standard of living. Following a debate on whether a bus-only system would be more cost-effective, Communications Minister [Ong Teng Cheong](/wiki/Ong_Teng_Cheong) came to the conclusion that an all-bus system would be inadequate, as it would have to compete for road space in a land-scarce country. Ong was an architect and town planner by training and through his perseverance and dedication became the main figure behind the initial construction of the system. Singapore's MRT infrastructure is built, operated, and managed in accordance with a hybridised quasi-[nationalised](/wiki/Nationalised) regulatory framework called the New Rail Financing Framework (NRFF), in which the lines are constructed and the assets owned by the [Land Transport Authority](/wiki/Land_Transport_Authority), a statutory board of the [Government of Singapore](/wiki/Government_of_Singapore). ### Mass Rapid Transit Corporation The Mass Rapid Transit Corporation (MRTC) was established on 14 October 1983 and took over the roles and responsibilities of the former provisional Mass Rapid Transit Authority. The founding chairman was [Michael Fam](/wiki/Michael_Fam) and the first executive director was Lim Leong Geok. On 7 November 1987, the MRT Corporation commenced operating service on Singapore's first [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) (MRT) section, consisting of 5 stations from [Yio Chu Kang](/wiki/Yio_Chu_Kang_MRT_station) to [Toa Payoh](/wiki/Toa_Payoh_MRT_station). On 1 September 1995, MRTC, along with Roads & Transportation Division of the [Public Works Department](/wiki/CPG_Corporation) and Land Transportation Division of the Ministry of Communications, merged to form the [Land Transport Authority](/wiki/Land_Transport_Authority). The operations of the MRT system were regrouped under SMRT Limited, as a private state-owned company owned by the government's investment arm [Temasek Holdings](/wiki/Temasek_Holdings). ### Privatisation In 1998, ownership of the rail assets encompassing the operation of the MRT system network were transferred to SMRT Limited. The process was executed under a License and Operating Agreement, which stated the maintenance obligation of SMRT Limited covering the infrastructures and assets of the transit system. On 26 July 2000, SMRT Limited was listed on the [Singapore Exchange](/wiki/Singapore_Exchange) as SMRT Corporation, with Temasek Holdings selling 33% of its shares. In July 2001, SMRT launched a [takeover bid](/wiki/Takeover#Friendly) for Trans-Island Bus Services (TIBS) that was accepted. The transaction was completed in December 2001, with TIBS being operated as a wholly owned subsidiary. As part of a corporate rebranding programme, TIBS was rebranded as [SMRT Buses](/wiki/SMRT_Buses) in May 2004. ### Nationalisation In September 2016, Temasek Holdings completed a successful takeover bid for the 46% of SMRT that it did not own,[*why?*] which resulted in SMRT being delisted from the Singapore Exchange and returning to government control. The buy-out was approved by the [High Court of Singapore](/wiki/High_Court_of_Singapore) and the last day of trading of SMRT shares was 18 October 2016. ### After nationalisation All of SMRT's train operating assets were sold to the government under the [Land Transport Authority](/wiki/Land_Transport_Authority)'s new Rail Financing Framework. From 1 October 2016, the Land Transport Authority assumed all the rail operating assets from SMRT under the Rail Financing Framework that allows the company to focus on its operational reliability. The bus operating assets were also sold to the government under Land Transport Authority's Bus Contracting Model. Being asset light would allow SMRT to focus on the operational reliability of the public transport system and its business ventures overseas. In 2023, SMRT Corporation merged its taxi operations under Strides Taxi with Premier Taxis to form Strides Premier. ## Operations This section **needs expansion** with: To expand the section for the commercial retail leasing under subsidary Stellar Lifestyle (including collaboration with Japan Rail for Stellar@TE2), as well as Strides Premier taxi. Engineering capabilities under Strides can be elaborated as well.. You can help by expanding it. *(September 2025)* SMRT's primary business is providing public-transport services in Singapore, with operations in the following (as of 2015): - [SMRT Buses](/wiki/SMRT_Buses) – a fleet of up to 1,200 buses, serving the majority of housing estates in northern and north-western Singapore, as well as Jurong West Region (between Boon Lay, Joo Koon and Tuas) as of September 2024. - [SMRT Trains](/wiki/SMRT_Trains) – 119 stations along the [North–South](/wiki/North%E2%80%93South_Line_(Singapore)), [East–West](/wiki/East%E2%80%93West_Line_(Singapore)), [Circle](/wiki/Circle_Line_(Singapore)) and the [Thomson–East Coast](/wiki/Thomson-East_Coast_MRT_line) lines of the [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) network. Also operates 13 stations along the [Bukit Panjang LRT line](/wiki/Bukit_Panjang_LRT_line). - Media related to SMRT Corporation at Wikimedia Commons - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T11:49:48.120052",
  "title": "SMRT Corporation",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/SMRT_Corporation"
}