{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:30.007545"
  },
  "content": "Singaporean media company ***So Drama!* Entertainment** (previously SAFRA Radio) is a Singapore [media company](/wiki/Media_company) owned by [SAFRA National Service Association](/wiki/SAFRA_National_Service_Association). In their portfolio are four brands - [883Jia](/wiki/883Jia), [Power 98](/wiki/Power_98_(radio_station)), Music and Drama Company and *PIONEER*. ## *PIONEER* Owned and managed by So Drama! Entertainment, *PIONEER* provides news on the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) (MINDEF) and the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF), and general defence and defence technology news. Originally a print magazine, it went fully digital in 2019. ## Music and Drama Company The Music and Drama Company (MDC) was first formed by Defence Minister [Goh Keng Swee](/wiki/Goh_Keng_Swee) in 1973 to boost the morale of [Singapore Armed Forces](/wiki/Singapore_Armed_Forces)' soldiers through live entertainment and educating them on national duty. MDC expanded in 1992 to include a choir, a chamber ensemble and a Chinese orchestra. MDC is based in [Nee Soon Camp](/wiki/Nee_Soon_Camp) and has music studios and a dance studio. Its radio programme, Forces 55, aired on [SBC](/wiki/Mediacorp) radio between 1977 and October 1994. The radio programme ended due to the launch of Power 98. Notable former members includes rapper [Sheikh Haikel](/wiki/Sheikh_Haikel), comedian and director [Jack Neo](/wiki/Jack_Neo), singer and actor [Gurmit Singh](/wiki/Gurmit_Singh) and musical artist [Dick Lee](/wiki/Dick_Lee). ## Radio Formerly known as SAFRA Radio, it was renamed as So Drama! Entertainment in 2017. According to the company, it chose the name “So Drama!” because \"it’s a quintessentially Singaporean phrase that describes something which moves and amuses you\". The company runs two radio stations – 88.3Jia and Power 98 Love Songs. 88.3Jia began broadcast in 1995, before relaunching in 2007 as Singapore's only bilingual station in Chinese and English. Power 98, meanwhile, was founded a year earlier in 1994; it relaunched to the current name in 2019, becoming the first and only English station in Singapore dedicated to love songs 24 hours a day.[*citation needed*] Additional stations from both 88.3Jia and Power 98 can be heard through their digital portal Camokakis, which include stations dedicated to various genres like [K-pop](/wiki/K-pop) and [classic hits](/wiki/Classic_hits). In June 2025, the Camokakis app was rebranded to Kakee, adding a [loyalty program](/wiki/Loyalty_program) where users can earn \"koins\" that can be redeemed for rewards, as well as short-form video content and games. Concurrently, it was announced that So Drama would discontinue its terrestrial radio operations by 30 October 2025 at 11:59 p.m., in favour of focusing exclusively on Kakee, with its [broadcasting license and franchise to own and operate radio stations](/wiki/Broadcast_law) being cancelled and surrendered to and its former frequencies being recalled by [IMDA](/wiki/Infocomm_Media_Development_Authority). This move is very similar to what was occurred with [ABS-CBN](/wiki/ABS-CBN_Corporation)'s [MOR Philippines](/wiki/MOR_Entertainment) [stations](/wiki/List_of_ABS-CBN_Corporation_channels_and_stations#My_Only_Radio_(defunct)) in the Philippines when it was forcefully [shutdown brought about by the expiration and cancellation of its franchise](/wiki/Shutdown_of_ABS-CBN_broadcasting) five years ago. ### Internet stations StationLanguageGenreFirst air dateWebsite[883Jia](/wiki/883Jia)[Mandarin Chinese](/wiki/Singaporean_Mandarin) [English](/wiki/English_language)[Adult contemporary](/wiki/Adult_contemporary)12 June 1995Website[Power 98](/wiki/Power_98_(radio_station))[English](/wiki/English_language)[Adult contemporary](/wiki/Adult_contemporary)31 October 1994Website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:30.007199",
  "title": "So Drama! Entertainment",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/So_Drama!_Entertainment"
}