{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:32.331537"
  },
  "content": "Welfare organization in Sinagpore **Society of Moral Charities** is a voluntary welfare organisation in [Singapore](/wiki/Singapore). It is the welfare arm of Thye Hua Kwan Moral Society. It is located in High Street Centre at North Bridge Road in Singapore. The society provides home help services such housekeeping for the elderly and frail, escort services to medical facilities. It also has various centers, Moral Welfare Home, Disability Information and Referral Centre, a therapy hub, a pregnancy crisis programme (Project Cherub) and services for the visually handicapped. ## History In 2005, the Society was selected by [Ministry of Community Development, Youth and Sports](/wiki/Ministry_of_Community_Development,_Youth_and_Sports) (MCYS) to manage a new early-help centre for [autistic](/wiki/Autism) children. Tapping on trained teachers and therapists from the Moral Therapy Hub and other resources, the organisation provides rehabilitation therapy services. The programme is to help children who have any development disorder. Training and counselling will also be provided for parents and caregiver. When the [Singapore Association of the Visually Handicapped](/wiki/Singapore_Association_of_the_Visually_Handicapped) (SAVH) lost its funding from [National Council of Social Service](/wiki/National_Council_of_Social_Service) in 2005 and unable to help their clients, the society helped SAVH's existing clients as SAVH is unable to help them. It also worked with the [Singapore National Eye Centre](/wiki/Singapore_National_Eye_Centre) to help these clients. - [List of voluntary welfare organisations in Singapore](/wiki/List_of_voluntary_welfare_organisations_in_Singapore) This Singaporean organisation article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:32.331286",
  "title": "Society of Moral Charities",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Society_of_Moral_Charities"
}