{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:36.030087"
  },
  "content": "Singaporean law enforcement officer **Song Kok Hoo** (1906 – 12 May 1985) was a Singaporean law enforcement officer. He was the country's first Asian [Deputy Commissioner of Police](/wiki/Deputy_Commissioner_of_Police_(Singapore)) and served in the police force for 35 years. ## Career Prior to joining the [Singapore Police Force](/wiki/Singapore_Police_Force), Song worked as a government clerk for fourteen months. Not keen on continuing a desk-bound career, he became a probationary police inspector in July 1926. In 1950, he was awarded the Colonial Police Medal for meritorious service. In October 1953, he was promoted from Assistant Superintendent to Deputy Superintendent; he was the first Asian officer in the history of the police force to hold either position. In December 1959, he became the country's first Asian Deputy Commissioner of Police, succeeding A. R. Anderson. He retired from the police force in December 1961, after 35 years of active duty. In January 1962, he was appointed as the Chief Security Officer of the Maruzen Toyo Oil Company's refinery at Tanjong Belayar. ## Personal life Song was the youngest son of writer Song Ong Liew and his wife Gek Cham ([née](/wiki/Maiden_name) Chan). He graduated from [Raffles Institution](/wiki/Raffles_Institution) in 1925. On 18 June 1932, he married Rosaline Lee at the Singapore Presbyterian Church in [Orchard Road](/wiki/Orchard_Road). Their wedding reception for 250 guests was hosted at Adelphi Hotel. The couple had a son and three daughters. Lee died on 20 November 1968. Song was also a member of the Chinese Christian Association. After fully retiring in 1965, Song alternated between Singapore and Australia, spending about equal time in either country. He died on 12 May 1985, at the age of 79; his funeral was held three days later in [Melbourne](/wiki/Melbourne).\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:36.029725",
  "title": "Song Kok Hoo",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Song_Kok_Hoo"
}