{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:41.205428"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Songs of the Sea\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2011)* *(Learn how and when to remove this message)* **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(May 2013)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*2007 musical by Philippe Villar and Pascal Lengagne ***Songs of the Sea*** was a [multimedia](/wiki/Multimedia) show located at [Siloso Beach](/wiki/Sentosa#Siloso_Beach) on [Sentosa Island](/wiki/Sentosa), Singapore. Designed by [ECA2](/wiki/ECA2) founder, [Yves Pépin](/wiki/Yves_P%C3%A9pin), *Songs of the Sea* started its operations on 26 March 2007, a day after the [Sentosa Musical Fountain](/wiki/Sentosa_Musical_Fountain) ceased operations. The fountain is a $30 million investment by [Sentosa](/wiki/Sentosa_Development_Corporation) to enhance its entertainment product offerings and to attract more tourists. It was the world's only permanent show set in the sea – with [pyrotechnics](/wiki/Pyrotechnics) displays, water jets that could shoot up to 40 meters, [laser show](/wiki/Laser_show), flame bursts, a live 7-person cast, and an open-air viewing gallery which can accommodate 3,000 visitors. *Songs of the Sea* had its final show on 4 May 2014, and was closed to make way for a brand new multi-sensory production titled Wings of Time, which was launched on 17 June that year. ## History ### Sentosa Musical Fountain Nearly 25 years earlier, the [Musical Fountain](/wiki/Musical_Fountain) opened in 1982 and was the biggest star attraction in [Sentosa](/wiki/Sentosa) Island of the time, and the biggest fountain of its kind in Asia at that time. It went through three massive renovations throughout its lifespan of 25 years: one in 1972 (the construction of the fountain itself), the second in 1992 (major upgrading project), and the third and final one in 1999 (under a major restoration and upgrading project directed by [ECA2](/wiki/ECA2)). After operating for 25 years, the Musical Fountain became an important milestone in the history of [Sentosa](/wiki/Sentosa), when its last [Magical Sentosa](/wiki/Magical_Sentosa) show was staged on 25 March 2007. It was then shut down and subsequently demolished to make way for the [integrated resort](/wiki/Integrated_resort) – [Resorts World Sentosa](/wiki/Resorts_World_Sentosa), which now occupies the vicinity. ### Songs of the Sea As the 25-year-old [Musical Fountain](/wiki/Musical_Fountain) ceased operations on 26 March 2007, to make way for the development of [Resorts World Sentosa](/wiki/Resorts_World_Sentosa), a new musical fountain was introduced in view of the closure of [Magical Sentosa](/wiki/Magical_Sentosa). The new [multimedia](/wiki/Multimedia)/[musical fountain](/wiki/Musical_fountain) was built at [Siloso Beach](/wiki/Sentosa#Siloso_Beach) on Sentosa Island, near Beach Station. Songs of the Sea is a multimillion-dollar sea spectacular that showcases a lively display of [pyrotechnics](/wiki/Pyrotechnics), [lasers](/wiki/Lasers), water jets that could shoot up to 40 meters, flame bursts, [computer animation](/wiki/Computer_animation), captivating music and performance by a 'live' 7-person cast. ## Production and development The new multimedia/musical fountain show uses giant water-projection screens. Images are projected on these water screens to create [CGI](/wiki/Computer-generated_imagery) animations, that are shown during the show. The show features Oscar, a colourful [Pterois miles](/wiki/Pterois_miles). The iconic [Merlion](/wiki/Merlion) statue no longer plays any part during the show any more, since the [Sentosa Musical Fountain](/wiki/Sentosa_Musical_Fountain), which it had played several parts in the shows that were performed there, was demolished to make way for the new integrated resort. ### Construction Construction work on the Songs of the Sea show began in January 2006, and completed in February 2007. The show made its debut on 26 March 2007. In the first year of its operation between 26 March 2007 and 31 December 2007, Songs of the Sea was watched by 991,723 guests, which is noted by some to be considerably more than the number of visitors who watched [Magical Sentosa](/wiki/Magical_Sentosa) in the same period. This proved the show to be a huge success and favourable amongst locals and foreigners alike. A video from [ECA2](/wiki/ECA2)'s website also reveals how the construction of the show progressed until the opening date. ### Structure and equipments The beach and the sea are the stage for the show. A stretch of wooden houses was built across the shoreline to create a Malay Kampung, or more commonly known as a [kelong](/wiki/Kelong). It is actually a work of art that is 120 metres (390 ft) long, while the rest of the equipment (water jets, water screens, [lasers](/wiki/Lasers) and projectors) are being hidden at the back of the kelong. There are a total of 69 water jets capable of reaching a height of 40 m (131 ft) and flames leaping up to a height of 20 m (66 ft). There are three water screens, the central one having a diameter of nearly 40 m (131 ft). tw The show has run twice a night at 7.40 pm and 8.40 pm, and lasted 25 minutes. ### Production team - Design and Direction: [ECA2](/wiki/ECA2) directed by [Yves Pépin](/wiki/Yves_P%C3%A9pin) - Scenario and Artistic Coordination: Moïra Smith - Music and Soundtrack: Philippe Villar and Pascal Lengagne - Cartoons and Animation: Dominique Fages and Gilbert Louët - Laser Design: Claude Lifante - Content Production: Thierry Nutchey - Project Manager: Carolina Jara Pinzon - Technical Director: Guillaume Duflot - Production: Jean-Christophe Canizarès Note: None of the cast's names were revealed, as the cast members were constantly switched over the years. Only the opening day cast members have been revealed, in the credits section of the Songs of the Sea DVD. ## Plot The show starts off with Li and his friends appearing, from a [shrub](/wiki/Shrub), waving and greeting the audience. One of Li's friends, a young, unnamed Indian girl, asks Li what should they do to entertain the audience, so they thought of singing. They played four different songs of the [four different races](/wiki/Singaporean_people), which includes \"[Chan Mali Chan](/wiki/Chan_Mali_Chan)\" and also \"Munnaeru Vaalibaa\", whilst Li sits on a rock and daydreams at the [kelong](/wiki/Kelong). So his friends sing \"[Singapura, Sunny Island](/wiki/Singapura_(song))\" making Li sing his \"Magical Song\", his song causes the image of Princess Ami to appear over the kelong, but she is shown to be asleep, before her image fades away. Shocked, Li and his friends panicked at the stunning vision of Princess Ami. Oscar's friends appear to see the commotion, but making up a comical argument as a result, singing the song \"It's Me\". Oscar appears and greets Li. Oscar, unlike the [plot of Magical Sentosa](/wiki/Magical_Sentosa#Plot), he tells Li how he knew his name. Oscar explains to Li about the vision of Princess Ami, of how she was put to sleep by the enchantment of the kelong. After learning about what has happened, Li sets out to seek for Princess Ami, but Oscar continues his [monologue](/wiki/Monologue) warning to him, \"Who knows what strange encounters you may have along the way!\". Along the way he meets the 3 Lords of the Elements. The first is The Lord of Fire, with the others being The Spirit of Light and the Lady of the Sea. Li sings for all three of them and helps regain their powers which they had lost after falling into a long sleep. After each successful song, there would be a spectacular show of flame bursts, laser displays and fountain displays respectively. Li believes he should give up after many attempts of trying, but then Oscar's friends encouraged Li with the song \"You're Not in This on Your Own\". After everyone joins in the singing, and their voices awaken Princess Ami, who is seen above the kelong smiling at the audience, and as her image fades away, the fountains come to life, dancing away in celebration. After awakening Princess Ami with his singing powers, Li is congratulated by Oscar for his deed. Oscar waves the audience, Li and his friends goodbye, and the show ends with a dazzling fireworks display. ## Music A sample of the mute version of \"*You're Not in This on Your Own*\". It is played at the beginning of the show in a similar fashion to the way, \"*[Here Everybody Lives in Harmony](/wiki/Songs_and_Tunes_from_The_Original_Soundtrack_of_Magical_Sentosa#Here_Everybody_Lives_in_Harmony)*\" was used in the beginning of [Magical Sentosa](/wiki/Magical_Sentosa). The score is probably not listed as part of the original soundtrack.*Problems playing this file? See media help.* In late 2006, [ECA2](/wiki/ECA2) musicians, Philippe Villar and Pascal Lengagne made their return to compose yet another soundtrack for a Sentosa musical, the original soundtrack of *Songs of the Sea*. There has been a lack of information given by [ECA2](/wiki/ECA2) on the developmental process of the album, along with its track listing (which can be illegitimately found on the contents of the DVD recording). Thus, resulting in another dispute about the personnel and music studio crew. Despite this, it is possibly suggested that both Villar and Lengagne were attempting to create a [pastiche](/wiki/Pastiche) of their own [previous work](/wiki/Songs_and_Tunes_from_The_Original_Soundtrack_of_Magical_Sentosa). This can be evidenced by the heavy usage of the [world music](/wiki/World_music) genre in most tracks, a pastiche of [Grand Finale](/wiki/Songs_and_Tunes_from_The_Original_Soundtrack_of_Magical_Sentosa#Grand_Finale) from the Magical Sentosa music album; the reprise of \"*Magical Song*\", and also a pastiche of [Here Everybody Lives in Harmony](/wiki/Songs_and_Tunes_from_The_Original_Soundtrack_of_Magical_Sentosa#Here_Everybody_Lives_in_Harmony) too, for the tune of Li's singing with the Spirit of Light, which was a remix of Magical Song/ Because of this, it can also probably suggest that the composers are making reference to their previous involvement with [Magical Sentosa](/wiki/Magical_Sentosa). Uniquely, *Songs of the Sea's* own soundtrack is bundled along with the DVD recording of the show as a bonus. Which is unlike *Magical Sentosa's*; where the soundtrack and DVD recording were being sold separately. This resulted in both the soundtrack and the recording of the show to share the same [album art](/wiki/Album_cover). The original soundtrack listing was rather unclear to the [fan cult](/wiki/Cult_following) community. All tracks are written by Philippe Villar and Pascal Lengagne. No.TitleLength1.\"Magic Song/You're Not in This on Your Own (Not to be confused with Magical Song)\"2:132.\"It's Me\"2:053.\"He Did It\"1:244.\"Water Ballet Duet\"2:365.\"Water Princess (Pre-Show Music)\"1:44 Note: The songs listed are actually a part of a bonus section from the DVD, \"The Songs\", where the soundtrack listed is recorded along with a video of the cast members recording it in the ECA2 studio. The songs listed are also from a DVD bought in 2007, so there may be differences with newer DVDs. ## Closure After a seven-year run, *Songs of the Sea* staged its last show on 4 May 2014. During its seven-year run, it was watched by more than 8.5 million viewers. The final show featured audience interaction with the cast members and a final farewell message on the central water screen, thanking viewers for its successful seven-year run. With the closure of *Songs of the Sea*, the entire set has upgraded for its replacement show, Wings of Time Sentosa, which was launched on 17 June that year. ## Characters ### Li He is the main [protagonist](/wiki/Protagonist) of the show. He is dressed in a white shirt and brown shorts. As he was singing along the beach, he was the first few to see Princess Ami who is at first shown to be asleep. Together with Oscar the Tiger Fish and his friends, he goes on a mission to awake her. The name of the cast member who portrayed Li was not revealed, since the cast members keep switching. But, based on the Songs of The Sea DVD, the pioneer cast member that portrayed Li was Firdaus Bin Abdul Rahman. His singing was voiced by Andy Chase. ### Oscar the Tiger Fish Oscar is a colourful [Pterois miles](/wiki/Pterois_miles) (despite being recognised as a [Tigerfish](/wiki/Tigerfish), it is actually not his species), who lives in a sleeping kingdom ruled by Princess Ami under the sea. He was created based on the [first series set of 50-cent coins](/wiki/Singapore_dollar#Coins) found in Singapore. He is self-proclaimed to be the creature \"who knows many things\". He is voiced by Christian Erickson. ### Oscar's Friends Also known as the Mischievous Sea Creatures, they are the unnamed friends of Oscar. One of them is a female octopus, another a male [seahorse](/wiki/Seahorse), while the final one is a male [moonfish](/wiki/Monodactylidae). The female octopus was voiced by Christine Flowers, the seahorse was voiced by Christian Erickson, while the moonfish was voiced by Andy Chase. ### Princess Ami She was put into deep sleep for a very long time for an unknown reason. She is the ruler of an unnamed and unmentioned kingdom. She and her kingdom are at last awakened by Li and his friends' song. Her character was probably made to be a reference to Princess Pearl from [Magical Sentosa](/wiki/Magical_Sentosa), although she has no speaking or singing roles. The cast member who portrayed Princess Ami was Corinne Yam, based on the Songs of The Sea DVD. ### Li's Friends Li's friends followed him to the beach, where they discovered the sleeping Princess Ami. They are all unnamed. Their real names were also not revealed, but based on the Songs of The Sea DVD, the pioneer cast members portraying Li's friends were Suhaila Mohd Sanif, Adi Jamaludin, Richel Xie Shun Hang, Mohammed Zamri bin Ahmad Tony, Mohamed Farez Bin Mohamed Najid, and Cindy Ng Bee Ting. It was revealed in an interview with a cast member, that he was a survivor of the Cable Car Tragedy in 1983. After 24 years of fear going back to the island, he agreed to perform in \"Songs of the Sea\". He has been one of the longest-performing members. ### Lords of the Elements #### Lord of Fire He is the loud and rude ruler of the element of fire. The cast member who voiced him was Steve Croce. #### Spirit of Light She is the kind and gentle ruler of the element of light, and she is the only one of the three rulers of the elements who thanked Li for bringing her back her powers. The cast member who voiced her was Christine Flowers, and her singing voice was voiced by Sandrine Tome. #### The Lady of the Sea She is the wise ruler of the element of Water. The cast member who voiced her was Christine Flowers, and her singing voice was voiced by Sophie Leleu. - [Sentosa](/wiki/Sentosa) - [Sentosa Musical Fountain](/wiki/Sentosa_Musical_Fountain) - [Magical Sentosa](/wiki/Magical_Sentosa) - [Fountain of Wealth](/wiki/Fountain_of_Wealth) - *[Songs and Tunes from the Original Soundtrack of Magical Sentosa](/wiki/Songs_and_Tunes_from_the_Original_Soundtrack_of_Magical_Sentosa)* [*dead link*] - Official website - ECA2 Official Website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:41.205030",
  "title": "Songs of the Sea",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Songs_of_the_Sea"
}