{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:38.361497"
  },
  "content": "Singaporean lawyer (1871–1941) **[Sir](/wiki/Sir) Ong Siang Song** [KBE](/wiki/Knight_Commander_of_the_Order_of_the_British_Empire) [VD](/wiki/Volunteer_Officers%27_Decoration) ([Chinese](/wiki/Chinese_language): 宋旺相; [pinyin](/wiki/Pinyin): *Sòng Wàngxiāng*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Sòng Ōng-siang*; 14 June 1871 – 29 September 1941) was a lawyer and active citizen of the British Crown Colony of [the Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements). He was an ethnic [Chinese](/wiki/Chinese_Singaporeans) of [Hokkien](/wiki/Hokkien_people) descent as well as a third generation Hokkien [Peranakan](/wiki/Peranakan) Baba (Peranakan term for *man*) Chinese with ancestry from Zhangzhou in the [Minnan region](/wiki/Southern_Fujian) of China. He was also the first ever Asian in Singapore to be knighted. Song was noted for his contributions to the development of the Singapore civil society, and was held in esteem throughout the Colony. ## Background Song was born in Singapore to [Song Hoot Kiam](/wiki/Song_Hoot_Kiam) ([Chinese](/wiki/Chinese_language): 宋佛儉; [pinyin](/wiki/Pinyin): *Sòng Fójiǎn*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Sòng Hu̍t-khiām*), the founder of the Straits Chinese Church (now [Prinsep Street Presbyterian Church](/wiki/Prinsep_Street_Presbyterian_Church)) and Ms Phan Fung Lean, a wife from Elder Song's second marriage who was of [Thai Chinese](/wiki/Thai_Chinese) descent. He was the eldest son from Song Hoot Kiam's second marriage – the youngest of the three sons of borne from Elder Song's two marriages. As a youth, Song studied at [Raffles Institution](/wiki/Raffles_Institution) and briefly at Christian Brothers' School (now [St. Joseph's Institution](/wiki/Saint_Joseph%27s_Institution,_Singapore)). He was a brilliant student, and won the Guthrie Scholarship at the age of 12 – a record he held for five years. The young Song was disqualified from the honor of being the first Queen's Scholar - the scholarship going instead to Dr [Lim Boon Keng](/wiki/Lim_Boon_Keng) - as he was under-aged at the time of the award. He was eventually awarded the Scholarship in 1888, becoming the only Chinese Queen's Scholar to read law in England. He was an outstanding scholar at the [Middle Temple](/wiki/Middle_Temple) and [Downing College](/wiki/Downing_College) in [Cambridge](/wiki/Cambridge). In 1893, Song was called to the Bar, entering legal practice upon returning to Singapore. In that same year he set up the legal firm, *Aitken and Ong Siang* at the age of 22. Song was also a shareholder and trustee of the Anglo - Chinese Boarding School in 1904. In 1907 he married Helen Yeo ([Chinese](/wiki/Chinese_language): 楊喜娘; [pinyin](/wiki/Pinyin): *Yáng Xǐniang*) in a military wedding – the first of its kind for a Chinese in Singapore. Song was a devout [Presbyterian](/wiki/Presbyterian). When the elder Song died in 1900, he succeeded his father as church elder, actively involved in the development of the Church choir and the church magazine. He was also a volunteer preacher, and served as Chairman of The Chinese Christian Association, formed in 1889 by the Elder Song. Song played an active role in community service, and deeply concerned with the welfare of the Straits Chinese and female education. As he was effectively bilingual in Malay and English, he produced the first Romanized Malay-language newspaper, *Bintang Timor* in 1894. The paper only ran for less than a year due to lack of support. Three years later, Song and Dr Lim Boon Keng began the *Straits Chinese Magazine*, an English language newspaper which enjoyed popular support by the community for 11 years. They were later joined by [Dr Wu Lien-teh](/wiki/Wu_Lien-teh) as a fellow editor. He also founded the [Singapore Chinese Girls' School](/wiki/Singapore_Chinese_Girls%27_School) together with Lim and other prominent Straits Chinese gentlemen, in July 1899 on [Hill Street](/wiki/Hill_Street,_Singapore). The school taught Romanised Malay, Chinese, Arithmetic, Geography, Music and Sewing to equip young girls for their future roles as wives and mothers. Song continued to contribute to the society by founding the Chinese Philomathic Society, and Straits Chinese British Association, and the [Hullett Memorial Library](/wiki/Raffles_Institution#Hullett_Memorial_Library) in his alma mater [Raffles Institution](/wiki/Raffles_Institution) together with Lim in 1923. He also became the first Chinese Captain in the Chinese Volunteer Corps in Singapore. His notable work to the society earned him a place as a Nominated Member of the [Singapore's Legislative Council](/wiki/Legislative_Council_of_the_Straits_Settlements) in 1919 and again serving as Member from 1924-1927. For his outstanding work in the Colony, Song was appointed an [O.B.E.](/wiki/Order_of_the_British_Empire) in 1928, and he was later knighted as a [K.B.E.](/wiki/Order_of_the_British_Empire) in 1936. Above all the contributions made, it was his monumental work on writing and publishing the 600-page book, *[One Hundred Years' History of the Chinese in Singapore](/wiki/One_Hundred_Years%27_History_of_the_Chinese_in_Singapore)* in 1923 that earned him a significant recognition in the annals of Singapore history. It remains an invaluable work of reference on Singapore history today. Song died in 1941. ## Bibliography - Cook, John Angus Bethune (1907) *Sunny Singapore : an account of the place and its people, with a sketch of the results of missionary work*. London : E. Stock. - Clammer, J. R. (1980). *Straits Chinese Society: Studies in the sociology of Baba communities of Malaysia and Singapore*. Singapore: Singapore University Press. - Prinsep Street Presbyterian Church (1993) *Prinsep Street Presbyterian Church: 150 Years of Faithfulness, 1843-1993*. Singapore: The Church. - Song Ong Siang (1923) *One Hundred Years' History of the Chinese in Singapore*.London : J. Murray. - 'Singapore days of old : a special commemorative history of Singapore' published on the *Singapore Tatler* 10th anniversary issue (1992). Hong Kong: Illustrated Magazine. - Wright, A., & Cartwright, H. A. (eds.)(1908) *Twentieth century impressions of British Malay: its history, people, commerce, industries and resources*. London: Lloyd's Greater Britain Pub. - Singapore Chinese Girls' School, \"Our History\" - Mr Song Ong Siang; his life and work. - One Hundred Year's History of the Chinese in Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:38.361118",
  "title": "Song Ong Siang",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Song_Ong_Siang"
}