{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:43.422294"
  },
  "content": "Bus depot in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Soon Lee Bus Park\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2021)* *(Learn how and when to remove this message)* **Soon Lee Bus Depot** is an [SMRT Buses](/wiki/SMRT_Buses) [bus depot](/wiki/Bus_garage) located in [Jurong West](/wiki/Jurong_West), Singapore. It is the only multi-storey bus depot owned by [Land Transport Authority](/wiki/Land_Transport_Authority) and the depot itself consists of 3 decks for bus parking. This bus depot is also the starting point for Service 185 and Express 502, which go to Buona Vista and the Central Business District respectively. It replaced the former Jurong Bus Depot and Penjuru Bus Depot in 2002. Previously owned and operated by [SBS Transit](/wiki/SBS_Transit), Soon Lee Bus Depot was sold to the LTA in 2023 in preparation for SMRT Buses taking over the Jurong West Bus Package, which is managed from this depot. SBS Transit garaged buses for services such as 30 (Boon Lay), 99 (Joo Koon), 174 (Boon Lay) and 198 (Boon Lay) at Soon Lee Bus Depot as a tenant operator for [Ulu Pandan Bus Depot](/wiki/Ulu_Pandan_Bus_Depot) from September 2024 to December 2024, after which services 61, 172, 178, 187, 975, 983 & 991 were all moved to Soon Lee Bus Depot after SMRT Buses ended its tenancy at [Bulim Bus Depot](/wiki/Bulim_Bus_Depot), and service 30, 99, 174 and 198 moved to Bulim Bus Depot. - Interchanges and Terminals (SBS Transit) This article related to bus transport is a stub. You can help Wikipedia by expanding it. - v - t - e This article about transport in [Singapore](/wiki/Singapore) is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:43.421905",
  "title": "Soon Lee Bus Park",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Soon_Lee_Bus_Park"
}