{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:45.479915"
  },
  "content": "Shredded bamboo shoots, turnips and small dried shrimps wrapped in rice-tapioca flour skin ***Soon kueh*** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 笋粿; [traditional Chinese](/wiki/Traditional_Chinese_characters): 筍粿; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *sún-kóe*; [pinyin](/wiki/Pinyin): *sǔnguǒ*; lit. 'bamboo shoot cake'), also spelt ***soon kway***, is a type of [steamed](/wiki/Steaming) [dumpling](/wiki/Dumpling) in [Teochew cuisine](/wiki/Teochew_cuisine). The dumpling is stuffed with julienned [jicama](/wiki/Jicama), [bamboo shoots](/wiki/Bamboo_shoot), and [dried shrimp](/wiki/Dried_shrimp), and is then wrapped in a skin traditionally made of rice and [tapioca flour](/wiki/Tapioca_flour) before steaming. Soon kueh is often eaten for breakfast or as a snack, served with both [sweet soy sauce](/wiki/Sweet_soy_sauce) and [chilli sauce](/wiki/Chili_sauce_and_paste). ## Ingredients ### Dumpling wrapper The dumpling wrapper is a hot water dough primarily made by combining flour, hot water, salt, and cooking oil. Sugar may also be added. The dough is often made with a combination of different flours, as a single flour-based dough results in an overly soft dough that is not pliable and prone to breakage. Most use a combination of two flours, which may often be rice, tapioca and wheat. The types and ratios of flour used vary between recipes that change the look and texture of the cooked product. For example, a variant made with a mixture of rice and tapioca flour yields a whitish, opaque dough while another variant made with wheat and tapioca flour produces a translucent dough. A traditional Teochew-style soon kueh uses a combination of rice and tapioca flour in a four-to-one ratio to achieve a dumpling wrapper that has a glossy, crystalline finish and a slightly firm and springy texture when cooked. ### Filling Soon kueh is traditionally made with bamboo shoots as the primary ingredient of the filling, which is also its namesake. Today, most soon kueh made and sold commercially use jicama as the primary ingredient as it is cheaper and more readily available. Another reason for using jicama over bamboo shoots is for a sweeter flavour and crunchier filling. Some home recipes may include a combination of both, with varying ratios. Common additions to the filling include dried shrimp (*hae bee*), garlic, shiitake mushrooms and carrots. Black fungus and pork meat may also be added in modern variants. A vegetarian version of the filling is described by heritage researcher Kelvin Tan as originating from the Hai Inn See temple in the [Choa Chu Kang](/wiki/Choa_Chu_Kang) area of Singapore in 1950. The abbess at the time, Yang Qincai, was inspired by the vast amount of bamboo growing on temple grounds to make these dumplings, which are later sold at a nearby [kopitiam](/wiki/Kopi_tiam) and became a popular breakfast item. Garlic is omitted in this variant as [Buddhists](/wiki/Buddhism) do not consume garlic due to religious beliefs. ## Preparation methods Typical preparation of soon kueh begins with cooking the filling. The thinly sliced or julienned ingredients are stir fried in a wok and flavoured with a simple seasoning of salt and pepper and set aside to cool. To make the dough for the wrapper, hot water is gradually added to the flour combination until the dough is formed. The dough is then allowed to cool before it is kneaded until smooth. Some recipes call for salt and sugar to be added to the hot water, while others add them during kneading. Cooking oil is the last ingredient to be added to the dough before it is left to rest. The rested dough is then portioned and rolled out to form individual wrappers. The filling is then added and the dumpling is sealed. The making and rolling out of the dough is said to be the most challenging part of making the dumpling, as it affects the texture and mouthfeel of the final product. Steaming is the traditional and most common method of cooking soon kueh. An alternative method is pan-frying the dumplings to achieve a charred, crisp texture on the surface. For steamed soon kueh, additional cooking oil is brushed onto the cooked dumplings after steaming to add a shine to the wrapper and prevents them from sticking to hands and packaging. The dumpling is often served warm or hot, as the texture of the wrapper may change by hardening after cooling down. The serving of sweet soy and chilli sauces alongside the dumpling is typical of traditional Teochew-style cuisine, where condiments are paired with food that is cooked with light seasonings to both retain and enhance the fresh, natural flavours of the ingredients used. - Food portal - China portal - Singapore portal - Malaysia portal - [List of steamed foods](/wiki/List_of_steamed_foods) - [Kueh](/wiki/Kueh)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:45.479481",
  "title": "Soon kueh",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Soon_kueh"
}