{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:46.305636"
  },
  "content": "Australian missionary **Sophia Blackmore** (18 October 1857 – 3 July 1945) was an Australian [Christian missionary](/wiki/Christian_mission). She founded the [Fairfield Methodist Schools](/wiki/Fairfield_Methodist_Schools), and also [Methodist Girls' School](/wiki/Methodist_Girls%27_School,_Singapore) in [Singapore](/wiki/Singapore). She was the first unmarried woman missionary sent by the [Woman's Foreign Missionary Society of the Methodist Episcopal Church](/wiki/Woman%27s_Foreign_Missionary_Society_of_the_Methodist_Episcopal_Church) to [Singapore](/wiki/Singapore). She also set up a boarding home for girls, supported the early Methodist Straits Chinese Christian work, published a Christian periodical in [Baba Malay](/wiki/Malay_trade_and_creole_languages#Baba_Malay), and is closely associated with the founding of [Kampong Kapor Methodist Church](/wiki/Kampong_Kapor_Methodist_Church). ## Early life Born 100 miles off [Sydney](/wiki/Sydney), New South Wales, Australia, Blackmore came from a devout Christian family from Portugal who had migrated south in the 1850s. Her mother's family had had associations with missionary greats such as Robert Morrison, Robert Moffat and David Livingstone while her father was an established solicitor in New South Wales. She was one of eight children. ## Missionary work in Singapore Under the auspices of the Woman's Foreign Missionary Society (WFMS) of the American Methodist Episcopal Church as single women serving as missionaries were unusual and Blackmore's Australian church did not support such a venture. Influenced by Isabella Leonard, a visiting American missionary, Blackmore left for India on 10 December 1886 with her mind set on serving China. However, Blackmore found no permanent position when she arrived in India. Then in Madras, she met Reverend [William Oldham](/wiki/William_Fitzjames_Oldham) who had gone to India for a conference. This chance meeting opened the doors for Blackmore to contribute to the growing missionary field in Malaya. To prepare for her move, Blackmore took Malay lessons from a family in Moradabad. The couple had previously resided in Singapore. It was also in Moradabad that Blackmore was officiated into the Methodist Episcopal Church. ### Education On her arrival in Singapore on 16 July 1887, Blackmore was encouraged by the Oldhams' work which included the local Methodist Episcopal Church and the Anglo-Chinese School at Coleman Street. Within a month, Blackmore helped open a school for Tamil girls. This was opened on 15 August 1887, with the support of the Reverend Oldham, several members of the Indian community, and a teacher named Alexander Hagedorn (Mrs. Alexander Fox). Known originally as the Tamil Girls' School, the school was later renamed the Methodist Girls' School. The school started in a small shophouse on Short Street. By 1925 the school was overcrowded, which precipitated a move to Mount Sophia, where it remained there until 1992 before being moved to its current location. Visiting homes by horse carriage in the estates bounded by Telok Ayer and Neil Road, she was led to the establishment of a second school for girls. Businessman [Tan Keong Saik](/wiki/Tan_Keong_Saik), along with other influential Chinese families, had persuaded her to teach their daughters – an uncommon request as girls were not a priority for education amongst the Chinese then. A widow, Nonya Boon, later offered Blackmore her home along Cross Street to start a school for girls. Beginning with just eight girls, the Anglo-Chinese Girls' School began in August 1888. Under the leadership of Emma Ferris, who was principal from 1892 to 1894, the school grew and eventually became the Fairfield Methodist Girls' School. In 1983, the school went [co-educational](/wiki/Mixed-sex_education) and the school was renamed as the Fairfield Methodist Secondary School. Entrusted with the care of a young girl when she first arrived in Singapore, Blackmore saw the need for a home for girls. Thus on 1 May 1890, a boarding home was set up for girls. First located at Sophia Road, the home moved several times along locations up the hill until its move to a bungalow at No. 4 Sophia Road. The house stood at the pinnacle of the hillock with a bird's eye view of the city. It was known initially as the Deaconess Home because it also housed many single lady missionaries and teachers. It is now more familiarly known as Nind Home (1912) after [Mary Clarke Nind](/wiki/Mary_Clarke_Nind). The home served as a residence to many of the school-going girls and several runaways, *mui tsais*, abandoned girls, and orphans. The Blackmore's girls, as they became known, were nurtured in the Christian faith and became suitable mates for Christian boys from similar homes in Malacca and Singapore. ### Churchwork To help her in her work, a certain Encik Ismail taught the young Blackmore High Malay. However, a form of market Malay was used as the lingua franca by the various races that poured into Singapore at the turn of the 20th century. Blackmore had therefore to adapt her knowledge of Malay in her work with the Indians, Malays, and the [Straits Chinese](/wiki/Peranakan). She became proficient enough in local street Malay to translate hymns and published the Baba Malay periodical, Sahabat using William Shellabear's printing press; the paper was originally meant for women, but it became so popular that its distribution eventually went beyond Penang. In 1894, Blackmore's home became the base for a Straits Chinese church headed by Goh Hood Keng, beginning with just six members and 16 probationers. Prior to this, Blackmore had already been preaching regularly in Malay on Sundays to girls from the Nind Home. She also preached to the Epworth boys' home, and workers from the Missionary Press. Blackmore would accompany Reverend Goh and Dr. Benjamin F. West to preach in the open-air at [Telok Ayer](/wiki/Telok_Ayer). By 1901, the blossoming Straits Chinese church had grown large enough to move to the Christian Institute at Middle Road, and eventually moving to Kampong Kapor, when it was renamed the Straits Chinese Methodist Church, and eventually Kampong Kapor Methodist Church. The [Kampong Kapor Methodist Church](/wiki/Kampong_Kapor_Methodist_Church) thus traces beginnings to Blackmore's early preaching work in the 1890s. The Bible Women's Training School was organised to train local women to carry on the duties of Christian social work that had already been established. Blackmore was the first to head it between 1901 and 1903. The School trained Eurasian ladies and gradually Chinese women from various parts of Malaya, in-home visitation. The Bible Women's Training School was considered ahead of its time in developing local, self-supporting work. Blackmore retired to Australia in 1927 though she did make several visits to Singapore prior to the outbreak of [World War II](/wiki/World_War_II). - [William Fitzjames Oldham](/wiki/William_Fitzjames_Oldham) - [Methodist Girls' School](/wiki/Methodist_Girls%27_School,_Singapore) - [Fairfield Methodist Schools](/wiki/Fairfield_Methodist_Schools) ## Bibliography - Doraisamy, T. R. (Ed.). (1987). Sophia Blackmore in Singapore: Educational and missionary pioneer 1887–1927. Singapore: Singapore:General Conference Women's Society of Christian Service, Methodist Church of Singapore. - Fairfield Methodist Secondary School. (2006). History. Retrieved 10 September 2008, from Fairfield Methodist Secondary School - Ho, Seng Ong. (1965). Methodist schools in Malaysia: Their record and history (p. 66). Petaling Jaya: Board of Education, Malaya Annual Conference. - Koh, T....et al. (Eds.) (2006). Singapore: The encyclopedia (p. 65). Singapore: Editions Didier Millet with the National Heritage Board. - Sng, B. E.K. (2003). In His good time: The story of the church in Singapore, 1819–2002 (pp. 112–114, 118, 120, 160). Singapore: Bible Society of Singapore : Graduates' Christian Fellowship.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:46.305256",
  "title": "Sophia Blackmore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sophia_Blackmore"
}