{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:48.446239"
  },
  "content": "* *Sophia Flats** is a condominium on Wilkie Road in [Rochor, Singapore](/wiki/Rochor). The building, which was completed in 1920, has been gazetted for conservation. ## Description The three-storey building, which was painted in yellow and made with modern reinforced concrete, as well as infill brick and plaster walls, curves along the junction of Wilkie Road and Niven Road. It features a recessed ground floor, which allows for a \"continuous\" [five-foot way](/wiki/Five-foot_way). The building also feature \"large\" overhangs, tall ceilings and ventilators that were placed above windows. It houses 19 residential units. ## History The building was completed in 1920 by a Mr. Maricar, a \"[Mohammedan](/wiki/Mohammedan) Indian\", and was later acquired by Japanese company Ichigoya. The building was then purchased by F. J. DeWitt, a general manager of the Borneo Sumatra Trading Company. It was sold for $122,000 on 2 March 1948 following DeWitt's departure from the colony. It was estimated that, had the building been constructed in that year, it would have cost $300,000. Frank Benjamin, the founder of retail company FJ Benjamin, was born and lived in one of the building's units until the 1950s. In 1959, he established his first office in the building. In August 2007, it was announced that the building's owners, which was then a \"low-profile Singaporean family\", had put it up for sale for $7.5 million. It then housed eight residential units and four office units. The building was later gazetted for conservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), who placed it within the Mount Sophia Secondary Settlement conservation area. 1°18′08″N 103°50′56″E﻿ / ﻿1.30214°N 103.84889°E﻿ / 1.30214; 103.84889\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:48.445876",
  "title": "Sophia Flats",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sophia_Flats"
}