{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:54.257334"
  },
  "content": "Family of sound cards by Creative Technology **Sound Blaster** is a family of [sound cards](/wiki/Sound_card) and audio peripherals designed by [Creative Technology/Creative Labs](/wiki/Creative_Technology) of [Singapore](/wiki/Singapore). The first Sound Blaster card was introduced in 1989. Sound Blaster sound cards were the [de facto standard](/wiki/De_facto_standard) for consumer audio on the [IBM PC compatible](/wiki/IBM_PC_compatible) [platform](/wiki/System_platform) until the widespread transition to [Microsoft](/wiki/Microsoft) [Windows 95](/wiki/Windows_95) and the integration of commoditized audio electronics in PCs. Windows 95 standardized the programming interface at the application level and thereby eliminated the importance of [backward compatibility](/wiki/Backward_compatibility) with Sound Blaster cards. By 1995, Sound Blaster cards had sold over 15 million units worldwide and accounted for seven out of ten sound card sales. To date, Sound Blaster has sold over 400 million units, and their current product lineup includes [USB](/wiki/USB)-powered [DACs](/wiki/Digital-to-analog_converter) as well as other audio adapters. ## Creative Music System and Game Blaster ### Creative Music System This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(December 2023)* *(Learn how and when to remove this message)* The history of Creative [sound cards](/wiki/Sound_card) started with the release of the Creative Music System (\"C/MS\") CT-1300 board in August 1987. It contained two [Philips SAA1099](/wiki/Philips_SAA1099) integrated circuits, which, together, provided 12 channels of [square-wave](/wiki/Square_wave_(waveform)) \"bee-in-a-box\" stereo sound, four channels of which can be used for noise. These ICs were featured earlier in various popular electronics magazines around the world. For many years Creative tended to use off-the-shelf components and manufacturers' reference designs for their early products. The various integrated circuits had white or black paper stickers fully covering their tops to hide their identities. On the C/MS board in particular, the Philips chips had white pieces of paper with a fictitious \"CMS-301\" inscription on them. Real Creative parts usually had consistent **CT *number*** references. Surprisingly, the board also contained a large 40-pin DIP integrated circuit bearing a \"CT 1302A CTPL 8708\" (Creative Technology Programmable Logic) [serigraphed](/wiki/Screen-printing) inscription and looking exactly like the DSP of the later Sound Blaster. Software, including Creative's own, use this chip to automatically detect the card (by trying certain register reads and writes). ### Game Blaster This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(December 2023)* *(Learn how and when to remove this message)* A year later, in 1988, Creative marketed the C/MS via [Radio Shack](/wiki/Radio_Shack) under the name **Game Blaster**. This card was identical in every way to the precursor C/MS hardware. Whereas the C/MS package came with five floppy disks full of utilities and song files, Creative supplied only a single floppy with the basic utilities and game patches to allow [Sierra Online](/wiki/Sierra_Online)'s games using the [Sierra Creative Interpreter](/wiki/Sierra_Creative_Interpreter) engine to play music with the card and it also included a later revision of the game [Silpheed](/wiki/Silpheed) that added C/MS support. ## First generation Sound Blasters, 8-bit ISA & MCA cards ### Sound Blaster 1.0, CT1310, CT1320A, CT1320B The Sound Blaster 1.0 (code named \"**Killer Kard**\"), CT1320A, was released in 1989. In addition to Game Blaster features, it has a 9-voice (11 voices in drum mode) [FM synthesizer](/wiki/Frequency_modulation_synthesis) using the [Yamaha YM3812](/wiki/Yamaha_YM3812) chip, also known as [OPL2](/wiki/OPL2). It provided compatibility with the market leader [AdLib](/wiki/AdLib) sound card, which had gained support in PC games in the preceding year. Creative used the \"DSP\" acronym to designate the digital audio part of the Sound Blaster. This stood for Digital Sound Processor, rather than the more common [digital signal processor](/wiki/Digital_signal_processor), and is a simple microcontroller from the [Intel](/wiki/Intel) [MCS-51](/wiki/MCS-51) family (supplied by Intel and [Matra MHS](/wiki/Matra), among others). It can play back 8-bit [monaural](/wiki/Monaural) [sampled sound](/wiki/Sampling_(signal_processing)) at up to 23 [kHz](/wiki/KHz) [sampling frequency](/wiki/Sampling_frequency) and record 8-bit at up to 12 kHz. The sole DSP-like features of the circuit are [ADPCM](/wiki/ADPCM) decompression and a primitive non-MPU-401-compatible MIDI interface. The ADPCM decompression schemes supported are 2 to 1, 3 to 1 and 4 to 1. The CT1320B variety of the Sound Blaster 1.0 typically has C/MS chips installed in sockets rather than soldered on the PCB, though units do exist with the C/MS chips soldered on. Some sources note that the original Sound Blaster 1.0 was produced under the CT1310 number. This however is a topic of ongoing debate. Creative refers to CT1310 for the Sound Blaster 1.0 on its website. In less than a year, the Sound Blaster became the top-selling expansion card for the PC. It achieved this by providing an AdLib-compatible product, with additional features, for the same, and often lower, price. The inclusion of a [game port](/wiki/Game_port) was important to its early success. PCs of this era did not include a game port. Game port cards were costly (around US$50) and used one of the few expansion slots PCs had at the time. Given the choice between an AdLib card or a fully-compatible Sound Blaster card that came with a game port, saved a slot, and included the \"DSP\" for not much more in price, many consumers opted for the Sound Blaster. In-game support for the digital portion of the card did not happen until after the Sound Blaster had gained dominance. When Microsoft announced [Multimedia PC](/wiki/Multimedia_PC) (MPC) in November 1990, it suggested to developers that they use the Sound Blaster as it was the only sound card that came close to complying with the MPC standard. The press speculated that Microsoft based the MPC standard on the Sound Blaster's specifications. By 1993 *Computer Gaming World* wondered \"why would a gamer\" buy a competing AdLib card that was not Sound Blaster-compatible. Creative advertised the Sound Blaster 16 (\"the 16-bit sound standard\") with the slogan \"Get Real\", emphasizing its \"real 100% Sound Blaster compatibility\" and rhetorically asking \"why those other manufacturers spend so much time comparing themselves to Sound Blaster\". #### Reception *[Compute!](/wiki/Compute!)* in 1989 stated that with Sound Blaster, \"IBM-compatible computers have taken the lead in sound and music for personal computers\". Naming it a Compute! Choice, the magazine described the quality of the opening music of *[Space Quest III](/wiki/Space_Quest_III)* with the card as \"extraordinary\", praising the quality compared to the [Roland MT-32](/wiki/Roland_MT-32) and Ad Lib versions. *Compute!* approved of the card's [DMA](/wiki/Direct_memory_access) and Creative's dissemination of technical information, and concluded that while the more-expensive MT-32 was superior, Sound Blaster's audio quality was better than that of Ad Lib or Game Blaster. ### Sound Blaster 1.5, CT1320C, CT1320U Released in 1990, the Sound Blaster 1.5, CT1320C, dropped the C/MS chips, which were no longer popular with game developers. Instead, the board had two empty sockets, which could be user upgraded by purchasing the C/MS chips directly from Creative or Phillips SAA-1099s from another source. Otherwise the card functions identically to the Sound Blaster 1.0. The CT1320U variety has the same layout as the CT1320C. ### Sound Blaster 2.0, CT1350 The final revision of the original Sound Blaster, the Sound Blaster 2.0 was released in October 1991, CT1350, added support for \"[auto-init](/wiki/Intel_8237#Modes)\" [DMA](/wiki/Direct_memory_access), which assisted in producing a continuous loop of [double-buffered](/wiki/Double-buffering) sound output. Similar to version 1.0 and 1.5, it used a 1-channel 8-bit DAC. However, the maximum sampling rate was increased to 44 kHz for playback, and 15 kHz for record. The DSP's MIDI UART was upgraded to [full-duplex](/wiki/Full-duplex) and offered [time stamping](/wiki/Time_stamp) features, but was not yet compatible with the [MPU-401](/wiki/MPU-401) interface used by professional MIDI equipment. The Sound Blaster 2.0's [PCB](/wiki/Printed_circuit_board)-layout used more highly integrated components, both shrinking the board's size and reducing manufacturing cost. Owners of previous revision Sound Blaster boards could upgrade their board by purchasing the V2.00 DSP chip from Creative Labs, and swapping the older DSP V1.0x with the newer replacement. The upgraded board gained the auto-init DMA and new MIDI capabilities of the Sound Blaster 2.0 but not the expanded sampling rates. The upgrade was necessary for full compatibility with the [Windows 3.0](/wiki/Windows_3.0) Multimedia Extensions upgrade. ### Sound Blaster MCV, CT5320 Sound Blaster MCV, CT5320, was a version created for [IBM](/wiki/IBM) [PS/2](/wiki/IBM_Personal_System/2) [Model 50](/wiki/IBM_PS/2_Model_50) and higher and their ISA-incompatible [Micro Channel architecture](/wiki/Micro_Channel_architecture). The MCV Sound Blaster has some issues outputting audio while running on PS/2s with CPUs running faster than 16 MHz. However, the joystick interface is still inoperable on PS/2s it was designed for due to the slow-speed Schottky chips that have been installed. None of these timing issues affect the Yamaha YM3812. Some of the MCV Sound Blasters were released with faster Schottkys which eradicated some of the problems. ## Second-generation Sound Blasters, 16-bit ISA & MCA cards ### Sound Blaster Pro, CT1330 Model CT1330, announced in May 1991, was the first significant redesign of the card's core features, and complied with the Microsoft MPC standard.. The Sound Blaster Pro supported faster digital input and output sampling rates (up to 22.05 kHz stereo or 44.1 kHz mono), added a \"[mixer](/wiki/Sound_card_mixer)\" to provide a crude master volume control (independent of the volume of sound sources feeding the mixer), and a crude high pass or low pass filter. The Sound Blaster Pro used a pair of [YM3812](/wiki/Yamaha_YM3812) chips to provide stereo music-synthesis (one for each channel). The Sound Blaster Pro was fully backward compatible with the original Sound Blaster line, and by extension, the [AdLib](/wiki/AdLib) sound card. The Sound Blaster Pro was the first Creative sound card to have a built-in [CD-ROM](/wiki/CD-ROM) interface. Most Sound Blaster Pro cards featured a proprietary interface for a [Panasonic](/wiki/Panasonic) ([Matsushita MKE](/wiki/Panasonic_CD_interface)) drive. The Sound Blaster Pro cards are basically 8-bit ISA cards, they use only the lower 8 data bits of the ISA bus. While at first glance it appears to be a 16-bit ISA card, it does not have 'fingers' for data transfer on the higher \"AT\" portion of the bus connector. It uses the 16-bit extension to the ISA bus to provide the user with an additional choice for an IRQ (10) and DMA (0)m channel only found on the 16-bit portion of the edge connector. A short lived joint developed project between Creative and Tandy resulted in the Creative/Tandy Multimedia Sound Adapter, 849–3030. This Sound Blaster Pro derived card was factory installed in Tandy Multimedia PCs. It combined the CT1330 with Tandy joystick and MIDI ports (not MPU-401 compatible). ### Sound Blaster Pro 2, CT1600 The revised version, the Sound Blaster Pro 2, CT1600, replaced the YM3812s with a more advanced Yamaha [YMF262](/wiki/YMF262) (*OPL3*). Otherwise it is functionally identical to the original Sound Blaster Pro. Shortly after the release of the Sound Blaster Pro 2 version, Creative discontinued the original Sound Blaster Pro. The Sound Blaster Pro 2 was also sold with the following on-board [CD-ROM](/wiki/CD-ROM) controllers: - Sound Blaster Pro 2, [SCSI](/wiki/SCSI), CT1610 - Sound Blaster Pro 2, [LMSI](/wiki/Laser_Magnetic_Storage_International), CT1620 - Sound Blaster Pro 2, [Sony](/wiki/Sony), CT1690 - Sound Blaster Pro 2, [Mitsumi](/wiki/Mitsumi), CT2600 Packaged Sound Blaster cards were initially marketed and sold into the retail-channel. Creative's domination of the PC audio card business soon had them selling the Sound Blaster Pro 2 [OEM](/wiki/Original_equipment_manufacturer), CT1680, to customers for integration into pre-assembled PCs. Creative also sold Multimedia Upgrade Kits containing the Sound Blaster Pro. The kit bundled the sound card, a Matsushita CD-ROM drive (model 531 for single-speed, or 562/3 for the later double-speed (2x) drives), and several CD-ROMs of multimedia software titles. As CD-ROM technology was new, the kit included CD-ROM software, representing a very good value to customers. One such kit, named \"OmniCD\", included the 2x Matsushita drive along with an ISA controller card and software, including [Software Toolworks](/wiki/The_Software_Toolworks) Encyclopedia and [Aldus PhotoStyler](/wiki/Aldus_PhotoStyler) SE. It was compliant with the [MPC Level 2](/wiki/Multimedia_PC) standard. ### Sound Blaster Pro 2 MCV, CT5330 The Sound Blaster Pro 2 MCV, CT5330, was a version created for [IBM](/wiki/IBM) [PS/2](/wiki/IBM_Personal_System/2) model 50 and higher and their [MicroChannel](/wiki/MicroChannel) bus. ## Third generation Sound Blasters, 16-bit ISA cards ### Sound Blaster 16 The next model, the Sound Blaster 16, announced in June 1992, introduced: - 16-bit [CD-quality](/wiki/CD-quality) [digital audio](/wiki/Digital_audio); - An [MPU-401](/wiki/MPU-401) compatible [UART](/wiki/UART) via [game port](/wiki/Game_port); - A connector for the [Wave Blaster](/wiki/Creative_Wave_Blaster), a '[Wavetable](/wiki/Sample-based_synthesis)' daughterboard. Eventually this design proved so popular that Creative made a PCI version of this card. Creative's audio revenue grew from $40 million per year to nearly $1 billion following the launch of the Sound Blaster 16 and related products. Rich Sorkin was General Manager of the global business during this time, responsible for product planning, product management, marketing and OEM sales. Moving the card off the ISA bus, which was already approaching obsolescence, meant that no line for host-controlled ISA DMA was available, because the PCI slot offers no such line. Instead, the card used PCI [bus mastering](/wiki/Bus_mastering) to transfer data from the main memory to the D/A converters. Since existing DOS programs expected to be able to initiate host-controlled ISA DMA for producing sound, backward compatibility with the older Sound Blaster cards for DOS programs required a software driver work-around; since this work-around necessarily depended on the [virtual 8086 mode](/wiki/Virtual_8086_mode) of the PC's CPU in order to catch and reroute accesses from the ISA [DMA controller](/wiki/DMA_controller) to the card itself, it failed for a number of DOS games that either were not fully compatible with this CPU mode or needed so much free [conventional memory](/wiki/Conventional_memory) that they could not be loaded with the driver occupying part of this memory. In [Microsoft Windows](/wiki/Microsoft_Windows), there was no problem, as Creative's Windows driver software could handle both ISA and PCI cards correctly. ### Sound Blaster ViBRA16 The Sound Blaster ViBRA16 was an inexpensive single-chip implementation of the [Sound Blaster 16](/wiki/Sound_Blaster_16) for the [OEM](/wiki/Original_equipment_manufacturer) market. Creative Labs also used this chip for the Sound Blaster 32, Phone Blaster and Phone Blaster 28.8 (VIBRA plus modem, CT3120 and CT3220.) and many other value-edition cards. External Yamaha OPL3 FM music synthesis was retained in earlier boards built around the ViBRA16 or ViBRA16s controllers, whilst the later (and more common) ViBRA16 boards used CQM (Creative Quadratic Modulation) developed by [E-mu Systems](/wiki/E-mu_Systems). This series included the ViBRA16 (CT2501), ViBRA16s (CT2502, CT2504), ViBRA16c (CT2505) [PnP](/wiki/Legacy_Plug_and_Play) and ViBRA16XV (CT2511) chips. The primary advantage of the ViBRA16 was the inclusion of a 14.4 kbit/s telephony Modem; it also functioned as a telephone. ## Fourth generation Sound Blasters, 16-bit ISA cards, dynamic sample-based synthesis ### Sound Blaster AWE32 Released in March 1994, the *Sound Blaster AWE32 (Advanced WavEffects)* introduced an all new MIDI synthesizer section based on the EMU8000. The *AWE32* consisted of two distinct audio sections; the Creative digital audio section (audio [codec](/wiki/Codec), optional CSP/ASP chip socket, Yamaha OPL3), and the [E-mu](/wiki/E-mu) MIDI synthesizer section. The synthesizer section consisted of the EMU8000 sampler and effects processor, an EMU8011 1 [MB](/wiki/Megabyte) sample ROM, and 512 [KB](/wiki/Kilobyte) of sample RAM (expandable to 28 MB). To fit the new hardware, the AWE32 was a full-length [ISA card](/wiki/ISA_card), measuring 14 in (360 mm). ### Sound Blaster 32 A derivative of the AWE32 design, the *Sound Blaster 32* (SB32) was a value-oriented offering from Creative. Announced on June 6, 1995, the SB32 became the new entry-level card in the AWE32 product-line (previously held by the *AWE32 Value*.) The SB32 retained the AWE32's EMU8000/EMU8011 MIDI-synthesis engine and built-in instrument ROM, but dropped the onboard [RAM](/wiki/RAM), the [Wave Blaster](/wiki/Creative_Wave_Blaster) header, and the CSP port. The SB32 used the *Vibra* chip to reduce component count, which meant bass/treble/gain control was limited compared to the AWE32. The loss of onboard RAM is offset by the inclusion of [30-pin SIMM](/wiki/SIMM) RAM sockets, which allow up to 28 MB RAM to be installed and used by the EMU engine. ### Sound Blaster AWE64 The AWE32's successor, the *Sound Blaster AWE64* (November 1996), was significantly smaller, being a \"half-length ISA card\" (that term is misleading—see the pictures for size comparison). It offered similar features to the AWE32, but also had a few notable improvements, including support for greater [polyphony](/wiki/Polyphony), although this was a product of 32 extra software-emulated channels (the additional channels could also be obtained on AWE32 hardware by using the AWE64's driver software). The 30-pin [SIMM](/wiki/SIMM) slots from AWE32/SB32 were replaced with a proprietary memory format which could be (expensively) purchased from Creative. The main improvements were better compatibility with older SB models, and an improved [signal-to-noise ratio](/wiki/Signal-to-noise_ratio). The AWE64 came in two versions: A standard version (later rebranded as *Value*) with 512 KB of RAM and a Gold version with 4 MB of RAM and a separate [S/PDIF](/wiki/SPDIF) output. ## Fifth generation Sound Blasters, PCI cards, multi-channel and F/X ### Ensoniq AudioPCI-based cards In 1998, Creative acquired [Ensoniq Corporation](/wiki/Ensoniq_Corporation), manufacturer of the AudioPCI, a card popular with [OEMs](/wiki/Original_equipment_manufacturer) at the time. It was a full-featured solution with [wavetable](/wiki/Table-lookup_synthesis) MIDI ([sample-based synthesizer](/wiki/Sample-based_synthesis)), 4-speaker [DirectSound3D](/wiki/DirectSound3D) surround sound, [A3D](/wiki/A3D) emulation, and [DOS](/wiki/DOS) [legacy support](/wiki/Legacy_support) via a [terminate-and-stay-resident program](/wiki/Terminate-and-stay-resident_program). It was cheap due to lack of hardware acceleration. It is full-duplex but at least in MS Windows it cannot play back several sources at once. Creative released many cards using the original AudioPCI chip, [Ensoniq ES1370](/wiki/Ensoniq_ES1370), and several boards using revised versions of this chip ([ES1371](/wiki/ES1371) and [ES1373](/wiki/ES1373)), and some with Creative-labeled AudioPCI chips. Boards using AudioPCI tech are usually easily identifiable by the board design and the chip size because they all look quite similar. Such boards include **Sound Blaster PCI64** (April 1998), **PCI128** (July 1998), **Creative Ensoniq AudioPCI**, **Vibra PCI** and **Sound Blaster 16 PCI**. An ES137x chip contains three stereo sample rate converters, some buffers and a PCI busmaster interface. Analogue interfacing is done by a codec chip, which runs at a fixed sampling frequency of 44 (Ensoniq Audio PCI) or 48 kHz (Creative's versions). (ISA soundcards had not resampled but switched between different time bases.) ES137x do not support [SoundFonts](/wiki/SoundFont) but a filter-less MIDI engine with [wavetable](/wiki/Table-lookup_synthesis) ([sample](/wiki/Sample-based_synthesis) table) sets of 2, 4, and 8 MB size. ### Sound Blaster Live! When the *Sound Blaster Live!* was introduced in August 1998, the use of a programmable [digital signal processor](/wiki/Digital_signal_processor) in PC-audio was not unprecedented, as IBM had already done that with cheap [Mwave](/wiki/Mwave) sound- and modem-cards and [Turtle Beach](/wiki/Turtle_Beach_Systems) with their professional Hurricane soundcards. The Live! was built around Creative's new EMU10K1 chip, which contained 2.44 million transistors and was advertised of processing a flashy 1,000 [MIPS](/wiki/Million_instructions_per_second). The EMU10K1 (and its successors) did not use on-card RAM/ROM storage for instrument samples, instead it used a PCI busmaster interface to access sample-data stored in the host-PC's system memory. A/D- and D/A- converters as well as analogue mixing is done by an AC'97 chip running at 48 kHz sampling rate. All members of the SB Live! family have at least four-channel analog audio outputs and a 15-pin MIDI/Joystick multiport. For game titles, *EAX* 1.0 (and later 2.0) ([environmental audio extensions](/wiki/Environmental_audio_extensions), which briefly competed with the now defunct [A3D 2.0](/wiki/A3D)) added hardware-accelerated acoustic effects. The EMU10K1 provided high-quality 64-voice [sample-based synthesizer](/wiki/Sample-based_synthesis) (marketed as \"Wavetable\"), with self-produced or third-party customized patches or \"Soundfonts\", and the ability to resample the audio output as input and apply a range of real-time DSP effects to any set of audio [subchannels](/wiki/Subchannel) present in the device. The first model and flagship of the SB/Live family was the *SB Live! Gold*. Featuring gold tracings on all major analog traces and external sockets, an [EMI](/wiki/Electromagnetic_interference)-suppressing printed circuit board [substrate](/wiki/Printed_circuit_board) and [lacquer](/wiki/Lacquer), the Gold came standard with a daughterboard that implemented a separate 4-channel alternative [mini-DIN](/wiki/Mini-DIN_connector) digital output to Creative-branded internal-[DAC](/wiki/Digital-to-analog_converter) speaker sets, a S/P-DIF digital audio Input and Output with separate software mappings, and a fully decoded MIDI interface with separate Input and Output (along with on mini-DIN converter.) The Gold highlighted many features aimed at music composition; ease-of-use ([plug-and-play](/wiki/Plug-and-play) for musicians), real-time loopback-recording of the MIDI-synthesizer (with full freedom of Soundfonts, and environmental effects such as reverb, etc.), and bundled MIDI-software. The mainstream model was the *Sound Blaster Live!* Like the Gold, the Live featured multi-speaker analog output (up to four channels), and identical music/sound generation capabilities (without the bundled MIDI software and interfacing-equipment.) Later versions of the Live!, usually called *Live! 5.1*, offered 5.1-channel support which adds a [center channel](/wiki/Center_channel) speaker and [LFE](/wiki/Low-frequency_effects) subwoofer output, most useful for movie watching. The Live! 5.1 could also use one of the 3.5 mm jack ports as an SPDIF out, which allowed the connection of an external decoder. Creative also released a *Sound Blaster Live! Player 1024* edition, which is identical to the regular *Sound Blaster Live!*, but with the addition of some extra software. ### Sound Blaster PCI 512 The *Sound Blaster PCI 512* (CT4790) is an EMU10K1-based sound card designed to fill a lower cost segment than the Live! Value. It is capable of most of the Live! Value's features aside from being limited to 512 MIDI voice polyphony (a software-based limitation), lacking digital [I/O](/wiki/Input/output), removal of expansion [headers](/wiki/Electrical_connector), and only stereo or [quadraphonic](/wiki/Quadraphonic) output support. The card's circuit layout is somewhat simpler than that of the Live! series. ### Sound Blaster Audigy The *Sound Blaster Audigy* (August 2001) featured the Audigy processor (EMU10K2), an improved version of the EMU10K1 processor that shipped with the *Sound Blaster Live!*. The Audigy could process up to four EAX environments simultaneously with its upgraded on-chip DSP and native [EAX 3.0 ADVANCED HD](/wiki/Environmental_audio_extensions) support, and supported up to 5.1-channel output. The Audigy was controversially advertised as a 24-bit sound card. The EMU10K2's audio transport (DMA engine) was fixed at 16-bit sample precision at 48 kHz (like the EMU10K1 in the original Live!), and all audio had to be resampled to 48 kHz in order to be accepted by the DSP (for recording or rendering to output.) *Sound Blaster Audigy 2* (September 2002) featured an updated EMU10K2 processor, sometimes referred to as EMU10K2.5, with an improved DMA engine capable of 24-bit precision. Up to 192 kHz was supported for stereo playback/record, while 6.1 was capped at 96 kHz. In addition, Audigy 2 supported up to 6.1 (later [7.1](/wiki/7.1_surround_sound)) speakers and had improved [signal-to-noise ratio](/wiki/Signal-to-noise_ratio) (SNR) over the Audigy (106 vs. 100 [decibels](/wiki/Decibels) ([A](/wiki/A-weighting))). It also featured built-in [Dolby Digital EX](/wiki/Dolby_Digital) 6.1 and 7.1 decoding for improved DVD play-back. The Audigy 2 line were the first sound cards to receive [THX](/wiki/THX) certification. *Sound Blaster Audigy 2 ZS* (September 2003) is essentially an Audigy 2 with updated DAC and [op-amps](/wiki/Operational_amplifier). Audigy 2 ZS uses the [Cirrus Logic](/wiki/Cirrus_Logic) CS4382 DAC together with the op-amps and can produce an output SNR of 108 dB. There were a few slight [printed circuit board](/wiki/Printed_circuit_board) modifications and [7.1](/wiki/7.1_surround_sound) audio support was added. *Sound Blaster Audigy 4 Pro* (November 2004) was an Audigy 2 ZS with updated DACs and [ADCs](/wiki/Analog-to-digital_converter), the new DAC being the Cirrus Logic CS4398, boosting the output SNR to 113 dB. Other than a [breakout box](/wiki/Breakout_box), it has no distinguishable difference from the Audigy 2 ZS. The DSP is identical to the Audigy 2 ZS's but Creative put an \"Audigy 4\" sticker to cover the chip, making it appear as if it is a new chip. The Audigy 4 Pro is not to be confused with the Audigy 4 (Value) which contains lower quality DACs and does not have golden plated jacks. The Audigy 4 (Value) is more in line with the Audigy 2 Value series. The Audigy 4 had a shorter life span than its predecessors, due to the short window between it and the next-generation Sound Blaster X-Fi. *Sound Blaster Audigy Rx* (September 2013) is similar to the *Audigy 4* but with a dedicated 600-ohm headphone amplifier and a [PCIe](/wiki/PCIe) 1x interface. *Sound Blaster Audigy Fx* (September 2013) also features a 600-ohm amplifier and a PCIe interface, but lacks the EMU10K DSP. ### Sound Blaster X-Fi The *X-Fi* (for \"Extreme Fidelity\") was released in August 2005 and as of 2012[update] came in *XtremeGamer*, *Titanium*, *Titanium Fatal1ty Professional*, *Titanium Fatal1ty Champion* and *Elite Pro* configurations. The 130 [nm](/wiki/Nanometer) [EMU20K](/wiki/EMU20K)1 (or EMU20K2 for Titanium series models) audio chip operates at 400 [MHz](/wiki/Megahertz) and has 51 million [transistors](/wiki/Transistor). The computational power of this processor, i.e. its performance, is estimated as 10,000 MIPS, which is about 24 times higher than the estimated performance of its predecessor, the Audigy processor. Beginning with the 2008 Titanium models, newer X-Fi cards switched from PCI to [PCI Express](/wiki/PCI_Express) x1 connectors. With the X-Fi's \"Active Modal Architecture\" (AMA), the user can choose one of three optimization modes: Gaming, Entertainment, and Creation; each enabling a combination of the features of the chipset. The X-Fi uses [EAX](/wiki/Environmental_audio_extensions) 5.0 which supports up to 128 3D-positioned voices with up to four effects applied to each. This release also included the 24-bit crystallizer, which is intended to pronounce percussion elements by placing some emphasis on low and high pitched parts of the sound. The X-Fi, at its release, offered some of the most powerful mixing capabilities available, making it a powerful entry-level card for home musicians. The other big improvement in the X-Fi over the previous Audigy designs was the complete overhaul of the resampling engine on the card. The previous Audigy cards had their DSPs locked at 48/16, meaning any content that did not match was resampled on the card in hardware; which was done poorly and resulted in a lot of intermodulation distortion. Many hardcore users worked around this by means of resampling their content using high quality software decoders, usually in the form of a plugin in their media player. Creative completely re-wrote the resampling method used on the X-Fi and dedicated more than half of the power of the DSP to the process; resulting in a very clean resample.[*citation needed*] ## Sixth generation Sound Blaster *Sound Core3D* cards ### Sound Blaster Recon3D The Recon3D series was announced in September 2011 and includes the *Recon3D PCIe*, *Recon3D Fatal1ty Professional* and *Recon3D Fatal1ty Champion*. The cards use the new integrated *Sound Core3D* chip, which features the *Quartet DSP* from the X-Fi series as well as integrated DAC, ADC and I/O interface in a 56-pin package. The Asia-only *Recon3D Professional Audio* is basically a *Recon3D PCIe* with some extra accessories such as cables. The Recon3D series of sound cards do not support [ASIO](/wiki/Audio_Stream_Input/Output). The Recon3D comes with a bundled software called the SBX Pro Studio. SBX Pro Studio allows users to adjust the amount of virtual Surround, Crystallizer, Bass, Smart Volume and Dialog Plus for their Recon3D sound cards. The Recon3D also has got the Crystal Voice feature that reduces the pickup of background noises like the hairdryer or vacuum cleaner when a beamforming microphone is used. Reviews have been generally positive, but pricing and small model differences have raised questions. Especially the low and mid priced models *Recon3D PCIe* and *Recon3D Fatal1ty Professional* have only cosmetic differences, but considerable price difference: the *Fatal1ty Professional*, adds a beamforming microphone, some red LED lights and a metal shroud over the board, but has no real hardware improvements. ### Sound Blaster Z-Series The Sound Blaster Z-Series was announced in August 2012 and includes the [PCI Express](/wiki/PCI_Express) x1 cards, *Z*, *Zx* and *ZxR* which use the same *Sound Core3D* chip as the previous Sound Blaster Recon3D series. The Z-Series improved sound quality over the Recon3D series by including more dedicated audio hardware such as [Op-Amps](/wiki/Operational_amplifier), [DACs](/wiki/Digital-to-analog_converter), and [ADCs](/wiki/Analog-to-digital_converter). - The *Sound Blaster Z* is the baseline card of the series. Some of its main features are Cirrus Logic 116 dB signal-to-noise ratio (SNR) digital-to-analog converters (DACs), a dedicated headphone jack with 600 ohm amplifier, and is bundled with a *Beamforming Microphone* that captures sound in a specific direction. One can switch between listening with headphones and desktop speakers in the Sound Blaster Z Control Panel. This card has a red color theme with a red LED light on the board. In addition to the red model, there is an OEM version that lacks the LED light, metal shielding and bundled microphone. - The *Sound Blaster Z SE* released in 2021 is identical to the Z, but with 7.1 channel virtual surround for compatible headphones, no bundled microphone and no driver CD as the card is only compatible with the Sound Blaster Command software. - The Sound Blaster Zx card is identical to the Z (exact same card, exact same card SKU/Model (SB1500) on card itself, compared side by side in store), with the only notable change compared to the baseline \"Z\" being the addition of the desktop ACM (Audio Control Module). The Zx & ZxR were both bundled with the Audio Control Module (ACM) which is basically an extension cord for headphones. The ACM contains both 1/4\" and 3.5 mm headphone and microphone jacks, a potentiometer headphone volume knob, and a built-in dual-microphone Beamforming array. The ACM uses a red color theme that matches the card. The entire package (Card and ACM) carries a separate model number of SB1506, which is different than the base SB1500 printed on the included card (as the card is just a SB-Z now bundled with accessories). - The *Sound Blaster ZxR* is the top of line sound card of the series and uses an entirely different card from the Z and Zx. Some of its features include TI [Burr-Brown](/wiki/Burr-Brown) 124 dB SNR DACs, two swappable op-amps, a 600 ohm 80 mW TI TPA6120 headphone amplifier, and 192 kHz stereo pass through. The *Sound Blaster ZxR* comes with a daughter board which provides optical [S/PDIF](/wiki/S/PDIF) input and output, and two [RCA](/wiki/RCA_connector) inputs that feature a TI Burr-Brown 123 dB SNR analog-to-digital converter (ADC); it has its own *Sound Core3D* processor and takes up a second expansion slot in the computer if installed. The *ZxR* can record up to 24-bit/96 kHz. The ACM and two boards (main and daughter) have a black color scheme with no LED lighting. ### Sound BlasterX AE-5/Plus The Sound BlasterX AE-5 was announced in June 2017, the first discrete sound card made by Creative in five years since the introduction of the Z-series. The card is the first in the Sound Blaster series to use a 32-bit/384 kHz SABRE 32 Ultra DAC (ES9016K2M), along with a custom-designed discrete headphone amplifier (1 W output power and low output impedance of 1 Ohm so it can provide high damping factor for virtually any dynamic headphone). The card has an additional RGB lighting courtesy of a MOLEX power connection and accompanying RGB LED strip. In late 2017, a white colored model of the sound card called the Sound BlasterX AE-5 Pure Edition was released with 4 RGB LED strips instead of one with the standard black model. In 2020, the AE-5 Plus was released which is similar to the previous model, but the sound card comes with hardware Dolby Digital Live and DTS encoding. There is a white colored Pure Edition released alongside the standard black model. ### Sound Blaster AE-7 The Sound Blaster AE-7 was released in July 2019 alongside the Sound Blaster AE-9. It is equipped with an ESS SABRE 9018 DAC, and it features an ACM (Audio Control Module), which connects to the sound card via two of the audio ports available on the card itself. It doesn't feature RGB lighting, contrary to the AE-5, and it doesn't require external power either. ### Sound Blaster AE-9 The Sound Blaster AE-9 was announced in December 2018, targeting the audiophile audience. This soundcard is equipped with an ESS SABRE 9038 DAC, and it features an external Audio Control Module which connects to the sound card with a mini-HDMI cable, containing an XLR port for a microphone and a toggleable 48+ volt phantom power rail; the sound card itself features replaceable operational amplifiers. The sound card with the external DAC consumes 75 W, and thus is the first sound card from Creative that requires auxiliary power, using a 6-pin [PCI-E](/wiki/PCI_Express) connector to supply power to the external DAC. The card was officially released on July 10, 2019, to celebrate 30 years since the introduction of the original Sound Blaster. ## Sound BlasterAxx Sound BlasterAxx is a series of USB powered speakers that has the features of a sound card. The speakers also have built-in microphones. The series of speakers work with Mac [OS X](/wiki/OS_X) other than [Microsoft Windows](/wiki/Microsoft_Windows). ### Sound BlasterAxx SBX series The Sound BlasterAxx SBX series was released in year 2012. There are three models in the series, the Sound BlasterAxx SBX 8, Sound BlasterAxx SBX 10 and Sound BlasterAxx SBX 20. All three speakers have a bass port, Headphone Out and Aux-in/Mic-in 3.5mm jacks behind. The speakers do not contain rechargeable batteries and they require a USB power source. The speakers work with the Sound BlasterAxx control panel software for adjustment of SBX Pro Studio and Crystal Voice settings. The Sound BlasterAxx Control Panel has got a Mac OS X version other than the Microsoft Windows version. The Sound BlasterAxx SBX 8 is the only speaker that does not have Bluetooth capability. The Sound BlasterAxx SBX 10 and Sound BlasterAxx SBX 20 are Bluetooth capable and can be used for answering phones calls from iOS and Android smart phones. The Bluetooth version for the speakers is Bluetooth 2.1(Enhanced Data Rate). The Bluetooth codecs supported are [SBC](/wiki/SBC_(codec)) and AAC, [aptX](/wiki/AptX) is not supported. The speakers also do not support [ASIO](/wiki/Audio_Stream_Input/Output) and do not have the Scout Mode feature. SBX Pro Studio effects such as SBX Surround, SBX Crystallizer, SBX Bass, SBX Smart Volume and SBX Dialog Plus can be adjusted by the Sound Blaster Central mobile app. ### Sound BlasterAxx AXX 200 In the beginning of 2014, [Creative Labs](/wiki/Creative_Labs) released the Sound BlasterAxx AXX 200 portable Bluetooth speaker. Like the speakers of the Sound BlasterAxx SBX series, it has a built-in SB-Axx1 sound chip and works with both Mac [OS X](/wiki/OS_X) and [Microsoft Windows](/wiki/Microsoft_Windows) computers. Its dimensions are 64.0 x 72.3 x 200.6 mm (2.51 x 2.84 x 7.9 inches) and it weighs 0.5 kg (1.1 lbs). The Sound BlasterAxx AXX 200 has a built-in 5200mAh Lithium-ion battery, allowing it to be used as a portable Bluetooth speaker. It has a microSD card slot for playing WMA/MP3 tracks from a microSD card. Calls and voices can be recorded through its microphone; the recordings are stored in the microSD card. It also has a megaphone function. Its Bluetooth version is Bluetooth 2.1(Enhanced Date Rate) and supports [SBC](/wiki/SBC_(codec)), AAC and [aptX](/wiki/AptX) Bluetooth codecs. It can be paired with Bluetooth devices via [NFC(Near Field Communication)](/wiki/Near_field_communication). Same as the Sound BlasterAxx SBX series of speakers, it does not support [ASIO](/wiki/Audio_Stream_Input/Output) and does not have the Scout Mode feature. ## List of USB audio devices - Sound Blaster Extigy - Sound Blaster MP3+ - Sound Blaster Audigy 2 NX - Sound Blaster X-Fi USB - Sound Blaster X-Fi HD USB - Sound Blaster X-Fi GO! Pro - Sound Blaster X-Fi Surround 5.1 Pro' - Sound Blaster X-fi Elite Pro - Sound Blaster Digital Music Premium HD - Sound BlasterAxx SBX 8 / SBX 10 / SBX 20 - Sound Blaster Play! - Sound Blaster Play! 2 - Sound Blaster Play! 3 - Sound Blaster Omni Surround 5.1 - Sound Blaster R3 - Sound BlasterAxx AXX 200 - [Sound Blaster Roar](/wiki/Sound_Blaster_Roar) - Sound Blaster Roar 2 - Sound Blaster E1 / E3 / E5 - Sound Blaster JAM - [Sound Blaster X7](/wiki/Sound_Blaster_X7) - Sound Blaster X7 Limited Edition - Sound Blaster FRee - Sound Blaster X3 - Sound Blaster X5 - Sound Blaster Katana [soundbar](/wiki/Soundbar) - Sound Blaster Katana v2 soundbar ## Connectors ### External connector Sound Blaster cards since 1999 conform to Microsoft's [PC 99](/wiki/PC_99) standard for color-coding the external connectors as follows: ColorFunctionPinkAnalog [microphone](/wiki/Microphone) input.Light blueAnalog [line level](/wiki/Line_level) input.Lime greenAnalog line level output for the main stereo signal (front speakers or headphones).BlackAnalog line level output for rear speakers.SilverAnalog line level output for side speakers.Orange[S/PDIF](/wiki/S/PDIF) digital output (sometimes used as an analog line output for a [center](/wiki/Center_channel) and/or subwoofer speaker instead) Up until the AWE line in 1994, Creative cards have short text inscriptions on the backplane of the card, indicating which port does what (i.e. Mic, Spk, Aux In, Aux Out). On later cards, the text inscriptions were changed to icons. With the latest cards from Creative, the cards were changed to use numbers as the ports are flexi-jacks and can have different functions assigned to them at run-time (i.e. changed from speaker output to mic in), but a color overlay sticker is included with retail units to help consumers identify the commonly used functions of the ports in their default modes. ### Internal pin connector and jumper A lot of audio/data [pin](/wiki/Pin_header) connectors and jumpers-setting is present in the internal body of the sound blaster, different from card to card, and along the years of productions. Most common pin connector: - Audio CD-IN, CD SPDIF and AUX-In - CD-ROM drive connection - PC speaker - TAD (Telephone Answering Device) connector - MB_PRO (Modem Blaster connector) - Wave Blaster Header Most common pin jumper setting (especially before [plug-and-play](/wiki/Plug-and-play) features): - Sound Card Base Address/IRQ/DMA - Line or Speaker output - MIDI - Joystick ## Driver software modification (soft mod) **This section has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*Some of this section's listed sources **may not be reliable**. Please help improve this article by looking for better, more reliable sources. Unreliable citations may be challenged and removed. *(January 2011)* *(Learn how and when to remove this message)*This section's **tone or style may not reflect the encyclopedic tone used on Wikipedia**. See Wikipedia's guide to writing better articles for suggestions. *(January 2011)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* Some [drivers](/wiki/Device_driver) from the Audigy 2 ZS have been soft-modded by enthusiasts. These can be installed on [Creative](/wiki/Creative_Technology)'s older cards, including Sound Blaster Live!, Audigy, and Audigy 2. It has been claimed to offer improved sound quality, hardware acceleration of higher EAX versions in games, 64-channel mixing for Audigy 1, and an overall improvement in the card's performance. Several forum posts across the web have reported favorable results with this technique, excepting Live! users where the drivers only add the ability to use the newer software applications (i.e. the newer mixer applet). Comments on forums from developers of the software mod have said that Live's hardware is not capable of EAX3 nor 64-channels of hardware sound mixing. Later, in 2004, Creative released updated drivers top-to-bottom for the Audigy through Audigy 4 line that put these cards basically at feature parity on a software level. As of 2006, the entire Audigy lineup uses the same driver package. DSP decoding at the driver level on other cards than Audigy 2 ZS and 4 is still not supported by official drivers, but it works with [soft-modded](/wiki/Softmod) drivers on the other cards with hardware DSP (like Audigy 2 6.1). When [Windows Vista](/wiki/Windows_Vista) was released, there was only a single beta driver for the Creative Audigy series that was usable on the operating system with minimal functionality and frequent instability reported by users. A Creative Forum activist named Daniel K. modified drivers from the X-Fi and applied it to the Audigy and Live! series, restoring most if not all of the features that came with the original XP setup CD in Vista. X-Fi drivers have noticeably better sound quality under Vista, and more bug fixes because of the newer build (last modified version is 2.15.0004EQ April). He managed to enable the X-Fi Crystallizer to work on Audigy series cards in software, however because of the [patents](/wiki/Patent) involved, he was forced to remove all the modified drivers and DLL patch. Creative then released a newer official Audigy Vista driver (2.18.0000 as of 28 July 2008) due to public and consumer pressure. However, some form of agreement between Creative and Daniel K has been achieved, as he returned to the Creative forums, posting updated versions of his modified drivers. He released the final version of his modded driver package as of January 12, 2012. ## Audio effects processor NameBit depthEAXTransistorsNotesEMU80000.5 millionEMU10K116-bit2.02.44 million350 nm, 335 MIPS, 32 DirectSound3D sound channelsEMU10K216-bit3.04 million200 MHz, 64 DirectSound3D sound channelsEMU10K2.524-bit4.04.6 million180 nm, 200 MHz, 424+ MIPS, 64 DirectSound3D sound channelsEMU20K124-bit5.051 million130 nm, 400 MHz, 10,340 MIPS, 128 DirectSound3D sound channelsEMU20K224-bit5.051 million65 nm, Fixes bugs in EMU20K1, PCI Express, embedded RISC processorSound Core3D24-bit5.0?Integrated analog codec and digital I/OSB-Axx124-bit5.0?Found in some Sound Blaster USB audio devices ## Compatibility with Linux All recent[*when?*] Linux distributions support Sound Blaster Cards via kernel drivers. In case of non-Plug-and-Play ISA cards, a configuration file in `/etc/modules` must be reconfigured, writing for example with Sound Blaster 16 card installed: `snd-sb16 isapnp=0`. X-Fi series cards have basic support in Linux, but the advanced features like signal routing, relay control or external I/O consoles are not supported. Support for the newer Sound Blaster cards (Z and AE series) was added to the kernel during 4.19 – 4.20 release timeframe. - [Ad Lib, Inc.](/wiki/Ad_Lib,_Inc.) - [Auzentech](/wiki/Auzentech) - [C-Media](/wiki/C-Media) - [Ensoniq](/wiki/Ensoniq) - [Gravis Ultrasound](/wiki/Gravis_Ultrasound) - [Loudspeaker](/wiki/Loudspeaker) - [Loudspeaker enclosure](/wiki/Loudspeaker_enclosure) - [M-Audio](/wiki/M-Audio) - [Media Vision](/wiki/Media_Vision) - [Realtek](/wiki/Realtek) - [Roland Corporation](/wiki/Roland_Corporation) - [TerraTec](/wiki/TerraTec) - [Turtle Beach Corporation](/wiki/Turtle_Beach_Corporation) - [VDMSound](/wiki/VDMSound) - [VIA Envy](/wiki/VIA_Envy) - [Yamaha sound chips](/wiki/List_of_Yamaha_products#Sound_chips) Notes - \"Creative Announces Sound Blaster 32\" by Creative Technology on Usenet, June 23, 1995, retrieved January 5, 2006\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:54.256888",
  "title": "Sound Blaster",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sound_Blaster"
}