{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:01:56.447603"
  },
  "content": "There are three general **sources of Singapore law**: [legislation](/wiki/Legislation), [judicial precedents](/wiki/Precedent) ([case law](/wiki/Case_law)), and [custom](/wiki/Custom_(law)). Legislation is divided into statutes and subsidiary legislation. [Statutes](/wiki/Statute) are written laws enacted by the [Singapore Parliament](/wiki/Parliament_of_Singapore), as well as by other bodies that had power to pass laws for Singapore in the past. Statutes enacted by these other bodies may still be in force if they have not been [repealed](/wiki/Repeal). One particularly important statute is the [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore), which is the supreme law of Singapore. Any law the Legislature enacts after the commencement of the Constitution that is inconsistent with it is, to the extent of the inconsistency, void. [Subsidiary legislation](/wiki/Delegated_legislation), also known as \"delegated legislation\" or \"subordinate legislation\", is written law made by ministers or other administrative agencies such as government departments and [statutory boards](/wiki/Statutory_boards_of_the_Singapore_Government) under the authority of a statute (often called its \"parent Act\") or other lawful authority, and not directly by Parliament. As Singapore is a [common law](/wiki/English_common_law) [jurisdiction](/wiki/Jurisdiction), judgments handed down by the courts are considered a source of law. Judgments may interpret statutes or subsidiary legislation, or develop principles of common law and [equity](/wiki/Equity_(law)) laid down, not by the legislature, but by previous generations of judges. Major portions of Singapore law, particularly [contract law](/wiki/Contract), equity and [trust law](/wiki/Trust_law_in_England_and_Wales), [property law](/wiki/Property_law) and [tort law](/wiki/Tort), are largely judge-made, though certain aspects have now been modified to some extent by statutes. A [custom](/wiki/Custom_(law)) is an established practice or course of behaviour that is regarded by the persons engaged in the practice as law. Customs do not have the force of law unless they are recognized in a case. \"Legal\" or \"trade\" customs are not given recognition as law unless they are certain and not unreasonable or illegal. In Singapore, custom is a minor source of law as not many customs have been given judicial recognition. ## Legislation Legislation, or [statutory law](/wiki/Statutory_law), can be divided into statutes and subsidiary legislation. ### Statutes [Statutes](/wiki/Statute) are written laws enacted by the Singapore Parliament, as well as by other bodies such as the [British Parliament](/wiki/Parliament_of_Great_Britain), [Governor-General of India in Council](/wiki/Governor-General_of_India) and [Legislative Council of the Straits Settlements](/wiki/Legislative_Council_of_the_Straits_Settlements), which had power to pass laws for Singapore in the past. Statutes enacted by these other bodies may still be in force if they have not been [repealed](/wiki/Repeal). One particularly important statute is the [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore), which is the supreme law of Singapore. Any law the Legislature enacts after the commencement of the Constitution that is inconsistent with it is, to the extent of the inconsistency, void. Statutes of the Singapore Parliament, as well as English statutes in force in Singapore by virtue of the Application of English Law Act 1993, are published in looseleaf form in a series called the *Statutes of the Republic of Singapore*, which is gathered in red binders, and are also accessible on-line from Singapore Statutes Online, a free service provided by the [Attorney-General's Chambers of Singapore](/wiki/Attorney-General_of_Singapore). Most statutes, apart from amending Acts and certain Acts such as Supply Acts, are assigned chapter numbers (the word \"chapter\" is usually abbreviated \"Cap.\"). Revised editions (abbreviated \"Rev. Ed.\") of statutes that consolidate all amendments to statutes within certain periods of time are published regularly. #### Passage of bills through Parliament A statute of the Singapore Parliament begins its life as a [bill](/wiki/Bill_(proposed_law)), which is usually introduced in Parliament by a [government minister](/wiki/Minister_(government)). In practice, most legislation is initiated by the [Cabinet](/wiki/Cabinet_of_Singapore), either acting on its own or on the advice of senior [civil servants](/wiki/Civil_service). Bills go through the following stages in Parliament: 1. The introduction and [first reading](/wiki/Reading_(legislature)#First_reading). 2. The [second reading](/wiki/Reading_(legislature)#Second_reading). 3. The committee stage. 4. The [third reading](/wiki/Reading_(legislature)#Third_reading). At the first reading, the bill is introduced into Parliament, usually by the responsible minister. No debate on the bill takes place. The bill is considered as having been read after the MP introducing it has read aloud its [long title](/wiki/Long_title) and laid a copy of it on the Table of the House, and the Clerk of Parliament has read out its [short title](/wiki/Short_title). Copies of the bill are then distributed to MPs, and it is published in the *Government Gazette* for the public's information. The bill is then scheduled for its second reading. If a bill makes substantial, and not merely incidental, provision for: - imposing or increasing any tax or abolishing, reducing or remitting any existing tax; - the borrowing of money, or the giving of any guarantee, by the Government, or the amendment of the law relating to the financial obligations of the Government; - the custody of the [Consolidated Fund](/wiki/Consolidated_Fund), the charging of any money on the Consolidated Fund or the abolition or alteration of any such charge; - the payment of money into the Consolidated Fund or the payment, issue or withdrawal from the Consolidated Fund of any money not charged on it, or any increase in the amount of such a payment, issue or withdrawal; or - the receipt of any money on account of the Consolidated Fund or the custody or issue of such money, the [Minister for Finance](/wiki/Minister_for_Finance_(Singapore)) must signify that the President has recommended the introduction of the bill, otherwise it may not be introduced in Parliament. On the second reading, the minister responsible for moving the bill usually makes a speech explaining the objects and reasons behind the bill. The general merits and principles of the bill are then debated. The bill then proceeds to the committee stage, where the details of the drafting of the proposed law are examined. Where a bill is relatively uncontroversial, it is referred to a [committee of the whole Parliament](/wiki/Committee_of_the_Whole); in other words, all the MPs attending the sitting form a committee and discuss the bill clause by clause. Bills that are more controversial, or that require the views of interested groups or the public, are often referred to a [select committee](/wiki/Select_committee_(parliamentary_system)). This is a committee of selected MPs who invite interested people to make representations to the committee. Public hearings to hear submissions on the bill may be held. The select committee then reports its findings, together with any suggested amendments to the bill, to Parliament. The bill then goes through a third reading. At this stage, only amendments not of a material character may be made to the bill. The minister moving the third reading may also make a speech outlining the changes made to the bill. The bill is then put to the vote. In most cases, a simple majority of Parliament is all that is needed for the bill to be approved. However, bills seeking to amend the Constitution must be carried by a special majority: not less than two-thirds of all MPs on the second and third readings. The bill will ordinarily take at least two Parliament sittings to be passed in the Parliament, with the first reading being a separate sitting from the subsequent two readings. However, an urgent bill accompanied by a Certificate of Urgency signed by the President may have all of its three readings done in the same sitting. #### Scrutiny of bills by the Presidential Council for Minority Rights Once most bills have been passed by Parliament, they must be submitted to a non-elected advisory body called the [Presidential Council for Minority Rights](/wiki/Presidential_Council_for_Minority_Rights) (PCMR). The PCMR's responsibility is to draw attention to any legislation that, in its opinion, is a \"differentiating measure\", that is, one that discriminates against any racial or religious community. When the Council makes a favourable report or no report within the time prescribed (in which case the bill is conclusively presumed not to contain any differentiating measures), the bill is presented to the President for assent. If the PCMR submits an adverse report, Parliament can either make amendments to the bill and resubmit it to the council for approval, or decide to present the bill for the President's assent nonetheless provided that a Parliamentary motion for such action has been passed by at least two-thirds of all MPs. The PCMR has not rendered any adverse reports since it was set up in 1970. Three types of bills need not be submitted to the PCMR: - [Money Bills](/wiki/Money_bill); - Bills the Prime Minister certifies as affecting the defence or security of Singapore, or that relate to public safety, peace or good order in Singapore - Bills the Prime Minister certifies are so urgent that it is not in the public interest to delay enactment #### Assent to bills by the President The President generally exercises his constitutional function of assenting to bills in accordance with Cabinet's advice and does not act in his personal discretion. Therefore, except in certain instances described below, he may not refuse to assent to bills that have been validly passed by Parliament. The words of enactment in Singapore statutes are: \"Be it enacted by the President with the advice and consent of the Parliament of Singapore, as follows:\". The President may act in his discretion in withholding assent to any of the following types of bills passed by Parliament: 1. A bill seeking to amend the Constitution that provides, directly or indirectly, for the circumvention or curtailment of the discretionary powers conferred upon the President by the Constitution. 2. A bill not seeking to amend the Constitution that provides, directly or indirectly, for the circumvention or curtailment of the discretionary powers conferred upon the President by the Constitution. 3. A bill that provides, directly or indirectly, for varying, changing or increasing the powers of the Central Provident Fund Board to invest the moneys belonging to the [Central Provident Fund](/wiki/Central_Provident_Fund). 4. A bill providing, directly or indirectly, for the borrowing of money, the giving of any [guarantee](/wiki/Guarantee) or the raising of any loan by the Government if, in the opinion of the President, the bill is likely to draw on reserves of the Government that the Government did not accumulate in its current term of office. 5. A [Supply Bill](/wiki/Money_bill), Supplementary Supply Bill or Final Supply Bill for any financial year if, in the President's opinion, the estimates of revenue and expenditure for that year, the supplementary estimates or the statement of excess, as the case may be, are likely to lead to a drawing on the reserves that were not accumulated by the Government during its current term of office. As regards a bill mentioned in paragraph 1, the President, acting in accordance with the advice of the Cabinet, may refer to a Constitutional Tribunal the question of whether the bill circumvents or curtails the discretionary powers conferred on him or her by the Constitution. If the Tribunal is of the opinion that the bill does not have this effect, the President is deemed to have assented to the bill on the day after the day when the Tribunal's opinion is pronounced [in open court](/wiki/In_open_court). On the other hand, if the Tribunal feels that the bill does have the circumventing or curtailing effect, and the President either has withheld or withholds his assent to the bill, the Prime Minister may direct that the bill be submitted to the electors for a national referendum. In that case, the bill only becomes law if it is supported by not less than two-thirds of the total number of votes cast at the referendum. If 30 days have expired after a bill has been presented to the President for assent and he or she has neither signified the withholding of assent nor referred the Bill to a Constitutional Tribunal, the bill is deemed to have been assented to on the day following the expiry of the 30-day period. The procedure is similar for a bill mentioned in paragraph 2, except that if the Constitutional Tribunal rules that the bill has a circumventing or curtailing effect, the Prime Minister has no power to put the bill to a referendum. This ensures that changes to the President's discretionary powers can only be made by way of [constitutional amendments](/wiki/Constitutional_amendment) and not ordinary statutes. If the President withholds his assent to any Supply Bill, Supplementary Supply Bill or Final Supply Bill referred to in paragraph 5 contrary to the recommendation of the Council of Presidential Advisers, Parliament may by resolution passed by not less than two-thirds of the total number of elected MPs overrule the decision of the President. If Parliament does not do so within 30 days of the withholding of assent, it may authorize expenditure or supplementary expenditure, from the [Consolidated Fund](/wiki/Consolidated_Fund) and Development Fund during the relevant financial year, provided that: - where the President withholds his assent to a Supply Bill, the expenditure so authorized for any service or purpose for that financial year cannot exceed the total amount appropriated for that service or purpose in the preceding financial year; or - where the President withholds his assent to a Supplementary Supply Bill or Final Supply Bill, the expenditure so authorized for any service or purpose shall not exceed the amount necessary to replace an amount advanced from any Contingencies Fund under Article 148C(1) of the Constitution for that service or purpose. If 30 days have passed after a Supply Bill, Supplementary Supply Bill or Final Supply Bill has been presented to the President for assent and her or she has not signified the withholding of assent, the President is deemed to have assented to the bill on the day immediately following the expiration of the 30-day period. Upon receiving presidential assent, a bill becomes law and is known as an [Act of Parliament](/wiki/Act_of_Parliament). However, the Act only comes into force on the date of its publication in the *Government Gazette*, or on such other date that is stipulated by the Act or another law, or a notification made under a law. #### Examples of statutes - The **Application of English Law Act** sets out the extent to which English law applies in Singapore today. - Under section 17(1) of the **Environmental Public Health Act**, it is an offence to: (a) deposit, drop, place or throw any dust, dirt, paper, ash, carcase, refuse, box, barrel, bale or any other article or thing in any public place;(b) keep or leave any article or thing in any place where it or particles therefrom have passed or are likely to pass into any public place;(c) dry any article of food or any other article or thing in any public place;(d) place, scatter, spill or throw any blood, brine, noxious liquid, swill or any other offensive or filthy matter of any kind in such manner as to run or fall into any public place;(e) beat, clean, shake, sieve or otherwise agitate any ash, hair, feathers, lime, sand, waste paper or other substance in such manner that it is carried or likely to be carried by the wind to any public place;(f) throw or leave behind any bottle, can, food container, food wrapper, glass, particles of food or any other article or thing in any public place;(g) spit any substance or expel mucus from the nose upon or onto any street or any public place; or(h) discard or abandon in any public place any motor vehicle whose registration has been cancelled under section 27 of the Road Traffic Act, any furniture or any other bulky article.The penalty is a fine not exceeding [S$](/wiki/Singapore_dollar)5,000 and, in the case of a second or subsequent conviction, a fine not exceeding $10,000 or to imprisonment for a term not exceeding three months or both. In addition, where a person who is 16 years of age or above is convicted of an offence under section 17, and if the court by or before which he is convicted is satisfied that it is expedient with a view to his reformation and the protection of the environment and environmental public health that he should be required to perform unpaid work in relation to the cleaning of any premises, the Court shall, in lieu of or in addition to any other order, punishment or sentence and unless it has special reasons for not so doing, make a [corrective work order](/wiki/Corrective_Work_Order) requiring him to perform such work under the supervision of a supervision officer. - The **[Maintenance of Religious Harmony Act](/wiki/Maintenance_of_Religious_Harmony_Act)**, among other things, authorises the making of restraining orders against officials or members of religious groups or institutions who have committed or are attempting to commit any of the following acts: (a) causing feelings of enmity, hatred, ill-will or hostility between different religious groups;(b) carrying out activities to promote a political cause, or a cause of any political party while, or under the guise of, propagating or practising any religious belief;(c) carrying out subversive activities under the guise of propagating or practising any religious belief; or(d) exciting disaffection against the President or the Government while, or under the guise of, propagating or practising any religious belief. - Under section 27A(1) of the **Miscellaneous Offences (Public Order and Nuisance) Act**, it is an offence to appears nude in a public place, or in a private place and is exposed to public view. The penalty is a fine not exceeding $2,000 or imprisonment for a term not exceeding three months or both. The reference in sub-section (1) to a person appearing nude includes a person who is clad in such a manner as to offend against public decency or order. - The **[Penal Code](/wiki/Penal_Code_(Singapore))** states the elements and penalties of common criminal offences such as homicide, theft and cheating, and also sets out general principles of criminal law in Singapore. - The **Sale of Goods Act**, an English Act made applicable to Singapore by the Application of English Law Act, sets out legal rules relating to the sale and purchase of goods. - The **[Women's Charter](/wiki/Women%27s_Charter_(Singapore))** sets out the law relating to marriage, divorce and separation, family violence, and the protection of women and girls. ### Subsidiary legislation [Subsidiary legislation](/wiki/Delegated_legislation), also known as \"delegated legislation\" or \"subordinate legislation\", is written law made by ministers or other administrative agencies such as government departments and [statutory boards](/wiki/Statutory_boards_of_the_Singapore_Government) under the authority of a statute (often called its \"parent Act\") or other lawful authority, and not directly by Parliament. Although there is no general requirement (as there is in the United Kingdom) for subsidiary legislation to be laid before Parliament for its information, this is usually done in Singapore. Subsidiary legislation is known by a variety of names. Section 2(1) of the Interpretation Act defines \"subsidiary legislation\" as meaning \"any order in council, proclamation, rule, regulation, order, notification, by-law or other instrument made under any Act, Ordinance or other lawful authority and having legislative effect\". - An *[Order in Council](/wiki/Order_in_Council)* is a law made directly by the British Crown in the exercise of its [prerogative](/wiki/Royal_Prerogative) law-making power it previously possessed in respect of Singapore. Orders-in-council are made only on the advice of ministers, and operate subject to provisions made by or under any Act of Parliament. - A *[proclamation](/wiki/Proclamation)* is an announcement made by or under the authority of the Crown. - *Rules* are generally legal instruments such as Rules of Court that regulate judicial or other procedure. - *[Regulations](/wiki/Regulation)* are legal instruments implementing the substantive content of Acts of Parliament that have a continuing regulating effect. - An *order* is a [legal instrument](/wiki/Legal_instrument) that has an executive flavour and expresses an obvious command. Often, its effect is limited to a particular moment in time, rather than continuing. - A *notification* is a legal instrument that provides factual information. For example, notifications are used to inform the public of the dates of commencement of statutes and the appointment of individuals to government posts. - *[By-laws](/wiki/Bylaw)* are regulations made by certain public and private bodies, for instance, [strata title](/wiki/Strata_title) management corporations. Their extent is usually limited to a relatively small geographical area or to the operations of a particular body only. Subsidiary legislation must, unless otherwise expressly provided in any statute, be published in the *Government Gazette* and, unless expressly provided in the subsidiary legislation itself, takes effect and comes into operation on the date of its publication. No subsidiary legislation made under an Act of Parliament may be inconsistent with the provisions of any Act. This means that any subsidiary legislation that was made *[ultra vires](/wiki/Ultra_vires)* its parent Act (that is, the Act did not confer power on the agency to make the subsidiary legislation) or is not consistent with any other statute is void to the extent of the inconsistency. Subsidiary legislation currently in force in Singapore is published in looseleaf form in a series called the *Subsidiary Legislation of the Republic of Singapore*, which is gathered in black binders. New subsidiary legislation published in the *Gazette* may be viewed for free on-line for five days on the Electronic Gazette website. #### Examples of subsidiary legislation - Under regulation 16 of the **Environmental Public Health (Public Cleansing) Regulations** made under the Environmental Public Health Act, any person who has urinated or defecated in any sanitary convenience with a flushing system to which the public has access shall flush the sanitary convenience immediately after using it. Contravention of this regulation is an offence punishable: (a) for a first offence, to a fine not exceeding $1,000 and to a further fine not exceeding $100 for every day or part thereof during which the offence continues after conviction;(b) for a second offence, to a fine not exceeding $2,000 and to a further fine not exceeding $200 for every day or part thereof during which the offence continues after conviction; and(c) for a third or subsequent offence, to a fine not exceeding $5,000 and to a further fine not exceeding $500 for every day or part thereof during which the offence continues after conviction. - The **Miscellaneous Offences (Public Order and Nuisance) (Assemblies and Processions) Rules** made under the Miscellaneous Offences (Public Order and Nuisance) Act require a permit for any public assembly or procession of five or more persons in any public place. The rationale given for this law is that a large group of people who gather for a peaceful purpose can turn violent. In the 1950s and 1960s there were several violent riots in Singapore, the last incident being the [1964 race riots](/wiki/1964_race_riots_in_Singapore) in which 36 people were killed. Although there have only been a few minor protests since then, the authorities continue to take a tough stance against unlicensed outdoor protests. On 31 December 2000, 15 members of [Falun Gong](/wiki/Falun_Gong) consisting of 13 foreigners and two Singaporeans were arrested at [MacRitchie Park](/wiki/MacRitchie_Reservoir) for holding an illegal assembly. - Public speaking at [Speakers' Corner](/wiki/Speakers%27_Corner#Singapore) is regulated by the **Public Entertainments and Meetings (Speakers' Corner) (Exemption) Order** made under the Public Entertainments and Meetings Act. - Under regulation 14 of the **Rapid Transit Systems Regulations** made under the Rapid Transit Systems Act, it is an offence to consume or attempt to consume any food or drinks while in or upon any part of the railway premises except in such places as are designated for this purpose by the [Land Transport Authority](/wiki/Land_Transport_Authority) or its licensee, or consume or attempt to consume any chewing gum or bubble gum while in or upon any part of the railway premises. Regulation 15 makes it an offence to spit, litter or soil any part of the railway premises. The maximum penalties for these offences are fines of up to $500 and $5,000 respectively. - The **Sale of Food (Prohibition of Chewing Gum) Regulations** made under the Sale of Food Act prohibits the sale or advertisement for sale of any [chewing gum](/wiki/Chewing_gum_ban_in_Singapore). The prohibition does not apply to the sale or advertisement of any chewing gum in respect of which a product licence has been granted under the Medicines Act. Thus, it is now possible to purchase chewing gum for dental or medical purposes (for instance, for the purpose of [nicotine replacement therapy](/wiki/Nicotine_replacement_therapy)) from pharmacies without a prescription. ## Judicial precedents As Singapore is a [common law](/wiki/English_common_law) [jurisdiction](/wiki/Jurisdiction), judgments of the courts are considered a source of law. Judgments may interpret statutes or subsidiary legislation, or develop principles of common law and [equity](/wiki/Equity_(law)) that have been laid down, not by the legislature, but by previous generations of judges. Major portions of Singapore law, particularly [contract law](/wiki/Contract), equity and [trust law](/wiki/Trust_law_in_England_and_Wales), [property law](/wiki/Property_law) and [tort law](/wiki/Tort), are largely judge-made, though certain aspects have now been modified to some extent by statutes. [Legal certainty](/wiki/Legal_certainty) and the orderly development of legal principles are promoted by the application of the doctrine of *[stare decisis](/wiki/Stare_decisis)*, also known as the doctrine of binding precedent. According to this doctrine, the decisions of higher courts are binding on lower courts. Thus, judgments of the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) are binding on the [High Court](/wiki/High_Court_of_Singapore), and judgments of both of these superior courts are binding on subordinate courts. A judge is generally not bound by previous decisions made by other judges in courts of the same level. Thus, a judge hearing a High Court case need not follow previous High Court decisions. Nonetheless, courts generally do so as a matter of [comity](/wiki/Comity), unless there are good reasons for doing otherwise. As the final appellate court in Singapore, the Court of Appeal is not bound by its previous decisions or those of predecessor courts such as the Privy Council. However, the Court continues to treat such decisions as \"normally binding\" and only departs from them \"where adherence to such prior decisions would cause injustice in a particular case or constrain the development of the law in conformity with the circumstances of Singapore\". Only the *[ratio decidendi](/wiki/Ratio_decidendi)* (that is, the legal principle that determines the outcome) of a case is binding according to the doctrine of *stare decisis*; other legal principles expressed that are not crucial to the final decision (*[obiter dicta](/wiki/Obiter_dicta)*) are only [persuasive](/wiki/Persuasive_precedent). As English courts do not form part of Singapore's hierarchy of courts, decisions of such courts are not binding on Singapore courts. However, as a result of Singapore's colonial heritage, English judicial precedents continue to exercise a strong influence on the legal system and are regarded as highly persuasive, particularly as regards the development of the common law, and the interpretation of English statutes applicable in Singapore and Singapore statutes modelled on English enactments. Judicial precedents from other jurisdictions may also be persuasive in specific areas of Singapore law. For instance, Indian decisions are persuasive in the areas of criminal law and procedure because Singapore borrowed heavily from India in these areas. The Constitution provides that the President may refer to a tribunal consisting of not less than three judges of the Supreme Court for its opinion any question as to the effect of any provision of the Constitution that has arisen or appears likely to arise. Where a Constitutional Tribunal has given an opinion, no court has jurisdiction to question the opinion, or the validity of any law the bill for which was the subject of a reference to the Tribunal. During Straits Settlements times, cases pertaining to Singapore appeared in various privately produced and official series of law reports such as *Kyshe's Reports* (covering cases decided between 1808 and 1939), the *Straits Law Journal* (1839–1891) and the *Straits Settlements Law Reports* (1867–1942). From 1932 until 1992, Singapore cases appeared regularly in the *Malayan Law Journal* (MLJ), the only local series of law reports published continuously since the 1930s, except during [World War II](/wiki/World_War_II). The MLJ is still consulted for Singapore cases decided prior to full independence in 1965. Since 1992, judgments of the High Court, Court of Appeal and Constitutional Tribunal of Singapore have appeared in the *Singapore Law Reports* (SLR), which is published by the [Singapore Academy of Law](/wiki/Singapore_Academy_of_Law) under an exclusive licence from the [Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore). The Academy has also republished cases decided since Singapore's full independence in 1965 that appeared in the MLJ in special volumes of the SLR, and is currently working on a reissue of this body of case law. Cases published in the SLR as well as unreported judgments of the Supreme Court and Subordinate Courts are available on-line from a fee-based service called LawNet, which is also managed by the Academy. ### Examples of judicial precedents - ***[Chng Suan Tze v. Minister for Home Affairs](/wiki/Chng_Suan_Tze_v._Minister_for_Home_Affairs)*** (1988) was a landmark Court of Appeal case in [administrative law](/wiki/Administrative_law), specifically with regards to reviewing the grounds of detention without trial under the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)). One of the main issues before the court was whether the test for [judicial review](/wiki/Judicial_review) was objective or subjective; in other words, whether judges could examine whether the executive's decision to detain a person was in fact based on national security considerations, as well as whether the executive's considerations in determining the detention fell within the scope of the purposes specified in section 8(1) of the Act. The court, in an *[obiter](/wiki/Obiter_dictum)* ruling, advocated the objective standard, stating: \"All power has legal limits and the [rule of law](/wiki/Rule_of_law) demands that the courts should be able to examine the exercise of discretionary power.\" Although the case was legislatively overruled in respect of internal security matters by amendments to the [Constitution of Singapore](/wiki/Constitution_of_Singapore) and the Internal Security Act, the principle still applies in judicial review proceedings not involving the Act. - ***Fay Michael Peter v. Public Prosecutor*** (1994) concerned an American teenager, [Michael P. Fay](/wiki/Michael_P._Fay), who was arrested in 1994 for vandalizing cars and stealing street signs. He pleaded guilty to two charges of vandalizing by spraying paint on a number of cars. On conviction by a subordinate court, he was sentenced to a total of four months' imprisonment and [six strokes of the cane](/wiki/Caning_in_Singapore). For the purposes of sentencing, other charges were taken into consideration, including 16 charges of vandalism involving paint. Fay appealed to the High Court against the sentences, arguing that (a) proviso to section 3 of the [Vandalism Act](/wiki/Vandalism_Act_(Singapore)) required the prosecution to prove beyond reasonable doubt the indelible quality of the paint used before caning could be imposed; (b) a probation order was appropriate in this case; and (c) the trial judge below should have ordered a pre-sentencing report with a view to ordering probation. The appeal was dismissed. The case generated intense media interest in the United States, culminating in a formal request from the US Government for the caning sentence not to be carried out. The Singapore Government rejected the request on the basis that foreigners in Singapore could not be held to a different standard from citizens. However, it recommended that the President reduce the caning from six strokes to four. - ***[Public Prosecutor v Kho Jabing SGCA 1](/wiki/Kho_Jabing#Prosecution's_appeal)*** (2015) was a landmark appeal made by the prosecutors against the life sentence of a convicted murderer named [Kho Jabing](/wiki/Kho_Jabing) (4 January 1984 - 20 May 2016). Kho was a Malaysian from Sarawak who, together with an accomplice [Galing Anak Kujat](/wiki/Galing_Kujat), robbed two Chinese construction workers and murdered one of them, 40-year-old Cao Ruyin, by repeatedly using a fallen tree branch to bludgeon Cao's head, resulting into Cao's death from a shattered skull and brain injuries 6 days later. Both Kho and Galing were found guilty of murder and sentenced to death in 2010; however, in the appeal process of both men, only Kho's death sentence was upheld by the higher courts, who dismissed Kho's appeal while Galing's conviction was lowered to robbery with hurt and his sentence was lowered to 18 years and 6 months' imprisonment with 19 strokes of the cane. In January 2013, when the law was amended to make the death penalty no longer mandatory for certain murder offences committed with no intention to kill and offers an alternative penalty of life imprisonment with/without caning instead, Kho was granted re-sentencing and thus received a life term with 24 strokes of the cane. However, the prosecution appealed for the death penalty on the account that Kho's actions was brutal and violent and a life sentence was thus not appropriate for him. On 14 January 2015, by a 3-2 verdict, Kho was sentenced to death a second time based on the majority decision, because the majority of the five judges felt that Kho had demonstrated viciousness and a blatant disregard for human life from his conduct at the time of the killing and the severity of Cao's injuries, which made the death penalty appropriate in Kho's case. Kho was subsequently executed on 20 May 2016. The outcome of the prosecution's appeal also set the main guiding principles for all judges in Singapore to decide where the discretionary death penalty is appropriate in future murder cases by determining whether an offender, despite having no intention to kill, exhibits viciousness and/or a blatant disregard for human life when committing the crime of murder. ## Custom In law, a [custom](/wiki/Custom_(law)) is an established practice or behaviour that is considered to be law by the persons engaged in it. Customs do not have the force of law unless recognized in a case. \"Legal\" or \"trade\" customs are not recognized as law unless they are certain and not unreasonable or illegal. In Singapore, custom is a minor source of law as not many customs have been given judicial recognition. ### Examples of custom - The general reception of English law under the Second Charter of Justice (see the article \"Law of Singapore\") was subject to three qualifications – one of which was that English law should be modified in application to Singapore so as not to cause injustice or oppression to the indigenous people of the island. Regard was to be had to their religions, usages and manners. This principle generally applied in family law and related matters. Thus in certain early, cases English law was modified by Chinese, Malay and Hindu customary law, and some native usages or customs acquired the force of law. However, the enactment of the [Women's Charter](/wiki/Women%27s_Charter_(Singapore)) in 1961 has unified the family law for all ethno-religious groups in Singapore except the Muslims, who are separately regulated by the Administration of Muslim Law Act. - Where [Malay](/wiki/Malays_in_Singapore) [Muslims](/wiki/Muslims) are concerned, the application of Muslim law is modified by Malay custom as regards marriage, divorce and the distribution of the [estate](/wiki/Estate_(law)) of an [intestate](/wiki/Intestacy) person. In fact, Muslim customary law and the Malay custom applicable to Malay Muslims appear to be the only strands of customary law that continue to have some significance in Singapore. - The practice of marking cheques is a recognized banking custom in Singapore. - [Constitution of Singapore](/wiki/Constitution_of_Singapore) - [Judicial system of Singapore](/wiki/Judicial_system_of_Singapore) - [Law of Singapore](/wiki/Law_of_Singapore) - [Parliament of Singapore](/wiki/Parliament_of_Singapore) ## Notes - Bartholomew, G[eoffrey] W[ilson]; Srinivasagam, Elizabeth; Netton, Pascal Baylon (1987), *Sesquicentennial Chronological Tables of the Written Laws of the Republic of Singapore 1834-1984*, Singapore: Malaya Law Review, Malayan Law Journal, [ISBN](/wiki/ISBN_(identifier)) 978-9971-70-053-9. - Chan, Helena H[ui-]M[eng] (1995), *The Legal System of Singapore*, Singapore: [Butterworths Asia](/wiki/LexisNexis_Butterworths), [ISBN](/wiki/ISBN_(identifier)) 978-0-409-99789-7. - Tan, Kevin (1999). *The Singapore legal system* (2nd ed.). Singapore: Singapore University Press, National University of Singapore. [ISBN](/wiki/ISBN_(identifier)) 9971-69-213-9. [OCLC](/wiki/OCLC_(identifier)) 41572868. ### General - Law in Singapore, by the C.J. Koh Law Library, National University of Singapore - LawNet - Singaporelaw.sg, by the Singapore Academy of Law Archived 15 August 2018 at the [Wayback Machine](/wiki/Wayback_Machine) - Singapore Law Watch, by the Singapore Academy of Law - Singapore Laws on the Internet from WWLegal.com – contains a list of Singapore legal resources on the Internet (published 15 January 2005) ### The Legislature and legislation - Parliament of Singapore - Electronic Gazette - Singapore Statutes Online – a service of the Attorney-General's Chambers, Singapore Archived 15 December 2017 at the [Wayback Machine](/wiki/Wayback_Machine) ### The Judiciary and judicial precedents - Supreme Court of Singapore - Subordinate Courts of Singapore - Family Court of Singapore - Juvenile Court of Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T12:01:56.447284",
  "title": "Sources of Singapore law",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sources_of_Singapore_law"
}