{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:02:03.566263"
  },
  "content": "Fire-related air pollution issueSoutheast Asian haze seriesHaze in [Borneo](/wiki/Borneo), (/wiki/2019_Southeast_Asian_haze)History1990s - [1997 Southeast Asian haze](/wiki/1997_Southeast_Asian_haze) - [1997 Indonesian forest fires](/wiki/1997_Indonesian_forest_fires) 2000s - [2005 Malaysian haze](/wiki/2005_Malaysian_haze) - [2006 Southeast Asian haze](/wiki/2006_Southeast_Asian_haze) - [2009 Southeast Asian haze](/wiki/2009_Southeast_Asian_haze) 2010s - [2010 Southeast Asian haze](/wiki/2010_Southeast_Asian_haze) - [2013 Southeast Asian haze](/wiki/2013_Southeast_Asian_haze) - [2015 Southeast Asian haze](/wiki/2015_Southeast_Asian_haze) - [2016 Malaysian haze](/wiki/2016_Malaysian_haze) - [2016 Southeast Asian haze](/wiki/2016_Southeast_Asian_haze) - [2017 Southeast Asian haze](/wiki/2017_Southeast_Asian_haze) - [2019 Southeast Asian haze](/wiki/2019_Southeast_Asian_haze) Key topics - [Chemical equator](/wiki/Chemical_equator) - Deforestation - [in Borneo](/wiki/Deforestation_in_Borneo) - [in Indonesia](/wiki/Deforestation_in_Indonesia) - [Mega Rice Project](/wiki/Mega_Rice_Project) - [Peat swamp forest](/wiki/Peat_swamp_forest) - [Borneo](/wiki/Borneo_peat_swamp_forests) Responses - [ASEAN Agreement on Transboundary Haze Pollution](/wiki/ASEAN_Agreement_on_Transboundary_Haze_Pollution) - [Operation Haze](/wiki/Operation_Haze) - [Transboundary Haze Pollution Act 2014](/wiki/Transboundary_Haze_Pollution_Act_2014) - [People's Movement to Stop Haze](/wiki/People%27s_Movement_to_Stop_Haze) See also - [Air pollution in Malaysia](/wiki/Air_pollution_in_Malaysia) - [API](/wiki/Air_Pollution_Index) - [Singapore PSI](/wiki/Pollutant_Standards_Index) - [Social and environmental impact of palm oil](/wiki/Social_and_environmental_impact_of_palm_oil) Category - v - t - e The **Southeast Asian haze** is a fire-related recurrent transboundary [air pollution](/wiki/Air_pollution) issue. [Haze](/wiki/Haze) events, where air quality reaches hazardous levels due to high concentrations of airborne [particulate matter](/wiki/Particulate_pollution) from burning [biomass](/wiki/Biomass_(ecology)), have caused adverse health, environmental and economic impacts in several countries in [Southeast Asia](/wiki/Southeast_Asia). Caused primarily by [slash-and-burn](/wiki/Slash-and-burn) land clearing, the problem flares up every [dry season](/wiki/Dry_season) to varying degrees and generally is worst between July and October and during [El Niño events](/wiki/El_Ni%C3%B1o). Transboundary haze in Southeast Asia has been recorded since 1972 with the (/wiki/1997_Southeast_Asian_haze) and (/wiki/2015_Southeast_Asian_haze) events being particularly severe. Industrial-scale slash-and-burn practices to clear land for agricultural purposes are a major cause of the haze, particularly for [palm oil](/wiki/Palm_oil) and [pulpwood](/wiki/Pulpwood) production in the region. Burning land occurs as it is cheaper and faster compared to cutting and clearing using [excavators](/wiki/Excavator) or other machinery. Fires started for this purpose sometimes spread and create [forest fires](/wiki/Wildfire), worsening the problem. The high concentration of [peat in soil](/wiki/Peat_swamp_forest) contributes to the haze's density and high [sulphur](/wiki/Sulfur) content. Fires in [Indonesia](/wiki/Indonesia) (particularly [South Sumatra](/wiki/South_Sumatra) and [Riau](/wiki/Riau) in [Sumatra](/wiki/Sumatra), and [Kalimantan](/wiki/Kalimantan) in [Borneo](/wiki/Borneo)), and to a lesser extent in [Malaysia](/wiki/Malaysia) and [Thailand](/wiki/Thailand), have been identified as sources. The haze regularly has a major impact on air quality in [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore) and [Brunei Darussalam](/wiki/Brunei_Darussalam); to a lesser extent and in particularly severe years, it also [impacts](/wiki/Impacts_of_the_Gaza_war) the [Philippines](/wiki/Philippines), [Thailand](/wiki/Thailand), [Vietnam](/wiki/Vietnam), [Cambodia](/wiki/Cambodia) and countries outside the region. Haze events have been shown to cause [health issues and mortality](/wiki/Health_impacts_of_air_pollution) in affected areas, and have caused disruption to economic activity and education as sectors are forced to close to minimise exposure to hazardous air. The haze also has a substantial environmental impact, being a major contributor to [greenhouse gas emissions](/wiki/Greenhouse_gas_emissions) in the region and affecting wildlife and ecosystems. The haze is an international issue which has caused regional political tensions. Efforts have been made to mitigate haze events and their impacts, and some relevant frameworks for regional cooperation among [ASEAN](/wiki/ASEAN) countries have been introduced. Challenges remain in implementing these, and mitigation efforts have failed to prevent haze from reoccurring. ## Causes Most haze events have resulted from [smoke](/wiki/Smoke) from fires that occurred on [peatlands](/wiki/Peatlands) in [Sumatra](/wiki/Sumatra) and the [Kalimantan](/wiki/Kalimantan) region of [Borneo](/wiki/Borneo) island. Poor accountability and transparency of Indonesian agricultural companies, and limited political and economic [incentives](/wiki/Incentives) to hold companies to account, have been identified as key barriers to mitigating the issue. Undisturbed humid [tropical forests](/wiki/Tropical_forests) are considered to be very resistant to fire, experiencing rare fires only during extraordinary dry periods. A study published in 2005 concluded that there is no single dominant cause of fire in a particular site and there are wide differences in the causes of fires in different sites. The study identified the following direct and indirect causes of fire: > - *Direct causes of fire* > - Fire as a tool in [land clearing](/wiki/Land_clearing) > - Fire as a weapon in [land tenure](/wiki/Land_tenure) or land use disputes > - Accidental or escaped fires > - Fire connected with [resource extraction](/wiki/Resource_extraction) > - *Indirect causes of fire* > - Land tenure and land use allocation conflicts and competition > - [Forest degrading](/wiki/Forest_degradation) practices > - Economic incentives/disincentives > - Population growth and migration > - Inadequate [fire fighting](/wiki/Fire_fighting) and management capacity ### Fire as a tool in land clearing Fire is the cheapest and fastest method to clear land in preparation for planting. Fire is used to clear the plant material left over from [logging](/wiki/Logging) or old crops. Mechanically raking the plant material into long piles and letting them rot over time, is expensive and slow, and could harbour [pests](/wiki/Pest_(organism)). Clearing land with machines and chemicals can cost up to US$200 per hectare while using fire costs US$5 per hectare. After a [peat swamp forest](/wiki/Peat_swamp_forest) has been cleared and drained, the [peat soil](/wiki/Peat_soil) is still unsuitable for agriculture, because peat soil is nutrient-poor and acidic (pH 3 - 4). To make the soil suitable for agriculture, the pH has to be [neutralised](/wiki/Neutralization_(chemistry)) and nutrients added. Pests and plant diseases also have to be removed. One method is to use chemicals such as [limestone](/wiki/Limestone) to neutralise the [acidity](/wiki/Acidity), as well as [fertilisers](/wiki/Fertilisers) and [pesticides](/wiki/Pesticides). This method costs about Rupiah 30 - 40 million per hectare. Alternatively, fire is used to clear the plant material left over from logging. The fire kills pests and the resulting [ash](/wiki/Ash) serves to fertilise the soil and neutralise the acidity. This method costs Rupiah 2 million per hectare. ### Land conflicts In [Indonesia](/wiki/Indonesia), the Basic Forestry Law grants the [Ministry of Forestry](/wiki/Ministry_of_Environment_and_Forestry_(Indonesia)) authority over all land classified as [forests](/wiki/Environment_of_Indonesia). Approximately 49% of the nation (909,070 square kilometres) is covered by actual forest, although the government classifies 69% of the land area (1,331,270 square kilometres) as forest. The land rights of [traditional communities](/wiki/Native_Indonesians) that live on land classified as forest cannot be registered and are generally unrecognised by the state. Therefore, these communities do not really have the ability to enforce rules at the village level and exclude outsiders such as oil palm plantations, logging companies, residents of other villages, migrants, small-scale loggers or transmigrants. Competing claims in turn leads to land conflicts. As the number of new, external actors increases, so does the likelihood that fire will be used as a weapon. ### Role of peat A [peatland](/wiki/Peatland) is an area where organic material such as leaves and twigs had accumulated naturally under waterlogged conditions in the last 10,000 years. This layer of organic material, known as [peat](/wiki/Peat), can be up to 20m deep. Indonesia has 265,500 km2 of peatland, which comprises 13.9% of its land area. Malaysia also has significant peatland in the [Peninsular](/wiki/Peninsular_Malaysian_peat_swamp_forests) and [Borneo](/wiki/Borneo_peat_swamp_forests), at 26,685 km2, covering 8.1% of its land area. Although originally a [wetland](/wiki/Wetland) ecosystem, much of the peatland in Southeast Asia have been drained for human activities such as agriculture, forestry and urban development. A report published in 2011 stated that more than 30% of peat swamp forests had been converted to agricultural land and a further 30% had been logged or degraded in the past 20 to 30 years. Excessive drainage in peat results in the top layer of peat drying out. Due to its high carbon content, dry peat is extremely susceptible to burning, especially during the dry season. Studies have shown that [peat fires](/wiki/Peat_fires) are a major contributor to the haze. In 2009, around 40% of all fires in Peninsular Malaysia, Borneo, Sumatra and Java were detected in peatlands, even though they cover only 10% of the land area studied. The concentration of [sulphur](/wiki/Sulphur) in rain falling over Singapore in (/wiki/1997_Southeast_Asian_haze) correlated closely with the PM2.5 concentration, which can be attributed to the strong sulphur emission from [peat fires](/wiki/1997_Indonesian_forest_fires). ## History Southeast Asian haze has frequently reoccurred, with the severity and regions affected differing between seasons. The issue has been recorded since 1972. The [1997 Southeast Asian haze](/wiki/1997_Southeast_Asian_haze), caused by [major forest fires in Indonesia](/wiki/1997_Indonesian_forest_fires), is thought to be the most severe on record, leading to dangerous pollution across most of Southeast Asia and affecting air quality as far as [Sri Lanka](/wiki/Sri_Lanka). The [2015 haze](/wiki/2015_Southeast_Asian_haze) has also been highlighted as a particularly severe year. In 2020, [lockdowns](/wiki/COVID-19_lockdowns) and other social movement restrictions introduced due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Southeast_Asia) are thought to have reduced air pollution across the region. - [1997 Southeast Asian haze](/wiki/1997_Southeast_Asian_haze) - [1997 Indonesian forest fires](/wiki/1997_Indonesian_forest_fires) - [2005 Malaysian haze](/wiki/2005_Malaysian_haze) - [2006 Southeast Asian haze](/wiki/2006_Southeast_Asian_haze) - [2009 Southeast Asian haze](/wiki/2009_Southeast_Asian_haze) - [2010 Southeast Asian haze](/wiki/2010_Southeast_Asian_haze) - [2013 Southeast Asian haze](/wiki/2013_Southeast_Asian_haze) - [2015 Southeast Asian haze](/wiki/2015_Southeast_Asian_haze) - [2016 Southeast Asian haze](/wiki/2016_Southeast_Asian_haze) - [2017 Southeast Asian haze](/wiki/2017_Southeast_Asian_haze) - [2019 Southeast Asian haze](/wiki/2019_Southeast_Asian_haze) - 2023 Southeast Asian haze - 2025 Southeast Asian haze ## Effects Haze related damages can be attributed to two sources: the haze causing fire and the haze itself. Each of the two factors can create significant disruption to people's daily lives and affect people's health. As a whole the recurring haze incidents affected regional economy and generated contention between governments of nations affected. ### Direct fire damage Haze fires can cause many kinds of damage that are local as well as transboundary. These include loss of direct and indirect forest benefits, timber, agricultural products and biodiversity. The fires also incur significant firefighting costs and carbon release to the atmosphere. Forest fires that contribute to haze are a part of [deforestation in Indonesia](/wiki/Deforestation_in_Indonesia) and [Malaysia](/wiki/Deforestation_in_Malaysia), a major environmental issue. ### Economy Some of the more direct damage caused by haze includes damage to regional [tourism](/wiki/Tourism) during haze periods, as flights have to be cancelled or delayed during particularly severe events. The haze also leads to industrial production losses, airline and airport losses, damage to fisheries, and incurs the costs on [cloud seeding](/wiki/Cloud_seeding). In addition, severe haze weather can lead to reduced crop productivity, accidents, evacuations, and the loss of confidence of foreign investors. The [1997 Southeast Asian haze](/wiki/1997_Southeast_Asian_haze) is thought to have led to US$9bn in damages across ASEAN whilst the [2015 haze](/wiki/2015_Southeast_Asian_haze) cost Indonesia alone an estimated $16bn. ### Education School closures have affected many parts of Malaysia, Singapore and Indonesia, sometimes for several weeks, due to hazardous air pollution. ### Health The health effects of haze depend on its severity as measured by the [Pollutants Standards Index](/wiki/Pollutants_Standards_Index) (PSI). Levels above 100 are classified as unhealthy and anything above 300 as hazardous. There is also individual variation regarding the ability to tolerate air pollution. Most people would at most experience sneezing, running nose, eye irritation, dry throat and dry cough from the pollutants. However, persons with medical conditions like asthma, chronic lung disease, chronic sinusitis and allergic skin conditions are likely to be more severely affected by the haze and they may experience more severe symptoms. Children and the elderly in general are more likely to be affected. For some, symptoms may worsen with physical activity. One study linked the haze to increased [lung cancer](/wiki/Lung_cancer) diagnoses in Malaysia. The transboundary Southeast Asian haze has been linked to various cardiovascular conditions including acute [ischemic stroke](/wiki/Ischemic_stroke), acute [myocardial infarction](/wiki/Myocardial_infarction) and [cardiac arrest](/wiki/Cardiac_arrest). These studies found dose-dependent effect of PSI on the risk of development these conditions. There appears to be increased susceptibility amongst the elderly and those with history of heart disease and diabetes mellitus. The risk is elevated for several days after exposure. PSI during periods of haze has also been correlated with all-cause mortality, as well as respiratory-illnesses that presented to Emergency Departments and hospital admissions. The [1997 Southeast Asian haze](/wiki/1997_Southeast_Asian_haze) is estimated to have directly led to 40,000 hospitalisations. A 2016 study estimated the [2015 Southeast Asian haze](/wiki/2015_Southeast_Asian_haze) may have caused around 100,000 deaths, most of which were in Indonesia; the BBC estimated over 500,000 suffered from respiratory ailments in the same season. A population study found that individuals experienced mild psychological stress, which was associated with the perceived dangerous PSI level and the number of physical symptoms. ### Environment In addition to the direct burning of rainforest, the haze also harms wildlife in the region such as [orangutans](/wiki/Orangutan), birds and amphibians, by impacting their health and reproduction. It has also been suggested that haze affects [marine ecosystems](/wiki/Marine_ecosystem). The haze also contributes to [greenhouse gas emissions](/wiki/Greenhouse_gas_emissions), to an extent that Indonesia's national daily emissions increased tenfold and temporarily exceeded that of China and the United States during the 2015 haze season. [Deforestation in Indonesia](/wiki/Deforestation_in_Indonesia) contributed to the country being the [third highest emitter](/wiki/List_of_countries_by_carbon_dioxide_emissions) in the world as of 2013. Commentators have suggested Indonesia's emissions during haze seasons undermine potential efforts to reach its pledged [Nationally Determined Contribution](/wiki/Nationally_Determined_Contributions) under the [Paris Agreement](/wiki/Paris_Agreement). ## Responses Countries have responded to haze events with [state of emergency](/wiki/State_of_emergency) declarations, [cloud seeding](/wiki/Cloud_seeding) to clear air and mobilising [firefighting](/wiki/Firefighting) resources to areas being burned. The public have also been recommended to stay at home with the doors closed, and wear [face masks](/wiki/Surgical_mask) when outside to minimise exposure to hazardous air quality. During the severe [1997 haze](/wiki/1997_Southeast_Asian_haze) caused primarily by [forest fires in Indonesia](/wiki/1997_Indonesian_forest_fires), Malaysian Prime Minister [Mahathir Mohamad](/wiki/Mahathir_Mohamad) announced [Operation Haze](/wiki/Operation_Haze), sending Malaysian firefighters to Indonesia to support the response.[*citation needed*] Singapore and Malaysia continuously monitor and report air pollution levels, using the [Pollutant Standards Index](/wiki/Pollutant_Standards_Index) and [Air Pollution Index](/wiki/Air_Pollution_Index), respectively. [ASEAN](/wiki/ASEAN) introduced a [Transboundary Haze agreement](/wiki/ASEAN_Agreement_on_Transboundary_Haze_Pollution) in 2002 following the severe international impact of the [1997 haze](/wiki/1997_Southeast_Asian_haze). Indonesia became the last country in ASEAN to ratify it in 2014, despite its major contribution to the issue. Singapore introduced the [Transboundary Haze Pollution Act 2014](/wiki/Transboundary_Haze_Pollution_Act_2014), that criminalises activities overseas that contribute to haze. Implementation of the domestic act to mitigate the regional issue has been challenging, and has affected [Indonesia–Singapore relations](/wiki/Indonesia%E2%80%93Singapore_relations). Singapore's investigations into individuals involved in the [2015 haze](/wiki/2015_Southeast_Asian_haze) were accepted by Indonesia, on the condition that it did not violate Indonesian sovereignty. Efforts have been made to introduce a similar domestic law in Malaysia, although the government shelved this in 2020. The [Roundtable on Sustainable Palm Oil](/wiki/Roundtable_on_Sustainable_Palm_Oil) added \"no peat\" to its certification scheme in response to the link between palm oil and peat burning. ## Proposed solutions This section needs to be **updated**. The reason given is: only one cite - from 2005. Please help update this article to reflect recent events or newly available information. *(November 2021)*This section **relies largely or entirely on a single source**. Relevant discussion may be found on the talk page. Please help improve this article by introducing citations to additional sources. *Find sources:* \"Southeast Asian haze\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2021)* The below solutions are proposed by Dennis et al. to mitigate the direct and indirect causes of fires which result in haze. ### Reduce the use of fire as a tool in land clearing Indonesian law prohibits the use of fire to clear land for any agriculture but weak enforcement is a major issue. Many companies have also claimed that zero burning is impractical and uncompetitive given the lack of meaningful penalties for illegal burning. ### Land-use allocations and tenure Research shows that the most common cause of fire was related to competition and conflict about land tenure and land allocation. Land-use allocation decisions made by central government agencies often overlap with the concession boundaries of local jurisdictions and indigenous communities' territories. Regional reforms are needed to resolve the resource conflicts and they offer opportunities for the regional government to reconcile decisions with those of local and customary institutions. Regional reforms should also ensure that land and resource allocations and decisions at all levels are compatible with physical site characteristics, prominently taking fire risks into account. However, Indonesia's legacy of inaccurate maps, overlapping boundaries, and a lack of technical expertise at the Provincial and District levels will make this a difficult task. ### Reduce forest degrading practices Policies to improve land management and measures to restore ecological integrity to degraded natural forests are extremely important to reduce the incidence of repeated fires. Promoting community involvement in such rehabilitation efforts is critical for their success in reducing fire risks. ### Capacity to prevent and suppress fires The fires in Kalimantan and Sumatra highlight the need to develop fire management systems that address concerns of specific areas. Sufficient resources must be made available to improve fire management in regions that need them, while recognising the diverse needs of different regions and the people within them. Technology such as remote sensing, digital mapping, and instantaneous communications can help to predict, detect, and respond to potential fire crises. However, such technology should be broadly accessible, widely used, and transparently controlled before they can be effective in improving fire management in remote regions. ### Economic disincentives and incentives In addition to effective criminal and monetary penalties for illegal burning and liability for fire damage, some policy analysts believe in the potential for economic policy reforms and market-based incentives. A combination of eco-labeling and international trade restrictions could reduce markets for commodities that posed high-fire risks in their production. The government could also provide fiscal advantages to support companies' investments in fire management. - [ASEAN Agreement on Transboundary Haze Pollution](/wiki/ASEAN_Agreement_on_Transboundary_Haze_Pollution) - [Asian Brown Cloud](/wiki/Asian_brown_cloud) - [Chemical Equator](/wiki/Chemical_equator) - [Peat swamp forest](/wiki/Peat_swamp_forest) - [Air pollution in Malaysia](/wiki/Air_pollution_in_Malaysia) - [Environmental issues in Indonesia](/wiki/Environmental_issues_in_Indonesia) - [Deforestation in Indonesia](/wiki/Deforestation_in_Indonesia) - [Palm oil production in Indonesia](/wiki/Palm_oil_production_in_Indonesia) - [Stubble burning](/wiki/Stubble_burning) - Combustion of biomass\n",
  "language": "en",
  "processed_at": "2026-01-12T12:02:03.565933",
  "title": "Southeast Asian haze",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Southeast_Asian_haze"
}