{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:02:18.627200"
  },
  "content": "This article **may incorporate text from a large language model**. It may include [hallucinated](/wiki/Hallucination_(artificial_intelligence)) information, copyright violations, claims not verified in cited sources, original research, or fictitious references. Any such material should be removed and content with an unencyclopedic tone should be rewritten. *(October 2025)* *(Learn how and when to remove this message)*Free speech zone in Singapore The **Speakers' Corner** in [Singapore](/wiki/Singapore) is an area located within [Hong Lim Park](/wiki/Hong_Lim_Park) at the [Downtown Core](/wiki/Downtown_Core) district, the only place where [Singaporeans](/wiki/Singaporeans) may demonstrate, hold exhibitions and performances, as well as being able to engage in political open-air public speeches, debates and discussions, with significant restrictions. As a [free speech zone](/wiki/Free_speech_zone), it is named for [Speakers' Corner](/wiki/Speakers%27_Corner) in [Hyde Park](/wiki/Hyde_Park,_London), London. Such free speech zones are found in countries with a political system characterized as an [illiberal democracy](/wiki/Illiberal_democracy). Launched in 2000, it aims to address the desire by Singaporeans for lawful outdoor demonstrations and processions as a means of further political expression. Only Singaporean citizens are entitled to organise or participate in demonstrations at the Speakers' Corner. Hong Lim Park was chosen as it was previously also a popular venue for many election rallies and political speeches during the 1950s and 1960s. Furthermore, the park is centrally located within the [city centre](/wiki/Central_Region,_Singapore), and is well-served by [public transport](/wiki/Transport_in_Singapore) services while being situated in a high public density area. ## Launch The corner was opened on 1 September 2000 by the [Singapore Government](/wiki/Singapore_Government) as a [free speech zone](/wiki/Free_speech_zone) where speaking events could be held without the need to apply for a licence under the Public Entertainments Act (Cap. 257, 1985 Rev. Ed.), now the Public Entertainments and Meetings Act (Cap. 257, 2001 Rev. Ed.) (PEMA). People had to register their intention to speak at the venue with a police officer at the [Kreta Ayer Neighbourhood Police Post](/wiki/Kreta_Ayer_Neighbourhood_Police_Post) any time within 30 days before the event, though there was no requirement for the police to be informed of the topic of the proposed speech. Other conditions imposed were that speeches had to take place between 7:00 a.m. and 7:00 p.m., and the use of sound amplification devices was prohibited. In 2002, exhibitions and performances were permitted to be held at Speakers' Corner. Conditions for the use of Speakers' Corner were further liberalised in 2008. Responsibility for registering people wishing to speak or stage an exhibition or performance was taken over by the Commissioner of Parks and Recreation, and online registration was introduced. It became possible to hold [demonstrations](/wiki/Demonstration_(people)) provided they are organized by [Singapore citizens](/wiki/Singaporean_nationality_law) and the participants are only citizens and [permanent residents](/wiki/Permanent_residency). Events can now be held around the clock, and self-powered amplification devices like [loudhailers](/wiki/Megaphone) may be used between 9:00 a.m. and 10:30 p.m. At present, Speakers' Corner is concurrently regulated by the Parks and Trees Regulations (Cap. 216, Rg. 1, 2006 Rev. Ed.), the Public Entertainments and Meetings (Speakers' Corner) (Exemption) (No. 2) Order 2011 (S 493/2011) (issued under the PEMA) and the Public Order (Unrestricted Area) (No. 2) Order 2011 (S 494/2011) (issued under the Public Order Act 2009 (No. 15 of 2009) (\"POA\")). The applicable conditions have remained essentially unchanged. Speakers and demonstration organizers must be Singapore citizens, while participants at demonstrations must be either citizens or [permanent residents](/wiki/Permanent_residency). Banners, films, flags, photographs, placards, posters, signs, writing or other visible representations or paraphernalia containing violent, lewd or obscene material must not be displayed or exhibited. Persons making speeches must use any of the four official languages of Singapore (English, [Malay](/wiki/Malay_language), [Mandarin](/wiki/Standard_Chinese) and [Tamil](/wiki/Tamil_language)) or related dialects, and organizers of demonstrations must be present throughout the event. Events must not deal with any matter that relates directly or indirectly to any religious belief or to religion generally, or which may cause feelings of enmity, hatred, ill-will or hostility between different racial or religious groups in [Singapore](/wiki/Singapore). Events adhering to the regulations are not immune from other existing laws such as those relating to [defamation](/wiki/Defamation) and [sedition](/wiki/Sedition). [Articles 14(1)(a) and (b)](/wiki/Article_14_of_the_Constitution_of_Singapore) of the [Constitution of Singapore](/wiki/Constitution_of_Singapore) respectively guarantee freedom of speech and expression and [freedom of assembly](/wiki/Freedom_of_assembly) to Singapore citizens. The PEMA and POA, which require permits to be obtained before public meetings and assemblies can be held, were enacted pursuant to exceptions to these rights. Article 14(2)(a) provides that [Parliament](/wiki/Parliament_of_Singapore) may by law restrict the right to free speech to protect, among other things, Singapore's security and public order, and to prevent incitement to any criminal offence. Under Article 14(2)(b), the right of assembly may also be limited for public order reasons. As Speakers' Corner was intended to increase avenues available for the exercise of free speech, the pieces of [subsidiary legislation](/wiki/Sources_of_Singapore_law#Subsidiary_legislation) regulating the venue were issued to provide that public speaking and demonstrations there are not subject to the PEMA and POA if the conditions specified in the subsidiary legislation are complied with. ## Background and establishment Singapore's political model has been described as a [representative democracy](/wiki/Representative_democracy_in_Singapore), and Singaporeans have constitutional rights to freedom of speech and assembly under [Articles 14(1)(a) and (b)](/wiki/Article_14_of_the_Constitution_of_Singapore) of the [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore). The constitutional rights to free speech and assembly extend only to [Singapore citizens](/wiki/Singaporean_nationality_law). Hence, the [Singapore Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) has held that non-citizens enjoy only common law free speech. Articles 14(1)(a) and (b) are then subject to Articles 14(2)(a) and (b) which allow Parliament to impose, by law, restrictions on the rights to freedom of speech and assembly. The grounds for restrictions are, for freedom of speech, Singapore's security, friendly relations with other states, public order, public morality, protecting [parliamentary privilege](/wiki/Parliament_of_Singapore#Privileges_and_immunities), [defamation](/wiki/Defamation), [contempt of court](/wiki/Contempt_of_court) and incitement to any criminal offence; and for freedom of assembly, public order only. These restrictions made it a lengthy and difficult process to obtain the licence required to address a public gathering. In response to these free speech concerns, Speakers' Corner was created as local adaptation of the [Speakers' Corner](/wiki/Speakers%27_Corner#Hyde_Park) in [Hyde Park, London](/wiki/Hyde_Park,_London), in 2000. In a 1999 interview with *[New York Times](/wiki/The_New_York_Times)* columnist [William Safire](/wiki/William_Safire), the [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Goh Chok Tong](/wiki/Goh_Chok_Tong) said the idea had first been suggested by the [Senior Minister](/wiki/Senior_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), but Goh felt that it was not yet the right time to set it up. The following year, the [Government](/wiki/Government_of_Singapore) decided to go ahead despite its fear of potential public disorder, as the idea enjoyed widespread support from the public and [civil society](/wiki/Civil_society) groups. During a [Parliamentary](/wiki/Parliament_of_Singapore) debate on the issue on 25 April 2000, opposition [Member of Parliament](/wiki/List_of_Singapore_MPs) [Joshua Benjamin Jeyaretnam](/wiki/Joshua_Benjamin_Jeyaretnam) asked the [Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) [Wong Kan Seng](/wiki/Wong_Kan_Seng) whether this was a \"mere show\" or whether the Government was serious about promoting free speech in Singapore. If the latter, he asked if the Minister would agree to an open debate with the [Workers' Party of Singapore](/wiki/Workers%27_Party_of_Singapore) outside Parliament. In response, Wong said there was nothing to prevent Jeyaretnam from making a speech at Speakers' Corner, but that the public forum for a proper policy debate was in Parliament: > It is not just a question of symbolism. Of course, we have a place to show. It is symbolism in the sense that, yes, if you want a place, there is a place. But for free speech, I think we must not delude ourselves. He [Jeyaretnam] can do so on the Internet. He can do so with the press. He can do so in any place he wants, subject to the rules of the land. And he can do so right here. So, what is the worry about having free speech? There is free speech all the time. It is a question of whether he is prepared to have it or not. Do not run away from it. When we give him an answer, stay here to listen. Speakers' Corner was launched on 1 September 2000 at [Hong Lim Park](/wiki/Hong_Lim_Park), a historical venue for political speeches and rallies. The park's proximity to the Kreta Ayer Neighbourhood Police Post (NPP) also made it convenient for people to register to speak at the venue. In the first nine months, more than a thousand speeches were made. ## Factors leading to establishment While the establishment of Speakers' Corner in Singapore on September 1, 2000, is often attributed to Senior Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew)'s initiative, its genesis was more complex and not solely a unilateral decision to grant free speech. The idea did not emerge \"out of the blue\", but rather in a climate of increasing scrutiny and advocacy for greater civic space. This period also saw intensified efforts by local activists, particularly [Chee Soon Juan](/wiki/Chee_Soon_Juan) and his fellow members from the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party) (SDP). They consistently engaged in acts of public assembly, procession, and speech, often without permits, leading to repeated fines, detentions, and imprisonments. These actions, despite the legal repercussions, served to highlight the existing restrictions on public expression and generated domestic and international discussion about the need for greater civic freedoms in Singapore. In an interview published in *[The New York Times](/wiki/The_New_York_Times)* in February 1999, columnist [William Safire](/wiki/William_Safire) directly questioned Lee Kuan Yew on Singapore's stance on public assembly and free expression. Safire wrote: \"[Lee Kuan Yew] brought up the example of Chee Soon Juan, 36, a neuropsychologist who dared to run for Parliament, After being fired from his job and losing his home, Dr Chee was arrested for breaching the Public Entertainment Act by trying to make a speech\". Safire related in his column how Lee had promised to set up a venue where Singaporeans could gather and speak. He added: \"Joseph Nye, head of Harvard's Kennedy School, suggested that Singapore set aside a place like London's old Hyde Park Corner, where people gathered to hear speakers sound off freely. Lee promises: 'We'll probably do it'\". The establishment of Speakers' Corner can therefore be viewed not merely as an internal policy shift, but as a carefully calibrated measure in response to a confluence of internal activism and external pressure, rather than a broad embrace of unfettered free speech. The initial stringent rules and ongoing restrictions on content (e.g., race and religion) and activities at Speakers' Corner further underscore this managed approach to public discourse. In February and March 1999, Chee Soon Juan served jail terms of 7 and 12 days for violating the Public Entertainments Act after making speeches without permits in December 1998 and January 1999, opting for jail rather than fines. A second SDP member, found guilty under similar charges for assisting Chee during his January speech, also opted for a 12-day jail term rather than pay a S$2,400 (USD $1,500) fine. Leaders of the ruling Peoples' Action Party (PAP) have a history of using civil defamation suits and jailing for public protests to suppress free expression and assembly in Singapore. Even after its establishment, activists like Chee Soon Juan continued to face legal challenges and restrictions for their attempts to engage in public assembly beyond the designated space and its specific regulations, signaling the enduring challenges to broader free expression in Singapore. ## Regulations ### Past Speakers' Corner was established by the issuance of the Public Entertainments (Speakers' Corner) (Exemption) Order 2000, which exempted people wishing to speak in Hong Lim Park from the need to apply for a licence under the Public Entertainments Act. Speakers had to be [Singapore citizens](/wiki/Singaporean_nationality_law), as the Government was concerned that the venue should not be used by foreigners \"to pursue their own agenda whether in respect of their own domestic issues, or those of other countries, including Singapore's\". They also had to register their intention to speak with a police officer at the Kreta Ayer NPP any time within 30 days before the public speaking, although there was no need to inform the police of the topic of the proposed speech. They were not permitted to deal with any matter which related either directly or indirectly to any religious belief or to religion generally, or which might cause feelings of enmity, hatred, ill-will or hostility between different racial or religious groups in Singapore. Other conditions imposed on a speech at Speakers' Corner were that it had to take place only between 7:00 a.m. and 7:00 p.m. on the date notified by the person to the police, had to be in any of Singapore's four official languages (English, [Malay](/wiki/Malay_language), [Mandarin](/wiki/Standard_Chinese) or [Tamil](/wiki/Tamil_language)) or any related dialects, and the use of sound amplification devices was prohibited. The latter restriction was justified on the grounds that it would reduce [noise pollution](/wiki/Noise_pollution) and prevent one speaker from drowning out another one, and that it also applied to Speakers' Corner in London. In 2002, exhibitions and performances were also permitted to be held at Speakers' Corner. The conditions that organizers and participants had to adhere to were broadly similar to those applying to speeches. In addition, the organizer or an authorized agent had to be present at all times during the exhibition or performance, the event could not contain violent, lewd or obscene messages, no banners or placards could be carried by participants, and the event could not be an assembly or procession for which a permit was required under the Miscellaneous Offences (Public Order and Nuisance) (Assemblies and Processions) Rules. With effect from 1 September 2008, under the Public Entertainments and Meetings (Speakers' Corner) (Exemption) Order 2008 (\"2008 PEMA Order\"), responsibility for registering people wishing to speak or stage an exhibition or performance at Speakers' Corner was taken over from the police by the Commissioner of Parks and Recreation by way of an amendment to the Parks and Trees Regulations. To provide greater convenience, the [National Parks Board](/wiki/National_Parks_Board) made it possible for people to register online at its website. In addition, it became possible to hold [demonstrations](/wiki/Demonstration_(people)) provided that they are organized by Singapore citizens and the participants are only citizens and permanent residents. As the time period restriction was lifted, events can now be held around the clock. In addition, rules on voice amplification were revised to allow the use of self-powered amplification devices like [loudhailers](/wiki/Megaphone) from 9:00 a.m. to 10:30 p.m. This relaxation of the rules potentially allows for speakers' messages to be heard by larger audiences. A minor change was also introduced to the conditions for the use of Speakers' Corner – no banner, film, photograph, [placard](/wiki/Placard) or poster containing any violent, lewd or obscene material may be displayed or exhibited whether before, during or after the event. In the first month after public demonstrations were permitted at Speakers' Corner, 11 out of the 31 applications received were indicated as being public protests. Hearers of Cries, a group concerned with the plight of abused maids, became the first group to hold a public outdoor demonstration at Speakers' Corner. ### Current The Public Order Act, intended to regulate public assemblies and processions and to introduce new powers for the preservation of public order, came into force on 9 October 2009. On the same day, the Public Order (Unrestricted Area) Order 2009 (\"2009 POA Order\") made pursuant to the Act declared that Speakers' Corner was an unrestricted area in which assemblies and processions could be held without the need for a police permit. Thus, at present, Speakers' Corner is concurrently regulated by the Parks and Trees Regulations, and by exemption orders issued under the PEMA and POA. The conditions under which addresses, debates, demonstrations, discussions, lectures and talks (whether or not together with any exhibition, performance, play-reading or recital), must be held have remained essentially unchanged. Speakers and demonstration organizers must be Singapore citizens, while participants in demonstrations must be either citizens or permanent residents. Banners, films, flags, photographs, placards, posters, signs, writing or other visible representations or paraphernalia containing violent, lewd or obscene material must not be displayed or exhibited. Persons making speeches must use any of the four official languages of Singapore or related dialects, and organizers of demonstrations must be present throughout the event. Crucially, events held at Speakers' Corner must not deal with any matter that relates directly or indirectly to any religious belief or to religion generally, or which may cause feelings of enmity, hatred, ill-will or hostility between different racial or religious groups in Singapore. A contravention of the regulations renders speakers and organizers of demonstrations liable to fines of up to $10,000, or incarceration of up to six months. The penalty for displaying anything violent, lewd or obscene at a demonstration is a fine not exceeding $3,000 or, on a subsequent conviction, $5,000. Events which adhere to the regulations are also not immune from other existing laws such as those relating to [defamation](/wiki/Defamation) and [sedition](/wiki/Sedition). In 2011, the regulations creating Speakers' Corner were suspended and then restored twice: first for the purpose of the campaigning period during the [general election](/wiki/2011_Singaporean_general_election), and subsequently for the [presidential election](/wiki/2011_Singaporean_presidential_election). ## Controversies In 2002, Dr. [Chee Soon Juan](/wiki/Chee_Soon_Juan), Secretary-General of the [Singapore Democratic Party](/wiki/Singapore_Democratic_Party), became the only Singaporean fined for advocating religious freedom at Speakers' Corner when he spoke against the government's ban on Muslim girls wearing the tudung (headscarf) in schools. Presenting the case for equality, racial harmony, and social cohesion, Chee challenged the lack of evidence behind claims that such religious expressions cause racial disunity. Despite facing government opposition, he consistently championed multicultural tolerance and spoke out against policies limiting religious freedoms in workplaces. His stance at Speakers' Corner highlighted the importance of embracing diversity and advocating for minority rights in Singapore's social fabric. Chee was charged and convicted with violation of the Public Entertainment and Meetings Act as a result, and fined $3,000. The fine imposed on Chee means that he could not stand in a parliamentary election for five years, disqualifying him for the [2006 Singapore General Elections](/wiki/Elections_in_Singapore). On 8 October 2002, Chee was sentenced to five weeks in prison after organizing a May Day rally for workers' rights without official permission. The police had earlier rejected Chee's application to stage the 'People Against Poverty' rally on the grounds that it might disrupt law and order. In protest against what he saw as censorship and unjust laws restricting public gatherings and free speech, Chee proceeded with the rally outside the [Istana](/wiki/The_Istana), leading to his arrest along with fellow organizer Ghandhi Ambalam. In January 2008, the [Complaints Choir](/wiki/Complaints_Choir), a vocal group participating in the [M1 Singapore](/wiki/M1_Limited) Fringe Festival 2008, was denied the chance to perform at Speakers' Corner and other outdoor venues unless the six foreigners in the group of 50 did not participate in the performance. As the choir did not wish to be split up in any way, it decided not to go ahead with the performance. Queried on the matter in Parliament, the [Minister for Communication, Information and the Arts](/wiki/Ministry_of_Information,_Communications_and_the_Arts) Dr. [Lee Boon Yang](/wiki/Lee_Boon_Yang) stated that the Government did not think it \"desirable or good precedent\" for \"foreigners [to come] here to organise and to lead Singaporeans to complain about our domestic issues\". On 19 September 2008, Thamiselvan Karuppaya, an Indian real estate agent who wished to speak at Speakers' Corner about the use of Tamil on public signs, had to change his plans after being informed by the police that he required a permit as the topic of his speech was racially sensitive. A subsequent application for a permit was turned down. ## Rights to free speech and assembly In his 2008 [National Day Rally](/wiki/National_Day_Rally) speech, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) indicated that the purpose behind various government policies, including the creation of Speakers' Corner, was to \"liberalise our society, to widen the space for expression and participation\". Its reception was mixed and included a wide range of views and perspectives on the impact of Speakers' Corner on increasing space for free speech and the freedom to assemble. It has been called an \"exercise in tokenism\" for the purpose of preserving a literal \"space\" for engaging in free speech while also \"cornering\" it in that space. This is reflected in the relative lack of progress toward liberalization in other areas such as awards of high damages in libel lawsuits brought by politicians which has been said to have a [chilling effect](/wiki/Chilling_effect_(law)) on political speech in Singapore. Former Workers' Party member [James Gomez](/wiki/James_Gomez_(politician)) has also expressed concerns about the effectiveness of the Speakers' Corner as a site of vibrant political debate, citing the lack of a \"culture of speaking\" amongst Singaporeans. The ban on racially or religiously sensitive speech has been criticized as possibly curtailing free speech on genuine political matters and limiting the scope of constitutionally entrenched fundamental liberties. Despite such criticisms, some social activist groups remain optimistic that Speakers' Corner represents a step toward political liberalization and the promise of a wider political space. Although Dr. Kenneth Paul Tan, Assistant Dean of the [Lee Kuan Yew School of Public Policy](/wiki/Lee_Kuan_Yew_School_of_Public_Policy), has noted that initial cynicism was inevitable as Speakers' Corner was a top-down initiative, he recognizes that civil society activists have since actively occupied and made use of Speakers' Corner to generate public interest in various social and political issues. This view is shared by Professor Bilveer Singh, a political science analyst at the [National University of Singapore](/wiki/National_University_of_Singapore), who has pointed to large turnouts at events organized at Speakers' Corner as evidence that Singaporeans are \"not fearful and not politically apathetic\". The government has also shown itself to be sensitive to calls for greater liberalisation on the ground, with Prime Minister Lee Hsien Loong acknowledging incremental changes to the rules and regulations at Speakers' Corner to be necessary for \"more citizens to engage in debate\" and to \"progressively open up our system even more\". ## Developments In 2008, Speakers' Corner was the scene for meetings held over several weeks by [Tan Kin Lian](/wiki/Tan_Kin_Lian), former chief executive of insurance company [NTUC Income](/wiki/NTUC_Income), to advise people of their legal recourse after [structured products](/wiki/Structured_product) they had purchased became virtually valueless upon the collapse of [Lehman Brothers](/wiki/Lehman_Brothers). On 23 January 2009 during an event at Speakers' Corner, the [National Solidarity Party](/wiki/National_Solidarity_Party_(Singapore)) gave its views on the national budget one day after it was announced, criticizing the Government for not doing enough to assist unemployed breadwinners during the recession. The Party's secretary-general, Ken Sunn, said the event was to let Singaporeans \"participate, speak and hear various views and opinions on the Singapore Government's 2009 Budget statement, and discuss ways to improve our Singapore Economy\". The first public rally by the [lesbian, gay, bisexual and transgender (LGBT) community in Singapore](/wiki/LGBT_in_Singapore), called [Pink Dot SG](/wiki/Pink_Dot_SG), was held on 16 May 2009. Estimates of the number of people who attended ranged from 1,000 to 2,500 people. Held every year since, the event was attended by 28,000 people in 2015. On 31 May 2009, more than a hundred people attended a demonstration at Speakers' Corner organized by human rights advocacy group Maruah to call for [Myanmar](/wiki/Myanmar)'s [military junta](/wiki/Military_junta) to release [Aung San Suu Kyi](/wiki/Aung_San_Suu_Kyi). Participants from Myanmar were requested to remain outside a cordoned-off area since only Singaporeans and permanent residents may attend demonstrations at Speakers' Corner. In July 2009, the [police](/wiki/Singapore_Police_Force) installed closed circuit television (CCTV) cameras for \"safety and security\". The police said that the cameras complemented the presence of their officers on the ground and did not record audio inputs. The move drew some negative reactions from the public. Former [Nominated Member of Parliament](/wiki/Nominated_Member_of_Parliament) Siew Kum Hong felt that the installation of CCTV cameras was \"pretty ridiculous\", and wondered if the move might feed the perception in some quarters that Singapore is a [police state](/wiki/Police_state), since Speakers' Corner is \"the one place in Singapore\" where people can demonstrate. Nevertheless, the surveillance cameras have not affected various events from being held. With effect from 1 December 2009, the size of Speakers' Corner was reduced so that it only occupies the half of Hong Lim Park nearer [New Bridge Road](/wiki/New_Bridge_Road). From 1 March 2012, Speakers' Corner was expanded to include an area behind Kreta Ayer NPP, near the junction of North Canal Road and [South Bridge Road](/wiki/South_Bridge_Road). A commemorative birthday memorial was organized for J.B. Jeyaretnam, the late leader of the opposition [Reform Party](/wiki/Reform_Party_(Singapore)), at Speakers' Corner on 5 January 2010. At the event, several opposition politicians shared with the public their experiences with Jeyaretnam. In September 2010, *[Today](/wiki/Today_(Singapore_newspaper))* newspaper reported that statistics from the [National Parks Board](/wiki/National_Parks_Board) indicated that the number of groups registering to stage events at Speakers' Corner had fallen from 39 between September 2008 and August 2009, to nine between September 2009 and August 2010. The number of individuals registering dropped from 102 to 57 during the same periods. [Senior Minister](/wiki/Senior_Minister_of_Singapore) [Goh Chok Tong](/wiki/Goh_Chok_Tong), who was [Prime Minister](/wiki/Prime_Minister_of_Singapore) when Speakers' Corner was set up, expressed the view that its use had declined because there were now other avenues for people to express themselves such as the Internet (including the [Government](/wiki/Government_of_Singapore)'s online feedback portal Reach), newspapers, and radio and television channels. Also, people might feel that the venue is not always the best place \"to meaningfully and constructively press their views on issues\". He saw Speakers' Corner as \"playing the same role as envisaged – mostly dormant but good to have\". On 30 November 2013, the first public rally by the [special needs community in Singapore](/wiki/Disability_in_Singapore), called [The Purple Parade](/wiki/The_Purple_Parade), was held. The event attracted 4,000 participants. The event has been held every year since, with the event moved to the [Fountain of Wealth](/wiki/Fountain_of_Wealth) in [Suntec City](/wiki/Suntec_City) in 2016. The [COVID-19 pandemic](/wiki/COVID-19_pandemic) had caused applications to host events at the Speakers' Corner being suspended in April 2020. As such, the Pink Dot rally in 2020 was a virtual event rather than a physical rally at Speakers' Corner. Speakers' Corner was reopened on 25 March 2022. In relation to the [Gaza war](/wiki/Gaza_war) as part of the wider [Israeli–Palestinian conflict](/wiki/Israeli%E2%80%93Palestinian_conflict), the SPF and NParks said in a joint statement that \"The Police will not grant any permit for assemblies that advocate political causes of other countries or foreign entities, or may have the potential to stir emotions and lead to public order incidents\", and that \"peace and harmony between different races and religions in Singapore should not be taken for granted, and we must not let events happening externally affect the internal situation within Singapore\". - [Demonstration (protest)](/wiki/Demonstration_(protest)) - [Public demonstrations in Singapore](/wiki/Public_demonstrations_in_Singapore) - [Speakers' Corner](/wiki/Speakers%27_Corner) ## Notes ### Legislation - Public Entertainments and Meetings Act (Cap. 257, 2001 Rev. Ed.) (\"PEMA\"). - Public Entertainments (Speakers' Corner) (Exemption) Order 2000 (S 364/2000) (\"2000 PEA Order\"). - Public Entertainments and Meetings (Speakers' Corner) (Exemption) Order (Cap. 257, O 3, 2002 Rev. Ed.), archived from the original on 27 September 2010 (\"2002 PEMA Order\"). - Public Entertainments and Meetings (Speakers' Corner) (Exemption) Order 2008 (S 426/2008) (\"2008 PEMA Order\"). - Public Order Act 2009 (No. 15 of 2009) (\"POA\"). - Public Order (Unrestricted Area) Order 2009 (S 491/2009) (\"2009 POA Order\"). ### Other works - [Thio, Li-ann](/wiki/Thio_Li-ann) (2003), \"Singapore: Regulating Political Speech and the Commitment 'to Build a Democratic Society'\", *International Journal of Constitutional Law*, **1** (3): 516–524, [doi](/wiki/Doi_(identifier)):10.1093/icon/1.3.516. - [Wong, Kan Seng](/wiki/Wong_Kan_Seng) ([Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore))), \"Speakers' Corner\", *Singapore Parliamentary Debates, Official Report* (25 April 2000), vol. 72, cols. 20–30. ### Articles - Goh, Ivy (27 March 2001), *Speakers' Corner*, Singapore Infopedia, [National Library Board](/wiki/National_Library_Board), archived from the original on 24 March 2012, retrieved 27 September 2010. - [Kurlantzick, Joshua](/wiki/Joshua_Kurlantzick) (Winter 2000–2001), \"Love My Nanny: Singapore's Tongue-Tied Populace\", *[World Policy Journal](/wiki/World_Policy_Journal)*, **17** (4): 69–74, [doi](/wiki/Doi_(identifier)):10.1215/07402775-2001-1011, [JSTOR](/wiki/JSTOR_(identifier)) 40209720. - Lee, Terence (March 2002), \"The Politics of Civil Society in Singapore\", *Asian Studies Review*, **26** (1): 97–117, [doi](/wiki/Doi_(identifier)):10.1080/10357820208713332, [S2CID](/wiki/S2CID_(identifier)) 145542946. - *Singapore: Asia's Gilded Cage [HRF/55/02]*, Human Rights Features, South Asia Human Rights Documentation Centre, Asia-Pacific Human Rights Network, 17 April 2002, retrieved 27 September 2010. - [Thio, Li-ann](/wiki/Thio_Li-ann) (2002), \"Recent Constitutional Developments: Of Shadows and Whips, Race, Rifts and Rights, Terror and Tudungs, Women and Wrongs\", *Singapore Journal of Legal Studies*: 328–373 at 339–340, [SSRN](/wiki/SSRN_(identifier)) 426950. - William, Ramesh (8 January 2009), \"Speak or (and?) be damned\", *I-S*, archived from the original on 16 November 2010, retrieved 15 September 2010. - Wong, Theresa; Wainwright, Joel (September 2009), \"Offshoring Dissent\", *Critical Asian Studies*, **41** (3): 403–428, [doi](/wiki/Doi_(identifier)):10.1080/14672710903119776, [S2CID](/wiki/S2CID_(identifier)) 155119877. ### Books - Lee, Terence (2010), *The Media, Cultural Control and Government in Singapore*, Abingdon, Oxford; New York, N.Y.: [Routledge](/wiki/Routledge), [ISBN](/wiki/ISBN_(identifier)) 978-0-415-41330-5. - Wong, Samuel (2000), *Speak! or Forever Hold Thy Peace!: Speaker's Corner* [sic] *and Free Speech in Singapore* [unpublished academic exercise], Singapore: Department of Sociology, Faculty of Arts and Social Sciences, [National University of Singapore](/wiki/National_University_of_Singapore). ### News reports - Mydans, Seth (3 September 2000), \"'Tom, Dick and Harry' of Singapore tasting freedom of Speakers' Corner\", *[Chicago Tribune](/wiki/Chicago_Tribune)*, archived from the original on 6 June 2012. - Berger, Sebastien (28 August 2004), \"Worldwide: Few dare to raise their voices at the Singapore Speakers' Corner\", *[The Daily Telegraph](/wiki/The_Daily_Telegraph)*, London, archived from the original on 1 March 2016. - Oei, Andre (2 February 2009), \"A spot for Speakers' Corner despite growing blogosphere\", *[The Straits Times](/wiki/The_Straits_Times) (reproduced on the [AsiaOne](/wiki/AsiaOne) website)*. ### Websites - Complaints Choir of Singapore – Live on [YouTube](/wiki/YouTube_video_(identifier)) - Our Hope for Singapore @ Speakers Corner (Part 1) on [YouTube](/wiki/YouTube_video_(identifier)) - Our Hope For Singapore @ Speakers Corner (Part 2) on [YouTube](/wiki/YouTube_video_(identifier)) - Pink Dot Loves Singapore! on [YouTube](/wiki/YouTube_video_(identifier)) - Singapore Iranian Student Protest at Speakers Corner on 11 Feb (Musical) on [YouTube](/wiki/YouTube_video_(identifier)) - Speakers Corner: People, Protests, Freedom on [YouTube](/wiki/YouTube_video_(identifier)) - Speakers Cornered Teaser on [YouTube](/wiki/YouTube_video_(identifier)) - National Parks Board - Police Licensing Computerised System (PLUS), Singapore Police Force Portals: - Freedom of speech - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T12:02:18.626909",
  "title": "Speakers' Corner, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Speakers%27_Corner,_Singapore"
}