{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:02:14.234315"
  },
  "content": "Campaign in Singapore to make Mandarin the native language of Chinese Singaporeans The **Speak Mandarin Campaign** (**SMC**; [traditional Chinese](/wiki/Traditional_Chinese_characters): 講華語運動; [simplified Chinese](/wiki/Simplified_Chinese_characters): 讲华语运动; [pinyin](/wiki/Pinyin): *Jiǎng Huáyǔ Yùndòng*) is an initiative by the [Government of Singapore](/wiki/Government_of_Singapore) to encourage the [Chinese Singaporean](/wiki/Chinese_Singaporean) population to speak [Standard Mandarin Chinese](/wiki/Standard_Mandarin), one of the four [official languages](/wiki/Official_language) of [Singapore](/wiki/Singapore) as [Singaporean Mandarin](/wiki/Singaporean_Mandarin). It was launched on 7 September 1979 by then Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) and organised by the [Promote Mandarin Council](/wiki/Promote_Mandarin_Council). The SMC has been held annually to promote the use of Mandarin. The campaign is contentious among Singaporeans. The ancestral origins of most Chinese Singaporeans were not from Mandarin speaking regions, and [Singaporean Hokkien](/wiki/Singaporean_Hokkien) had served as the *[lingua franca](/wiki/Lingua_franca)* of the Chinese community in Singapore until the campaign began. Since the 2010s, the SMC has been scaled down, with the government promoting greater appreciation of other Chinese varieties and relaxing restrictions on their use in local media. At the same time, many Singaporeans have begun to rediscover the ancestral forms of their respective Chinese varieties. Since 2020, Mandarin itself was surpassed by [Singaporean English](/wiki/Singaporean_English) as the primary language in Chinese Singaporean households. ## Background In 1966, the Singaporean government implemented a policy of [bilingual](/wiki/Bilingual) education, where Singaporean students learn both English and their designated mother tongue, which was Mandarin for all Chinese Singaporeans \"by default\". The *Goh Report*, an evaluation of Singapore's education system by [Goh Keng Swee](/wiki/Goh_Keng_Swee), showed that less than 40% of the student population managed to attain minimum levels of [competency](/wiki/Linguistic_competence) in two languages. It was later determined that the learning of Mandarin among Chinese Singaporeans was hindered by home use of native [Chinese varieties](/wiki/Varieties_of_Chinese), such as [Hokkien](/wiki/Singaporean_Hokkien), [Teochew](/wiki/Teochew_Min), [Cantonese](/wiki/Cantonese) and [Hakka](/wiki/Hakka_Chinese). Hence, the government decided to rectify problems facing implementation of the bilingual education policy, by launching a campaign to promote Mandarin as a common language among the Chinese Singaporean population, and to discourage use of other Chinese varieties. Launched in 1979 by then [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), the campaign aimed to simplify the language environment for [Chinese Singaporeans](/wiki/Chinese_Singaporeans), improve communication between them, and create a Mandarin-speaking environment conducive to the successful implementation of the bilingual education programme. The initial goal of the campaign was for all young Chinese to stop speaking topolects in five years, and to establish Mandarin as the language of choice in public places within 10 years. According to the government, for the bilingual policy to be effective, Mandarin should be spoken at home and should serve as the new [lingua franca](/wiki/Lingua_franca) among Chinese Singaporeans. They argued that Mandarin was more \"economically valuable\", and speaking Mandarin would help Chinese Singaporeans supposedly retain their heritage, as Mandarin seemingly contains a \"cultural repository of values and traditions\" that are \"identifiable to all Chinese\", regardless of \"topolect group\". ## Rationale The rationale of the SMC was initially to encourage more people, especially the young, to speak Mandarin instead of other Chinese varieties. This aimed to enable communication across different dialect groups and, at the same time, reduce language barriers between Singapore's various ethnic communities particularly after [independence](/wiki/Independence_of_Singapore). With the demands of globalisation and other economic challenges facing a young nation, the government increasingly emphasised English. As a result, many English-educated Chinese Singaporeans began to lose proficiency in Mandarin and other Chinese languages. ### Initial response During the [1991 Singaporean general election](/wiki/1991_Singaporean_general_election), the governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP) retained its [supermajority](/wiki/Supermajority) but secured a smaller share of seats than in previous elections. One factor was the opposition's ability to tap into the linguistic anxieties of [working class](/wiki/Working_class) Chinese Singaporeans who spoke varieties of Chinese other than Mandarin. Many of these Singaporeans held onto their own languages as a form of identity and some refused to enrol their children in schools that had Mandarin names. As a result, the PAP government switched its focus away from non-Mandarin Chinese varieties towards encouraging English-speaking and educated Chinese to speak more Mandarin. In 1994, the SMC specifically targeted English-educated business professionals and working adults. It promoted the use of Mandarin, to keep their \"links\" to cultural roots, so as to better appreciate the \"heritage and value\" and, most importantly, complement the economical aspects as [China began to rise](/wiki/Rise_of_China) in the business sector. In 2010, through The Chinese Challenge, the SMC moved towards a cultural aspect, whereby its main focus is to promote Singaporeans to hold on to their \"roots\", knowing their own culture well. ## Campaigns For each SMC, a slogan was created and a different segment of the Chinese community was targeted. Campaign slogans YearTarget audienceMandarin Chinese sloganEnglish (translation)English (official)1979Chinese community多讲华语，少说方言 *duō jiǎng huá yǔ, shǎo shuō fāng yán*Speak More Mandarin, Speak Less DialectsSpeak More Mandarin, Speak Less Dialects1981Chinese community学华语，讲华语 *xué huá yǔ, jiǎng huá yǔ*Learn Mandarin, Speak MandarinLearn Mandarin, Speak Mandarin1982Workplaces在工作场所讲华语 *zài gōng zuò chǎng suǒ jiǎng huá yǔ*Speak Mandarin While At WorkSpeak Mandarin While At Work1983Markets and food centres华人讲华语，合情又合理 *huá rén jiǎng huá yǔ, hé qíng yòu hé lǐ*Chinese People Speaking Mandarin Is Both Fair and ReasonableMandarin In, Dialects Out1984Chinese parents请讲华语，儿女的前途，操在您手里 *qǐng jiǎng huá yǔ, ér nǚ de qián tú, cāo zài nín shǒu lǐ*Speak Mandarin, Your Children's Future Is In Your HandsSpeak Mandarin. Your Children's Future Depends On Your Effort Today1985Public transport workers华人，华语 *huá rén, huá yǔ*Chinese People, Chinese Language (Mandarin)Mandarin Is Chinese1986Food and drink establishments先开口讲华语，皆大欢喜 *xiān kāi kǒu jiǎng huá yǔ, jiē dà huān xǐ*Speak Mandarin First, Then Everyone Is HappyStart With Mandarin, Not Dialects1987Shopping centres会讲华语，先讲常讲 *huì jiǎng huá yǔ，xiān jiǎng cháng jiǎng*Learn How To Speak Mandarin, Speak It First And Speak It OftenStart With Mandarin, Speak It More Often1988White-collar workers多讲华语，亲切便利 *duō jiǎng huá yǔ, qīn qiè biàn lì*Speak Mandarin More Often, It's Endearing And ConvenientBetter With More Mandarin, Less Dialects1989Chinese community常讲华语，自然流利 *cháng jiǎng huá yǔ, zì rán liú lì*Speak Mandarin Often, And You Will Become Naturally FluentMore Mandarin, Less Dialects. Make It A Way of Life1990Senior executives华人，华语 *huá rén, huá yǔ*Chinese People, Chinese Language (Mandarin)Mandarin Is Chinese1991English-educated Chinese Singaporeans学习华语认识文化 *xué xí huá yǔ rèn shí wén huà*Learn Mandarin, Understand The CultureMandarin For Chinese Singaporeans: More Than A Language1992English-educated Chinese Singaporeans用华语表心意 *yòng huá yǔ biǎo xīn yì*Use Mandarin To Express YourselfSay It In Mandarin1993English-educated Chinese Singaporeans讲华语，受益多 *jiǎng huá yǔ, shòu yì duō*Speak Mandarin, You Will Benefit Greatly From ItSpeak Mandarin. It Helps1994/1995English-educated Chinese and business professionals华语多讲流利 *huá yǔ duō jiǎng liú lì*Fluency Comes With Speaking Mandarin FrequentlyMandarin. Use It Or Lose It1996/1997English-educated Chinese working adults讲华语开创新天地 *jiǎng huá yǔ kāi chuàng xīn tiān dì*Speak Mandarin, Create New HorizonsSpeak Mandarin, Explore New Horizons1998/1999English-educated Chinese working adults讲华语，好处多 *jiǎng huá yǔ, hǎo chù duō*Speak Mandarin. Benefits Are PlentySpeak Mandarin, It's An Asset2000Chinese community讲华语？ 没问题！ *jiǎng huá yǔ? méi wèn tí!*Speak Mandarin? No Problem!Speak Mandarin? No Problem!2006/2007Post-1965 English-speaking Chinese Singaporeans华语 COOL *huá yǔ COOL*Mandarin [is] CoolMandarin [is] Cool2007/2008Post-1965 English-speaking Chinese Singaporeans讲华语, 你肯吗? *jiǎng huá yǔ, nǐ kěn ma?*Speak Mandarin, Are You Willing To?Speak Mandarin, Are You Game?2009/2010Youths华文？ 谁怕谁！ *huá wén? sheí pà sheí!*Mandarin? Don't Be Afraid!Be Heard In Chinese!2011/2012Youths华文华语，多用就可以 *huá wén huá yǔ, duō yòng jiù kě yǐ*Written And Spoken Mandarin, You Only Need To Use It OftenMandarin. It Gets Better With Use ### 1983 华人讲华语，合情又合理 (Mandarin's In, Dialects Out) In 1983, the promotion of Mandarin moved to markets and food centres, closer to the heartlands. Between 1983 and 1987, Telecoms also offered 'Dial for Mandarin Lessons' services on a 24-hour basis every day. Peak-hour calls averaged about 40,000. \"A need for common language between different ethnic Singaporeans or effective communication of thoughts\" and to \"preserve cultural roots by learning written Chinese and speaking Mandarin, since culture is transmitted through written words\", were some highlights of the campaign launching speeches in 1983. ### 2000 讲华语？ 没问题！ Speak Mandarin? No problem! - The Campaign was officially launched at the premiere of a Chinese movie \"A Tale of the Sacred Mountain\". - The Mandarin Film Festival was the first film festival organised by the Promote Mandarin Council. It was held from 17 to 22 September at the Golden Village Grand, Great World City. The Festival screened 12 critically acclaimed films produced by some of China's best producers and directors. - Singapore's first Mandarin a cappella CD album entitled \"A Cappella Fanatix, Mandarin A Cappella\" was jointly produced by Young Musicians' Society and the Promote Mandarin Council. - The forum entitled \"Mandarin for the Family\" was held on 18 November. The speakers comprised educationists who discussed teaching methods for the learning of Chinese, as well as well-known personalities who shared their experiences in learning Mandarin and using it both at home and in the office. - The Chinese Heritage Series, which comprises arts and cultural performances ranging from 新谣 *[xinyao](/wiki/Xinyao)*, hand puppet to Chinese Orchestra was held at various shopping malls. - SMC celebrities' web chats – a series of web chats with well-known artistes and personalities was held. - A Speak Mandarin Campaign commemorative book entitled \"Mandarin: The Chinese Connection\" (华人，华语，华文) was produced. - The first CD-ROM on learning Mandarin was produced. Entitled \"Speak Mandarin? No problem!\" (讲华语？ 没问题！), it is an interactive learning CD-ROM which caters to adults who know basic Mandarin and have a desire to improve it. The official speech during the launch of the Speak Mandarin Campaign 2000 was given by [Mah Bow Tan](/wiki/Mah_Bow_Tan), then Minister for National Development. In the speech, he gave credits to the SMC, for successfully establishing Mandarin as a principal language of communication amongst Singaporean Chinese, but says that a higher standard of spoken Mandarin needs to be achieved. Having a good command of Mandarin exposes people to culture and heritage, as well as facilitating dealings with [Asia](/wiki/Asia)'s potential economy powerhouse, [China](/wiki/China). The community and schools have new roles to play to increase and improve the use and standards of Mandarin in Singapore. ### 2006/07 华语 COOL! (Mandarin [is] COOL!) The official speech during the launch of the campaign was given by [Wong Kan Seng](/wiki/Wong_Kan_Seng), Deputy Prime Minister and Minister for Home Affairs at the official launch. The message for that year was for Chinese Singaporeans to use Mandarin \"not in place of, but in addition to English as Mandarin adds so much to our cultural and personal enrichment and business effectiveness. Together with its partners, the Promote Mandarin Council is now encouraging Chinese Singaporeans to go beyond just seeing Mandarin as \"hip\" or \"cool\", but also to deepen their knowledge of the rich heritage.\" 2006's theme of the campaign is \"华语 COOL\", with the goals of making people deepen their appreciation of the Chinese heritage and to be able to communicate in \"cool\" Mandarin in addition to English. The Campaign uses a lifestyle-oriented approach, revolving around movies, music and metaphors, extending the theme of \"华语 COOL\". Some examples of resources of the movies, music and metaphors include: - Mandarin Rocks @ K Box - MusicNet Song Book with Hanyu PinYin - 成语 365 (一天一句) \"Idioms 365 (An Idiom a Day)\" by PanPac Education - CoolSpeak! Column in Sunday Times - Huayu Cool on 938LIVE - Straits Times' new \"成语 Cool\" (Idioms [are] Cool) The theme song for the campaign for that year is 我想听你说 (wǒ xiǎng tīng nǐ shuō) by Singaporean singer, [Joi Chua](/wiki/Joi_Chua). Some of the other partners include [ComfortDelGro](/wiki/ComfortDelGro), Lianhe Zaobao, [Mediacorp TV](/wiki/MediaCorp_TV), STOMP, Tong Shui Café and the SAF Music & Drama Company. ### 2007/08 To promote Mandarin as an enjoyable, fun and living language via popular lifestyle activities, to show how Chinese Singaporeans can embrace Mandarin in their daily lives, was the aim of SMC in 2007/ 08. The tagline is '讲华语, 你肯吗?' (Speak Mandarin – Are You Game?). SMC also retains its \"华语 COOL!\" branding which is now familiar and popular among Chinese Singaporeans. For a period of 12 months, starting from 5 November 2007, the campaign featured a series of fun and engaging programmes and activities by its partners. Key strands of SMC 07/08 are Sports, Culture and The Arts, Design and Lifestyle. #### Sports During the official launch of the campaign on 5 November 2007, Lee Swee Say, then Minister in Prime Minister's office, announced the partnership between the SMC and various sports organizations. The sports partners for 2007's campaign include the [Singapore Sports Council](/wiki/Singapore_Sports_Council) (SSC), the [Football Association of Singapore](/wiki/Football_Association_of_Singapore), the [S-League](/wiki/S-League), and The Cage. *[The Straits Times](/wiki/The_Straits_Times)* and STOMP! also launched a new initiative, 'On Your Marc, Get Set, Go!' following *The Straits Times'* correspondent Marc Lim on his Mandarin-learning journey as he picks up pointers from national athletes. #### Culture Going for a fresher look, the SMC's promotional materials, from outdoor advertisements to posters and collateral, are designed with an edgy, vibrant and contemporary feel. Activists are also featured in the posters, to encourage more Chinese Singaporeans to explore Mandarin together with them. The campaign's theme song \"挑战 (Challenge)\" was created by two of the most sought-after talents in Asia's Mandarin Pop scene – Eric Ng (composer) and Xiaohan (lyrics). The song was performed by Ngak, a good example of a predominantly English-speaking Chinese Singaporean. Partners, including Theatre Practice and Funkie Monkies Productions will be tapping on theatre and music, to encourage Chinese Singaporeans to enjoy speaking Mandarin. #### The arts, design and lifestyle Partners such as Night and Day – Bar+Gallery+Friends and 77th Street came together for the first time with some of Singapore's 'edgy' designers, to create an exciting initiative to promote SMC 07/08. Theatre Practice also continued to make Chinese Theatre accessible to Singaporeans who are interested in Chinese Theatre and culture, thus, opening the doors to SMC's target audience. ### 2009/10 华文？ 谁怕谁 (Be heard in Chinese) The 2009 SMC started with a series of videos on foreign children speaking correctly pronounced and fluent Chinese, showed that anyone can learn Chinese, that it is not something only the Chinese people can acquire. The video shows foreign children talking about either Chinese myths or other Chinese related culture. The Promote Mandarin Council is trying to alert Singaporeans to embrace Singaporean heritage and pass it on to the next generation. The purpose of these \"Be heard in Chinese\" videos was not to mock Singaporeans, who are born Chinese but cannot speak Chinese. Instead, it reminded parents to create a learning environment for their children, to get to know Chinese via culture and knowledge, instead of seeing it as a tool to venture into the China market. In the following year, the SMC started a series of promotions on \"The Chinese Challenge\", where it moved to a wider audience and became more general. The main purpose of \"The Chinese Challenge\", which is an online contest, is to provide an interactive platform, to encourage Singaporeans and even Permanent Residents to enjoy and improve their Mandarin and deepen their knowledge of Chinese culture, through experiencing the finest in Chinese culture and language. Therefore, it is not to just asking people to learn Chinese, but also to create an environment that allows them to learn Chinese effectively. In addition, in order to attract more youths towards speaking and knowing Chinese, in 2010 \"The Chinese Challenge\" added a student category, to reach out to more youths. ### 2011/12 华文华语，多用就可以 (Mandarin. It Gets Better With Use) For 2011's campaign, the Government plan was to boost Mandarin lessons, by making them more fun and engaging through the use of digital media. New initiatives, such as the Theme Song Contest and Short Video Clip Competition, were introduced and targeted at youths and students. Newly appointed Chairman of the Promote Mandarin Council, Mr Seow Choke Meng, extended his invitation for all to support the Promote Mandarin Council in its efforts to promote Mandarin, and urged all Chinese Singaporeans to leverage on their foundation, and use Mandarin frequently to keep the language alive in our community. In 2012, to celebrate the 33rd year of promoting Mandarin in Singapore, the Promote Mandarin Council introduced a brand new initiative- the iHuayu iPhone app (released on 24 July 2012). iHuayu offers 50,000 bilingual business and Singapore-related terms frequently used in the media, accompanied with sample sentences and scenarios. The app can be purchased for free from the [iTunes Store](/wiki/ITunes_Store). Android mobile phone users can also download the iHuayu (i华语) application on [Google Play](/wiki/Google_Play). Also introduced is a new song – Shuo ([Chinese](/wiki/Simplified_Chinese_characters): 说; [pinyin](/wiki/Pinyin): *shuō*; lit. 'speak [as in 'speak a language']') – as part of the initiatives for 2012. The song encourages listeners to speak more and to use the language, as it gets easier with use. Shuo is composed, arranged and produced by Iskandar Ismail and performed by Singaporean artiste, Tay Kewei. ## Implementation When the campaign began in 1979, the use of Mandarin was promoted across all public domains, and in the early years there was some selective suppression of other Chinese varieties. Civil servants, including those working in hospitals, were prohibited from using non-Mandarin varieties except when communicating with elderly individuals over 60 years old. People under 40 in the [service sectors](/wiki/Tertiary_sector) were also required to use Mandarin rather than other Chinese varieties. Efforts to limit the public use of other Chinese varieties continued into the 1980s, with the last Cantonese television programmes phased out in 1981, and the only [Hong Kong](/wiki/British_Hong_Kong) television series broadcast being [dubbed](/wiki/Dubbing_(filmmaking)) in Mandarin. However, these were hindered by the aggressive expansion of Hong Kong's [Cantopop](/wiki/Cantopop) industry and [cinema](/wiki/Hong_Kong_action_cinema) into Singapore, although state-owned television tried to simultaneously promote Mandarin by requiring [subtitles](/wiki/Subtitle_(captioning)) in the standard language on non-Mandarin programming. The government proved more successful in limiting access [TV3](/wiki/TV3_(Malaysia)) from Malaysia, which carried Cantonese programming, by preventing Singaporeans living in [public housing](/wiki/Public_housing_in_Singapore) banned from installing outdoor antennas which might be required to receive the channel. In 1985, the government discouraged viewing of TV3 channel with the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) refusing to modify or upgrade existing its antenna on HDB blocks, citing the government is not obliged to assist better reception for foreign channels. National newspaper [*The Straits Times*](/wiki/The_Straits_Times) reported that the government was worried that TV3 channel viewing would affect certain government policies such as the SMC with its non-Mandarin programmes. The government also prevented local newspapers and magazines from carrying listings for it. Reactions from HDB flat owners ranged from anger to resignation with people getting antennas to receive the channel. In addition, in collaboration with the SMC, the cinema operator [Golden Village](/wiki/Golden_Village) began showing more Chinese films, particularly local productions, to promote awareness of speaking Mandarin. The Singaporean government did not officially prioritise the suppression of non-Mandarin Chinese varieties. Such suppression was never a major component of the campaign, as the government was tolerant of older people using their native varieties and assumed that young people would have \"no use for dialects,\" deeming them \"useless\". In fact, the government continued to promote [Cantonese opera](/wiki/Cantonese_opera) as a traditional ethnic performance and sponsored night classes in Cantonese music at government-run community centres. One of the most influential implementations that the SMC had used is *The Straits Times*. For instance, as part of the campaign to promote greater use for Chinese, the English newspaper would publish daily Mandarin vocabulary lessons in order to help Singaporeans improve their standard for Mandarin. Other ways of encouraging people to learn Chinese is to sign up for speak Mandarin courses, listen to Chinese music, explore online resources and download audio lessons, which can be found in the official website of Speak Mandarin Campaign. Besides, in 2005, there were publications of CD-ROMs and tapes on Mandarin lessons, handbooks of English-Chinese terms as well as telephone Mandarin lessons to help people to learn Mandarin. Notably, in 2006, [my Paper](/wiki/My_Paper) which was published by the [Singapore Press Holdings](/wiki/Singapore_Press_Holdings) became the first free Chinese newspaper to be given out in Singapore. In 2008, my Paper went from being a Chinese newspaper into a bilingual newspaper and the circulation rate hit 300,000. Education was one of the most effective ways to promote use of Mandarin. In 2004, Singapore government specially set up a committee to review methods for teaching Chinese courses, whereby creative Chinese writing courses were set up in schools in 2005, as a way to intrigue and engage students in learning Chinese. Also, other education organisations such as [Nanyang Technological University](/wiki/Nanyang_Technological_University) (NTU) had set up a Chinese faculty and even collaborated with China's [Confucius Institute](/wiki/Confucius_Institute) to help train teachers with regards to Chinese language, to improve the standard of Chinese [education in Singapore](/wiki/Education_in_Singapore) and in order to influence people with regards to the use of Chinese. Lee Kuan Yew himself, a native English speaker who had learned Mandarin later in life, expressed his concern about the declining proficiency of Mandarin among younger Singaporeans. In a parliamentary speech, he said: > \"Singaporeans must learn to juggle English and Mandarin\". Therefore, he launched a television program, 华语!, in January 2005, in an attempt to attract young viewers to learn Mandarin. Following this, in June 2005, Lee published a book, *Keeping My Mandarin Alive*, documenting his decades of effort to master Mandarin—a language which he had to re-learn due to disuse: > \"...because I don't use it so much, therefore it gets disused and there's language loss. Then I have to revive it. It's a terrible problem because learning it in adult life, it hasn't got the same roots in your memory.\" In the same year 2005, the campaign started to rebrand Chinese by using local artists and cool leisure activities, hence the birth of the slogan \"Mandarin [is] Cool!\". ## Outcome Language Spoken at Home Among Chinese Resident Population in SingaporePredominant Household Language1957 (%)1980 (%)1990 (%)2000 (%)2010 (%)2015 (%)2020 (%)[English](/wiki/Singapore_English)1.810.220.62332.637.448.3[Mandarin](/wiki/Singaporean_Mandarin)0.113.132.83547.746.129.9non-Mandarin Chinese varieties ([Hokkien](/wiki/Singapore_Hokkien), Cantonese, Teochew, etc)9776.246.230.719.216.18.7 The success of the campaign became evident twenty years after its launch. It significantly reduced the number of non-Mandarin speakers in Singapore. The use of other Chinese varieties at home fell from 76.2% in 1980 to 19.2% in 2010, down from a high of 97% in 1957. At the same time, Chinese households reporting Mandarin as the dominant language at home increased from 13.1% in 1980 to 47% in 2010. Ironically, English grew even faster than Mandarin, eventually surpassing it in 2020 as the primary language in Chinese Singaporean households. ## Criticism ### Chinese Singaporeans The Speak Mandarin Campaign has faced criticism from several quarters. Speakers of non-Mandarin Chinese varieties have complained that their children are required to study two foreign languages, English and Mandarin, rather than following an alternative policy of English and their native variety. Lee Kuan Yew himself acknowledged this, noting that for many Chinese Singaporeans, Mandarin is a \"stepmother tongue\" while their native variety is the \"real mother tongue\". Furthermore, in 2009, despite the ongoing 华文？ 谁怕谁 (Be Heard in Chinese) movement, Lee admitted that the teaching of Mandarin in schools had gone the \"wrong way\" and that, as a result of his insistence on bilingualism, \"successive generations of students paid a heavy price\". In June 2010, Lee also said that \"Mandarin is important but it remains a second language in Singapore\". Some critics include that the Mandarin education system's goal of promoting cultural identity has left many younger generations of Mandarin speakers unable to communicate with their grandparents and older relatives who speak other varieties of Chinese. They have compared the policy to that of [Russification](/wiki/Russification) and intentional [language elimination](/wiki/Language_death). The reduction in the number of speakers who speak non-Mandarin varieties in Singapore has raised concerns on the issues of preservation of these varieties. In March 2009, when *[The Straits Times](/wiki/The_Straits_Times)* ran an article by Jalelah Abu Baker who mentioned a quote from Ng Bee Chin, then the acting head of Nanyang Technological University's (NTU) Division of Linguistics and Multilingual Studies, who was quoted as saying that \"40 years ago, we were even more multilingual.... All it takes is one generation for a language to die.\" The article soon caught the attention of [Chee Hong Tat](/wiki/Chee_Hong_Tat), then the Principal Private Secretary of Lee Kuan Yew. In the letter from Chee to the editor in *The Straits Times* Forum, he highlighted the importance of English and Mandarin over other Chinese varieties and spoke of how speaking other Chinese varieties ultimately \"interferes with the learning of Mandarin and English\". He added that \"it would be stupid for any Singapore agency or NTU to advocate the learning of dialects, which must be at the expense of English and Mandarin.\" The move by the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) to standardise [Hanyu Pinyin](/wiki/Pinyin) names for Chinese Singaporean schoolchildren also received widespread backlash among polarised parents. ### Non-Chinese Singaporeans Non-Chinese language communities, particularly from the [Malays](/wiki/Malay_Singaporeans) and [Indians](/wiki/Indian_Singaporean), have also argued that the emphasis on promoting Mandarin weakens the role of English as Singapore's lingua franca and risks marginalising minority groups. Varieties such as Hokkien, alongside Malay, have served as languages of the Straits Chinese (*[Peranakan](/wiki/Peranakan)*) for centuries. In the Singaporean variety of Hokkien, there is a notable presence of Malay loanwords, and vice versa. During the early to mid 20th century, [Bazaar Malay](/wiki/Malay_trade_and_creole_languages#Singapore_Bazaar_Malay) had emerged as a confluence of Malay, Hokkien, Tamil, English and other Chinese varieties. Some have expressed concern that requirements for Mandarin fluency or literacy have been used to discriminate against non-Chinese minorities. While current employment laws prohibit racial discrimination, employers sometimes circumvent these rules by insisting that applicants be bilingual in English and Mandarin. ## Other language campaigns in Singapore The Speak Mandarin Campaign is one of the four official language campaigns in Singapore, the other three being the [Speak Good English Movement](/wiki/Speak_Good_English_Movement), Bulan Bahasa (Malay Language Month) and the Tamil Language Festival. Each of the language campaigns are overseen by the respective language councils, with secretariat support from the [National Heritage Board](/wiki/National_Heritage_Board_(Singapore)) (NHB). - [Language death](/wiki/Language_death) - [Languages of Singapore](/wiki/Languages_of_Singapore) - [Promotion of Putonghua](/wiki/Promotion_of_Putonghua) - [Singaporean Hokkien](/wiki/Singaporean_Hokkien) - [Singaporean Mandarin](/wiki/Singaporean_Mandarin) - [Speak Good English Movement](/wiki/Speak_Good_English_Movement) - Official site - Official Facebook page - Learn Mandarin Online\n",
  "language": "en",
  "processed_at": "2026-01-12T12:02:14.234049",
  "title": "Speak Mandarin Campaign",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Speak_Mandarin_Campaign"
}