{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:02:20.235302"
  },
  "content": "Multilingual academic programme in Singapore The **Special Assistance Plan** (**SAP**; [Chinese](/wiki/Simplified_Chinese_characters): 特别辅助计划; [pinyin](/wiki/Pinyin): *Tèbié Fǔzhù Jìhuà*) is a programme in [Singapore](/wiki/Singapore) introduced in 1979 which caters to academically strong students who excel in both their mother tongue as well as English. It is available only in selected primary and secondary schools. In a SAP school, several subjects may be taught in the mother tongue, alongside other subjects that are taught in English. SAP schools currently cater only to those studying [Mandarin](/wiki/Mandarin_Chinese) as their [mother tongue](/wiki/Language_education_in_Singapore) although theoretically, future SAP schools for other mother tongues are a possibility. ## List of schools Special Assistance Plan schools (or SAP schools, 特选学校) refers to schools that offers the Special Assistance Plan. The SAP is offered at both primary (elementary) school level as well as secondary (high school) level, in Special Assistance Plan primary schools (特选小学) and Special Assistance Plan high schools (特选中学) respectively. ### SAP Primary Schools NameType 2AreaNotesWebsiteGEP[Ai Tong School](/wiki/Ai_Tong_School) 爱同学校MixedBishanAffiliated to [Singapore Hokkien Huay Kuan](/wiki/Singapore_Hokkien_Huay_Kuan)[Catholic High School](/wiki/Catholic_High_School,_Singapore) (Affiliated Primary School) 公教中学 (附小)BoysBishanYes[CHIJ St. Nicholas Girls' School](/wiki/CHIJ_Saint_Nicholas_Girls%27_School) (Affiliated Primary School) 圣尼格拉女校 (小学部)GirlsAng Mo KioHoly Innocents’ Primary School 圣婴小学MixedHougangHong Wen School 宏文学校MixedKallang[Kong Hwa School](/wiki/Kong_Hwa_School) 光华学校MixedGeylangAffiliated to [Singapore Hokkien Huay Kuan](/wiki/Singapore_Hokkien_Huay_Kuan)Maha Bodhi School 菩提学校MixedGeylang[Maris Stella High School (Primary)](/wiki/Maris_Stella_High_School_(Primary)) 海星中学 (附小)BoysToa PayohNan Hua Primary School 南华小学MixedClementiYesNanyang Primary School 南洋小学MixedBukit TimahYesPei Chun Public School 公立培群学校MixedToa PayohPei Hwa Presbyterian Primary School 培华长老会小学MixedBukit TimahPoi Ching School 培青学校MixedTampinesRed Swastika School 卍慈学校MixedBedok[Tao Nan School](/wiki/Tao_Nan_School) 道南学校MixedMarine ParadeAffiliated to [Singapore Hokkien Huay Kuan](/wiki/Singapore_Hokkien_Huay_Kuan)Yes ### SAP High Schools NameTypeSchool CodeAreaNotesWebsite[Anglican High School](/wiki/Anglican_High_School,_Singapore) 圣公会中学Mixed7101Tanah MerahAffiliated to: - [St Andrew's Junior College](/wiki/St_Andrew%27s_Junior_College) [Catholic High School](/wiki/Catholic_High_School_(Singapore)) 公教中学Boys[IP](/wiki/Integrated_Programme): 9131 [Special:](/wiki/Secondary_education_in_Singapore#Secondary_streams) 7102 BishanAffiliated to: - [Eunoia Junior College](/wiki/Eunoia_Junior_College) (IP) - [Singapore Chinese Girls' School](/wiki/Singapore_Chinese_Girls%27_School) (IP) - [CHIJ Saint Nicholas Girls' School](/wiki/CHIJ_Saint_Nicholas_Girls%27_School) (IP) - [Catholic Junior College](/wiki/Catholic_Junior_College) (Non-IP) [CHIJ Saint Nicholas Girls' School](/wiki/CHIJ_Saint_Nicholas_Girls%27_School) 圣尼各拉女校Girls[IP](/wiki/Integrated_Programme): 9134 [Special:](/wiki/Secondary_education_in_Singapore#Secondary_streams) 7118 Ang Mo KioAffiliated to: - [Eunoia Junior College](/wiki/Eunoia_Junior_College) (IP), - [Singapore Chinese Girls' School](/wiki/Singapore_Chinese_Girls%27_School) (IP) - [Catholic High School](/wiki/Catholic_High_School,_Singapore) (IP) - [Catholic Junior College](/wiki/Catholic_Junior_College) (Non-IP) - [CHIJ St. Nicholas Girls' School (Primary)](/wiki/CHIJ_Saint_Nicholas_Girls%27_School) [Chung Cheng High School (Main)](/wiki/Chung_Cheng_High_School_(Main)) 中正中学 (总校)Mixed7104Marine ParadeAffiliated to: - [Nanyang Junior College](/wiki/Nanyang_Junior_College) (Non-IP) - [Chung Cheng High School (Yishun)](/wiki/Chung_Cheng_High_School_(Yishun)) (Non-IP) [Dunman High School](/wiki/Dunman_High_School) 德明政府中学Mixed3101Tanjong Rhu[Hwa Chong Institution](/wiki/Hwa_Chong_Institution) 华侨中学Boys0806Bukit TimahOffers the *Hwa Chong Diploma* ; Affiliated to: - [Nanyang Girls' High School](/wiki/Nanyang_Girls%27_High_School) (IP) [Maris Stella High School](/wiki/Maris_Stella_High_School) 海星中学Boys7111Toa PayohAffiliated to: - [Catholic Junior College](/wiki/Catholic_Junior_College) (Non-IP) - [Maris Stella High School (Primary)](/wiki/Maris_Stella_High_School) [Nan Chiau High School](/wiki/Nan_Chiau_High_School) 南侨中学Mixed7112SengkangAffiliated to [Singapore Hokkien Huay Kuan](/wiki/Singapore_Hokkien_Huay_Kuan)[Nan Hua High School](/wiki/Nan_Hua_High_School) 南华中学Mixed3047Clementi[Nanyang Girls' High School](/wiki/Nanyang_Girls%27_High_School) 南洋女子中学校Girls7114Bukit TimahOffers the *Hwa Chong Diploma* ; Affiliated to: - [Hwa Chong Institution](/wiki/Hwa_Chong_Institution) (IP) - [Nanyang Primary School](/wiki/Nanyang_Primary_School) [River Valley High School](/wiki/River_Valley_High_School_(Singapore)) 立化中学Mixed3103Boon Lay ## Admission A student's admission to a SAP school (or any secondary school) is decided based on their results in the [Primary School Leaving Examination](/wiki/Primary_School_Leaving_Examination) (PSLE). To enter a SAP school, a student must achieve a PSLE aggregate score that puts him in the top 10% of his cohort, with an 'A' grade for both the Chinese and English (before AL). This means that only a relatively small group of students who are academically and linguistically strong may enter a SAP school. Consequently, SAP schools have a reputation of being the \"elite\" group of secondary schools in the country, alongside independent and autonomous schools. This stems from the Singaporean tradition of effective bilingualism in the education of the elite students from SAP schools. Some students, regardless of whether they are in a SAP school, are offered a chance at effective trilingualism in secondary education starting from age 13. The first language, English, is the international language of commercial and the administrative and legal language of Singapore, a [former British colony](/wiki/Straits_Settlements). The mother tongue reflecting the cultural and ethnic identity of the student. The \"third languages\" are foreign and Asian languages which are considered by MOE to be \"economically, politically and culturally vital\", such as Japanese, German, Spanish, French, Arabic, Bahasa Indonesia, Chinese (Special Programme) and Malay (Special Programme). In order to qualify for these programmes, a student must obtain a PSLE score of AL8 or better for foreign language, and AL24 for Asian Language. ## Historical context Many SAP schools were historically Chinese language medium schools, i.e. they taught all academic subjects in Mandarin (including science and mathematics), and which may have taught English as a foreign language. Following Singapore's independence in 1965, the government recognised four official languages in Singapore (English, Mandarin Chinese, Malay and Tamil), but clearly designated English as the main language of basic and higher education, government and law, science and technology as well as trade and industry. This is reflected in the Bilingual Policy which came into effect in 1966. While according official recognition to the languages of different ethno-linguistic communities in Singapore, it sought to promote English as a neutral common language to unite a culturally diverse nation of immigrants. English was also held to be the language of international higher education, science/technology and commerce. As such, it was indispensable to Singapore, given her ambition to become a 'Global City', articulated as early as 1972. As the English language gained importance, more parents inclined to send their child to English-medium schools, which adversely affected enrollment of Chinese-medium schools. In 1977, admission to Chinese-medium elementary schools made up only 10 per cent of the nation's cohort, which increasingly reflected the increasingly critical status of the Chinese-medium schools, in stark contrast over a decade. The need to preserve traditional Chinese schools with rich heritage and culture became a pressing agenda for the government, with raising English standards and attracting capable students into such schools a key priority, as pointed out by then [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew). In 1979, the Ministry of Education (MOE) designated nine Chinese-medium secondary schools as Special Assistance Plan (SAP) schools. These schools were intended to provide top-scoring primary school leavers with the opportunity to study both English and Mandarin to high levels of competence. Also, these schools were to preserve the character of traditional Chinese-medium secondary schools and allay fears that the Government was indifferent to Chinese language and culture amid declining enrolments in Chinese-medium schools. The selected schools were given additional teaching resources and given assistance to run classes with a lower student-to-teacher ratio. The programme was deemed highly successful with five of the designated schools consistently attaining top ten positions in the secondary school ranking in the 1990s, outperforming several established English-medium schools. This supported the Government to further expand the programme to two other institutions with strong Chinese heritage, including [Nan Chiau High School](/wiki/Nan_Chiau_High_School), which was initially listed as an SAP school candidate in 1978. Six top performing SAP high schools are also approved by the Ministry of Education to offer Integrated Programme (IP) to their full cohort, with [The Chinese High School](/wiki/The_Chinese_High_School_(Singapore)), [Nanyang Girls' High School](/wiki/Nanyang_Girls%27_High_School) being the piloting schools with [Hwa Chong Junior College](/wiki/Hwa_Chong_Junior_College) in 2004, followed by [River Valley High School](/wiki/River_Valley_High_School,_Singapore) in 2006 and [Dunman High School](/wiki/Dunman_High_School) in 2008. Catholic High School and CHIJ St. Nicholas Girls' School were approved to offer Joint Integrated Programme in 2013 with [Singapore Chinese Girls' School](/wiki/Singapore_Chinese_Girls%27_School). ## Societal significance This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(July 2016)* *(Learn how and when to remove this message)* With rapid economic development and exposure to Western, particularly American popular culture and values in the 1970s and 1980s, Singapore began to change from a lower income, poorly educated society to a more confident, educated, vocal and individualistic society. Around the same time, in the 1980s, the world was witnessing the rise of Japan and the Asian [newly-industrialised economies](/wiki/Newly-industrialized_country) or NIEs, of which Singapore was one. Economically, America appeared unable to compete with rising Asian manufacturing competitors, especially Japan and was facing budget deficits. Singapore politicians from the dominant [People's Action Party](/wiki/People%27s_Action_Party) synthesised these various situations and developed certain ideas that came to be known as the [Asian Values](/wiki/Asian_Values) discourse. According to this line of argument, Singapore, along with [Taiwan](/wiki/Taiwan), [Hong Kong](/wiki/Hong_Kong), [South Korea](/wiki/South_Korea) and [Japan](/wiki/Japan), had succeeded so spectacularly in no small part because of their shared [Confucianist](/wiki/Confucianist) cultural heritage, which emphasised values such as hard work, education, family unity, deference and loyalty to authority figures, community spirit (in contrast to Western [individualism](/wiki/Individualism)), etc. To better sell this argument to a multi-ethnic population where the non-Chinese / non-'Confucianist' communities formed at least a quarter of the population, the discourse was re-branded 'Asian Values', rather than Confucian Work Ethic. In Singapore, traditional Asian culture was seen as a source of the nation's economic success thus far. As such, the government embarked on programmes and campaigns to promote traditional culture, including the revitalised *Speak Mandarin Campaign* (targeted at English rather than dialect speakers, as was historically the case) as well as SAP schools. ## Concerns and criticisms The SAP school programme is periodically criticised in the national media by Singaporeans who are concerned about the [ethnic segregation](/wiki/Ethnic_segregation) that it inevitably promotes. SAP schools offer mother tongue lessons in only one language: Mandarin. This means that the vast majority, if not all, of the students in SAP schools will be ethnically Chinese. These students will have little opportunities to interact with people of other races, which can potentially cause issues in a [multi-racial](/wiki/Multi-racial) country like Singapore. Besides, the SAP does not have Malay or Tamil equivalents, which might be viewed by some as MOE not placing these two languages on an equal level as Mandarin. In addition, subjects that are related to Chinese culture may also be taught in Mandarin, such as Chinese literature, the history of China and Chinese–English translation studies.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:02:20.235024",
  "title": "Special Assistance Plan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Special_Assistance_Plan"
}