{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:02:30.879548"
  },
  "content": "Fantasy sports and prediction app**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)*This article **may have been created or edited in return for undisclosed payments**, a violation of Wikipedia's terms of use. It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. *(September 2019)* *(Learn how and when to remove this message)* **SportsHero** is a real-time [fantasy sports](/wiki/Fantasy_sport) [app](/wiki/Mobile_app) and social prediction platform. Within the app, users make predictions on match, game, competition results. These users are ranked based on information provided by other fans and experts in the community, as well as real-time news and statistics. [Football (soccer)](/wiki/Association_football) and [cricket](/wiki/Cricket) are currently available on the app, with plans to introduce [cycling](/wiki/Cycle_sport) and further keystone sports such as [basketball](/wiki/Basketball), [AFL](/wiki/Australian_Football_League), [esports](/wiki/Esports) and [American football](/wiki/American_football). SportsHero is available as a mobile download for both [iOS](/wiki/IOS) and [Android](/wiki/Android_(operating_system)) devices. ## Background SportsHero was launched by *MyHero Pte Ltd*, a [Singapore](/wiki/Singapore)-based [mobile app](/wiki/Mobile_app) developer, in May 2016. The app replaces *FootballHero*, which had a user base of over 250,000. Existing users prior to the launch of SportsHero were migrated over to the app. SportsHero is based on the same model as TradeHero, a social investment network founded in 2013. It is a currency trading simulation app that allows stock-watchers spend and earn virtual credits buying and selling stocks on exchanges around the world. In May 2016, SportsHero received US$2.4 million in funding, led by [Australia](/wiki/Australia)-based Nevada Iron Ltd. The latter company signed a [Heads of Agreement](/wiki/Heads_of_Agreement_(law)) with Sportz Hero Pty Ltd to acquire SportsHero. In October 2017, SportsHero launched an enhanced brand identity and user experience. It upgraded the app to offer a free to play model for users across key markets whilst providing a pay to play model. SportsHero can be download in 195 countries around the world and is available in three languages - Bahasa Indonesia, English and Mandarin. In November 2017, WIRED Magazine UK rates SportsHero as one of the best iPhone apps of 2017. ## Partnerships and agreements SportsHero partnered with Minute Media's 90Min over a three-year term on 17 October 2017. Under the deal, 90Min supplies SportsHero with original football content developed by 90Min editorial staff, fan contributors and football influencers, as well as gives access to Minute Media's community. On 9 May 2018, SportsHero announced two Indonesian partners, Mr Tri Putra Permadi and PT Walletku Indompet Indonesia (Walletku). Indonesian IT, social network and telecommunications entrepreneur Mr Tri Putra Permadi is SportsHero's Official Indonesian Football Partner, while Walletku is the platforms technology partner that offers a payment platform and range of digital products, including prepaid mobile phone credit. Walletku's payment platform is integrated with SportsHero's Indonesian app to facilitate the sale of SportsHero tickets to Walletku's users wanting to participate in SportsHero's localised Indonesian competitions. **Global ambassadors** On 29 March 2017, [Ian Chappell](/wiki/Ian_Chappell) was appointed SportsHero's global cricket ambassador. Chappell captained the Australian Cricket team between 1971 and 1975 before taking a central role in the breakaway World Series Cricket organisation. Today he is a prominent sports journalist and cricket commentator. ## Patents “Method, System And Computer Program To Broker The Monetized Broadcasts Of Users Through A Subscription Based Information Ecosystem” U.S. Patent 20150356559. Filed November 4, 2013, published December 10, 2015 (Dinesh Bhatia, Dominic Morris) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:02:30.879246",
  "title": "SportsHero",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/SportsHero"
}