{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:02:26.339425"
  },
  "content": "[Singaporeans](/wiki/Singaporeans) participate in a wide variety of sports for [recreation](/wiki/Recreation) as well as for [competition](/wiki/Sports_competition). Popular sports include [football](/wiki/Association_football), [swimming](/wiki/Swimming), [track and field](/wiki/Track_and_field), [basketball](/wiki/Basketball), [rugby union](/wiki/Rugby_union), [badminton](/wiki/Badminton), [table tennis](/wiki/Table_tennis), and [cycling](/wiki/Cycling). Many [public residential areas](/wiki/Public_housing_in_Singapore) provide amenities like [swimming pools](/wiki/Swimming_pool), outdoor spaces (i.e. [street football](/wiki/Street_football_(association_football)) and basketball courts, running tracks) and indoor sport centres, with facilities for badminton, table tennis, [squash](/wiki/Squash_(sport)) among others. As an [island city-state](/wiki/Geography_of_Singapore), [Singapore](/wiki/Singapore) is surrounded by waters thus, many Singaporeans also enjoy [water sports](/wiki/Water_sport) like swimming, [water polo](/wiki/Water_polo), sailing, [kayaking](/wiki/Kayak), [rowing](/wiki/Rowing) and [waterskiing](/wiki/Waterskiing). There is also a number of avid recreational [scuba divers](/wiki/Scuba_diving), a prominent diving spot being the southern island of [Pulau Hantu](/wiki/Pulau_Hantu), famous for its [coral reefs](/wiki/Coral_reef). Although Singapore does not have a *[de jure](/wiki/De_jure)* national sport, football is arguably the most popular [spectator sport](/wiki/Spectator_sport) in Singapore. Singapore has its own professional football [league](/wiki/Sports_league), known as the [Singapore Premier League](/wiki/Singapore_Premier_League) (formerly known as S. League). Launched in 1996, it consists of nine teams competing against one another, with one based in [Brunei](/wiki/Brunei), as of 2023[update]. Since 2019, all eight teams in Singapore shared their home stadiums with one other team, which are mostly located in heartland towns. In 1998, 2004, 2007 and 2012, the [Singapore national football team](/wiki/Singapore_national_football_team) were champions in the [AFF Championship](/wiki/AFF_Championship), the premier football competition in [Southeast Asia](/wiki/ASEAN_Football_Federation). Singapore athletes have performed well in both regional and international competitions, mainly in swimming, badminton, table tennis, [bowling](/wiki/Bowling), sailing, [water polo](/wiki/Water_polo), [sepak takraw](/wiki/Sepak_takraw), and [silat](/wiki/Silat). To date, Singapore has won a total of one gold, two silver and two bronze [Olympic medals](/wiki/Singapore_at_the_Olympics). Singapore has also amassed a total of 41 gold, 59 silver and 117 bronze medals at the [Asian Games](/wiki/Singapore_at_the_Asian_Games). ## History ### Colonial era [Sports in Singapore](/wiki/Sports_in_Singapore) can be traced back to the colonial times where the earliest official records on sports were found. Sports had an important role to play as it helped to fill the idle hours for the colonials who had to wait for months for news of home from mail ships. It also offered an alternative to other activities such as the amateur local theatre scene and the \"stiff dinner parties\". In colonial Singapore, the development of sports were shaped by diverse cultural backgrounds and a hierarchical social structure. Sports during those times was very much a luxury and was only for the privileged few. The average local had few, if any, opportunities to indulge in sporting activities. For most, simply trying to make a living took up most of their time. Moreover, the older sports clubs were established mainly for the colonials. Early sporting events were marked by limited participation and segregation along racial lines. ### Contemporary era Upon independence, sport initially facilitated wealth-based class distinctions, but eventually became a cornerstone of nation-building. Since 1964, a *Pesta Sukan* (Festival of Sport) has accompanied annual [National Day](/wiki/National_Day) celebrations, with the city having hosted the [1973 SEAP Games](/wiki/1973_SEAP_Games). In that year, the Singapore government formed the [Singapore Sports Council](/wiki/Singapore_Sports_Council) (now Sport Singapore), aiming to increase national cohesion and productivity. In 1984, a College of Physical Education was launched to produce specialist teachers for physical education, with school sport having generally grown in importance. The Ministry of Defence considers sport important in the context of ensuring that male students are fit for military service. Since the 1990s, the [Foreign Sports Talent Scheme](/wiki/Foreign_Sports_Talent_Scheme) has improved Singapore’s showings in international events by helping to acquire athletes born abroad. In general, the nation now invests more resources into elite sport due to its greater affluence. In 2000, the [Ministry of Community Development](/wiki/Ministry_of_Community_Development,_Youth_and_Sports) was given a sport portfolio because sport was identified as an important part of Singapore taking its place among developed nations. ## Recreational The most popular sports in Singapore include outdoor sports like [football](/wiki/Association_football), swimming, [track and field](/wiki/Track_and_field), [rugby union](/wiki/Rugby_union) and cycling as well as various indoor sports like badminton, table tennis and basketball. Floorball has a young history in the country, but is gaining popularity. Most Singaporeans live in [public residential areas](/wiki/Public_housing_in_Singapore) with amenities like swimming pools, outdoor spaces (i.e. [street football](/wiki/Street_football_(association_football)) and basketball courts, running tracks) and indoor sport centres, with facilities for badminton, table tennis, [squash](/wiki/Squash_(sport)) among others. As an island city-state, Singapore is surrounded by waters thus, water sports like swimming, [water polo](/wiki/Water_polo), sailing, [kayaking](/wiki/Kayak), [rowing](/wiki/Rowing) and [waterskiing](/wiki/Waterskiing) are also popular among Singaporeans. ## Domestic competition Singapore has its own [football](/wiki/Association_football) league, the [Singapore Premier League](/wiki/Singapore_Premier_League) (formerly known as S. League), formed in 1996, which comprises nine clubs, including one based in Brunei. In 2003, Singapore hosted a round of the UIM [F1H2O](/wiki/F1H2O) World Championship in [Marina Bay](/wiki/Marina_Bay,_Singapore). The event subsequently took the title of [Singapore Grand Prix](/wiki/Singapore_Grand_Prix). In 2006, the [Singapore Slingers](/wiki/Singapore_Slingers) joined the [National Basketball League](/wiki/National_Basketball_League_(Australia)) in Australia but, left in 2008. The Singapore Slingers were one of the inaugural teams in the [ASEAN Basketball League](/wiki/ASEAN_Basketball_League) founded in October 2009. Beginning in 2008, Singapore started hosting a round of the [Formula One World Championship](/wiki/Singapore_Grand_Prix). The race was staged at the [Marina Bay Street Circuit](/wiki/Marina_Bay_Street_Circuit) in the [Marina Bay](/wiki/Marina_Bay,_Singapore) area, and became the first night race on the F1 calendar, and the first street circuit in Asia. ### Government-sanctioned programmes The [Government of Singapore](/wiki/Government_of_Singapore) sanctions a variety of sports-based programmes for [education](/wiki/Education_in_Singapore) in addition to the normal [physical education](/wiki/Physical_education). The [National Physical Fitness Award](/wiki/National_Physical_Fitness_Award) (NAPFA) was introduced in 1982, a scheme which requires mandatory participation of all students within primary and secondary education. The scheme gives awards for a variety of physical tests for [endurance](/wiki/Endurance), [cardiovascular](/wiki/Cardiovascular) fitness and strength, including a medium-distance run of 1.6 or 2.4 kilometres for primary and secondary students respectively, and the results are reflected in each student's [report book](/wiki/Report_card). As such, although gaining an award is not mandatory, students are often pressured to do so. In addition, the government sponsors the [Singapore Sports School](/wiki/Singapore_Sports_School), which was established on 2 April 2004, combining a secondary school curriculum with professional training in each student's preferred sport, in an attempt to nurture future generations of sportsmen and sportswomen. The concept behind the Singapore Sports School is that sporting talent should not be compromised when striving for academic excellence. ## Youth Olympic Games On 21 February 2008 the [International Olympic Committee](/wiki/International_Olympic_Committee) announced that Singapore won the bid to host the inaugural [2010 Summer Youth Olympics](/wiki/2010_Summer_Youth_Olympics). Singapore beat Moscow in the final by 53 votes to 44. On 15 September 2010, Senior Parliamentary Secretary for [Ministry of Community Development, Youth and Sports](/wiki/Ministry_of_Community_Development,_Youth_and_Sports) [Teo Ser Luck](/wiki/Teo_Ser_Luck) announced that Singapore will start off the [Singapore Biennale Games](/wiki/Singapore_Biennial_Games) initiative to keep up the Singapore Youth Olympic Games 2010 Legacy, to be held every 2 years, starting from year 2011. Singapore has also performed well in subsequent editions of the Youth Olympic Games. To date, the country has won a total of 2 gold, 3 silver and 4 bronze medals. Singapore sent its first 3 winter sport athletes to the [2020 Winter Youth Olympics](/wiki/2020_Winter_Youth_Olympics) held in [Lausanne, Switzerland](/wiki/Lausanne). ## Rugby union Rugby was first introduced in Singapore during the late 19th century, when Singapore was still a Crown colony part of the British Empire. It has had a steady presence since the beginning of the 20th century, when the Malay Cup between the [Singapore national team](/wiki/Singapore_national_rugby_union_team) and the [Malayan national team](/wiki/Malaysia_national_rugby_union_team) was established, which was one of the oldest rugby competitions in the world. ## List of achievements ### Badminton - [Wong Peng Soon](/wiki/Wong_Peng_Soon) - [Ong Poh Lim](/wiki/Ong_Poh_Lim) - 1954, All-England Champion, Men's doubles - [Li Li](/wiki/Li_Li_(badminton_player)) - 2002, Gold, Commonwealth Games in Manchester, Women's singles - [Ronald Susilo](/wiki/Ronald_Susilo) - 2004, Gold, 2004 Japan Open, Men's singles - [Loh Kean Yew](/wiki/Loh_Kean_Yew) - 2021, Champion, [BWF World Championships](/wiki/2021_BWF_World_Championships_%E2%80%93_Men%27s_singles) in Spain, Men's singles - [Terry Hee](/wiki/Terry_Hee) - 2022, Gold, Commonwealth Games in Birmingham, Mixed doubles - [Tan Wei Han](/wiki/Tan_Wei_Han) - 2022, Gold, Commonwealth Games in Birmingham, Mixed doubles ### Basketball - [Singapore national basketball team](/wiki/Singapore_national_basketball_team) - [South East Asian Games](/wiki/South_East_Asian_Games) - 1979-Bronze Medal - 2013-Bronze Medal - 2015-Bronze Medal - [ASEAN Basketball Championship](/wiki/ASEAN_Basketball_Championship) - 2001-Bronze Medal - 2013-Bronze Medal - [Singapore Slingers](/wiki/Singapore_Slingers) - In 2006, they were the first and only Asian team that was ever given permission to play in [Australia's NBL](/wiki/Australia%27s_NBL). They finished the [2006–07 NBL season](/wiki/2006%E2%80%9307_NBL_season) with a 13–20 record. - [ASEAN Basketball League](/wiki/ASEAN_Basketball_League) - 2016-Final Runner Up - 2018-Final Runner Up - 2019-Final Runner Up ### Bodybuilding - Joan Liew Lee Ting - 2011, 1st place, NPC Tournament of Champions held in USA - 2010, 2nd place, NPC Tournament of Champions held in USA - 2009, 1st place, Multi Asian Championships (over 52 kg) - 2006, 1st place, Asian Women's Open Invitational Championships in Singapore (Welterweight) - 2006, Guest posing at Singapore Bodybuilding Championships in Singapore - 2002, Gold, Asian Women's bodybuilding Championships in China - 2001, Guest posing at Singapore Bodybuilding Championships in Singapore - 2001, 7th place, 6th World Games in Japan (over 52 kg) - 2000, Gold, Asian Bodybuilding Championships - [Abdul Halim bin Haron](/wiki/Abdul_Halim_bin_Haron) - 2000, Bronze, Asian Championship, welterweight (75 kg) - 2002, Gold, Asian Games in Busan, bantamweight (65 kg) - [Azman bin Abdullah](/wiki/Azman_bin_Abdullah) - 1993, Gold, IOC-sanctioned World Games Bodybuilding Championships, middleweight - 1993, Gold, World Bodybuilding Championships, middleweight - 3-time Mr Asia - [Simon Chua](/wiki/Simon_Chua) - 2002, Gold, Asian Games in Busan, welterweight (75 kg) - 2002, Gold, Commonwealth Bodybuilding Championships in Calcutta, welterweight (75 kg) - 2003, Bronze, commonwealth bodybuilding champs - [Danie Dharma](/wiki/Danie_Dharma) - Asian Championship Classic Physique 2017 - World Regional Championships Classic Physique Class B Category 2018 - NPC Worldwide Singapore Men's Bodybuilding 2023 Overall Winner ### Bowling - Adelene Wee Chin Suan - 1985, won 3 Golds at Asian FIQ Youth Championships, in Singles, Masters, and Team - 1985, won Ladies Masters champion, World FIQ Championship in London - Jesmine Ho - 2001, Masters Champion, World Bowling Masters Championship in Abu Dhabi - Jennifer Tan - 2002, Masters Champion, World Bowling Masters Championship in Denmark - [Remy Ong](/wiki/Remy_Ong) - 2002, won 3 Golds, Asian Games in Busan, Single, Trios, and Masters ### Chess - [Ignatius Leong](/wiki/Ignatius_Leong) - [Lian Ann Tan](/wiki/Lian_Ann_Tan) ### Cricket - [Singapore national cricket team](/wiki/Singapore_national_cricket_team) - [2009 ICC World Cricket League Division Six](/wiki/2009_ICC_World_Cricket_League_Division_Six): **Champions** - (/wiki/2012_ICC_World_Cricket_League_Division_Five) [ICC World Cricket League](/wiki/2009_ICC_World_Cricket_League_Division_Six) Division Five: **Champions** - [2014 ACC Premier League](/wiki/2014_ACC_Premier_League): Winner - [2019 ICC T20 World Cup Qualifier](/wiki/2019_ICC_T20_World_Cup_Qualifier): 11th place - [2020 ACC Eastern Region T20](/wiki/2020_ACC_Eastern_Region_T20): Winner (Qualified for [2020 Asia Cup Qualifier](/wiki/2020_Asia_Cup_Qualifier)) - (/wiki/2022_ICC_Men%27s_T20_World_Cup_Global_Qualifier_Group_B) [ICC T20 World Cup Qualifier](/wiki/2019_ICC_T20_World_Cup_Qualifier): 8th place - [Tim David](/wiki/Tim_David) - Played for Singapore (2019-2020) - Averaged 46.5 runs for Singapore in T20I cricket, the highest Singaporean average - First Singaporean to play in the [IPL](/wiki/Indian_Premier_League) - [Surendran Chandramohan](/wiki/Surendran_Chandramohan) - Most international runs for Singapore at 756 - [Janak Prakash](/wiki/Janak_Prakash) - Most international wickets for Singapore at 40 - [Arjun Mutreja](/wiki/Arjun_Mutreja) - Highest individual score for Singapore at 108 vs [Bermuda](/wiki/Bermuda_national_cricket_team) at [Selangor Turf Club](/wiki/Selangor_Turf_Club), [Kuala Lumpur](/wiki/Kuala_Lumpur) on 27 October 2014 ### Cuesports - [Peter Gilchrist](/wiki/Peter_Gilchrist_(billiards_player)) - 1994, WPBSA World Champion - 2001, WPBSA World Champion - 2009, Gold Medalist, English Billiards (Singles), SEA Games - World Record for highest billiard break at 1346 ### Floorball - [Singapore men's national floorball team](/wiki/Singapore_men%27s_national_floorball_team) - [Asia Pacific Floorball Championships](/wiki/List_of_Asia_Pacific_Floorball_champions) - Champions 2006 - Champions 2007 - Champions 2008 - Champions 2010 - Champions 2012 - [Asia-Oceania Floorball Cup](/wiki/Asia-Oceania_Floorball_Cup) - Champions 2019 - [2014 Southeast Asian Floorball Championships](/wiki/2014_Southeast_Asian_Floorball_Championships): Champions - [2015 Southeast Asian Games](/wiki/Floorball_at_the_2015_SEA_Games): Champions - [Singapore women's national floorball team](/wiki/Singapore_women%27s_national_floorball_team) - [Asia Pacific Floorball Championships](/wiki/List_of_Asia_Pacific_Floorball_champions) - Champions 2005 - [Asia-Oceania Floorball Cup](/wiki/Asia-Oceania_Floorball_Cup) - Champions 2018 - Champions 2022 ### Football - [Singapore Lions](/wiki/Singapore_Lions) - [Malaysia Cup](/wiki/Malaysia_Cup) - 24 times Champion - [Singapore National Football Team](/wiki/Singapore_national_football_team) - [ASEAN Football Championship](/wiki/ASEAN_Football_Championship) - 1998-Champions - 2004-Champions - 2007-Champions - 2012-Champions - [Fandi Ahmad](/wiki/Fandi_Ahmad) - 1983–1985, Played for [FC Groningen](/wiki/FC_Groningen). Scored in a shock 2–0 against Inter Milan. In 1999, was voted one of the best 25 players ever to play for FC Groningen, earning him a place in the club's Hall of Fame. In 2003, he was named in the club's best eleven of the twentieth century. - 1988, Golden Boot Award, Malaysia Cup - [V. Sundramoorthy](/wiki/V._Sundramoorthy) - Played at [FC Basel](/wiki/FC_Basel) for Switzerland - [Adam Swandi](/wiki/Adam_Swandi) - Played at French division 3 team [FC Metz](/wiki/FC_Metz) - [Safuwan Baharudin](/wiki/Safuwan_Baharudin) - Played at Australia top division team [Melbourne City](/wiki/Melbourne_City_FC) ### Indoor Skydiving - [Kyra Poh](/wiki/Kyra_Poh) - 2017: Gold Medal, [Wind Games](/wiki/Wind_Games). - Acknowledged as \"the world's fastest flyer\". ### Netball In 2005, the [Singaporean team](/wiki/Singapore_national_netball_team) won the [Asian Netball Championship](/wiki/Asian_Netball_Championship) with a win over the [Malaysian team](/wiki/Malaysia_national_netball_team) with a score of 53–39 at the Finals. ### Pétanque - Cheng Zhi Min - 2015, Bronze, Malaysia Port Dickson Open Triples in Port Dickson, Malaysia - 2015, Bronze, 2nd South-East Asia Petanque Association (SEAPA) Championship Phnom Penh, Cambodia - Goh Wee Teck - 2015, Bronze, Malaysia Port Dickson Open Triples in Port Dickson, Malaysia - 2015, Bronze, 2nd South-East Asia Petanque Association (SEAPA) Championship Phnom Penh, Cambodia - Shanti Prakash Upadhayay - 2015, Bronze, Malaysia Port Dickson Open Triples in Port Dickson, Malaysia - 2015, Bronze, 2nd South-East Asia Petanque Association (SEAPA) Championship Phnom Penh, Cambodia ### Sailing - [Benedict Tan](/wiki/Benedict_Tan) - 1994, Gold, Asian Games in Hiroshima, Laser class - 1989, 1991, 1993, 1995, Won Laser Gold in SEA games - Joan Huang and Naomi Tan - 1998, Gold, Asian Games, Ladies International 420 Class - [Siew Shaw Her](/wiki/Siew_Shaw_Her) and [Colin Ng](/wiki/Colin_Ng) - 1998, Gold, Asian Games, Men's International 420 Class - Teo Wee Chin and [Terence Koh](/wiki/Terence_Koh_(sailor)) - 2005, Gold, Youth Sailing World Championship, [Busan](/wiki/Busan), 420 class - [Sarah Tan](/wiki/Sarah_Tan) and Lim Tze Ting - 2008, Gold, Asian Games, Women's International 420 Class ### Silat - Sheik Alauddin - 1990, Gold, World Silat Championships in the Netherlands, 80–85 kg - 1994, Gold, World Silat Championships in Thailand, Men's Open - Muhammad Shakir Bin Juanda - 2012, World Pencak Silat Championships in the Class-I (85–90 kg) category - 2016, World Pencak Silat Championships in the Class-I (85–90 kg) category - Sheik Farhan - 2015, World Pencak Silat Championships in the Class-J (90–95 kg) category - 2016, World Pencak Silat Championships in the Class-J (90–95 kg) category ### Squash - Pang Ka Hoe, Benedict Chan, Samuel Kang and Vivian Rhamanan - 2017, Gold, South East Asia Games, men's team - Pamela Chua, [Au Yeong Wai Yhann](/wiki/Au_Yeong_Wai_Yhann), Mao Shi Hui and Sneha Sivakumar - 2017, Silver, South East Asia Games, women's team ### Swimming - [Ang Peng Siong](/wiki/Ang_Peng_Siong) - 1982, Gold, US swimming Championships, 50 m freestyle, with 22.69 s, fastest time in 1982 - 1982, Gold, Asian Games in New Delhi, 100 m freestyle - 1990, Silver, Asian Games, 50 m freestyle - [Neo Chwee Kok](/wiki/Neo_Chwee_Kok) - 1951, won 4 Golds, Asian Games in New Delhi, 1500 m, 400 m, 800 m freestyle, 4 × 100 m relay - [Junie Sng Poh Leng](/wiki/Junie_Sng_Poh_Leng) - 1978, won 2 Golds, Asian Games, 400 m freestyle, 800 m freestyle, breaking Asian Games record in both events - [Joscelin Yeo](/wiki/Joscelin_Yeo) - 1993, won 9 Golds, 1 Silver, Southeast Asia Games - 1994, won 1 Bronze, Asian Games, 100 m fly - 1995, won 7 Golds, 2 Silvers, Southeast Asia Games - 1997, won 3 Golds, 1 Silver, 2 Bronzes, Southeast Asia Games - 1999, won 6 Golds, 2 Silvers, 1 Bronze, Southeast Asia Games - 2000, member of world-record setting and NCAA Championships, 200 m medley relay, with teammates from University of California - 2001, won 3 Golds, 4 Silvers, Southeast Asia Games, - 2002, won 1 Bronze, Asian Games in Busan, 100 m fly - 2003, won 4 Golds, 1 Silver, Southeast Asia Games, - [Thum Ping Tjin](/wiki/Thum_Ping_Tjin) - Swam across the [English Channel](/wiki/English_Channel) in August 2005. - [Tao Li](/wiki/Tao_Li) - 2005, won 3 Golds and 1 Bronze, 23rd Southeast Asian Games - 2006, won 1 Gold and 1 Bronze at the 2006 Asian Games, another 1 Gold and 1 Bronze at Milo Asia Swimming Championships - 2007, won 4 Golds, 24th Southeast Asian Games - 2008, made it into the finals for the 100m butterfly event at the [2008 Summer Olympics](/wiki/2008_Summer_Olympics) in Beijing, set two Asian records and the national record in the process, became the eighth fastest butterfly swimmer in the world and the first Singaporean swimmer to enter an Olympic final. - [Joseph Schooling](/wiki/Joseph_Schooling) - 2016, won Gold for the 100m butterfly event at the [2016 Summer Olympics](/wiki/Swimming_at_the_2016_Summer_Olympics) in Rio de Janeiro ### Table tennis - [Li Jiawei](/wiki/Li_Jiawei) - 2001, Won 4 Golds, Commonwealth Championships in New Delhi - Woman's Singles, - Woman's Double, with Jing Junhong - mixed doubles, with Duan Yongjun - Women's Team Champion - 2002, Won 3 Golds, Commonwealth Championships, - Woman's Double, with Jing Junhong - mixed doubles, with Duan Yongjun - Women's Team Champion - 2003, Won US Open - 2004, Won US Open - [Jing Junhong](/wiki/Jing_Junhong) - 2001, Win 2 Golds, Commonwealth Championships, New Delhi - Woman's Double, with Li Jiawei - Women's Team Champion - 2002, Won 2 Golds, Commonwealth Championships, - woman's Double, with Li Jiawei - Women's Team Champion - Duan Yongjun - 2001, Gold, Commonwealth Championships, mixed doubles, with Li Jiawei - 2002, Gold, Commonwealth Championships, mixed doubles, with Li Jiawei - [Feng Tianwei](/wiki/Feng_Tianwei) - [Wang Yuegu](/wiki/Wang_Yuegu) - [Yu Mengyu](/wiki/Yu_Mengyu) ### Taekwondo - [Ng Ming Wei](/wiki/Ng_Ming_Wei) - 2017, Gold, Commonwealth Championships (Men's -58 kg) - 2015, Bronze, Southeast Asian Games (Men's -54 kg) ### Track and field - [Chee Swee Lee](/wiki/Chee_Swee_Lee) - 1974, Gold, Asian Games, 400 m - [Ng Liang Chiang](/wiki/Ng_Liang_Chiang) - 1951, Gold, Asian Games in New Delhi, 110 m hurdles ### Weightlifting - [Chua Phung Kim](/wiki/Chua_Phung_Kim) - 1962, Gold, Commonwealth Games, bantamweight - 1970, Silver, Commonwealth Games, bantamweight - [Tan Howe Liang](/wiki/Tan_Howe_Liang) - 1958, Gold, Asian Games in Tokyo - 1958, Gold, commonwealth Games, lightweight - 1960, Silver, Summer Olympic Games in Rome, lightweight - 1962, Gold, commonwealth Games, middleweight ### Wushu - [Vincent Ng](/wiki/Vincent_Ng) - 1995, Gold, [World Wushu Championships](/wiki/World_Wushu_Championships) in Baltimore, United States - [National sport records in Singapore](/wiki/National_sport_records_in_Singapore) - [Foreign Sports Talent Scheme](/wiki/Foreign_Sports_Talent_Scheme) - [Culture of Singapore](/wiki/Culture_of_Singapore) - [OCBC Cycle Singapore](/wiki/OCBC_Cycle_Singapore) - [List of Singapore world champions in sports](/wiki/List_of_Singapore_world_champions_in_sports) - [Singapore Sports Hub](/wiki/Singapore_Sports_Hub) - [List of stadiums in Singapore](/wiki/List_of_stadiums_in_Singapore) - [Sport Singapore](/wiki/Sport_Singapore) - Singapore Sports Council official website - List of National Sports Associations in Singapore - Team Singapore - Official website to support Singapore's bid for 2010 Youth Olympic Games at [archive.today](/wiki/Archive.today) (archived 2012-05-26) - Sports-related listings in Singapore - Singaporesports.sg – One-stop sports events and news site\n",
  "language": "en",
  "processed_at": "2026-01-12T12:02:26.339169",
  "title": "Sport in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sport_in_Singapore"
}