{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:02:33.435148"
  },
  "content": "Cultural diplomacy platform **Spotlight Singapore** is a [cultural diplomacy](/wiki/Cultural_diplomacy) platform that serves as a gateway to emerging and growth-leading markets Singapore. The first five editions of Spotlight Singapore were managed by the former The Old Parliament House Limited (TOPH). The Spotlight Singapore brand was transferred to The RICE Company Limited (TRCL), an arts and creative not-for-profit organisation in 2014 and is currently managed by TRCL’s subsidiary, Global Cultural Alliance from 2015. Spotlight Singapore combines artistic, economic and educational activities, with the objective of creating understanding, [dialogue](/wiki/Dialogue) and [sustainable](/wiki/Sustainable) collaborations between the arts and business communities of Singapore and her counterparts. Spotlight Singapore began as an international showcase for Singapore artists and their works. The programme subsequently grew to become a \"business-friendly\" event utilising [cultural diplomacy](/wiki/Cultural_diplomacy). It began in 2006 in [Hong Kong](/wiki/Hong_Kong) as a cultural exchange programme, and travelled to [Tokyo](/wiki/Tokyo) in December 2006 with a business element introduced. By the third edition, which was held in [Moscow](/wiki/Moscow) in June 2008, Spotlight Singapore had an intensive 4-day cultural-business programme that introduced the Russian capital to Singapore's lifestyle, and enabled the delegates to meet and seek out business opportunities while developing friendship with their counterparts through the exchange of cultures. In 2011, Spotlight Singapore hosted the programme in [South Africa](/wiki/South_Africa) With plans to venture into the European markets, [Bratislava](/wiki/Bratislava) and [Prague](/wiki/Prague), capital cities of [Slovakia](/wiki/Slovakia) and the [Czech Republic](/wiki/Czech_Republic) respectively, were chosen as Spotlight Singapore's fifth destination in 2012. In 2015, Spotlight Singapore held its sixth edition in Mexico City. In 2018, this programme will be hosted in India, Delhi as a celebration of the 50 years of partnership between ASEAN and India. ## Events ### Hong Kong *Spotlight Singapore* was first launched in Hong Kong in January 2006 on invitation from the [Hong Kong Fringe Club](/wiki/Hong_Kong_Fringe_Club), as part of the City Festival. The programme for Spotlight Singapore in Hong Kong consisted of *Sound Thinking*, a 10-minute work commissioned for [electronica](/wiki/Electronica) and from four vacuum cleaners and the *Earshot* Exhibition that showcased key Singapore literary works and an exhibition of Singapore poetry. ### Tokyo Spotlight Singapore in Tokyo was held at the Mori Arts Centre at [Roppongi Hills](/wiki/Roppongi_Hills) from 5 to 7 December 2008, invited by the Japanese Mori Group of companies. The event incorporated more business-friendly elements, with a delegation of 40 businessmen. The programme presented *Generation/s*, a specially commissioned inter-disciplinary music-theatre work composed by [Iskandar Ismail](/wiki/Iskandar_Ismail), a [Cultural Medallion](/wiki/Cultural_Medallion) recipient. ### Moscow Spotlight Singapore was invited to Russia by [Embassy of Singapore in Moscow](/wiki/Embassy_of_Singapore_in_Moscow). It was presented at the 532-seat Theatre Hall of [Moscow International House of Music](/wiki/Moscow_International_House_of_Music) with an 80% house, and was attended by Singapore Senior Minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) and Russia's Deputy Foreign Minister Alexander Sultanov. The event included the collaboration of Singapore artists and the famed Russian violinist Tatiana Grindenko and her ensemble Opus Posth in the Russian premiere of Generation/s, directed by Singapore Talent, [Ivan Heng](/wiki/Ivan_Heng), and fused with Iskandar Ismail's score of an ensemble of 30. Spotlight Singapore brought 100 Singapore businessmen to Moscow for the event's 4-day business exploration programme and developed the large-scale business exploration programme through a partnership with [International Enterprise Singapore](/wiki/International_Enterprise_Singapore), supported by the [Skolkovo Moscow School of Management](/wiki/Skolkovo_Moscow_School_of_Management), [Chamber of Commerce and Industry of the Russian Federation](/wiki/Chamber_of_Commerce_and_Industry_of_the_Russian_Federation), Opora Russia, [Singapore Business Federation](/wiki/Singapore_Business_Federation) and Singapore Manufacturers' Federation. ### Cape Town Spotlight Singapore will host a programme at [Cape Town](/wiki/Cape_Town), South Africa, from 16 March to 19 March 2011. Co-organised by [The Arts House](/wiki/The_Arts_House) and Asian Culture Enterprise Singapore with Raintree Solutions as the South African partner, Spotlight Singapore in Cape Town's 4-day programme includes artistic collaborations and presentations in music, literature and design, business networking sessions, industry tours and breakout sessions. ### Bratislava-Prague In line with its focus on emerging economies, and with various Singapore companies expressing an interest to establish their presence in the European market, Spotlight Singapore spun off the Spotlight Singapore Young Entrepreneurs Series (YES) to Bratislava and Prague from 23 to 29 September 2012. For Spotlight Singapore YES the arts and culture components had been designed to reflect a mentor-mentee relationship, a transfer of experience and knowledge from one generation to another and for an exchange between cultures. Young and aspiring entrepreneurs from various Polytechnics and tertiary education institutes also participated enthusiastically. Through both the music and visual/public art events, Spotlight Singapore YES not only showcased Singapore’s rich and diverse arts and cultural heritage but also the readiness of the next generation to engage with the various cultures of the world. ### Mexico City Spotlight Singapore Mexico City was held to celebrate 40 years of bilateral relations between Singapore and Mexico, which was attended by over 100 artists, business people, political leaders and students. This edition saw the creation of Pasar Singapura, a specially conceived interchange of music, visual arts and cuisine from Singapore and Mexico in a cultural marketplace held at Biblioteca de Mexico, an event that was sponsored by Temasek. The delegation also visited iconic places of historical significance as well as business forums. - Main Site\n",
  "language": "en",
  "processed_at": "2026-01-12T12:02:33.434820",
  "title": "Spotlight Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Spotlight_Singapore"
}