{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:02:36.686122"
  },
  "content": "* *Spuul** offers [over-the-top content](/wiki/Over-the-top_content) across web, mobile/tablets (iOS, Android), smart TVs, and Chromecast to stream and download feature-length movies, short films, and TV shows in Hindi, Punjabi, Tamil, Malayalam, Telugu, and other Indian regional languages. The service is available worldwide. As of 2018, Spuul has also incorporated Live Indian, Nepali, Bangladeshi and Pakistani TV Channels in their offering while also providing users with an option to DVR and watch the earlier aired episodes of the shows. As of early 2016, Spuul had a catalogue of over 1,000 films and TV shows, as well as partnerships across several production companies such as [Yash Raj Films](/wiki/Yash_Raj_Films), [Balaji Telefilms](/wiki/Balaji_Telefilms), [Shemaroo Entertainment](/wiki/Shemaroo_Entertainment), [Viacom 18](/wiki/Viacom_18), [Reliance Entertainment](/wiki/Reliance_Entertainment), [Phantom Films](/wiki/Phantom_Films), and [UTV Motion Pictures](/wiki/UTV_Motion_Pictures). In addition to a large selection of free movies, Spuul offers a premium subscription option in monthly, annual and multiple smaller packages, along with pay-per-view movies. Spuul is headquartered in [Singapore](/wiki/Singapore), with an office in [Mumbai](/wiki/Mumbai). Spuul Blog provides news and gossip for movie buffs to read. ## Reviews According to a review by PCQuest, \"Overall, the experience was pretty good and we can say the app is quite the right destination for movie fanatics.\" ## History Spuul was founded in 2012 by Sudesh Iyer, S. Mohan, and Subin Subaiah. Sudesh Iyer founded Sony Entertainment TV in India and serves as Spuul's chairman; S. Mohan founded Accellion, buUuk and other tech companies and is currently the COO. Subin Subaiah has worked in banking across several companies such as Deutsche Bank and Standard Chartered, and currently serves as Spuul CEO. Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:02:36.685728",
  "title": "Spuul",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Spuul"
}