{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:02:40.484750"
  },
  "content": "* *Sri Layan Sithi Vinayagar Temple** is a Hindu temple at the junction of [Keong Saik Road](/wiki/Keong_Saik_Road) and [Kreta Ayer Road](/wiki/Kreta_Ayer_Road) in [Chinatown, Singapore](/wiki/Chinatown,_Singapore). Completed in 1925, the temple has been underwent multiple major renovations. ## Description The front gate features decorated posts and a moulded cornice accompanied by dentils. The gate also features five sculptures, one of which depicts the Hindu deity [Ganesha](/wiki/Ganesha), to whom the temple is dedicated. The temple's [Gopuram](/wiki/Gopuram), which was made taller and \"more ornate\" during a 2007 facelift for the temple, features five levels which taper towards the top of the structure to signify the [five human senses](/wiki/Sense). The painted sculptures and carvings on the Gopuram depict various aspects of the mythology surrounding Ganesha. The temple also features a statue of [Naagar](/wiki/Nagaraja), a Holy [Vel](/wiki/Vel) and a statue of the deity [Rama](/wiki/Rama). ## History The temple replaced an older [attap roof](/wiki/Attap_dwelling) temple dedicated to Ganesha near the mortuary of the [Singapore General Hospital](/wiki/Singapore_General_Hospital) catering towards the hospital employees, as well as those working at the nearby [Outram Prison](/wiki/Outram_Prison) and soldiers from the Sepoy Lines. However, the government acquired the land on which the temple stood in 1920 to expanding the hospital. As such, with funding from the [Nattukottai Chettiars](/wiki/Nagarathar) of [Tamil Nadu](/wiki/Tamil_Nadu), the current temple was built in 1925. It was named \"Layan Sithi\" as it was located near the Sepoy Lines. The statue of Ganesha from the original temple was installed in front of the main Ganesha statue within the newer temple. A third Ganesha statue was donated by Pichappa Chettiar, a trustee of the temple. The temple was gazetted for conservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority). It was placed in the [Bukit Pasoh Conservation Area](/wiki/Bukit_Pasoh_Road) which is within the Chinatown Historic District. The temple underwent renovations in 1975 and was re-consecrated on 14 November of that year. It was again renovated in 1989 and re-consecrated on 10 November. On the eve of [Thaipusam](/wiki/Thaipusam), a statue of the Hindu deity [Murugan](/wiki/Kartikeya) is carried over to the temple from the [Sri Thendayuthapani Temple](/wiki/Sri_Thendayuthapani_Temple) on Tank Road on a silver chariot, where it remains until it is returned to the Sri Thendayuthapani Temple on the following night. The Holy Vel, which is, in Hindu mythology, Murugan's weapon, is transported to the temple on Tank Road on Thaipusam. The Vel is doused in milk before it is offered to the Murugan statue. From June to December 2007, the temple underwent a $2.4 million facelift, during which the walls of the temple were demolished and rebuilt such that there would be more space within the temple. The temple's Gopuram, which was previously only three tiers tall, was replaced by a Gopuram with five tiers featuring carvings from 15 craftsmen of India. The temple was re-consercrated on 16 December, with over 10,000 worshippers in attendance of the re-consecration ceremony. In 2017, an adjacent two-storey annexe building was completed. The building was to be used for special [Pujas](/wiki/Puja_(Hinduism)). The temple underwent a $1 million facelift in 2019. The renovation works included installing a wheelchair ramp, repainting murals and adding more cubicles to the temple's toilets. The re-consecration ceremony, which was attended by around 15,000 worshippers, was held on 15 December. 1°16′53″N 103°50′30″E﻿ / ﻿1.28132°N 103.84171°E﻿ / 1.28132; 103.84171\n",
  "language": "en",
  "processed_at": "2026-01-12T12:02:40.484463",
  "title": "Sri Layan Sithi Vinayagar Temple",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sri_Layan_Sithi_Vinayagar_Temple"
}