{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:02:44.526881"
  },
  "content": "Hindu temple in Singapore **Sri Veeramakaliamman Temple** ([Tamil](/wiki/Tamil_language): ஸ்ரீ வீரமாகாளியம்மன் கோவில்; [Chinese](/wiki/Simplified_Chinese_character): 维拉马卡拉曼庙), also known earlier as **Soonambu Kambam Kovil***,* is a [Hindu](/wiki/Hindu) temple located in the middle of [Little India](/wiki/Little_India,_Singapore) in the southern part of [Singapore](/wiki/Singapore). The temple started as a shrine dedicated to the Hindu goddesses [Kali](/wiki/Kali) and [Parvati](/wiki/Parvati) in 1855 before a temple was built by Bengali labourers in 1881. ## Architecture Images of Kali within the temple show her wearing a [garland of skulls](/wiki/Mundamala) and ripping out the insides of demons, and Parvati sharing a peaceful family moments with her sons [Ganesha](/wiki/Ganesha) and [Murugan](/wiki/Murugan). The building is constructed in the style of South Indian [Tamil](/wiki/Tamil_people) temples common in [Tamil Nadu](/wiki/Tamil_Nadu) as opposed to the style of Northeastern Indian Kali temples in [Bengal](/wiki/Bengal), where Her [worship](/wiki/Worship) is extremely widespread but the style of temple construction differs considerably. ## History This temple has also been used to shelter people from Japanese air raids during the horrid period of World War 2.[*citation needed*] ## Controversy In 2018, the Charities Commissioner has barred the temple's chairman Sivakadacham, former chairman R Selvaraju, and secretary Ratha Krishnan Selvakumar from their posts, after the three, who were cheque signatories and approvers for payments, issued more than $1.5 million in uncrossed cheques. Of these, 45 cheques – totalling more than $227,000 – were not issued to the names of the intended recipients of the proceeds. The inquiry also revealed that Ratha had obtained loans of $350,000 without the management committee's approval and with no written loan agreements with the lenders. Cash loans and disbursements of proceeds from the loans were also not properly accounted for in the temple's records. - Official site - Uniquely Singapore website This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e This article about a [Hindu place of worship](/wiki/Hindu_temple) is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:02:44.526540",
  "title": "Sri Veeramakaliamman Temple",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sri_Veeramakaliamman_Temple"
}