{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:02:42.264189"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Sri Thendayuthapani Temple\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2021)* *(Learn how and when to remove this message)*This article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"Sri Thendayuthapani Temple\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2021)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Hindu Temple in Tank Road, Singapore The **Sri Thendayuthapani Temple**, better known as the **Chettiars' Temple**, is one of Singapore Hindu community's most important monuments. The temple was built by the [Chettiars](/wiki/Chettiar) (Indian moneylenders) at Tank Road in 1859 and managed by the Chettiars' Temple Society. The temple was reconstructed in 1983 and renovated in 2022. The temple was gazetted as a [National monument of Singapore](/wiki/National_monuments_of_Singapore) on 20 October 2014. ## Worship The Hindu temple is dedicated to [Muruga](/wiki/Kartikeya). On the eve of [Thaipusam](/wiki/Thaipusam), the statue of Murugan is paraded from the temple through the city to [Sri Layan Sithi Vinayagar Temple](/wiki/Sri_Layan_Sithi_Vinayagar_Temple), another Chettiar temple located at [Keong Saik Road](/wiki/Keong_Saik_Road) in [Chinatown](/wiki/Chinatown,_Singapore), and then back to Sri Thendayuthapani Temple. On Thaipsuam, devotees will walk from [Sri Srinivasa Perumal Temple](/wiki/Sri_Srinivasa_Perumal_Temple) on Serangoon Road, with their bodies pierced by hooks, spears and spiked steel structures called [kavadi](/wiki/Kavadi_Aattam), or carry *paal kudam*s (milk pots) on their heads, to Sri Thendayuthapani Temple as an act of penance in gratitude to Lord Murugan for granting their prayers of supplication. ## History In 1859, the Sri Thendayuthapani Temple was constructed at Tank Road for worship for the Hindu deity, Lord Muruga, by the Chettiar community in Singapore. In the late 1970s, it was decided to reconstruct the temple at a cost of S$3.3 million which is paid by the Chettiar community. The reconstruction was done by 1983 and was consecrated on 24 November 1983. In 2022, the temple was renovated, including reconstructing the [Meenakshi](/wiki/Meenakshi) Amman sanctum, replacement of temple floors and repainting the sanctum walls and columns, at a cost of about $1 million. - Website of Sri Thandayuthapani Temple This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:02:42.263801",
  "title": "Sri Thendayuthapani Temple",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sri_Thendayuthapani_Temple"
}