{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:02:48.647325"
  },
  "content": "Church in St Andrew's Road, Singapore **Saint Andrew's Cathedral** is an [Anglican](/wiki/Anglican) [cathedral](/wiki/Cathedral) in [Singapore](/wiki/Singapore). It is located near [City Hall](/wiki/City_Hall,_Singapore), [Downtown Core](/wiki/Downtown_Core), within the [Central Area](/wiki/Central_Area,_Singapore) in Singapore's central business district. It is the cathedral church of the [Anglican Diocese of Singapore](/wiki/Anglican_Diocese_of_Singapore) and serves as the mother church to 27 parishes and more than 55 congregations. The church has existed on the site since 1836, although the current building was constructed in 1856–1861. The logo of the cathedral is the [St Andrew's Cross](/wiki/Saltire). In 2006, it marked the 150th anniversary of the St Andrew's Church Mission, which was initiated in 1856. After a period of more than 2 years of restorative works, the Cathedral Nave was reopened and dedicated by Bishop Titus Chung on 24 December 2023. ## History A piece of land between [Hill Street](/wiki/Hill_Street,_Singapore) and [North Bridge Road](/wiki/North_Bridge_Road) was originally allocated by [Sir Stamford Raffles](/wiki/Stamford_Raffles) in his [Town Plan of 1822](/wiki/Raffles_Town_Plan) for the siting of an Anglican church. However, construction of the church did not begin until funds were raised by the community in 1834. The church was built between North Bridge Road and St Andrew's Road. The church was named [Saint Andrew](/wiki/Saint_Andrew) after the patron saint of Scotland in honour of the Scottish community who had donated to the building fund. ### First church The first Saint Andrew's Church was designed by [George Drumgoole Coleman](/wiki/George_Drumgoole_Coleman) in the [neo-classical](/wiki/Neoclassical_architecture) style. The foundation stone was laid on 9 November 1835, and the building constructed by 1836. The first church service was conducted on 18 June 1837 by the first chaplain, Reverend Edmund White, and the church was consecrated on 10 September 1838 by [Bishop Daniel Wilson](/wiki/Daniel_Wilson_(bishop)) of [Calcutta](/wiki/Calcutta). After complaints that the church resembled a \"Town Hall, a College or an Assembly Room\", a spire was added by [John Turnbull Thomson](/wiki/John_Turnbull_Thomson) in 1842. The spire was built without a lightning conductor, however, and the church suffered two [lightning](/wiki/Lightning) strikes in 1845 and 1849. It was then declared unsafe and closed in 1852, and subsequently demolished in 1855. The church had a bell known as the [Revere Bell](/wiki/Revere_Bell), named after Mrs Maria Revere Balestier, the wife of American Consul Joseph Balestier, who donated it in 1843. It also contained an organ by the London builder [Holdich](/wiki/George_Holdich) (1843/1844), who coincidentally opened his firm in the same building as [Bevington and Sons](/wiki/Henry_Bevington) who would later supply the organ for the Roman Catholic [Cathedral of the Good Shepherd](/wiki/Cathedral_of_the_Good_Shepherd) nearby. ### Second church The construction of a second church was initiated by the then [Governor of the Straits Settlements](/wiki/Governor_of_the_Straits_Settlements) [William Butterworth](/wiki/William_John_Butterworth). [Colonel](/wiki/Colonel_(British_Army)) [Ronald MacPherson](/wiki/Ronald_MacPherson), the Executive Engineer and [Superintendent](/wiki/Management) of [convicts](/wiki/Convict), designed the new church in the [Gothic Revival](/wiki/Gothic_Revival) style. The tower was originally designed to be twice the height of the previous tower and without a spire, but during the construction, it was discovered that the foundation might not support such a heavy structure, and a lighter spire was used instead. The plan was also simplified so that it could be more easily built by Indian convict labourers, who were commonly used in building construction in early Singapore. John Bennet was the engineer responsible for the construction. After MacPherson was transferred to [Malacca](/wiki/Malacca), the completion of the building was overseen by Major John F. A. McNair, John Bennett and W. D. Bayliss. [The Rt Rev.](/wiki/The_Right_Reverend) Dr [Daniel Wilson](/wiki/Daniel_Wilson_(bishop)), [Lord Bishop of Calcutta](/wiki/Diocese_of_Calcutta_of_the_Church_of_North_India), laid the [foundation stone](/wiki/Foundation_stone) on 4 March 1856, and the building was completed in 1861. The first [service](/wiki/Church_service) was held on 1 October 1861. Dr [George Cotton](/wiki/George_Cotton), who succeeded Bishop Wilson, had the honour of [consecrating](/wiki/Consecrate) the church on 25 January 1862. The Saint Andrew's Mission was initiated on 25 June 1856, and the first [Anglican](/wiki/Anglican) [evangelical](/wiki/Low_church) [outreach](/wiki/Outreach) in Singapore was launched from the church. ### Consecration as cathedral In 1869, the church was transferred from the Diocese of Calcutta to the [Diocese](/wiki/Diocese) of [Labuan](/wiki/Labuan) and [Sarawak](/wiki/Sarawak). In 1870, [Archdeacon](/wiki/Archdeacon) John Alleyne Beckles consecrated it as the Cathedral Church of the United Diocese. The Revere Bell was replaced by a chime of bells in 1889. The Revere Bell is currently placed in the [National Museum of Singapore](/wiki/National_Museum_of_Singapore). The cathedral is currently owned by the [Synod](/wiki/Synod) of the Diocese of Singapore, established in 1909. The first Anglican bishop, The Right Reverend Charles James Ferguson-Davie, was appointed that year. In 1942, shortly before the [Fall of Singapore](/wiki/Fall_of_Singapore) to the [Japanese](/wiki/Empire_of_Japan), the cathedral served as an emergency hospital. A Memorial Hall dedicated to those who died in the [Second World War](/wiki/Second_World_War) was added in 1952. The north and south transepts of the cathedral was originally built as porches for carriages. Both transepts have been extended to provide halls, meeting rooms and offices: the North Transept in 1952, and the South Transept 1983. Saint Andrew's Cathedral was [gazetted](/wiki/Gazette) as a [Singaporean national monument](/wiki/National_Monuments_of_Singapore) on 28 June 1973. A project to extend the building was initiated in 2003. An [archaeological](/wiki/Archaeological) [excavation](/wiki/Excavation_(archaeology)) was conducted on its grounds in 2004 by the [National University of Singapore](/wiki/National_University_of_Singapore) before building commenced. The extension, called the Cathedral New Sanctuary, was completed in November 2005. It was largely built underground to comply with conservation guidelines for a gazetted national monument, and features a new worship hall within two underground levels of new floor space. The cathedral bells, cast in 1888 by [John Taylor & Co](/wiki/John_Taylor_%26_Co) of [Loughborough](/wiki/Loughborough), England, were originally hung as a chime of eight in the key of [E-flat](/wiki/E%E2%99%AD_(musical_note)). These were designed to be hung for [change ringing](/wiki/Change_ringing). However, contemporary surveys found that the tower had unsuitable foundations to support a swinging peal of bells, and they were hung dead for chiming via the [Ellacombe system](/wiki/Ellacombe_apparatus). In 2018, a further survey found that the tower was perfectly capable of withstanding change ringing, and a project was launched for them to be hung properly. The bells were taken out of the tower in November of that year for tuning and cleaning. The new ringing arrangement (a peal of twelve in [D](/wiki/D_(musical_note)), retaining six of the original eight bells) was also made by John Taylor & Co. The first change ringing on the twelve took place on August 7, 2019, and the bells were dedicated on Sunday 11 August. ## Architecture The existing cathedral was designed in a [Neo-Gothic](/wiki/Neo-Gothic) architectural style, and was finished with [Madras](/wiki/Madras) *[chunam](/wiki/Chunam)*. The architect MacPherson is said to have drawn inspiration for aspects of the design from [Netley Abbey](/wiki/Netley_Abbey), a ruined thirteenth century church in [Hampshire](/wiki/Hampshire), England. The [piers](/wiki/Pier_(architecture)) of the [nave](/wiki/Nave) of Saint Andrew's closely resemble the surviving piers at Netley. Three [stained glass](/wiki/Stained_glass) windows located at the [apse](/wiki/Apse) are dedicated to three figures in Singapore's early colonial history and who are represented on the windows by their coats of arms. The window at the centre is dedicated to [Sir Stamford Raffles](/wiki/Sir_Stamford_Raffles), the windows on the left to [John Crawfurd](/wiki/John_Crawfurd), the first major [Resident](/wiki/Resident_(title)) of Singapore, and the windows on the right to [Major General](/wiki/Major_General) [William Butterworth](/wiki/William_John_Butterworth), the governor who initiated the construction of the second church building. However, the original stained glass windows were damaged during the Second World War. MacPherson is remembered in the grey and red [granite](/wiki/Granite) memorial monument surmounted by a [Maltese cross](/wiki/Maltese_cross) in the grounds, and by the [stained glass](/wiki/Stained_glass) window over the west door. Jalan Klapa was also renamed MacPherson Road in his honour. The gallery at the West end was not part of MacPherson's plan but added after the Cathedral opened. It has the only decorated elements in the church, with foliated pillars and pilasters, and [crocketed](/wiki/Crocket) arches. The east end was originally plain, containing just a communion table set behind a communion rail. Choir stalls and new altar rails were added in 1900, and in 1905, a reredos designed by Charles J. Blomfield, F.R.I.B.A, depicting the Worship of the Shepherds, executed in [Salviati](/wiki/Salviati_(glassmakers)) mosiac was installed. This was erected by public subscription in memory of Emily Harriet Hose, the wife of [George Hose](/wiki/George_Hose), bishop of Labuan and Sarawak. The altar has since been reordered to reflect late 20th century Roman Catholic liturgical fashions which followed the [Second Vatican Council](/wiki/Second_Vatican_Council), which preferred a celebration of the eucharist 'versus populum', and the altar was moved into the centre of the quire, on a modern platform, separated from its reredos. There was originally an organ installed in 1861 by John Walker of London, at the cost of £600. This organ withstood the humid climate of Singapore for 66 years until it was pulled down in 1928 to make way for a new organ by Hill Noramn and Beard (completed 1929), which incorporated some of the Walker organ. This new instrument was constructed at the cost of £30,000 and had three manuals. The Walker organ was originally placed in the north aisle, but subsequently moved to the west gallery where the choir sat at the time. The choir was subsequently moved to the east end of the church and sat in divided stalls, and a second organ by Bryceson Bros. of London was erected in the north vestry. This organ was subsequently sold to [St. George's Church, Penang](/wiki/St._George%27s_Church,_Penang). In 1959, Hill Norman and Beard carried out substantial restoration and repair of the organ, as well as carrying out tonal modifications Towards the end of the 20th century, the Hill Norman and Beard organ fell into disrepair and was subsequently left disused for a long period, replaced by an electronic instrument. In 2008, some pipes from the disused organ were restored and reintalled in a new case in the west gallery, and connected to the electronic organ console. This was further expanded in 2017 to include more restored pipes, including pipework from the original 1861 organ. Three objects in the Saint Andrew's Cathedral symbolise the affiliation of the Church with the [Anglican](/wiki/Anglican) Communion in England and its allegiance to the worldwide [See of Canterbury](/wiki/See_of_Canterbury). The Canterbury Stone, set in a [pillar](/wiki/Column) by the [lectern](/wiki/Lectern) and bearing a bronze replica of the [Canterbury Cross](/wiki/Canterbury_Cross), was sent from [Canterbury Cathedral](/wiki/Canterbury_Cathedral) in 1936. The Coventry Cross, on the [column](/wiki/Column) supporting the [pulpit](/wiki/Pulpit), is made from three silver-plated iron nails from the ruins of the 14th century [Coventry Cathedral](/wiki/Coventry_Cathedral) destroyed by bombing during the [Second World War](/wiki/Second_World_War). The Coronation Carpet in the [Epiphany](/wiki/Epiphany_(Christian)) Chapel comes from the carpet that was used in the [Coronation](/wiki/Coronation_of_Elizabeth_II) of [Queen Elizabeth II](/wiki/Elizabeth_II_of_the_United_Kingdom) in [Westminster Abbey](/wiki/Westminster_Abbey). ## St Andrew's Cathedral Choir The St Andrew's Cathedral Choir is the oldest musical institution in Singapore. [*citation needed*] Lim Chin Kai serves as the music director since 1992. ## Gallery - [Anglican Diocese of Singapore](/wiki/Anglican_Diocese_of_Singapore) ### Cited works - Norman Edwards, Peter Keys (1996), *Singapore – A Guide to Buildings, Streets, Places*, Times Books International, [ISBN](/wiki/ISBN_(identifier)) 9971-65-231-5 - *Insight City Guide: Singapore* - Swindell, Frank G. (1929). *A Short History of St. Andrew's Cathedral, Singapore*. The Malay Tribune Press Ltd. - St Andrew's Cathedral Online - Uniquely Singapore article\n",
  "language": "en",
  "processed_at": "2026-01-12T12:02:48.647036",
  "title": "St Andrew's Cathedral, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/St_Andrew%27s_Cathedral,_Singapore"
}