{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:49:51.837907"
  },
  "content": "Singaporean technology, defence and engineering companyThis article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"ST Engineering\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2025)* *(Learn how and when to remove this message)* **Singapore Technologies Engineering** or **ST Engineering** (**ST Engg.**) is a [Singapore](/wiki/Singapore)-based multinational technology, defence and engineering group with a diverse portfolio of businesses across the aerospace, [smart city](/wiki/Smart_city), defence and public security segments. As of 2024, it was the eighth largest company on the [Singapore Exchange](/wiki/Singapore_Exchange) by market capitalisation. It is a component stock of MSCI Singapore, [FTSE Straits Times Index](/wiki/Straits_Times_Index) and Dow Jones Best-in-Class Asia Pacific Index. The company is ranked among the top 100 global defence manufacturers by the [Stockholm International Peace Research Institute](/wiki/Stockholm_International_Peace_Research_Institute) (SIPRI) and *[Defense News](/wiki/Defense_News)* based on defence segment and total revenue respectively. ## History ST Engineering's history stemmed from the foundations of the Singapore defence industry, with the earliest roots being the Chartered Industries of Singapore in 1967. Its origins are linked to several defence-related companies that later became its operational divisions. These notable companies were held under Sheng-Li Holding Company Private Limited ([traditional Chinese](/wiki/Traditional_Chinese_characters): 勝利控股公司; [simplified Chinese](/wiki/Simplified_Chinese_characters): 胜利控股公司; [pinyin](/wiki/Pinyin): *Shènglì kònggǔ gōngsī*; [Wade–Giles](/wiki/Wade%E2%80%93Giles): *Shêng-lì K'òng-kǔ K'ung-sī*), which was formed on 3 January 1974 to serve as the holding entity for eight defence-related companies of significant interest to [Ministry of Defence (MINDEF)](/wiki/Ministry_of_Defence_(Singapore)) through a share exchange with the [Minister for Finance (Incorporated)](/wiki/Ministry_of_Finance_(Singapore)). The name was a direct phonic adaption of the Chinese word \"胜利\" ([traditional Chinese](/wiki/Traditional_Chinese_characters): 勝利; [simplified Chinese](/wiki/Simplified_Chinese_characters): 胜利; [pinyin](/wiki/Pinyin): *Shènglì*; [Wade–Giles](/wiki/Wade%E2%80%93Giles): *Shêng-lì*), which translates as \"victory\". The Singapore Technology Corporation (STC), established in 1983, briefly served as a holding company to consolidate the manufacturing and service capabilities of the ordnance-related companies, with the exception of [Bofors](/wiki/Bofors)-linked joint venture Allied Ordnance Company of Singapore (AOS), which later became a subsidiary of CIS in 1988. Sheng-Li Holding Company was later succeeded as the **Singapore Technologies Holdings** (SingTech, or ST) on 11 May 1990, through a series of restructure and re-consolidation following the introduction of its new corporate identity and sunburst logo in 1989. The following companies were instrumental in the foundation of ST Engineering. ### Chartered Industries of Singapore (CIS) The Chartered Industries of Singapore (CIS) was established in 1967 as a munitions manufacturer to address the defense equipment needs of Singapore following [its independence](/wiki/Independence_of_Singapore_Agreement_1965). The company's first facility, located in [Jurong](/wiki/Jurong), began operations as an ammunition plant. Parts of this facility later became the [Singapore Mint](/wiki/Singapore_Mint). Initially, CIS produced 5.56mm caliber ammunition for the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF), while simultaneously minting [circulation coins](/wiki/Singapore_dollar#Marine_series_1967) for the [Board of Commissioners of Currency of Singapore](/wiki/Monetary_Authority_of_Singapore) (BCCS). Both operations shared a workshop that supported both military and civilian markets. In its early years, CIS focused on licensed manufacturing and subcontracted work for foreign ordnance producers. During this period, the company's engineers and technicians gained experience in development and production of munitions across various calibers. By 1996, CIS, through its subsidiaries, had expanded its operations to produce various types of ordnance for the SAF and international export. Its subsidiaries included: - *Chartered Ammunition Industries (CAI)*, which produced small, medium, and large caliber ammunition, explosives, pyrotechnics, and anti-tank weapons. - *Ordnance Development Engineering (ODE)*, incorporated in 1973 with the objective to achieve indigenous design and manufacture medium to large caliber weapon systems, including mortars, cannons (such as the [FH88](/wiki/FH-88) and [FH2000](/wiki/FH-2000)). - *Chartered Firearms Industries (CFI)*, which manufactured infantry and crew-served weapons, including the SR88A assault rifle, Ultimax 100 light machine gun, 7.62mm General Purpose Machine Gun (GPMG), 40mm grenade launchers, and the 40/50 Cupola Weapon System. - *Allied Ordnance of Singapore (AOS)*, which provided [short-range air defense systems](/wiki/Short_range_air_defense), including the 40mm L70 air defense gun and associated missile and optronic fire control systems. In 1973, CIS formed *Allied Ordnance of Singapore (AOS)* in partnership with Sweden's [Bofors](/wiki/Bofors) to manufacture quick-firing anti-aircraft (40mm) and naval (57mm) guns, along with their ammunition and fuzes. After Bofors withdrew from the venture in 1988, AOS became a wholly owned subsidiary of CIS. ### Singapore Automotive Engineering (SAE, later ST Automotive) Singapore Automotive Engineering (SAE) was incorporated in 1971 in one of the SAF's vehicle maintenance base at [Ayer Rajah](/wiki/One-north), to support automotive-related services for the SAF. Its first immediate task was to service and maintain a fleet of [V200](/wiki/Cadillac_Gage_Commando) Armoured Personnel Carriers, as well as the repair and overhaul of the fleet of [Bedford](/wiki/Bedford_Vehicles) trucks inherited from the British military forces in 1972. By 1982, SAE expanded into the commercial sector, including establishing the SAE Inspection Centre to provide vehicle servicing for military and civilian clients. In 1983, the company established Singapore Commuter, a taxi service operator. Singapore Commuter was later merged with Singapore Airport Services Ltd (SABS Taxi Ltd) and Singapore Bus Service Taxi Pte Ltd (SBS Taxi Pte Ltd) in April 1995 to form [CityCab](/wiki/ComfortDelGro). In the defence sector, ST Auto had fulfilled various contracts for several military vehicle upgrades, including the [AMX-13-SM1](/wiki/AMX-13#Production_variants) Light Tanks in both Singapore and overseas, and refurbishments the [M113](/wiki/M113_armored_personnel_carrier) Armoured Personnel Carrier in 1993 for the Singapore Armed Forces. Singapore Automotive Engineering make its initial public offering on the Singapore Stock Exchange on 27 August 1991, offering 30 million shares at an issue price of [S$](/wiki/Singapore_dollar)1.20. In 1992, it obtained exclusive rights to distribute German Opel cars in partnership with American car maker [General Motors](/wiki/General_Motors). On 29 December 1994, Singapore Automotive Engineering was renamed Singapore Technologies Automotive Ltd (or ST Automotive, or ST Auto), along with announced name changes of the other three main subsidiaries under the Singapore Technologies Group. as part of a group-wide rebranding following the transfer of the parent group, Singapore Technologies Group, to Temasek Holdings earlier that year. In end-1995, STA Detroit Diesel-Allison was formed to take on the maintenance of the Detroit diesel engines and Allison transmission used in the Bionix as well as to distribute the Detroit Diesel parts in the Asian region. ### Singapore Electronic & Engineering Limited (SEEL, later ST Electronics & Engineering) Singapore Electronic & Engineering Limited (SEEL) was established in 1969, following the withdrawal of the [British Royal Navy](/wiki/Royal_Navy) from Singapore and the acquisition of Her Majesty's Sembawang Dockyards by [Swan Hunter](/wiki/Swan_Hunter). SEEL took control of assets and electronics workshops previously operated by the Royal Navy and inherited staff, including weapons maintenance personnel and seconded civilians.. The workshops were initially managed by Philips Australia. SEEL continued to provide maintenance services for the Royal Navy Fleet and, subsequently, for United States military forces deployed in Vietnam, as well as the Singapore Armed Forces (SAF). To adapt to the reduced demand following the Royal Navy's departure and the slow uptake of US Navy contracts, SEEL established an aviation electronics service wing alongside its general engineering operations. This expanded its client base to include private, charter, and military operators.. Despite this expansion, SEEL struggled to generate significant profits during its early years. By 1974, financial difficulties led to staff retrenchments and the sale of some assets. In an effort to remain viable, SEEL briefly diversified into the distribution and maintenance of commercial electronic products, laying the groundwork for its future system integration capabilities. A Systems Division was subsequently established within the Engineering Department, along with an Aircraft Electrical Overhaul Shop at Seletar Air Base. By 1977, SEEL had returned to profitability. SEEL was placed under the Singapore Aircraft Industries (SAI) in 1980 prior to its listing in July 1991, for its involvement aviation-related businesses. SEEL ventured into commercial ventures beginning from the 1970s. In September 1978, SEEL won the contract to do the Building Automation System for [Changi International Airport Terminal 1](/wiki/Changi_Airport) with ITT Regelungstechnik, a West German subsidiary of US company [ITT](/wiki/ITT_Inc.). In 1982, it secured the contract through a Singapore-German joint venture Systems Union Pte Ltd, to supply new control and automation systems for the second 3.35 km runway of Changi International Airport. It went on to secure contracts for integrated communication and control systems for local and overseas metro projects, including the [Singapore MRT](/wiki/Mass_Rapid_Transit_(Singapore)) in 1992 and the [Taipei Metro](/wiki/Taipei_Metro) in 1993. In the defence industry, SEEL was awarded contracts by MINDEF for the outsourced operations of the Electronic Supply and Maintenance Base in 1981 and the Central Missile Supply Base in 1983. SEEL's Aviation Division was integrated with SAMCO's aircraft component repair facility in August 1982 to form Singapore Aero-Components Overhaul (SACO). SEEL would focus on landbased electronics systems while under the parent holding company SAI. In 1986, a joint venture, Singapore Engineering Software (SES), was established between SEEL and the Swedish company Ericsson Radio Systems AB. The purpose of the venture was to enhance engineering capabilities, particularly in software development for real-time command and control. Over time, it was expected to provide SEEL with access to Ericsson's global market reach. On 29 December 1994, Singapore Electronic & Engineering Limited was renamed Singapore Technologies Electronics & Engineering Ltd (or ST Electronics & Engineering, or ST E&E), along with announced name changes of the other three main subsidiaries under the Singapore Technologies group. ### Singapore Shipbuilding and Engineering (SSE, later ST Shipbuilding & Engineering) Singapore Shipbuilding & Engineering (SSE) was established in May 1968 as a private company with the Singaporean government holding a minority stake. Initially, SSE focused on constructing vessels for the [Republic of Singapore Navy](/wiki/Republic_of_Singapore_Navy) (RSN) as well as commercial operators. In its early years, the company faced financial difficulties. Although the RSN had ordered several logistics vessels, funding priorities shifted towards the expansion of the [Singapore Air Defence Command](/wiki/Republic_of_Singapore_Air_Force), and the RSN had no further significant work for SSE. This led to a decline in business, compounded by ongoing management-labor issues. By 1978, SSE experienced a significant setback after underbidding a contract for a series of 10 cargo container vessels for a consortium of European owners. As a result, the company faced the possibility of loan defaults. To avert collapse, Sheng-Li Group, a company within the same corporate group, injected fresh capital into SSE. During this period, key personnel from the RSN, joined SSE to lead the company through its turnaround. The company recovered within a year following restructuring. Following the restructuring, SSE began to focus more aggressively on the commercial market, offering vessel designs for commercial clients. The company invested in building a skilled team of engineers and introduced a variable bonus scheme. By 1981, SSE secured a major contract to build three 120-meter cargo container vessels for Hellenic Lines, a Greek shipping company. The vessels were delivered ahead of schedule. SSE was the first shipyard in Asia to acquire a CAD/CAM system. In the latter half of the 1980s, the company continued to innovate, producing advanced vessels such as the Tiger 40 Hovercraft. In 1991, SSE achieved global recognition by earning the [ISO 9001 Certification](/wiki/ISO_9000_family) from [Lloyd's Register Quality Assurance (UK) Ltd](/wiki/Lloyd%27s_Register) (LRQA), as the first shipyard outside Western Europe to do so. While the shipyard initially focused on naval and paramilitary craft for both Singapore and international clients, it also expanded into the civilian sector. By 1996, 45% of SSE's revenue came from military contracts, with the remainder derived from commercial projects. These included the conversion of seismic vessels, the refurbishment of luxury yachts, the design and installation of firefighting systems on supply ships, and the repair of chemical tankers and dredges. On 29 December 1994, Singapore Shipbuilding and Engineering was renamed Singapore Technologies Shipbuilding and Engineering Ltd (or ST Shipbuilding), along with announced name changes of the other three main subsidiaries under the Singapore Technologies group. ### Singapore Aerospace (later ST Aerospace) Singapore Aerospace's roots traces back to Singapore Aerospace Maintenance Company (SAMCO), formed in 1975 to take over the maintenance and support services to the [Singapore Air Defence Command](/wiki/Republic_of_Singapore_Air_Force). SAMCO was incorporated in the background of a downsized Lockheed presence as the United States pulled out from the [Vietnam War](/wiki/Vietnam_War), and to leverage on the potential in the regional aerospace industry as a commercial service provider. SAMCO officially began operations at the hangar facilities in Seletar West Camp on 1 April 1976. SAMCO, with an initial capital of $3 million in capital, build its initial capabilities with key technicians and engineers hired from Lockheed Aircraft Services. A joint venture, Singapore Aero-Engine Overhaul Limited (SAEOL), was also formed with the [Singapore Airlines](/wiki/Singapore_Airlines) in 1977 through Sheng-Li Holdings, to overhaul aircraft engines of SIA and the Republic of Singapore Air Force (RSAF). This built on the capabilities of The Singapore Airlines Engine Overhaul Base, which was launched in 1974 to provide engine maintenance services for the flag carrier's airliner fleet. In 1977, SAMAERO Co Pte Ltd was formed as a joint venture between Societe Nationale Industrielle Aerospatiale (SNIAS) of France and SAMCO. SAMAERO's job was to sell spare parts and tools for helicopters as well as support SNIAS products and the distribution of the Super Puma and Ecurueil helicopters. SAMAERO was renamed Eurocopter South East Asia (ESEA) in 2000. In 1980, Singapore Aerospace Industries (SAI), a holding company, was formed to assume the role of a holding company for aerospace-related subsidiaries of Sheng-Li Holdings.This included Singapore Aero-Components Overhaul (SACO), SAMCO, SAMAERO and Singapore Aero Engine Overhaul Limited (SAEOL). Due to its existing aviation-linked operations, Singapore Electronic & Engineering Limited was placed as a subsidiary under Singapore Aircraft Industries (SAI). In mid-1982, to rationalise the defence industries, SEEL's Aviation Division was integrated with SAMCO's aircraft component repair business into a new company, Singapore Aero-Components Overhaul (SACO) under SAI. In 1985, Singapore Airlines sold its holdings, bringing SAEOL fully owned by SAI. Singapore Aerospace Industries was listed as Singapore Aerospace in 1990. It went commercial the same year with the formation of ST Aviation Services Company (SASCO) as a local commercial aircraft maintenance subsidiary with commercial air frame manufacturing, repair and overhaul facilities in collaboration with Singapore Airlines and [Japan Airlines](/wiki/Japan_Airlines). SASCO ventured overseas to set up ST Mobile Aerospace Engineering in Alabama, USA, which carried out heavy maintenance work and converted passenger planes into freighters. In the 1990s, ST Aero derived most of its revenue from commercial aircraft contracts. A weakened US dollar and a world-wide glut in aircraft maintenance facilities hit the aerospace arm. In the first half of 1995, SASCO reported a loss of at least $17 million. In 1996, SASCO's commercial sector increased turnover by 24%, while its military sector managed a marginal growth of 2%. Singapore Aerospace attained GMP Part 1 certification in 1991. On 29 December 1994, Singapore Aerospace was renamed Singapore Technologies Aerospace Ltd (or ST Aerospace), along with announced name changes of the other three main subsidiaries under the Singapore Technologies group. The main subsidiaries would later be renamed ST Aerospace Systems (STA Systems), ST Aerospace Engineering (STA Engineering), ST Aerospace Engines (STA Engines) and ST Aerospace Supplies (STA Supplies). ### Formation of ST Engineering Group On 28 August 1997, Singapore Technologies Engineering Ltd (ST Engineering) was formed as a public-listed holding company through the merger of Singapore Technologies Aerospace Ltd, Singapore Technologies Automotive Ltd, Singapore Technologies Shipbuilding & Engineering Ltd, and Singapore Technologies Electronics & Engineering Ltd. The merger involved the exchange of existing shares of the four companies for shares in ST Engineering, under Section 210 of the 1967 Companies Act of Singapore. Former Listed EntityNo. of replacement ST Engineering shares (per 1,000 existing shares of former listed entity) ST Aerospace Ltd4,505ST Automotive Ltd5,137ST Shipbuilding & Engineering Ltd2,863ST Electronics & Engineering Ltd2,568 In tandem with the merger, the limit on foreign ownership of ST Engineering shares was lifted. Singapore Technologies Pte Ltd, representing the Singapore Technologies group of companies, would hold 65.9 per cent of the issued share capital of the newly formed ST Engineering Ltd (including a direct interest of 53.2 per cent.). ST Engineering's shares debuted on the [Stock Exchange of Singapore](/wiki/Stock_Exchange_of_Singapore) on 8 December 1997, at the time becoming the largest industrial company to be listed on the main board. The merger combined the capabilities of the constituent companies into a single group operating across multiple business areas. In October 2004, ST Engineering's assets were transferred under [Temasek Holdings](/wiki/Temasek_(company)), along with all companies under the parent holding company Singapore Technologies Pte Ltd, as part of a major restructuring exercise that saw the dissolution of Singapore Technologies Group. The move would bring about S$20 million of cost savings to Temasek Holdings, by lower the cost of debt, and provide direct visibility over the listed companies previously held by Singapore Technologies Pte Ltd as an intermediate holding company. The restructuring of STPL was declared completed on 31 December 2024, with all shareholdings in the listed and unlisted companies and other assets previously held by STPL fully transferred to Temasek Holdings. ST Engineering has since expanded its operations in aerospace, defence, and engineering, serving both commercial and military clients across multiple industries. Independent rankings in 2007 placed the company among the largest public aerospace and defence companies globally. #### Global expansion and consolidation Following its formation, ST Engineering underwent significant consolidation and global expansion. In October 1999, the group acquired Chartered Industries of Singapore (CIS) for S$78 million, subsequently merging it with ST Auto in 2000 to form ST Kinetics. To penetrate the North American market, VT Systems (current ST Engineering North America) was established in 2000, leading to the strategic 2002 acquisition of VT Halter Marine to ensure compliance with [the Jones Act](/wiki/Merchant_Marine_Act_of_1920) for US shipbuilding. Throughout the mid-2000s, the land systems sector of the group, under ST Kinetics, expanded its international footprint through acquisitions in the commercial vehicle and specialty equipment sectors across the US, China, and Canada. In 2012, ST Kinetics was reorganized into dedicated Defence and Commercial business groups to better manage its diversifying portfolio. During this period, ST Kinetics faced a significant regulatory challenge when it was one of several firms debarred by [India’s Ministry of Defence](/wiki/Ministry_of_Defence_(India)), a move the company formally contested in the [High Court of Delhi](/wiki/Delhi_High_Court). By 2013, the group continued its emerging market expansion, establishing new subsidiaries and distribution networks in Brazil, Myanmar, and Africa. ### Consolidation of ST Engineering brand In 2018, the ST Engineering Group harmonised all brands of its divisions by using \"ST Engineering\" as the Masterbrand. Through the re-branding, ST Aerospace was renamed ST Engineering Aerospace, ST Electronics as ST Engineering Electronics, ST Kinetics as ST Engineering Land Systems, and ST Marine as ST Engineering Marine. On 1 January 2021, ST Engineering was reorganised into Commercial, and Defence & Public Security clusters, replacing the previous sector-based structure of Aerospace, Electronics, Land Systems, and Marine. The Commercial cluster would focus on commercial businesses such as Commercial Aerospace, Urban Solutions and Satellite Communications, while the Defence & Public Security cluster would focus on defence businesses such as Digital Systems and Cyber, Land Systems, Marine and defence Aerospace. As a result, the Group's financial reporting was realigned to reflect these new operating segments, with the changes incorporated into its financial results for the first half of the year, ending 30 June 2021. ## Areas of business ST Engineering has a diverse portfolio of businesses and a global network of subsidiaries and associated companies across Asia, Europe, the Middle East and the U.S. ### United States ST Engineering expanded to the [United States](/wiki/United_States) in 2001, locating its U.S. headquarters in [Herndon, Virginia](/wiki/Herndon,_Virginia). It now operates in 52 cities across 21 states. It was known as Vision Technologies Systems (VTS) until 1 July 2019, when VTS was renamed to ST Engineering North America as part of the Group's brand harmonisation exercise in 2018. In 2005, the group's land systems arm (then ST Kinetics) acquired the US-based Specialized Vehicles Corporation, which included the Hackney and Kidron brands. Following a group-wide brand harmonisation in 2018 and a 2021 corporate reorganisation, these operations were integrated into the Urban Solutions cluster. Currently operating as ST Engineering Hackney, Inc. and ST Engineering Kidron, the units manufacture specialised side-loader truck bodies for the beverage and emergency rescue sectors, as well as multi-temperature refrigerated containers for cold chain and food service logistics. ### Kazakhstan On 12 December 2024, ST Engineering signed a strategic agreement with [Kazakhstan Paramount Engineering](/wiki/Kazakhstan_Paramount_Engineering) to set up in-country production capability for a new 8x8 armored vehicle. ## Operations Since 2021, ST Engineering has undergone a strategic transition from its legacy sector-based model—comprising Aerospace, Electronics, Land Systems, and Marine—to a functional cluster-oriented structure. This reorganisation was accompanied by a portfolio rationalisation strategy aimed at exiting capital-intensive, non-core commercial manufacturing to refocus capital on high-growth technology and engineering sectors. Prior to this reorganisation and portfolio rationalisation, several high-profile divestments have been carried out, including sale of Chinese-based construction units Beijing Zhonghuan Kinetics Heavy Vehicles Co. Ltd (BZK) in July 2014 at S$3.28 million, Guizhou Jonyang Kinetics Co., Ltd. (GJK) in June 2016 at [CN¥](/wiki/Renminbi)200 million. By late 2025, the group had completed several significant divestments and liquidations, including the sale of its US-based construction unit [LeeBoy](/wiki/Fayat_Group) for US$290 million and its interest in the enterprise connectivity provider SPTel, liquidation of Myammar-based Kinetics Automotive & Specialty Equipment Co., Ltd (KASE). These moves streamlined the group into three primary business clusters: Commercial Aerospace, Urban Solutions, and Defence & Public Security, all underpinned by a group-wide digital and cybersecurity core. ### Commercial Aerospace The group’s commercial aerospace operations, under the ST Engineering Aerospace entity, provide comprehensive aviation lifecycle support, ranging from [original equipment manufacturing](/wiki/Original_Equipment_Manufacturing) (OEM) and nose-to-tail maintenance to asset management and leasing. It is recognised by *[Aviation Week](/wiki/Aviation_Week_%26_Space_Technology)* as the world's largest independent third-party airframe [Maintenance, Repair, and Overhaul](/wiki/Aircraft_maintenance) (MRO) provider by annual man-hours, and one of the few with in-house engineering design and development capabilities. In its aerostructures business, the company manufactures engine nacelles and composite panels for major aircraft OEMs. Through a long-standing joint venture with Airbus, [Elbe Flugzeugwerke GmbH](/wiki/Elbe_Flugzeugwerke), ST Engineering is the sole provider of passenger-to-freighter (P2F) conversions for the [A320](/wiki/Airbus_A320_family), [A321](/wiki/Airbus_A321), and [A330](/wiki/Airbus_A330) airframes. Additionally, ST Engineering Aerospace operates an extensive engine MRO network across [Asia-Pacific](/wiki/Asia-Pacific), [Europe](/wiki/Europe) and the [United States](/wiki/United_States), specialising in support for [CFM](/wiki/CFM_International) engines such as the [CFM56](/wiki/CFM_International_CFM56) and [LEAP](/wiki/CFM_International_LEAP), while managing a global portfolio of aviation assets and leasing through its investment management arm. ### Infrastructure and mobility solutions The infrastructure and mobility solutions cluster under the term \"Smart City\" focuses on the physical and digital infrastructure of modern cities, integrating mobility solutions, environmental engineering, and urban management systems. Following the 2022 acquisition of TransCore from [Roper Technologies](/wiki/Roper_Technologies), the group became a market leader in [electronic toll collection](/wiki/Electronic_toll_collection) and [congestion pricing](/wiki/Congestion_pricing) in [North America](/wiki/North_America). Its mobility business manages urban road and rail traffic, signalling and safety systems under the AGIL brand, and remains the exclusive distributor and service provider for [MAN Truck & Bus](/wiki/MAN_Truck_%26_Bus) vehicles in Singapore. This segment has increasingly focused on fleet electrification and the integration of the AGIL DriveSafe+ [artificial intelligence](/wiki/Artificial_intelligence) (AI) platform to enhance public transport safety. Under the AGIL brand, the cluster also provides smart utilities and environmental platforms. This includes the AGIL smart city operating system implemented for Lusail City, Qatar in 2024 under a S$60m contract, which optimises city-wide lighting, water, and energy consumption. ST Engineering remains a major provider of specialized side-loader truck bodies for the beverage and emergency rescue industries, as well as multi-temperature refrigerated truck bodies in North America, under the Hackney and Kidron brands. It is also a major investor in [Skyports](/wiki/Skyports), which provide drone services for Singapore's [Public Utilities Board](/wiki/Public_Utilities_Board_(Singapore)). ### Digital systems, communications, and cybersecurity This overarching pillar serves as the group’s technological backbone, providing advanced computing and security solutions for commercial, financial, and government clients. The cybersecurity division, led by its subsidiary D'Crypt, specialises in high-assurance hardware encryption and quantum-safe cryptography, while operating managed Security Operations Centres (SOCs) for critical infrastructure protection. The group’s satellite business, featuring the iDirect and Newtec brands, provides the ground infrastructure necessary for [broadband](/wiki/Broadband) and [5G non-terrestrial](/wiki/5G) networks. This business also manages the group's [satellite imaging](/wiki/Satellite_imagery) and [geospatial](/wiki/Geographic_data_and_information) wing, utilising the [TeLEOS constellation](/wiki/TeLEOS-1) for earth observation. These digital capabilities extend into digital health and financial services technologies, where the company applies data science and AI for predictive analytics, secure [payment gateways](/wiki/Payment_gateway), and [digital identity](/wiki/Digital_identity) systems. ### Defence & Public Security ST Engineering serves as a prime contractor for multi-domain systems across air, land, sea, and Command, Control, Communications, Computers, Cyber, Intelligence, Surveillance, and Reconnaissance (C5ISR) systems. The land systems domain managed under the ST Engineering Land Systems entity provides comprehensive life-cycle support through MRO services, alongside the modernisation of legacy platforms. The group specialises in Service Life Extension Programmes (SLEP), where older assets—such as the [M113 Armoured Personnel Carrier](/wiki/M113_armored_personnel_carrier)—are upgraded with modern [powerpacks](/wiki/Powerpack_(drivetrain)) and digitised systems. The group also design and manufacture of [proprietary](/wiki/Proprietary) digitised combat platforms such as the [Terrex](/wiki/Terrex_ICV) [infantry carrier vehicle](/wiki/Infantry_carrier_vehicle) and the [Hunter](/wiki/Hunter_AFV) [armoured fighting vehicle](/wiki/Armoured_fighting_vehicle), with the latter utilising the HMX3000 [Infinitely Variable Transmissions](/wiki/Infinitely_Variable_Transmission) (IVT) produced by its [Canadian](/wiki/Canada) subsidiary, Kinetics Drive Solutions. In the air domain, the group provides integrated MRO and upgrade solutions for a wide range of military aircraft, including supersonic fighters, transport aircraft, and helicopters. As a [Lockheed Martin](/wiki/Lockheed_Martin)-authorised service centre, it is a global \"Centre of Excellence\" for the [C-130 Hercules](/wiki/Lockheed_C-130_Hercules), having redelivered over 650 units to international air forces with upgrades such as full glass cockpits and structural life extensions. The group also performs deep-level maintenance and [avionics](/wiki/Avionics) modernisation for the Republic of Singapore Air Force’s [F-16 Falcon](/wiki/General_Dynamics_F-16_Fighting_Falcon) and [F-15SG Eagle](/wiki/McDonnell_Douglas_F-15_Eagle) fleets. Through its US-based subsidiary MRAS, the company manufactures complex aerostructures and components for global military platforms including the [C-5 Galaxy](/wiki/Lockheed_C-5_Galaxy), [P-8 Poseidon](/wiki/Boeing_P-8_Poseidon), and the [V-22 Osprey](/wiki/Bell_Boeing_V-22_Osprey). In the naval domain, the company provides [turnkey](/wiki/Turnkey) design and construction services for vessels ranging from [stealth frigates](/wiki/Stealth_ship) to large-scale [landing platform docks](/wiki/Amphibious_transport_dock) (LPDs). In October 2025, the group launched the first of six [Victory-class Multi-Role Combat Vessels](/wiki/Victory-class_multi-role_combat_vessel) (MRCV) for the Republic of Singapore Navy, designed as a \"mothership\" to coordinate unmanned systems. Beyond shipbuilding, the group is a major integrated MRO provider for [naval fleets](/wiki/Naval_fleet), specialising in the refitting and mid-life upgrades (MLU) of complex [surface combatants](/wiki/Surface_combatant) and [submarines](/wiki/Submarine), such as the 2023 contract for the [Formidable-class](/wiki/Formidable-class_frigate) multi-role [stealth frigates](/wiki/Stealth_ship). The cluster's unmanned capabilities are unified through the DroNet and VELOCE platforms for aerial surveillance and logistics, as well as uncrewed surface vessels (USVs) for maritime mine countermeasures. ST Engineering maintains a public policy against the design, production, or sale of anti-personnel mines, cluster munitions, and white phosphorus munitions. ## Products ### Aircraft - [A-4SU Super Skyhawk](/wiki/ST_Aerospace_A-4SU_Super_Skyhawk) - [Eurocopter EC120 Colibri](/wiki/Eurocopter_EC120_Colibri) - includes development of tail boom, access doors, and composite materials for the [Fenestron](/wiki/Fenestron) - [AirFish 8](/wiki/AirFish_8) wing-in-ground effect craft ### Vessels - Tiger 40 Hovercraft - [Victory-class multi-role combat vessel](/wiki/Victory-class_multi-role_combat_vessel) (MRCV) - [Formidable-class](/wiki/Formidable-class_frigate) frigate - [Independence-class littoral mission vessel](/wiki/Independence-class_littoral_mission_vessel) (LMV) - [Victory-class](/wiki/Victory-class_corvette) missile corvette - [Endurance-class](/wiki/Endurance-class_landing_platform_dock) [landing platform dock](/wiki/Amphibious_transport_dock) (LPD) - Brave-class ship-to-shore connector - Vanguard-class Series - [Fearless-class](/wiki/Fearless-class_patrol_vessel) patrol vessel - Super Swift series ultra-high speed fast patrol boat (FPB) - [*Red Sailfish*](/wiki/Fireboats_in_Singapore) - heavy fire vessel (HFV) - Unmanned surface vehicles (USVs) - Swift 18 USV - Venus 9 / Venus 16 USV - Long Endurance USV - Autonomast - USV conversion package - Mercury autonomous underwater vehicle (AUV) ### Firearms #### Rifles - [M16S1](/wiki/M16_rifle) [5.56 mm](/wiki/5.56%C3%9745mm_NATO) [assault rifle](/wiki/Assault_rifle) - [Ultimax 100](/wiki/Ultimax_100) 5.56 mm [section automatic weapon](/wiki/Squad_automatic_weapon) - [SAR 21](/wiki/SAR_21) 5.56 mm assault rifle - [SAR 80](/wiki/SAR_80) 5.56 mm assault rifle - [SR 88](/wiki/SR_88) 5.56 mm assault rifle - [BR18](/wiki/BR18) bullpup multirole combat rifle - [Conventional Multirole Combat Rifle](/wiki/Conventional_Multirole_Combat_Rifle) (CMCR) - [STK Compact Personal Weapon (CPW)](/wiki/ST_Kinetics_CPW) - [7.62 mm](/wiki/7.62_mm_caliber) [general-purpose machine gun](/wiki/General-purpose_machine_gun) (GPMG) #### Machine guns - [STK 50MG](/wiki/STK_50MG) [heavy machine gun](/wiki/Heavy_machine_gun) #### Grenade launchers - [STK 40 AGL](/wiki/STK_40_AGL) automatic [grenade launcher](/wiki/Grenade_launcher) system - [STK 40 GL](/wiki/STK_40_GL) grenade launcher ### Ground combat systems - [FH 88](/wiki/FH-88) [155mm](/wiki/155_mm_caliber) 52-calibre field [howitzer](/wiki/Howitzer) - [FH-2000](/wiki/FH-2000) 155mm 52-calibre field howitzer - [SLWH Pegasus](/wiki/SLWH_Pegasus) 155mm lightweight towed howitzer - [SSPH-1 Primus](/wiki/SSPH_Primus) 155mm [self-propelled howitzer](/wiki/Self-propelled_artillery) - [Bionix](/wiki/Bionix_(family_of_armoured_fighting_vehicles)) [armoured fighting vehicle](/wiki/Armoured_fighting_vehicle) (AFV) - [Bronco](/wiki/Bronco_All_Terrain_Tracked_Carrier) all-terrain tracked carrier (ATTC) - [AV81 Terrex](/wiki/Terrex_ICV) 8×8 wheeled [infantry carrier vehicle (ICV)](/wiki/Armoured_personnel_carrier) - [Hunter](/wiki/Hunter_AFV) armoured fighting vehicle (AFV) - [Spider Light Strike Vehicle (LSV)](/wiki/Light_Strike_Vehicle_(Singapore)) - Light Armoured Multi-Role Vehicle (LAMV) - Mini All Terrain Vehicle (MATV) #### 120 mm Super Rapid Advanced Mortar System (SRAMS) The 120SRAMS is developed specifically for rapid and close range requirements of the battlefield. The semi-automatic Ammunition Transfer System and the patented Valve System in the breech mechanism provides an effective vent for the trapped air to let the bomb \"free-fall\" into the barrel. This reduces the projectile's in-bore travel and reportedly allows the 120SRAM to achieve the highest continuous firing rate of up to 18 rounds per minute—3 times faster than a conventional [mortar](/wiki/Mortar_(weapon)) system which can fire up to 6 rounds per minute. Recent product information has indicated the firing rate at a more modest 10 rounds per minute. The patented Cooling System is able to reduce the temperature that builds up in the barrel quickly to enable continuous firing without blockage. The patented Blast Diffuser reduces the blast overpressure by about 8 to 10 decibels. The 120SRAM is also currently the only system in the world with a recoil of less than 20 tonnes, which allows the 120SRAM to be mounted on board a 4×4 wheeled vehicle. The 120SRAM has a navigation and positioning system, power gun drives and integrated with an automatic fire control system, which require just a 3-person crew to operate the weapon. ### Munitions - 81 mm [Mortar](/wiki/Mortar_(weapon)) - 120 mm Mortar - 155 mm Large Calibre Munition - [SFG 87](/wiki/SFG_87) hand granade - [Pyrotechnics](/wiki/Pyrotechnics) [Homeland Security](/wiki/Homeland_Security) Solutions - Rapid Deployment Solution - Security Tamper Evident Bags (STEB) - Demul X Biological & Chemical Decontamination System (BCDS) - Integrated Mail Screening System (IMSS) - Demilitarisation services (Demil) - Analysis, Test and Evaluation (AT&E) - Advanced Logistics Proactive Solutions (ALPS) ## Controversies ### Ship-repair corruption scandal In 2014, the subsidary ST Marine was involved in one of Singapore’s largest corporate corruption cases. Following an investigation by the [Corrupt Practices Investigation Bureau](/wiki/Corrupt_Practices_Investigation_Bureau) (CPIB), it was revealed that between 2004 and 2010, approximately S$24.9 million in bribes had been paid to secure ship-repair contracts. These payments were falsely recorded in company accounts as \"entertainment expenses\" using fraudulent petty cash vouchers. The scandal resulted in the prosecution of several high-ranking former executives: - See Leong Teck (former CEO and President of ST Marine) was sentenced in 2016 to 10 months' imprisonment and a $100,000 fine. - Chang Cheow Teck (former President of ST Marine and ST Aerospace) pleaded guilty to \"failing to use reasonable diligence in performing his duties\" and was given a 14-day short detention order in 2017. - Other senior management, including former COO Han Yew Kwang and former presidents Tan Mong Seng and Mok Kim Whang, received jail terms ranging from 16 weeks to six months. - Financial officers Ong Tek Liam and Patrick Lee Swee Ching were issued fines of $300,000 and $210,000 respectively for their roles in conspiring to falsify entries in the group's accounts. In response to the scandal, ST Engineering stated that it has \"zero tolerance\" for fraud and corruption. The group has since implemented a more robust Code of Business Conduct and Ethics, established a dedicated Ethics Committee chaired by the Group CEO, and launched an anonymous whistleblowing platform to prevent future occurrences of corporate malpractice.\n",
  "language": "en",
  "processed_at": "2026-01-12T11:49:51.837598",
  "title": "ST Engineering",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/ST_Engineering"
}