{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:02:51.382489"
  },
  "content": "Medical organization**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **possibly contains original research**. Please improve it by verifying the claims made and adding inline citations. Statements consisting only of original research should be removed. *(September 2016)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"St John Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2021)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Military unit **St John Singapore** is a voluntary secular organisation in [Singapore](/wiki/Singapore) established in 1877 which provides training in [first aid](/wiki/First_aid) and home nursing. It is affiliated with the [Order of Saint John](/wiki/Order_of_Saint_John_(chartered_1888)) based in the United Kingdom. Its ambulance members (male members) and nursing members (female members) perform voluntary first aid coverage duties during national events and other events. It comprises 3 sub-organisations, namely the St John Brigade Singapore, St John Association Singapore, St John Fellowship Singapore. The National Headquarters (NHQ) is located at 420 [Beach Road](/wiki/Beach_Road,_Singapore) and was officially opened on 24 June 1960 by the Yang di-Pertuan Negara (and subsequently [President of Singapore](/wiki/President_of_Singapore)), Encik [Yusof bin Ishak](/wiki/Yusof_bin_Ishak). ## History In 1877, the **St John Ambulance Association (SJAA)** was established in Singapore to train people in first aid. The **St John Ambulance Brigade (SJAB)**, the uniformed companion body of the SJAA, was established in 1887 to gather qualified volunteers to render medical aid during public events and emergencies. In 1885, the SJAA center was established in Singapore. After a few years, the centre closed and reopened in 1906. The centre closed again after its honorary secretary died. In 1930, [Chen Su Lan](/wiki/Chen_Su_Lan) restarted a new SJAA centre and its first batch of trainees graduated in 1933. The uniformed division was subsequently established in September 1938 In 1952, the **St John Council** was created to manage both SJAB and SJAA in Singapore and in 1970, the council was registered as the **National St John Council of Singapore**. In 1980, the SJAA and SJAB came together to be known as **St John Ambulance Singapore (SJAS)**. In January 2014, the Order of St John conferred SJAS the status of Priory. SJAS was then renamed as **St John Singapore** in the same year**.** ## Organisation and Structure St John Singapore consists of 3 Sub Divisions, the St John Association and the St John Brigade and St John Fellowship. The St John Association is the training wing and was established in 1885. It provides training in First Aid, Home Nursing, Child Care, and other related subjects to the public. The St John Brigade is the uniformed branch which provides First Aid and ambulance services, and is largely known for its Cadet (CCA) and Badger programmes. The St John Fellowship is the old comrades association of St John Singapore. It was established in April 1996 to support the activities of St John Singapore and enable former members to keep in touch with St John and with each other. It also organise meetings, social events, and other activities as desired by members to advance the work of St John and the Fellowship. ## Core Competencies Students of participating schools may join St John Brigade as their Co-Curricular Activity (CCA), as cadet members. Typically, cadet members undergo training in four core competencies – First Aid, Home Nursing, Transportation of Casualty, and Foot Drill. These are conducted through Routine Training and other Training Camps that vary from Corps to Corps and District to District. In the interest of holistic development, cadet members also have the opportunity to participate in enrichment activities which can allow them to earn Cadet Proficiency Badges. Outstanding cadet members are awarded the prestigious Chief Commissioner's Badge after attaining 12 proficiency badges (with at least 2 from each of the 4 badge groups, Knowledge of the Order of St John (KOTO) Badge, and the Total Defence Badge). ## St John Day As St John the Baptist Day, 24 June, normally falls during the Singapore School Holidays, corps typically observe St. John Day on the first Wednesday after school reopens. On that day, members don their Brigade Uniform during official school hours. A St John Day message by the Chief Commissioner is read out by the Principal or student leader during the morning flag raising ceremony. Where possible, the St John Flag is also raised alongside the State Flag and the respective School Flag. On this day also, members reaffirm their loyalty to the Republic of Singapore and affirm their commitment to the twin mottoes of the Order, 'For the Faith' and 'For the Service of Humanity', in reciting the St John Pledge. ## Orders, Decorations and Medals Officers and members are entitled to receive the following Orders, Decorations and Medals: ### Local Awards 1. The Commendation Medal of St John (CMSJ) 2. The 5 Years First Aid Efficiency Medal 3. The 1984 Golden Jubilee Commemorative Medal 4. The Priory of Singapore Inauguration Commemorative Medal 5. The Priory of Singapore Grand Council Conference Commemorative Medal ### International Awards (awarded by the Order of St John) 1. The Bailiff / Dame Grand Cross of the Order of St John (GCStJ) 2. The Knights / Dame of Justice of the Order of St John (KStJ / DStJ) 3. The Knights / Dame of Grace of the Order of St John (KStJ / DStJ) 4. The Commander of the Order of St John (CStJ) 5. The Officer of the Order of St John (OStJ) 6. The Member of the Order of St John (MStJ) 7. The Life-Saving Medal of the Order of St John* 8. The Ultra Long Service/[Service Medal of the Order of St John](/wiki/Service_Medal_of_the_Order_of_St_John) *To be worn on the right chest. ## Dress Regulations ### Uniforms At present, there are a total of 4 uniforms of St. John Brigade Singapore, which are listed as follows: 1. Ceremonial Uniform 2. Mess Kit 3. Safari Uniform 4. Field Uniform Cadet members are presently only entitled to wear the Ceremonial and Field Uniform, the latter of which is also the most widely recognised uniform of the St. John Brigade Singapore. The Field Uniform consists of a black beret with a cap badge, depending on which is entitled to the wearer. Nursing members wear a hairnet as well. The top consists of a white short-sleeved shirt / blouse with plastic concealed buttons. For female members, due to the white uniform, bras should be of decent colours if worn. Shoulder flashes bearing the Maltese Cross with twin lions and unicorns, together with the words \"St. John Singapore\" are worn on both sleeves. A black epaulette is worn on both shoulders denoting the rank of the member. The bottom consists of black pants / culottes, which is worn with the St. John belt. Black socks and black low-cut boots are worn with the shoelaces tied in the formal-style. For Presidents, Senior Officers, Officers and Warrant Officers, the following 4 uniforms are worn: Common nameDescription (Ambulance)Description (Nursing)Safari UniformA bush jacket with 4 big silver buttons in front, with epaulettes and metal rank insignias for both the men and the ladies. Medal ribbons are normally worn though full medals are sometimes worn during parades and ceremonies. Peak Cap or Beret is worn.Same. Lady officers wear bowler hats or berets instead of peak caps and have the option of black culottes or slacks.Field UniformSame uniform as for Members except for collar badges/gorget patches. Beret is worn.Same. Lady officers have the option of black culottes or slacks.Ceremonial UniformA long-sleeved version of the safari jacket, with mandarin collar. Full medals and Peak Cap or Beret is worn.A long-sleeved version of the safari uniform with mandarin collar. Full medals and Bowler Hat or Beret is worn.Mess KitA wing-collared shirt with maroon cummerbund bow-tie. Tuxedo jacket with miniature medals and rank insignias is worn. No headdress is worn.A cross bow-tie. Tuxedo jacket with miniature medals and rank insignias is worn. No headdress is worn. ### Head Dress #### Beret Beret and Cap Badge for Members, Officers and Warrant Officers RankBeretCap BadgeCadet Members Beret with Cadet Cap Badge Cadet Cap BadgeAdult Members Beret with Adult Cap Badge Adult Cap BadgeOfficers, Warrant Officers Grades 2 to 4 Beret with Officer Cap Badge Officer Cap BadgeSuperintendents, Commissioners and Warrant Officers Grade 1 Beret with Senior Officer Cap Badge Senior Officer Cap Badge (embroidered) #### Peak Cap and Bowler Hat Peak Caps, Bowler's Hat and Cap Badge for Officers and Warrant Officers RankCap Embellishment (Ambulance)Cap Embellishment (Nursing)Cap BadgeOfficers and Warrant Officer Grades 2 to 4 Peak Cap Bowler's Hat Officer Cap BadgeSuperintendents and Warrant Officer Grade 1 Peak Cap with a silver bar Bowler's Hat with silver lining Senior Officer Cap Badge (embroidered)Commissioners Peak Cap with a silver bar and St John wort Bowler's Hat with silver lining Senior Officer Cap Badge (embroidered) ### Distinguishing Marks #### Collar Badges **Rank**Adult MembersWarrant Officers, Officers and Assistant Superintendents**Collar Badges** #### Gorget Patches **Rank**Brigade PresidentsSuperintendents and Deputy SuperintendentsCommissioners**Gorget Patches** ## Rank structure As a uniformed organisation that has a military heritage that originated with the Order of St. John, a rank structure used to distinguish members and appointment holders. In general, the rank one holds within the organisation corresponds with their appointment. Ranks and Insignia of [St John Ambulance](/wiki/St_John_Ambulance) (Commissioners) **Rank**CCDCCSACCACC**Insignia****Title**Chief CommissionerDeputy Chief CommissionerSenior Assistant Chief CommissionerAssistant Chief CommissionerRanks and Insignia of [St John Ambulance](/wiki/St_John_Ambulance) (Superintendents and Officers) **Rank**SUPTDSAS1OFFR2OFFR3OFFR**Insignia****Title**SuperintendentDeputy SuperintendentAssistant SuperintendentFirst OfficerSecond OfficerThird OfficerRanks and Insignia of [St John Ambulance](/wiki/St_John_Ambulance) (Warrant Officers) **Rank**WO1WO2WO3WO4**Insignia****Title**Warrant Officer Grade 1 Brigade Sergeant Major HQ Warrant OfficerWarrant Officer Grade 2 (Brigade / District) Sergeant Major (HQ / District) Warrant OfficerWarrant Officer Grade 3 District Sergeant Major District Warrant OfficerWarrant Officer Grade 4 District Warrant OfficerRanks and Insignia of [St John Ambulance](/wiki/St_John_Ambulance) (Adult and Cadet members) **Rank**SSSSSGSGTCPLLCPPTE**Insignia****Title**Senior Staff SergeantStaff SergeantSergeantCorporalLance CorporalPrivatePresidents ## Badges for Cadets ### Brigade Badges for Cadets The following badges are listed in order of precedence: 1. Chief Commissioner's Badge 2. Deputy Chief Commissioner's Badge 3. Commissioner's Badge 4. Superintendent's Badge 5. First Aid Instructor's Badge 6. Home Nursing Instructor's Badge 7. Drill Instructor Badge 8. Unicorn Badge (Cease to be issued from 2018) 9. National First Aid Competition Champion Badge 10. National Activity Badge ### Corps Appointment Badges (Phased out from 2021) - Corps Secretary - Corps Storekeeper ## National First Aid and Home Nursing Competition The National First Aid and Home Nursing Competition, typically referred to as the National First Aid Competition (NFAC), is an annual inter-district competition in which all 5 districts send teams to compete in each of the 4 categories. Prior to the NFAC, each district organises its own Inter-Corps First Aid and Home Nursing Competition with a similar competition framework. The 4 champion teams from each district represent their respective districts in the NFAC. These competitions aim to uphold the high first aid and basic nursing standards of the cadets. ### Competition Categories The 4 categories are listed below: CategoryDescriptionAmbulance Adult (AA)Males of age 15 above with Adult First Aid CertificateNursing Adult (NA)Females of age 15 or above with Adult First Aid CertificateAmbulance Cadet (AC)Males of age 13 or below with Basic First Aid CertificateNursing Cadet (NC)Females of age 13 or below with Basic First Aid Certificate ### Competition Framework There are 2 frameworks for the competition, one for the Ambulance categories and one for the Nursing categories. #### Ambulance Category Framework AA and AC teams are expected to complete the following as part of the competition: 1. First Aid Long Case (20 mins) 2. First Aid Short Case (10 mins) 3. Transportation of Casualty (10 mins) #### Nursing Category Framework NA and NC teams are expected to complete the following as part of the competition: 1. Home Nursing Case (20 mins) 2. First Aid Medium Case (15 mins) - [Ranks and insignia of St John Ambulance (England)](/wiki/Ranks_and_insignia_of_St_John_Ambulance_(England)) - [St Andrew's First Aid](/wiki/St_Andrew%27s_First_Aid) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:02:51.382203",
  "title": "St John Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/St_John_Singapore"
}