{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:49:53.506851"
  },
  "content": "Singaporean investor**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)* **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(June 2018)* *(Learn how and when to remove this message)*This article **may rely excessively on sources too closely associated with the subject**, potentially preventing the article from being verifiable and neutral. Please help improve it by replacing them with more appropriate citations to reliable, independent sources. *(June 2018)* *(Learn how and when to remove this message)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(August 2017)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Singapore Technologies Telemedia Pte. Ltd.**, commonly referred to as simply **ST Telemedia**, [doing business as](/wiki/Trade_name) **STT**, company name **199500279W**, is a Singapore-headquartered strategic investor specialising in Communications and Media, Data Centres and Infrastructure Technology businesses globally. It is represented in 15 countries, three continents across Asia Pacific, the US and Europe. It is a portfolio company of [Temasek Holdings](/wiki/Temasek_Holdings). In 2016, the company refreshed its corporate identity, adopting a new logo and streamlined business name ST Telemedia. ## Business activities STT's investment portfolio is centred on three business segments across the digital value chain – Communication & Media, Data Centres, and Infrastructure Technology. ### 2024 - In June 2024, STT GDC raised S$1.75 Billion from [KKR](/wiki/Kohlberg_Kravis_Roberts) and Singtel. - In December 2024, STT announced that it will be selling off a portion of its stake in [U Mobile](/wiki/U_Mobile), holding a minority stake of about 20% upon completion of the transaction. ### 2020 - In March 2020, STT announced the completion of its majority investment in CloudCover, a cloud-native service provider with presence in India and Southeast Asia. ### 2019 - In January 2019, STT announced that it completed the acquisition of a majority stake in Cloud Comrade, a Singapore-based cloud computing company with presence also in Malaysia and Indonesia. - ST Telemedia Cloud, a public cloud solutions provider across APAC was established. - Quantum Security, a portfolio company of STT announced its official entry into the AI and Cloud IT market. - In October 2019, STT announced that it was taking a majority stake in Seattle-based cloud service provider 2nd Watch. ### 2018 - In January 2018, STT led in a new round of funding for Bespin Global, a cloud management company which helps enterprise customers in South Korea and China with cloud adoption. ### 2017 - In November 2017, STT led in a new round of funding for Instart Logic, which created a cloud-based digital experience platform that enables brands to increase their online performance. - In April 2017, STT announced its investment in Dallas-based Armor, The First Totally Secure Cloud Company™, and became a joint lead shareholder with The Stephens Group. ### 2016 - In August 2016, STT unveiled a refreshed corporate identity to reflect its new strategic direction. - In June 2016, STT announced its lead investment in Moogsoft's Series C financing, giving the real-time IT Operation Analytics provider a boost to expand its global operations in Europe, Asia and Americas. - In May 2016, STT announced its strategic partnership with Tata Communications to expand data centre business in India and Singapore. The partnership involved a 74% majority stake acquisition of Tata Communications’ data centre business in India and Singapore by STT’s wholly owned subsidiary, ST Telemedia Global Data Centres (STT GDC). Tata Communications remains as a significant shareholder, holding the remaining 26% stake in the business. The acquisition of the data centres in India was completed in October 2016, while the acquisition of the data centres in Singapore completed in February 2017. ### 2015 - In August 2015, STT made its first investment in emerging technology verticals, leading a US$40 million financing round in Datameer, a big data analytics and visualization company based in San Francisco, California. Datameer is a big data analytics platform that helps companies create and extract value from enterprise data lakes. - In July 2015, STT announced a joint venture partnership where its portfolio companies STT GDC and [StarHub](/wiki/StarHub) agreed to build and develop MediaHub, a highly specialised telecommunications, media and data centre facility. - In June 2015, STT, through STT GDC, invested in VIRTUS Data Centres in the UK. - In March 2015, STT announced plans to build its flagship data centre, known as STT Defu, in Singapore. ### 2014 - In August 2014, STT re-entered the data centre market with its investment in GDS Services (GDS), a leading provider of advanced and high-availability data centre services in China. ### 2011 - In May 2011, STT invested in [Sky Cable](/wiki/Sky_Cable), the Philippines' largest cable company and leading broadband service provider. ### 2010 - In March 2010, STT acquired a 33% stake in [U Mobile](/wiki/U_Mobile), Malaysia's fourth mobile service provider. It also took a 10% stake in VNPT Global, a subsidiary of VNPT Group, Vietnam's foremost full service telecommunications service operator. - Official website - ST Telemedia Global Data Centres (STT GDC)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:49:53.506383",
  "title": "ST Telemedia",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/ST_Telemedia"
}