{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:02:53.071363"
  },
  "content": "Arts centre in Singapore **Stamford Arts Centre** is an arts centre on [Waterloo Street](/wiki/Waterloo_Street) in [downtown Singapore](/wiki/Central_Area,_Singapore). The building previously served as the [Japanese National School](/wiki/The_Japanese_School_Singapore), the former premises of the [Gan Eng Seng School](/wiki/Gan_Eng_Seng_School), the Stamford Girls' School and the Stamford Primary School. ## History The building opened as the [Japanese National School](/wiki/The_Japanese_School_Singapore) in 1920. In 1947, the [Gan Eng Seng School](/wiki/Gan_Eng_Seng_School) temporarily moved into the building before moving to [Anson Road](/wiki/Anson_Road) in 1951. After the Gan Eng Seng School vacated the building, the Stamford Girls' School was established at the building in 1955. The school was established in 1951 as a single session school and initially had six teachers and three classes, serving children around [Middle Road](/wiki/Middle_Road,_Singapore), Waterloo Street, [Queen Street](/wiki/Queen_Street,_Singapore) and Selegie Road. The school was named by Miss M. Hadley, then the principal of [Raffles Girls' School](/wiki/Raffles_Girls%27_School). However, plans for the Stamford Girls' School to be the sister school of the Raffles Girls' School did not materialise. After moving into the former premises of the Gan Eng Seng School, the girls's school became a two session school. The school merged with the Waterloo Primary School in 1984 to form the Stamford Primary School. The primary school moved to [Victoria Street](/wiki/Victoria_Street,_Singapore) in January 1986. In 1988, the building was restored and renovated under the [National Arts Council](/wiki/National_Arts_Council,_Singapore) Arts Housing Scheme. The first nine arts organisations to be housed in the centre were the Practice Performing Arts School, the Chuen-Lei Literature and Arts Association, the Singapore Broadway Playhouse, the Lee Howe Choral Society, the Hsinghai Art Association, the Tamils Representative Council, the Nrityalaya Aesthetics Society and the Singapore Kairalee Kala Nilayam. However, in November 1994, it was announced that the Chuen-Lei Literature and Arts Association's tenancy at the centre would not been renewed as it was \"found to be not sufficiently active and the standard of their activities also did not come to our expectations. In 2017, the building underwent a $7 million refurbishment. The newly-renovated centre was to focus on 'traditional arts' and would include a new multi-purpose hall, a shared studio, an artist-in-rsidencey space, as well as shops and a food-and-beverage outlet on the first floor. As a result of the renovations, many of the previous tenants of the centre left the building permanently, including the Bhaskar's Arts Academy, and the Practice Performing Arts School, which had since become The Theatre Practice, the latter of which moved into the Young Musicians' Society Arts Centre at [54-58 Waterloo Street](/wiki/54-58_Waterloo_Street). The newly-refurbished and restored building was reopened in October 2018 and featured an augmented reality walking trail and a Chinese opera stage tour which utilised virtual reality. 1°18′01″N 103°51′11″E﻿ / ﻿1.30025°N 103.85303°E﻿ / 1.30025; 103.85303\n",
  "language": "en",
  "processed_at": "2026-01-12T12:02:53.071039",
  "title": "Stamford Arts Centre",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Stamford_Arts_Centre"
}