{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:02:54.355250"
  },
  "content": "Hotel in Singapore, Singapore **Stamford House** is a historic building located at the corner of the junction of [Stamford Road](/wiki/Stamford_Road) and [Hill Street](/wiki/Hill_Street,_Singapore), in the [Downtown Core](/wiki/Downtown_Core) of Singapore. Originally known as **Oranje Building** (sometimes spelled *Oranjie*), it formerly housed a shopping mall. The building had since redeveloped along with adjoined [Capitol Building](/wiki/Capitol_Building,_Singapore) and both were reopened as a hotel The Capitol Kempinski Hotel Singapore in October 2018. ## History The building was designed by [Regent Alfred John Bidwell](/wiki/Regent_Alfred_John_Bidwell) (1869–1918) of [Swan & Maclaren](/wiki/Swan_%26_Maclaren) in 1904 for the Armenian firm of Stephens, Paul & Company. The bottom two floors were leased to retail firm [Whiteaway Laidlaw & Co.](/wiki/Whiteaway_Laidlaw) ### 1900-1960: The Hotel Because of a shortage of hotel rooms, [Raffles Hotel](/wiki/Raffles_Hotel) took over the top two floors of the Building in 1911 as an annexe for two years, calling this Raffles Lodge. The Oranje Building was renovated in 1920 by Arathoon Sarkies in the will to transform the building into a high-end hotel. In 1921, the Grosvenor was opened in the Oranje Building on 1 August 1921 with 50 rooms and the same menu as Raffles. An early advertisement specified “special rate for Families, Planters, and Miners and Members of the Civil Service”. The Grosvenor was closed in August 1926 and its furniture was auctioned off. The rooms were renovated and renamed Stamford Hotel and Restaurant in September 1926. It was then reinstated the name: the Grosvenor and managed by Hoseb Arathoon. In 1933-1934, Seth Paul's daughter Klara Van Hien took the hotel out of Hoseb's hands and renamed it Oranje Hotel. In December 1941, a number of survivors of the *[Prince of Wales](/wiki/HMS_Prince_of_Wales_(53))* and the *[Repulse](/wiki/HMS_Repulse_(1916))* were first housed in the Oranje Hotel. During the Japanese Occupation, the building continued to be used by the [Japanese forces](/wiki/Japanese_Imperial_Army) as a hotel. After [World War II](/wiki/World_War_II), the hotel rooms were [rented](/wiki/Renting) out and ground floor of the building used as shops. ### 1960-1980: The Stamford House In 1963, the building changed hands and was sold to Basco Enterprises Private Limited. It refurbished the building and renamed the building as Stamford House. Together with the adjacent [Shaws Building](/wiki/Shaws_Building), which housed the [Capitol Theatre](/wiki/Capitol_Theatre,_Singapore), the Stamford House was once a main shopping centre in Singapore. The upper two layer of the building was a modern and comfortable air-conditioned office-block, occupied by internationally known organisations. Basco Enterprises’ Bobby-O Department Store, which mainly sold electronic equipment and jewellery, was opened in the building likely in the 1970s and remained there until the 1980s. ### 1980-2000: Conservation In 1984, the Stamford House, together with the Shaws Building, was acquired by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), which imposed planning restrictions to preserve the building. In May 1991, a decision was made to forgo preserving the similarly rustic four-storey Eu Court and conserve Stamford House instead as the latter had more potential for commercial purposes. Later the same year, Stamford House underwent extensive conservation and restoration works. Despite protests by the public, Eu Court was demolished in 1992 for road widening with the aim of easing future [traffic congestion](/wiki/Traffic_congestion) on Hill Street. Today, a new building, Stamford Court, is sited on a portion of the site of the former Eu Court building. The S$13 million [conservation](/wiki/Architectural_conservation) project for Stamford House was undertaken by the main [contractor](/wiki/General_contractor) Batae Engineering, and took three years. The Stamford House was re-opened as a furniture and [furnishings](/wiki/Furnishing) centre on 28 March 1995. The shopping mall has a rentable space of 3,350 square metres (36,000 square feet) over three floors, and was managed by Pidemco Land (now [CapitaLand](/wiki/CapitaLand)). ### 2000-Presence: Redevelopment In 2008, Stamford House, along with its stretch of adjoining buildings including [Capitol Building](/wiki/Capitol_Building,_Singapore), [Capitol Theatre](/wiki/Capitol_Theatre,_Singapore) and [Capitol Centre](/wiki/Capitol_Centre,_Singapore), were offered to potential developers as a single integrated site for commercial redevelopment. In 2010, a consortium formed by Pua Seck Guan’s Perennial Real Estate and Chesham Properties won a bid to restore Stamford House, Capitol Theatre and Capitol Building into a hotel, shops, residences, and a theatre. Grant Associates worked closely with the project's lead architect, Richard Meir and Partners Architects, the project consist of Singapore's largest cinema cum theatre complex, a 6 stars luxury hotel and a shopping mall, with a total size of 21,000 m. In November 2011, Shimizu Corporation was awarded the redevelopment project to develop into a large scale mixed use complex called \"Capitol Development\". There was a shopping component named [Capitol Piazza](/wiki/Capitol_Piazza) and also a residential component, named Eden Residences Capitol, which were on the site or the demolished Capitol Centre. The redevelopment of the complex was completed and its topping out ceremony held in 3 April 2014. In 2015, Stamford House and its adjoined Capitol Building were refurbished and scheduled to be reopened as a six-star hotel The Patina, Capitol Singapore by the end of 2015, however was delayed due to dispute among its owners. By 2016, the project stalled when disagreement arose within the consortium, and the hotel spread across Capitol Building and Stamford House failed to open although a Temporary Occupation Permit was given in October 2017. The deadlock was broken by a settlement made in the High Court in January 2018 and, in March, Perennial bought out Chesham Properties for about $528 million. Later in May 2018, the Perennial Real Estate Holdings appointed [Kempinski Hotels S.A.](/wiki/Kempinski_Hotels_S.A.) to took over as its operator. The Stamford House and Capitol Building were officially opened as The Capitol Kempinski Hotel Singapore on 1 October 2018. ## Architecture The Stamford House was designed by R. A. J. Bidwell, who was also the architect for Raffles Hotel, [Goodwood Park Hotel](/wiki/Goodwood_Park_Hotel) and other significant buildings in Singapore. The building is [architecturally](/wiki/Architectural) well-related to its environs, including the adjacent Capitol Theatre and the MPH Building on Stamford Road. The Stamford House is a variation of the [Venetian](/wiki/Venice) [Renaissance](/wiki/Renaissance_architecture) [architectural style](/wiki/Architectural_style) that was popular in commercial buildings in the [Victorian](/wiki/Victorian_era) period. It has an appealing, [romantic](/wiki/Romanticism) architectural composition with its curved central [pediment](/wiki/Pediment) and two triangular ones at either end. With its [Adamesque](/wiki/Adamesque)-like [mouldings](/wiki/Molding_(decorative)) and elaborate ornamental devices, the three-storey Stamford House is typical of the [High Victorian](/wiki/Victorian_architecture) phase. The building has an [arcade](/wiki/Arcade_(architecture)) which allows [natural light](/wiki/Daylighting_(architecture)) to enter. It mainly housed offices, with shops on the ground floor opening on to a [five-foot way](/wiki/Five-foot_way). A hallmark of many older buildings in the colonial district, the covered walkway around the Stamford provides shade and encourages pedestrian traffic by shoppers and tourists. ### Restoration The Stamford House's characteristic gold tinted detailing was only revealed during [restoration](/wiki/Building_restoration) work between 1991 and 1994. A [frieze](/wiki/Frieze) of intricate floral [plaster](/wiki/Plaster) on the façade was found beneath another layer of plain plaster, for which no historical records were found. Solid [granite](/wiki/Granite) columns were uncovered from under layers of plaster at the main entrance. The solid pillars were carved from a single huge slab of granite. Exquisitely wrought [cast-iron](/wiki/Cast_iron) [grilles](/wiki/Grille_(architecture)), in the same intricate floral design as the frieze, were revealed after years of being covered by bland shop signs. The missing pieces were restored by a Malaysian [craftsman](/wiki/Master_craftsman). Though the walls of Stamford House were in a good condition, 50% of the [plasterwork](/wiki/Plasterwork) and [cornices](/wiki/Cornice) were damaged. Most of the wooden floor boards in the building were rotten and had to be replaced with *chengai* (*Balanscarpus heimii*), a tropical [hardwood](/wiki/Hardwood). New doors in the original style had to be made. All originals were photographed meticulously before work began. Modern [services](/wiki/Penetrant_(mechanical,_electrical,_or_structural)) had to be added sensitively, so that [wiring](/wiki/Wiring) and the [air conditioning](/wiki/Air_conditioning) vents do not jar with the original architecture. New additions were introduced to maintain the old-world ambience of the building. These include [brass](/wiki/Brass) lamps from Italy, ground flooring done in the original [marble](/wiki/Marble), a [hydraulic](/wiki/Hydraulic) [lift](/wiki/Elevator) with brass doors and *chengai* timber covering for the new concrete floors. Decorative features were also added internally to reflect the rich facade: naked steel [I-beams](/wiki/I-beam) were clad in plaster, and the old outhouse, a wing which contained only toilets, was turned into an attached wing for shops and services. A modern [skylight](/wiki/Skylight_(window)) allows sunlight to illuminate the building's interior. The corner store was turned into an external [foyer](/wiki/Foyer) where people can walk in from both sides of the road. As there were no records of the building's interior [decor](/wiki/Decor), the contractors had to uncover clues and make decisions on colour, pattern and size, sometimes based on [straw polls](/wiki/Straw_poll) taken from passers-by. The main contractor Batae Engineering employed the preferred top-down approach, from the roof down to the floor, for Stamford House's restoration. ## Controversy In 1991, there is a debate over whether to demolish EU Court or Stamford House for a road widening project. EU Court is an endangered art deco styled building across Hill Street from Stamford House which was built in the late 1920s as an apartment block. However during the period of time, there is a fundamental issue of traffic congestion in that area which leads to the consideration of road widening. This sparks controversy as experts think that policy-makers should focus on stopping the car growth problem instead of simply expanding the road. However in the end, EU Court was still being demolished in 1992 to make way for the widening of Victoria and Hill Streets, being replaced by Stamford Court, a building that seems rather out of sync with the architecture of the area. The result was the irreversible loss of a heritage building in order for Hill street to be widened by one lane, which did not solve the traffic congestion issue. Therefore, decision was made to forgo preserving EU Court and conserve Stamford House instead. This is mainly because Stamford House was claimed to have “greater potential to become an active and successful commercial centre”. ## Notes - Wright, Nadia (2003). *Respected Citizens: The History of Armenians in Singapore and Malaysia*. Middle Park: Amassia Publishing. [ISBN](/wiki/ISBN_(identifier)) 0-9751082-0-4. - Bonny Tan (2 November 1999). \"Stamford House\". Singapore Infopedia, [National Library Board](/wiki/National_Library_Board). Archived from the original on 8 September 2007. Retrieved 16 September 2007. - Vernon Cornelius (2005). \"Stamford Road\". Singapore Infopedia, [National Library Board](/wiki/National_Library_Board). Archived from the original on 15 October 2007. Retrieved 16 September 2007. - Dhoraisingam S Samuel (1991). *Singapore's Heritage Through Places of Historical Interest*. Singapore: Elixir Consultancy Service. [ISBN](/wiki/ISBN_(identifier)) 981-00-3185-8. - Jane Beamish, Jane Ferguson (1989). *A History of Singapore Architecture: The Making of a City*. Singapore: Graham Brash. [ISBN](/wiki/ISBN_(identifier)) 9971-947-97-8. - Uniquely Singapore: Shopping in North Bridge Road\n",
  "language": "en",
  "processed_at": "2026-01-12T12:02:54.354981",
  "title": "Stamford House, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Stamford_House,_Singapore"
}