{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:02:56.514512"
  },
  "content": "British colonial official (1781–1826)This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Stamford Raffles\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2023)* *(Learn how and when to remove this message)* **Sir Thomas Stamford Bingley Raffles** [FRS](/wiki/Fellow_of_the_Royal_Society) [FRAS](/wiki/Fellow_of_the_Royal_Asiatic_Society) (5 July 1781 – 5 July 1826) was a British [colonial official](/wiki/Colonial_Office) who served as the [governor of the Dutch East Indies](/wiki/List_of_governors_of_the_Dutch_East_Indies) between 1811 and 1816 and [lieutenant-governor of Bencoolen](/wiki/Lieutenant-governor_of_Bencoolen) between 1818 and 1824. Raffles was involved in [the capture](/wiki/Invasion_of_Java_(1811)) of the [Indonesian](/wiki/Dutch_East_Indies) island of [Java](/wiki/Java) from the [Dutch](/wiki/French_and_British_interregnum_in_the_Dutch_East_Indies#French_interregnum_1806–1811) during the [Napoleonic Wars](/wiki/Napoleonic_Wars). It was returned under the [Anglo–Dutch Treaty of 1824](/wiki/Anglo%E2%80%93Dutch_Treaty_of_1824). He also wrote *[The History of Java](/wiki/The_History_of_Java_(1817_book))* in 1817, describing the history of the island from ancient times. The *[Rafflesia](/wiki/Rafflesia)* flowers were named after him. Raffles also played a role in further establishing the [British Empire](/wiki/British_Empire)'s reach in [East](/wiki/East_Asia) and [Southeast Asia](/wiki/Southeast_Asia). He secured control over the strategically located [Singapore](/wiki/Singapore) from local rulers in 1819 to secure British access along the [Strait of Singapore](/wiki/Strait_of_Singapore) and the nearby seas in the region, particularly the [Indian Ocean](/wiki/Indian_Ocean) and the [South China Sea](/wiki/South_China_Sea). His actions were initially not endorsed by the British government and led to tensions between the British and the [Dutch](/wiki/Dutch_Empire). The [Anglo–Dutch Treaty of 1824](/wiki/Anglo%E2%80%93Dutch_Treaty_of_1824) established their respective spheres of influence, the Dutch relinquishing their claims to Singapore while the British ceded [Bencoolen](/wiki/British_Bencoolen) to them. A [transshipment port](/wiki/Entrep%C3%B4t) was subsequently established in Singapore for [maritime trade](/wiki/Maritime_trade) between Europe and Asia. While Raffles was largely credited for the founding of contemporary Singapore, the early running of day-to-day operations was mostly done by [William Farquhar](/wiki/William_Farquhar), who served as the first [Resident of Singapore](/wiki/Resident_of_Singapore) from 1819 to 1823. Raffles soon returned to England in 1824, where he died on his birthday in 1826 at the age of 45. His legacy while complex remains significant in Singapore, most notably the [Raffles's Landing Site](/wiki/Raffles%27s_Landing_Site), as well as his name being a common sight in numerous entities and institutions throughout the country. ## Early life Thomas Stamford Bingley Raffles was born on (1781-07-05)5 July 1781 on board the ship *Ann*, off the coast of [Port Morant](/wiki/Port_Morant), Jamaica, to Captain Benjamin Raffles (1739, London – 23 November 1811, [Deptford](/wiki/Deptford)) and Anne Raffles (née Lyde) (1755 – 8 February 1824, London). Benjamin served as a [ship master](/wiki/Sea_captain) for various ships engaged in the direct trade between England and the [West Indies](/wiki/West_Indies). Although some biographers have suggested that Benjamin was involved in the [slave trade](/wiki/Atlantic_slave_trade), modern historians have refuted such claims. When Benjamin ended his involvement in the West India trade in 1800, it caused his family considerable hardship. The little money the family had went into sending the young Raffles to the Mansion House Academy, [Hammersmith](/wiki/Hammersmith), a moderately priced boarding school, offering Latin, Greek, French, arithmetic, bookkeeping and geography, that specialised in preparing boys for clerkships or the army. In 1795, at the age of 14, Raffles started working in [London](/wiki/London) as a clerk for the [East India Company](/wiki/East_India_Company). Nine years later, in 1804, the 23-year-old Raffles married [Olivia Mariamne Devenish](/wiki/Olivia_Mariamne_Devenish), a widow 10 years his senior,: 57, 73, 107 who was formerly married to Jacob Cassivelaun Fancourt, an assistant surgeon in Madras, who had died in 1800.: 59, 69 In 1805, he was sent to [Prince of Wales Island](/wiki/Penang_Island), [Malaya](/wiki/British_Malaya), starting his long association with Southeast Asia. He started as assistant secretary, under the Honourable [Philip Dundas](/wiki/Philip_Dundas), the new governor of Penang. At this time, he also made the acquaintance of [Thomas Otho Travers](/wiki/Thomas_Otho_Travers), who would accompany him for the next 20 years. ## Java Island ### British invasion of Java This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(March 2021)* *(Learn how and when to remove this message)* His knowledge of the [Malay language](/wiki/Malay_language), as well as his wit and ability, gained him favour with [Lord Minto](/wiki/Gilbert_Elliot-Murray-Kynynmound,_1st_Earl_of_Minto), the [governor-general of India](/wiki/Governor-general_of_India), and he was sent to [Malacca](/wiki/Malacca). In 1811, after the annexation of the [Kingdom of Holland](/wiki/Kingdom_of_Holland) by France during Napoleon's war, Raffles had no choice but to leave the country. He mounted [a military expedition](/wiki/Invasion_of_Java_(1811)) against the Dutch and French in [Java](/wiki/Java), in the [Dutch East Indies](/wiki/Dutch_East_Indies). The war was swiftly conducted by Admiral [Robert Stopford](/wiki/Robert_Stopford_(Royal_Navy_officer)), General [Frederick Augustus Wetherall](/wiki/Frederick_Augustus_Wetherall), and Colonel [Robert Rollo Gillespie](/wiki/Robert_Rollo_Gillespie), who led a well-organised army against an opposing army of mostly French [conscripts](/wiki/Conscript) with little proper leadership. The previous Dutch governor, [Herman Willem Daendels](/wiki/Herman_Willem_Daendels), had built a well-defended fortification at [Meester Cornelis](/wiki/Meester_Cornelis), now [Jatinegara](/wiki/Jatinegara). His successor, Governor [Jan Willem Janssens](/wiki/Jan_Willem_Janssens), who coincidentally had surrendered to the British five years earlier at the [Cape Colony](/wiki/Cape_Colony), mounted a brave but ultimately futile defence at the fortress. The British, led by Colonel Gillespie, stormed the fort and captured it within three hours. Governor Janssens attempted to escape inland but was captured. The British invasion of Java took a total of 45 days, during which Raffles was appointed the [lieutenant-governor of the Dutch East Indies](/wiki/Lieutenant-governor_of_the_Dutch_East_Indies) by Lord Minto before hostilities formally ceased. He took his residence at [Buitenzorg](/wiki/Buitenzorg), and despite having a small group of Britons as his senior staff, kept many of the Dutch civil servants in the governmental structure. ### Rule During the relatively brief period of British rule in Java, Raffles negotiated several peace treaties along with ordering several military expeditions against local rulers. Rumours of plans by the [Yogyakarta Sultanate](/wiki/Yogyakarta_Sultanate) to launch an attack against the British led to uneasiness among Britons in Java. On 20 June 1812, Raffles led a 1,200-strong British force to capture the [Royal Palace of Yogyakarta](/wiki/Kraton_Ngayogyakarta_Hadiningrat). Yogyakarta forces, surprised by the attack, were easily defeated; the palace fell in one day, and was [subsequently sacked and burnt](/wiki/Sack_of_Yogyakarta). Raffles ordered much of the palace's archives to be removed, taking them back with him. The attack was unprecedented in Javanese history, as it was the first time an indigenous palace had been captured by a European army, humiliating the Yogyakarta Sultanate. Although peace returned to [Central Java](/wiki/Central_Java) in the immediate aftermath of the attack, it may have fuelled the deep-seated instability and hostility to European involvement in the region that ultimately gave rise to the [Java War](/wiki/Java_War) during the 1820s. Raffles also ordered an expedition to [Palembang](/wiki/Palembang), [Sumatra](/wiki/Sumatra) to depose local sultan [Mahmud Badaruddin II](/wiki/Mahmud_Badaruddin_II). The expedition was also ordered to occupy the nearby [Bangka Island](/wiki/Bangka_Island) in order to establish a permanent British presence in the area, in case Java returned to Dutch rule after the end of the [War of the Sixth Coalition](/wiki/War_of_the_Sixth_Coalition) in Europe.[*citation needed*] During his lieutenant-governorship, Raffles placed some restrictions on the local [slave trade](/wiki/History_of_slavery) in line with wider British policy across its Asian territories, although slavery remained widespread and Raffles himself was served by a large retinue of slaves at his official residences in Java. Raffles also attempted a replacement of the Dutch system of forced agricultural deliveries-in-kind with a cash-based [land tenure](/wiki/Land_tenure) system of land management, probably influenced by the earlier anti-feudal critiques of [Dirk van Hogendorp](/wiki/Dirk_van_Hogendorp_(1761%E2%80%931822)). He was advised by a holdover from the previous Dutch regime on Java, the president of the High Court of Java, [Herman Warner Muntinghe](/wiki/Herman_Warner_Muntinghe), especially in the matter of the reform of the public finances of the colony, and its system of taxation. Under Raffles's aegis, a large number of ancient monuments in Java were systematically catalogued for the first time. The first detailed English-language account of [Prambanan](/wiki/Prambanan) was prepared by [Colin Mackenzie](/wiki/Colin_Mackenzie), while the [Buddhist temple](/wiki/Buddhist_temple) of [Borobudur](/wiki/Borobudur) was surveyed and cleared of vegetation by H. C. Cornelius. When his wife, Olivia, died on 26 November 1814, Raffles was devastated. In 1815, he left again for England shortly before the island of Java was returned to control of the Netherlands following the [Napoleonic Wars](/wiki/Napoleonic_Wars), under the terms of the [Anglo-Dutch Treaty of 1814](/wiki/Anglo-Dutch_Treaty_of_1814). Raffles had been removed from his post by the [East India Company](/wiki/East_India_Company) ahead of the handover, and officially replaced by [John Fendall Jr.](/wiki/John_Fendall_Jr.) on account of the poor financial performance of the colony during his administration, and allegations of financial impropriety on his own part. He sailed to England in early 1816 to clear his name and, *en route*, visited [Napoleon](/wiki/Napoleon), who was in exile at [St. Helena](/wiki/St._Helena), but found him unpleasant and unimpressive. ## Interlude in England In 1817, Raffles wrote and published *[The History of Java](/wiki/The_History_of_Java)*, describing the history of the island from ancient times as well as its geography, flora, and fauna. In 1817, Raffles was created a [Knight Bachelor](/wiki/Knight_Bachelor) by the Prince Regent [George IV](/wiki/George_IV), whose daughter, [Princess Charlotte](/wiki/Princess_Charlotte_of_Wales_(1796%E2%80%931817)), was particularly close to him. At the publication of the book, he also stopped using the name 'Thomas', preferring to use his middle name, 'Stamford', possibly to avoid confusion amongst his associates with Sir Thomas Sevestre, or his cousin, [Thomas Raffles](/wiki/Thomas_Raffles), who both bore the same first name. On 22 February, he married his second wife, [Sophia Hull](/wiki/Sophia_Hull), and later set sail to [Bencoolen](/wiki/British_Bencoolen) (present-day [Bengkulu](/wiki/Bengkulu_(city)) in Indonesia) to take up his new post with his new wife. ## Bencoolen and Malaya This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(January 2023)* *(Learn how and when to remove this message)* Raffles arrived in Bencoolen on Sumatra on 19 March 1818, where he was appointed as the [lieutenant-governor of Bencoolen](/wiki/Lieutenant-governor_of_Bencoolen) on 22 March 1818. Despite the prestige connected with the title of Lieutenant-Governor, [Bencoolen](/wiki/British_Bencoolen) was a colonial backwater, whose only real export was [pepper](/wiki/Black_pepper), and only the murder of a previous [Resident](/wiki/Resident_(title)), Thomas Parr, gained it any attention back home in Britain. Raffles found the place wrecked, and set about reforms immediately, mostly similar to what he had done on [Java](/wiki/Java); abolishing slavery and limiting [cockfighting](/wiki/Cockfighting) and such games. To replace the slaves, he used a contingent of [convicts](/wiki/Convict), already sent to him from India. It was at this point that he realised the importance of a British presence that both challenged the Dutch [hegemony](/wiki/Hegemony) in the area, and could remain consistently profitable, unlike Bencoolen or [Batavia](/wiki/Batavia,_Dutch_East_Indies). However, the strategic importance of poorly maintained but well-positioned [British possessions](/wiki/British_possessions), such as [Penang](/wiki/Penang) or Bencoolen, made it impossible for the British to abandon the unprofitable colonies in such proximity to the Dutch in Java. The competition in the area, between Raffles and the aggressive Dutch [commissioner-general](/wiki/Commissioners-General_of_the_Dutch_East_Indies), [Cornelis Theodorus Elout](/wiki/Cornelis_Theodorus_Elout), and later Raffles' former advisor on Java, [Muntinghe](/wiki/Herman_Warner_Muntinghe), now a member of the new High Government of the Dutch East Indies, who Elout had put in power,[a] certainly led at least in part to the later [Anglo-Dutch Treaty of 1824](/wiki/Anglo-Dutch_Treaty_of_1824). Raffles looked into alternatives in the area; namely [Bangka](/wiki/Bangka_Island), which had been ceded to the Dutch after its conquest by the British during its occupation of Java. [Bintan](/wiki/Bintan) was also under consideration. Despite the fact that [Francis Light](/wiki/Francis_Light) overlooked the island before settling upon Penang in 1786, the [Riau Archipelago](/wiki/Riau_Archipelago) was an attractive choice just to the south of the [Malay Peninsula](/wiki/Malay_Peninsula), for its proximity to [Malacca](/wiki/Malacca). In his correspondences with [Calcutta](/wiki/Calcutta), Raffles also emphasised the need to establish a certain amount of influence with the native chiefs, which had greatly waned since the return of the Dutch. Raffles sent [Thomas Travers](/wiki/Thomas_Otho_Travers) as an ambassador to the Dutch, to possibly negotiate an expansion of British economic interests. When this failed, and when Raffles's own expeditions into his new dominion found only treacherous terrain and few exportable goods, his desire to establish a better British presence was cemented. However, the Anglo-Dutch Convention of 1814 was not completely clear, especially on the issue of certain possessions such as [Padang](/wiki/Padang). The Convention of 1814 only returned Dutch territory that was held before 1803, which did not include Padang. Raffles asserted the British claim personally, leading a small expedition to the [Kingdom of Pagaruyung](/wiki/Pagaruyung_Kingdom). Yet, as Raffles confirmed with the sultan regarding the absolute British influence of the area, he realised that the local rulers had only limited power over the well-cultivated and civilised country, and the treaty was largely symbolic, and had little actual force. ## Founding of modern Singapore Major-General [William Farquhar](/wiki/William_Farquhar), the [British Resident](/wiki/Resident_(title)) of Malacca, had been attempting to negotiate [commercial treaties](/wiki/Commercial_treaty) with the local chiefs of the [Riau Archipelago](/wiki/Riau_Archipelago), especially before Raffles' arrival. Farquhar was compelled to sign the treaty not with the official head of the sultanate, but rather, the [Raja Muda (Regent or Crown Prince) of Riau](/wiki/Riau-Lingga_Sultanate). He noted it as a success, and reported it as such to Raffles. Raffles sailed to [Malacca](/wiki/Malacca) in late 1818, to personally secure a British presence in the Riau area, especially *Singapura*, which was favoured by him both through the readings of [Malayan](/wiki/Malay_language) histories, and by Farquhar's explorations. Despite [Lord Hastings](/wiki/Francis_Rawdon-Hastings,_1st_Marquess_of_Hastings)' less-than-stellar opinion of Raffles before (which had necessitated his trip to England to clear his name at the end of his tenure as Lieutenant-Governor of Java), the now well-connected and successful Raffles was able to secure permission to set up a settlement. At this point in [Singaporean history](/wiki/History_of_Singapore), the name *Lion City* was applied. The city was in a strategically advantageous position; however, he was ordered not to provoke the Dutch, and his subsequent actions were officially disavowed by the British government. In London, [Lord Castlereagh](/wiki/Viscount_Castlereagh) attempted to quell Dutch fears, and continuing efforts were made to reach an agreement between the nations that eventually became the [Anglo-Dutch Treaty](/wiki/Anglo-Dutch_Treaty_of_1824) of London of 1824. As well as the treaty, instructions were sent out to Raffles to undertake far less intrusive actions; however, the long distance between the Far East and Europe meant that the orders had no chance of reaching Raffles in time. ### Establishment After a brief survey of the [Karimun Islands](/wiki/Karimun_Islands), on 29 January 1819, he established a post at the southern tip of the [Malay Peninsula](/wiki/Malay_Peninsula). It was established that there was no Dutch presence on the island of Singapore. [Johor](/wiki/Johor) also no longer had any control of the area, so contact was made with the [Temenggong Abdul Rahman](/wiki/Temenggong_Abdul_Rahman). The contacts were friendly, and Raffles, knowledgeable about the muddled political situation, took advantage to provide a rudimentary treaty between the nominal chiefs of the area that called for the exclusivity of trade, and the British protection of the area. Members of Raffles's party [surveyed](/wiki/Surveying) the island, and proceeded to request the presence of the sultan, or whoever at the time had supreme nominal power, to sign a formal treaty, while Major Farquhar was ordered to do the same in Rhio (Riau). The writings of Raffles and Farquhar indicate that the British found Temenggong Abdul Rahman with 400 to 500 residents in Singapore in January 1819. Another member of the 1819 expedition party, Captain John Crawford, recalled in his diary an encounter with \"upwards of 100\" of Chinese. British colonial documentations revealed that Temenggong Abdul Rahman had provided these Chinese who were [Teochews](/wiki/Teochew_people) the cost and expenses of opening [gambier](/wiki/Uncaria_gambir) plantations at Mount Stamford (now Pearl’s Hill) prior to British arrival. He had also \"in some instances\" advanced money to the Teochew cultivators on the understanding he would be repaid in the form of gambier or other produce. Farquhar had the impressions that the Temenggong’s interests in these plantations were represented by a brother-in-law of his named Baba Ketchil and the first Captain China of Singapore, a Teochew merchant named Tan Heng Kim ((陈亨钦), was \"one of the principal persons concerned\". A few days later, the formal treaty was signed by [Hussein Shah](/wiki/Hussein_Shah_of_Johor) who claimed to be the \"lawful sovereign of the whole of territories extending from [Lingga](/wiki/Lingga_Islands) and [Johor](/wiki/Johor) to Mount Muar\". Although Hussein Shah had had no previous contact with the British, he had certainly heard of the strength of the [Royal Navy](/wiki/Royal_Navy), and was in no position to argue against the terms. Raffles reassured him that the Dutch posed no threat in the area. Hussein Shah had been the crown Prince of Johor, but while he was away in [Pahang](/wiki/Pahang) to get married, his father died, and his younger brother was made sultan, supported by some of the court officials and the Dutch. To circumvent the situation of having to negotiate with a sultan influenced by the Dutch, Raffles decided to recognise, on behalf of the British Crown, Hussein Shah as being the rightful ruler of Johor. Farquhar's attempt to establish a more favourable treaty in Rhio (Riau) was met with greater challenge, as the Dutch were present, and made for a rather awkward position. The Dutch were alarmed, and sent a small contingent to the island. Despite a covert offer of subterfuge against the Dutch offered by the Raja of Rhio (Riau), Farquhar returned, and an official protest was sent by the Raja to Java regarding the matter. Raffles declared the foundation of what was to become modern Singapore on 6 February, securing the transfer of control of the island to the [East India Company](/wiki/East_India_Company). With much pomp and ceremony, the official treaty was read aloud in languages representing all nations present, as well as the Malay and Chinese inhabitants. Sultan Hussein Shah was paid 5,000 [Spanish dollars](/wiki/Spanish_dollar) a year, while Temenggong Abdul Rahman received 3,000 a year, both massive sums at the time, roughly equivalent to [£](/wiki/British_pound)287,000 and £172,000 now. Farquhar was officially named the [Resident of Singapore](/wiki/Resident_of_Singapore), and Raffles was named as 'Agent to the Most Noble the Governor-General with the States of Rhio (Riau), Lingin (Lingga) and Johor'. Although ownership of the post was to be exclusively British, explicit orders were given to Farquhar to maintain free passage of ships through the [Strait of Singapore](/wiki/Strait_of_Singapore), and a small military presence was established alongside the trading post. After issuing orders to Farquhar and the remaining Europeans, Raffles left the next day, 7 February 1819. ### Achin, and the early conflict with the Dutch Raffles also planned to start a British presence in [Achin](/wiki/Acheh), on the northern tip of [Sumatra](/wiki/Sumatra). As soon as he had departed, the Raja of Rhio (Riau) sent letters to the Dutch, disclaiming the deal, protesting innocence, and blaming British encroachment. Meanwhile, in [Malacca](/wiki/Malacca), the Dutch acted at once, commanding that no Malays could go to Singapore. Raffles's bold claim of Singapore created a curious geographic situation: although [Penang](/wiki/Penang) was clearly closer in distance to Singapore, Raffles, in his capacity as Lieutenant-Governor of Bencoolen, was nominally still in control. This undoubtedly irked the authorities in Penang, to the point where they refused to send any [sepoys](/wiki/Sepoy) to Singapore to complete the garrison. Official Dutch complaints came before the end of the month, and Raffles attempted to appease the situation by instructing Farquhar to not interfere with the politics of surrounding islands. Despite numerous threats and serious considerations by the Dutch governor-general [Van der Capellen](/wiki/Godert_van_der_Capellen) in Java, they did not take any military action. The confused political situation in Johore and Rhio also created a certain uneasiness and instability for the two nations. [Tengku Long](/wiki/Tengku_Long) was claimed to be a [pretender](/wiki/Pretender) to the throne, and, since the [succession](/wiki/Order_of_succession) laws in the Malay sultanates were not clear cut, treaties signed between native rulers and the European powers always seemed to be on the verge of invalidation; especially if a sultan should be deposed by one of his siblings or other pretenders. Nonetheless, amidst uncertainty and intrigue, Raffles landed in Achin on 14 March 1819, with the begrudging help of Penang. Once again, it seems that multiple people were in power, but none wanted to formally deal with the British. The hostile atmosphere created allowed Raffles to cancel the only meeting he was able to arrange, with Panglima Polim, a powerful divisional chief, fearing treachery. As the influential merchant John Palmer, Raffles, and fellow commissioner John Monckton Coombs of Penang sat offshore, awaiting a response, [Calcutta](/wiki/Calcutta) debated whether to reinforce the port city. Evacuation plans were made, but the Dutch never acted, and ultimately Lord Hastings prompted Colonel Bannerman, the [governor of Penang](/wiki/Governor_of_Penang), to send funds to bolster Singapore. Finally Raffles was capable of convincing his fellow commissioners to sign a treaty with Jauhar al-Alam Shah, the ruler of Achin, which installed a [British Resident](/wiki/Resident_minister), as well as guaranteeing the exclusivity of bilateral trade. By the time Raffles had returned to Singapore, on 31 May, much of the immediate crisis that the colony had caused in Penang and Calcutta had passed. By then, the initial five-hundred villagers had grown to become five-thousand merchants, soldiers, and administrators, packed onto the island. Raffles was determined to destroy the Dutch mercantile monopoly in the area, to replace it with a gateway for trade with China and Japan. The latter he had attempted but failed to reach an agreement with while governing Java. ### First year of Singapore While in Singapore, Raffles established schools and churches in the local languages. He allowed [missionaries](/wiki/Missionaries) and local businesses to flourish. Certain colonial aspects remained: a European town was quickly built to [segregate](/wiki/Ethnic_segregation) the population, separated by a river; carriage roads were built, and [cantonments](/wiki/Cantonment) constructed for the soldiers. Otherwise, no other duties were imposed. Confident that Farquhar would follow his instructions well, Raffles sailed for Bencoolen once again on 28 June. ## Bencoolen, once again\n",
  "language": "en",
  "processed_at": "2026-01-12T12:02:56.514230",
  "title": "Stamford Raffles",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Stamford_Raffles"
}