{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:03:00.381676"
  },
  "content": "Singaporean telecommunications company**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)* **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(March 2017)* *(Learn how and when to remove this message)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(March 2017)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"StarHub\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2024)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **StarHub Limited**, commonly known as **StarHub**, is a Singaporean multinational [telecommunications](/wiki/Telecommunications) conglomerate and one of the major [telcos operating in the country](/wiki/Telecommunications_in_Singapore). Founded in 1998, it is listed on the [Singapore Exchange](/wiki/Singapore_Exchange) (SGX). ## History ### Early years StarHub was awarded the license to provide fixed networks and mobile services on 23 April 1998, when the government announced that the telecommunications sector in Singapore would be completely liberalised by 2002. In 2000, the government announced the date for complete liberalisation would be brought forward to 1 April 2000, and the 49% cap on foreign ownership of public telecommunications companies in Singapore would be lifted. StarHub was officially launched on 1 April 2000 with [ST Telemedia](/wiki/ST_Telemedia), [Singapore Power](/wiki/Singapore_Power), [BT Group](/wiki/BT_Group) and [Nippon Telegraph and Telephone](/wiki/Nippon_Telegraph_and_Telephone) (NTT) as its major shareholders. On 21 January 1999, StarHub acquired [internet service provider](/wiki/Internet_service_provider) CyberWay and it became a subsidiary within the StarHub group. It was renamed as StarHub Internet on 3 December 1999 in a move to integrate CyberWay into the StarHub brand.[*citation needed*] ### 2000s In 2001, Singapore Power divested its shares in StarHub and sold its 25.5% stake to ST Telemedia for S$400 million. BT Group subsequently divested its 18% stake as a result of consolidation, after accumulating debt acquired during the bidding round for 3G licences in the United Kingdom.[*citation needed*] On 1 October 2002, the company merged with Singapore's sole cable television operator, Singapore Cable Vision. As a result of the merger, it acquired SCV's cable television as well as broadband internet access operations. StarHub was publicly listed on the [Singapore Exchange](/wiki/Singapore_Exchange) on 13 October 2004.[*citation needed*] On 12 January 2007, StarHub announced a 'Strategic Alliance' with [Ooredoo](/wiki/Ooredoo). On 1 May 2009, the Infocomm Development Authority of Singapore announced that StarHub's wholly owned subsidiary, Nucleus Connect, was selected as the Operating Company (OpCo) to design, build and operate the active infrastructure of the Next Generation Nationwide Broadband Network (Next Gen NBN). Next Gen NBN is now simply known as Nationwide Broadband Network or NBN. On 14 July 2009, StarHub announced the retirement of long-standing chief executive Terry Clontz. Neil Montefiore, the former chief executive of the country's smallest telecommunications company [M1 Limited](/wiki/M1_Limited), took over as chief executive officer on 1 January 2010. Terry Clontz remains as a non-executive director of StarHub. On 1 August 2009, StarHub relocated its corporate office to StarHub Green building at Ubi from its previous office location at StarHub building at Cuppage. ### 2010s On 7 February 2013, StarHub announced the retirement of Neil Montefiore as chief executive officer by end February 2013. StarHub's chief operating officer Tan Tong Hai was appointed CEO on 1 March 2013. On 13 July 2015, StarHub announced the retirement of Tan Guong Ching as chairman. StarHub's former chief executive officer Terry Clontz was appointed chairman on 15 July 2015. In December 2016, StarHub's new innovation centre and converged operations cockpit Hubtricty went operational. Located at Mediapolis@one-north, the facility also contains a co-working space and data analytics centre. ### 2020s On 29 April 2020, a joint venture between StarHub and [M1 Limited](/wiki/M1_Limited) was awarded a license to create a 5G network in Singapore by the Singapore Government. In August 2021, Starhub announced that it will be launching [Nvidia](/wiki/Nvidia)'s [GeForce Now](/wiki/GeForce_Now) in Singapore, the first country in the region and the only local operator in the country to introduce the cloud gaming service. On 17 February 2022, StarHub was introduced as a programme partner for DBS #CyberWellness. In March 2022, IMDA approves deal for StarHub to buy a majority stake in [MyRepublic](/wiki/MyRepublic) business. In an article written by Straits Times, \"The Infocomm Media Development Authority (IMDA) has approved local telco StarHub's proposal to buy a majority 50.1 per cent stake in rival Internet service provider MyRepublic's fibre broadband business for residential and enterprise customers in Singapore.\" The proposed transaction was announced by StarHub and MyRepublic in September last year. At the time, the deal was worth $70.8 million. This would grow Starhub broadband market share from 34% to about 40% in Singapore. On 12 August 2025, Starhub announced it has fully acquired the broadband business of MyRepublic for S$105.2 million. ## Subsidiaries The StarHub group consists of several subsidiaries, which include: CompanyTypePrincipal activitiesStarHub Mobile Pte LtdSubsidiary[HSPA](/wiki/High_Speed_Packet_Access), [LTE](/wiki/LTE_(telecommunication)) and [5G NR](/wiki/5G_NR) Mobile Network (3G/4G/5G)StarHub Cable Vision LtdSubsidiaryDigital Pay TV services ([StarHub TV](/wiki/StarHub_TV))StarHub Online Pte LtdSubsidiaryResidential broadband and telephone service (Digital Voice)Nucleus ConnectSubsidiaryResponsible for designing, building and operating the infrastructure of Singapore's Nationwide Broadband Network (NBN)Ensign InfoSecurity Pte LtdSubsidiaryProvision of comprehensive cybersecurity services in Asia regionStrateq Sdn BhdSubsidiaryHeadquartered in Malaysia, provides end-to-end data-driven IT solutions with in-house research and development capabilitiesJOS Malaysia Sdn. BhdSubsidiaryHeadquartered in Malaysia, serves around 1,500 blue-chip organizations and government clients in diverse industry sectors embarking on technology transformationMyRepublic Broadband Pte LtdSubsidiaryBroadband Internet services specialising in high-speed, low-latency fibre broadband connectivity to residential and enterprise customers in Singapore ## Services ### Mobile services StarHub provides mobile services through its subsidiary StarHub Mobile. Since its launch on 1 April 2000, StarHub has been Singapore's fastest growing mobile operator. It has close to two million customers and is the second largest mobile network operator with close to 30% market share. On 27 May 2003, it became the first mobile operator in Singapore to commercially launch [BlackBerry](/wiki/BlackBerry), a hand-held wireless device providing e-mail, telephone, text messaging, web browsing and other wireless data access. Customers trials of 3G services began in November 2004, and was released in April 2005. In January 2005, StarHub announced that it would form an exclusive strategic partnership for [i-mode](/wiki/I-mode) in Singapore with [NTT DoCoMo](/wiki/NTT_DoCoMo), a subsidiary of StarHub's major shareholder NTT. Customer trials started in October 2005, and the service was launched on 18 November. On 15 July 2009, StarHub became the first mobile operator in the Asia Pacific region to commercially launch a HSPA+ service. Branded as *MaxMobile Elite*, StarHub's HSPA+ service offers download speeds up to 21 Mbit/s nationwide. On 19 September 2012, StarHub began the enhancement of its high-speed mobile broadband network with Long Term Evolution (LTE) and Dual Cell High-Speed Packet Access Plus (DC-HSPA+), which improved peak downlink speeds of up to 75 Mbit/s and 42 Mbit/s respectively. On 7 March 2013, StarHub became the first telecommunications company in Singapore to offer [High Definition (HD) Voice](/wiki/Wideband_voice). Over a year later, the company launched 4G Voice over LTE services. Both technologies enhance mobile call experience by improving speech clarity and reducing background noise. In September 2015, StarHub was ranked world's fastest 4G network by independent mobile coverage checker OpenSignal. Five months later, OpenSignal reported that according to its study, Singapore is the fastest country with LTE. Singapore's StarHub and Singtel as well as Canada's SaskTel tied in the world's fastest operator category. As of the second quarter of 2016, StarHub's 4G outdoor coverage was at 99.69%. In comparison, Singtel's coverage was at 99.95% coverage and M1's at 99.29%. In November 2016, StarHub and Vodafone renewed their partnership agreement for Singapore for a further three years. The partnership was formed in 2012 to offer innovative mobile services to enterprise customers. On 1 December 2016, StarHub rolled out a travel data plan allowing 2 GB or 3 GB use over 30 days across all mobile networks in nine Asia-Pacific destinations. In January 2017, StarHub switched embedded SIM (eSIM) on its 4G network to support devices that come without a physical SIM. The Samsung Gear S3 Frontier (LTE) is the first eSIM wearable to be made available in Singapore. ### Pay TV StarHub provides cable television services through its subsidiary Singapore Cable Vision Ltd. Its Hybrid [Optical Fibre](/wiki/Optical_Fibre)-[Coaxial](/wiki/Coaxial) network reaches 99% of households in Singapore. In November 2004, it announced the launch of digital cable services over its cable network, which added more channels and allowed greater consumer interactivity. On 18 January 2007, StarHub introduced a commercial high definition television service. On 7 June 2012, StarHub launched TV Anywhere, a multi-platform service which allows subscribers to watch TV channels and on-demand content on their personal devices such as laptops and tablets. On 18 March 2013, StarHub started offering commercial customers [StarHub TV](/wiki/StarHub_TV) on Fibre, its [Internet Protocol television (IPTV)](/wiki/IPTV) service. On 8 April 2015, IPTV was rolled out to residential customers. On 12 August 2015, an online streaming service called StarHub Go was launched, and TV Anywhere was merged into it. ### Internet services StarHub provides broadband internet access through its subsidiaries StarHub Internet and StarHub Online respectively. StarHub Internet was formed after the acquisition of internet access provider CyberWay, while StarHub Online was formed after a merger with Singapore Cable Vision. StarHub has 475,000 home broadband customers as of the third quarter of 2016. On 3 December 1999, a free surf plan was announced in conjunction with the rebranding of CyberWay, a first in Singapore's consumer internet industry. Customers could surf the internet for free via dial-up and pay only normal local telephone charges. Over 180,000 people signed up for the free surf plan in less than three months since it was announced. StarHub provides broadband internet access on the same network it uses for cable television services using [cable modems](/wiki/Cable_modems) based on the [DOCSIS](/wiki/DOCSIS) standard. StarHub is a founding member of the global [Wireless Broadband Alliance](/wiki/Wireless_Broadband_Alliance) and provides wireless broadband services at numerous locations throughout Singapore. In November 2004, it announced an agreement with [Connexion by Boeing](/wiki/Connexion_by_Boeing) which provide StarHub customers the ability to access the internet and digital content in flight. On 28 December 2006, StarHub became the first operator in the world to commercially launch a 100 Mbit/s residential broadband service nationwide. Known as *MaxOnline Ultimate*, it is one of three cable broadband services offered by StarHub, the other two being *MaxOnline Express* and *MaxOnline Premium*. StarHub also launched 100 Mbit/s, 150 Mbit/s, 200 Mbit/s and 1000 Mbit/s residential fibre broadband service in April 2010. It is known as *MaxInfinity Ultimate*, *MaxInfinity Elite*, *MaxInfinity Supreme* and *MaxInfinity Platinum*. In October 2012, StarHub launched two new gamer-centric broadband plans under the name MaxInfinity LVL99 for gamers to enjoy priority. The plans have since been discontinued. In November 2014, StarHub started bundling a 100 Mbit/s cable broadband connection with its 1 Gbit/s fibre broadband plans, branded as \"Dual Broadband\", for customers to get two broadband links in their home. ### Fixed network services StarHub's fixed network, built since inception, extends more than 2,000 km (1,200 mi) around Singapore and directly connects more than 800 commercial buildings. It provides a wide range of fixed network services, broadly categorised as data services and [Internet Protocol](/wiki/Internet_Protocol) and Voice services. **Data services include:** - [Asynchronous Transfer Mode](/wiki/Asynchronous_Transfer_Mode) service - Domestic Leased Circuit - Facilities Management - [Frame Relay](/wiki/Frame_Relay) - [International Private Leased Circuit](/wiki/Leased_line) **Internet protocol services include:** - Corporate Dialup and [ADSL](/wiki/Asymmetric_digital_subscriber_line) via access to [DSLAMs](/wiki/Digital_subscriber_line_access_multiplexer) located in office buildings - [Dedicated](/wiki/Dedicated_line) [Leased lines](/wiki/Leased_line) - Global internet protocol network - Global [Virtual Private Network](/wiki/Virtual_Private_Network) - Metropolitan [Ethernet](/wiki/Ethernet) services - Internet Protocol Transit/[Backbone](/wiki/Backbone_network) services - Managed Security Services - Hosting Services - Co-location Service\n",
  "language": "en",
  "processed_at": "2026-01-12T12:03:00.381381",
  "title": "StarHub",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/StarHub"
}