{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:03:04.685441"
  },
  "content": "Courthouse in Singapore The **State Courts Building**, also known as **The Octagon** and formerly as the **Subordinate Courts Building**, is a [courthouse](/wiki/Courthouse) on Upper Cross Street in Singapore. Completed in 1975, the building housed the [State Courts of Singapore](/wiki/State_Courts_of_Singapore) (formerly the Subordinates Courts of Singapore) until 2019, when the courts moved into the State Courts Towers. ## Architecture According to the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), the building is \"noted for its complex design that creates a powerful timeless exterior while having a well-considered internal layout that combines functional needs, all within a restrained and dignified aesthetic that marked a major departure from the neo-classical style that had been adopted for the court system\". The authority also describes the building as a \"good example of a modern public building that symbolizes a modern and forward looking nation.\" It features angular shapes, as well as alternating bands of white masonry walls and bands of dark recessed windows. The central atrium utilises natural lighting and ventilation. It is allegedly \"oriented in all directions as a metaphor on its function to address all in the community.\" ## History The building's construction, which cost $13 million, began on 22 January 1973. Prior to its construction, the various divisions of the Subordinates Courts each had their own premises in different areas. After the building's completion in 1975, all but two of the Subordinate Courts divisions, the Family Justice Division and the Small Claims Tribunal, moved into the building. It began operations on 15 September of that year. The latter relocated to the building in 2005 while the former moved into the nearby [Old Ministry of Labour Building](/wiki/Old_Ministry_of_Labour_Building) in 2001. At its completion, the building had 26 courtrooms. A later expansion brought the total number of courtrooms in the building to 37. According to the Urban Development Authority, the building became a local landmark as a result of its \"outstanding architectural appearance\", and that it has also become a \"social landmark which the public has come to associate with the dispensation of justice.\" The authority gazetted the building for conservation on 10 July 2013. The building's 40th anniversary ceremony was held on 19 January 2016. The building's main entrance was shifted to [Upper Cross Street](/wiki/Upper_Cross_Street) on 3 December to facilitate the construction of a newer state courts building. On 13 December 2019, the building was officially closed as the State Courts moved to the newly-constructed State Courts Towers, which was to be fully-functional by 16 December. 1°17′13″N 103°50′34″E﻿ / ﻿1.2869°N 103.8429°E﻿ / 1.2869; 103.8429\n",
  "language": "en",
  "processed_at": "2026-01-12T12:03:04.685112",
  "title": "State Courts Building",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/State_Courts_Building"
}