{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:03:08.595104"
  },
  "content": "Various statistics relating to COVID-19 cases and deaths in Singapore This article presents official statistics gathered during the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore). The [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) of [Singapore](/wiki/Singapore) has been publishing official numbers on a daily basis since the first confirmed case of [SARS-CoV-2](/wiki/SARS-CoV-2) virus on 23 January 2020. In their situation reports, the cases are broken down into several categories: imported cases, non-imported community cases, non-imported dormitory cases. Prior to 16 April 2020, MOH had released the data only at the end of the day. However upon discovery of a civil servant leaking information before the official release of data, since 17 April 2020, MOH has been providing a preliminary update of summarised figures at around noon of each day with the details released at the end of the day. ## Classifying COVID-19 cases Singapore adheres strictly to [World Health Organization](/wiki/World_Health_Organization)'s case definition for classifying COVID-19 deaths, which does not include non-pneumonia fatalities like those caused by blood or heart issues among COVID-19 patients in its official tally. This was exemplified in three cases which the cause of death was recorded as either ischaemic heart disease or heart attack, and a suicide committed by an Indian migrant worker who was tested positive for the virus. ## Untraced cases prior to 11 April 2020 No. of SARS-CoV-2 infection cases in Singapore with no known links to previous cases or travel history ( - v - t - e ) Day[notes 1]Month12345678910111213141516171819202122232425262728293031**February 2020****Count**9798777898999911101010**Ref.****March 2020****Count**111111121212131414910910111112161723242931314144425867717993**Ref.****April 2020****Count**115118127145179177193236375426515**Ref.**Notes: ## Charts The linear plot shows the total number of cases as a function of time (by date) since 23 January 2020, the date of the first reported case in Singapore, while the graph plotted on a [logarithmic scale](/wiki/Logarithmic_scale), or a [semi-log plot](/wiki/Semi-log_plot), shows an [exponential growth](/wiki/Exponential_growth) in the number of cases as a straight line on the graph. In the logarithmic scale plot, the [slope](/wiki/Slope) of the straight line determines the rate of growth of the number of cases, with a steeper slope representing a higher growth rate. The third and fourth plot shows the number of daily new cases and total active cases respectively as reported. ### Overview This graph was using the legacy Graph extension, which is no longer supported. It needs to be converted to the new Chart extension.Show linear scaleThis graph was using the legacy Graph extension, which is no longer supported. It needs to be converted to the new Chart extension.Show logarithmic scale ### Cases per day ### Active cases per day ### Recoveries per day ### Deaths per day ### Total tests performed The linear plot shows the total number of tests performed as a function of time (by date) from 7 April 2020, the date of the first testing data given in Singapore. This graph was using the legacy Graph extension, which is no longer supported. It needs to be converted to the new Chart extension. ### Cumulative number of cases, hospitalizations, ICU admissions, recoveries and deaths ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T12:03:08.594803",
  "title": "Statistics of the COVID-19 pandemic in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Statistics_of_the_COVID-19_pandemic_in_Singapore"
}