{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:03:23.852717"
  },
  "content": "This article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)* In [Singapore](/wiki/Singapore), stray cats, otherwise referred to as street cats or community cats, have been the subject of long-standing public debate. They are commonly found in public or residential areas, with a population numbering 13,000 today. Attitudes surrounding stray cats have varied, ranging from negative perceptions surrounding their overpopulation and disease-carrying characteristics, to positive perceptions surrounding their connections to the [Singapura](/wiki/Singapura_cat) cat breed and wider acceptance by the general public.: 310–315 Issues surrounding stray cats are not unknown to Singaporeans. They have been the subject of abandonment and abuse through incidents of cats being slashed and thrown off buildings.: 319–320 The [Singapore Government](/wiki/Government_of_Singapore) has enacted various laws and policies like the Cat Management Framework, the Stray Cat Rehabilitation Scheme, and the Animals and Birds Act.: 319–320 At present, much of the efforts surrounding the care and protection of Singapore’s stray cats is contributed by community cat feeders, cat rescuers, and cat fosterers.: 282 ## Overview ### Locations Stray cats are prevalent in Singapore. They can be found in various locations: in exposed corners of sewage systems, residential areas like the void decks of [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) flats, and public spaces like [hawker centres](/wiki/Hawker_centre) and schools.: 319–320 : 280–282 One of Singapore’s islands, [Saint John's Island](/wiki/Saint_John%27s_Island), is particularly known for its substantial cat population. Aside from roaming Singapore’s streets, some stray cats find shelter in the homes of community cat feeders in the area.: 282 Street cats are nocturnal, and would be found wandering these areas mostly at night.: 292 ### Population There are thousands of stray cats roaming around Singapore. Historical estimates of the number of stray cats in Singapore range from 60,000 to 80,000 cats.: 280 Modern estimates put that number at 13,000, with that number set to increase with increased cat registration rates. Singapore’s large stray cat population stems from high cat ownership prior to residents living in HDB flats; when they still lived in [kampong](/wiki/Kampong) settlements. In the 1960s - 1980s, residents were gradually moved into HDB flats, and the presence of these animals were discouraged. There is a disagreement on when HDB enacted a ban on cats in HDB flats; some sources cite 1978 as the year of commencement for the ban. Others cite 1989. Still others cite 1960. Despite the discrepancy in dates, the result is the same: cats were banned from HDB flats, and many residents evicted their cats from their homes to live on the street. Despite the ban, cats were tolerated in residential areas. In 2024, the ban was lifted to allow cats in HDB flats. ### Appearance Singapore has a diverse population of stray cats, with fur colors and patterns including [tabbies](/wiki/Tabby_cat), [tortoiseshells](/wiki/Tortoiseshell_cat), [gingers](/wiki/Ginger_cat), and [pointed](/wiki/Points_(coat_color)). Most stray cats in Singapore are short-haired cats with short or stumpy tails. ### Diet Stray cats scavenge for food in human garbage and hunt birds or rely on hawker centres to provide them with leftover human food. Community cat feeders also provide stray cats with food and water.: 291 ## Social attitudes ### 1960s - 1980s: Ban on cats in HDB flats Singapore’s views on stray cats have undergone several changes over the years. In the 1960s, when the Singapore government was relocating residents from kampong settlements, stray cats were seen as unhygienic and as disease-carrying pests. The resulting aforementioned ban that was enacted in either 1960, 1978, or 1989 emphasised that stray cats were not accepted in Singapore. The Singapore government also set a maximum fine of S$4,000 if it was discovered that a resident owned a cat in their flat. ### 1970s: SPCA-led and government-encouraged spaying program In the 1970s, the [Society for the Prevention of Cruelty to Animals (SPCA)](/wiki/Society_for_the_Prevention_of_Cruelty_to_Animals_Singapore) in Singapore implemented a [spaying](/wiki/Spaying) programme in hawker centres to manage the population of stray animals that were abandoned there and left to feed on human leftover food. The programme encompassed the spaying of both stray cats and dogs, but stray cats were more commonly found in hawker centres. While the programme was under SPCA’s management and jurisdiction, the Singapore government assisted the SPCA by making licences cheaper for spayed dogs as an incentive. The Ministry of Environment also attempted to increase the hygiene levels of hawker centres to prevent stray cats from gathering there. ### 1975 - 2000: the Singapura cat and kucinta In 1975, the [Singapura cat breed](/wiki/Singapura_cat) was discovered and subsequently achieved international recognition. The Singapore government, specifically the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board), subsequently created the Kucinta campaign in 1990-1991 to capitalise on the popularity of the cat breed and present it as a uniquely Singaporean symbol. The campaign was phased out in 2000 due to the encroachment of stray cats into residential areas, reigniting previous perceptions of stray cats as pests. There were disagreements over the Kucinta campaign and the perception of stray cats among the general Singaporean public. During the Kucinta campaign, the Singapore Government focused on the international fame of the Singapura breed. Singaporeans by contrast thought the stray cats that the Singapura cat breed was produced from was a more appropriate Singaporean symbol.: 314 ### 2003: the SARS cat-culling incident During the [SARS epidemic](/wiki/2002%E2%80%932004_SARS_outbreak) in Singapore in 2003, stray cats were captured and culled by the Singapore Government due to the misconception that they could spread the SARS virus.: 315 Stray cats were also abused due to similar fears. The misconception was later debunked by the Agri-Food and Veterinary Authority (AVA), but the AVA’s findings were not published due to a lack of confirmation on its reliability. Animal advocacy groups like the Animal Lovers League attempted to relocate Singapore’s remaining stray cats in shelters in Johor to prevent them from being culled by the Singapore government. This arrangement fell through, leading these animal advocacy groups to thus shelter Singapore’s stray cats in Singapore under their care. Advocacy efforts surrounded the opposition of culling measures by the Singapore government, and to instead enact a pre-existing Stray Cat Rehabilitation Scheme that involved catching, [neutering](/wiki/Neutering), and releasing stray cats. Due to public pressure, the Singapore government had, by the end of the year, made land available for bidding for interested parties looking for land to shelter Singapore’s stray cats. The AVA also finalised and published their findings stating that stray cats did not carry or spread the SARS virus, thus dispelling the misconception. ### 2003 - 2024: contemporary views The perception of stray cats among some Singaporeans remains negative today among some segments of the population. Stray cats dirty public spaces by defecating or otherwise leaving their waste products in these areas. Additionally, they produce loud sounds that disrupt nearby residents, especially when stray cats are present in residential areas and tend to be active at night. Most complaints regarding pets in HDB flats relate to cats because they cannot be kept indoors all the time or be trained to not disrupt other residents. The divide between natural and human-made urban structures are blurring due to [urbanisation](/wiki/Urbanization); Singaporeans and animals would likely interact with one another at increasing rates. However, given the exclusion that stray cats currently face from public spaces, the integration of stray animals, including stray cats, into urban environments and human interactions remains incomplete. Though there was substantial support in 2023 from at least 8 in 10 Singaporeans surveyed for the legalisation and government oversight of stray cats in Singapore. ### 2024: Cat Management Framework On 11 May 2024, a new Cat Management Framework was announced by AVS to start licensing cats from 1 September 2024. A two years transition period was given to allow cat owners to license their cats. It also provides a Trap-Neuter-Rehome/Release-Manage (TNRM) programme for stray cats and education and outreach on community cat caregiving. The existing Trap-Neuter-Rehome/Release-Manage (TNRM) programme for stray dogs is expanded to stray cats. After being neutered, stray cats would either be adopted or otherwise rehomed or released back onto the streets. After the September 1, 2026 transitional period, there will be a maximum fine of S$5,000 for having an unlicensed cat in a resident’s home. There are concerns by cat advocates regarding these regulations, specifically the low barriers of entry for residents to become cat owners and ambiguity surrounding enforcement. Confusion over the new rules set by the framework have even led some to abandon their cats, contributing to the stray cat population in Singapore. Additionally, cat fosterers feel that their ability to shelter as many stray cats as they want to is impeded by the new two-cat limit. The vetting process for cat fosterers by the Singapore government is also dissuading some from continuing their work due to concerns over their suitability and compliance with regulations, and long bureaucratic processes. The rules for cat fosterers specifically are also unclear. ## Issues surrounding stray cats Despite changing attitudes, there have been historical and contemporary issues surrounding stray cats. ### Cat abandonment Singaporeans have abandoned cats and kittens, often leaving them unsterilised and susceptible to injury and death by other animals or by man-made causes. Cat abandonment is particularly prevalent during festive seasons, and not all cats can be assisted and rescued by cat rescuers and community members. ### Cat abuse Stray cats have been subjected to abuse, for instance, there have been cases of stray cats being thrown off buildings, slashed by knives, and wounded by objects thrown at them.: 287 Many cases of cat abuse have gone unsolved, though some perpetrators have been found and dealt with accordingly. For investigations into such cases to begin, submitting tangible evidence of the culprits committing these offenses is required, but such evidence is not always available.: 321 Perpetrators are empowered to commit these acts for many reasons. The previously held misgivings about cats by both the government and the public had and have towards stray cats might embolden some perpetrators. Perpetrators may also abuse stray cats due to the knowledge that these stray cats cannot fight back. Mental illnesses also contribute to such behaviour. Some perpetrators abuse animals to obtain social media attention and notoriety and financial profit from videos of cat abuse due to its fetishization. ## Other related legislation ### Stray Cat Rehabilitation Scheme Beginning in 1998, the Stray Cat Rehabilitation Scheme was enacted by the AVA to gradually capture, neuter, and release stray cats in Singapore as opposed to culling them. It was temporarily suspended in 2003 during the SARS epidemic when the Singapore government opted to cull instead of neuter stray cats out of fear that stray cats could spread diseases. Attempts were made to restart the scheme after the SARS epidemic, but animal welfare groups headed the effort, and not the AVA and town councils that were initially involved. ### Animals and Birds Act The Animals and Birds Act criminalises animal abuse perpetrated by individuals and businesses. In 2011, there were numerous killings and cases of stray cat abuse in [Beach Road](/wiki/Beach_Road,_Singapore) and the nearby areas of [Kampong Glam](/wiki/Kampong_Glam) and [North Bridge Road](/wiki/North_Bridge_Road). The perpetrators of those cases went unpunished due to the lack of a conclusive culprit, and public pressure caused the government to enforce harsher punishments for such abuse cases in the Animals and Birds Act. In 2019, the Act was reviewed by the Animal & Veterinary Service (AVS) after several incidents regarding the abuse of mostly cats and cases of animal negligence attained national notoriety. As of 2019, deterrents to animal abuse and negligence involve a maximum of 18 months imprisonment and/or a S$15,000 fine for first-time offenders. Abandonment and negligence incurs a maximum of 12 months imprisonment and/or a S$10,000 fine. Punishments for these crimes are doubled if perpetrators repeatedly commit these offenses. ## Community helpers ### Cat feeders There are several groups of community cat feeders, or cat feeders, in Singapore. Many cat feeders skew older, employed women with a passion for helping and interacting with cats.: 282 Given that cats are nocturnal animals, cat feeders also carry out their feeding activities at night.: 282, 292 Cat feeders take care of the stray cats in their community at their own expense and ensure the needs of these cats are met. Cat feeders provide stray cats with food, water, and shelter through the hosting of these cats in their homes.: 294 The cost of these endeavours can be financially and emotionally draining. For instance, feeding stray cats can cost hundreds of dollars a month. Cat feeders also pay for the surgical neutering of these stray cats and other veterinary costs, which can go into the thousands of dollars. Caring for the stray cats in the community demands a daily time commitment as cat feeders not only have to bring food and water for the stray cats, but they have to wait until the cats have finished before cleaning up after them. Cat feeders are also educators that teach the public the proper ways to interact and engage with stray cats. However, they sometimes experience mistreatment from those in the community, like when they are threatened and reprimanded for feeding the stray cats due to the mistaken belief that they are contributing to an increase in stray cats. Cat feeders also fear retaliation when they do not comply with residents’ objections, which led many to avoid such interactions altogether by only operating at certain areas and timings. ### Cat rescuers and fosterers Some members of the community operate at night and use their financial resources to neuter and nurture the stray cats in their community. Their main objective is to find permanent homes for these stray cats. Cat rescuers and fosterers often let stray cats into their home whenever they can, assuming all responsibility surrounding their wellbeing. This includes feeding and cleaning up after the cats, ensuring the cats’ health, and integrating them into the group of cats already in the house who are also waiting to be adopted. This endeavour can be expensive, ranging from hundreds to thousands of dollars per cat, on top of the substantial daily time commitment involved in caring for them. To help these stray cats find new owners, cat rescuers / cat fosterers rely on social media. They would interview and evaluate potential adopters to ensure they are suitable and prepared to take care of a cat. This process can be time-consuming, depending on the cat’s personality and health. ## Abuse In 2024, a 31-year-old man was sentenced to 20 days jail for neglecting 43 cats in a vacant flat. They were kept in a small, confined space without adequate food and water. It was the largest [animal cruelty](/wiki/Cruelty_to_animals) prosecution in terms of pet numbers by the NParks. In 2025, Barrie Lin Pengli who suffered from major depressive disorder were sentenced to 14 months’ jail for abusing five cats. Two were killed by being thrown off from high floors at Housing Board blocks with one severely injured. The other two cats were suffocated before being released. ## Notes 1. Abdullah, Zhaki. “Cat licensing scheme to kick in on Sept 1 in Singapore.” *The Straits Times*, May 11, 2024. Cat licensing scheme to kick in on Sept 1 in Singapore. 2. Chan, Ying-kit. “No Room to Swing a Cat? Animal Treatment and Urban Space in Singapore.” *Southeast Asian Studies* 5, no. 2 (2016): 305–29. No Room to Swing a Cat? Animal Treatment and Urban Space in Singapore. 3. Chee, Lilian. “Keeping Cats, Hoarding Things: Domestic Situations in the Public Spaces of the Singaporean Housing Block.” *Journal of Architecture* (London, England) 22, no. 6 (2017): 1041–65. Keeping cats, hoarding things: domestic situations in the public spaces of the Singaporean housing block. 4. Davis, Lucy. “Zones of Contagion: The Singapore Body Politic and the Body of the Street-Cat.” In *Considering Animals: Contemporary Studies in Human-Animal Relations*, edited by Carol Freeman, Elizabeth Leane, and Yvette Watt. London: Routledge, 2016. Zones of Contagion: The Singapore Body Politic and the Body of the Str. 5. Franklin, Adrian. “The More-than-Human City.” *The Sociological Review (Keele)* 65, no. 2 (2017): 202–17. The more-than-human city. 6. Gill, Jaipal Singh. “Commentary: Do we need to do more to protect our community cats?.” *CNA*, June 2, 2021. Commentary: Do we need to do more to protect our community cats?. 7. Ives, Mike. “A Messy Problem in Orderly Singapore: Keeping Track of Cats.” *The New York Times*, November 9, 2024. . 8. Lou, Si Yuan. “'Not an easy job': Community cat feeders say they also pay for sterilisation, medical care of abandoned strays.” *TODAY*, January 17, 2023. 'Not an easy job': Community cat feeders say they also pay for sterilisation, medical care of abandoned strays. 9. “Most people agree pet cats should be licensed, allowed in HDB flats: AVS survey.” *CNA*, May 6, 2023. Most people agree pet cats should be licensed, allowed in HDB flats: AVS survey. 10. Neo, Harvey. “Nature and the Environment as an Evolving Concern in Urban Singapore.” In *Changing Landscapes of Singapore: Old Tensions, New Discoveries*, edited by Elaine Lynn-Ee Ho, Chih Yuan Woon, and Kamalini Ramdas. Singapore: NUS Press Pte Ltd, 2013. Changing Landscapes of Singapore: Old Tensions, New Discoveries. 11. Ng, Marcus. “St John’s Island: From Gateway to Getaway.” BiblioAsia. April 30, 2018. St John’s Island: From Gateway to Getaway. 12. Searle, A. G. “A Study of Variation in Singapore Cats.” *Journal of Genetics* 56, no. 2 (1959): 111–26. A study of variation in Singapore cats. 13. Tan, Judith. “NParks to review Animals and Birds Act, Code of Animal Welfare.” *The Straits Times*, January 13, 2025. NParks to review Animals and Birds Act, Code of Animal Welfare. 14. Woon, Wallace. “ST Explains: Why cats are banned from HDB flats, and what lifting the ban would take.” *The Straits Times*, September 4, 2022. ST Explains: Why cats are banned from HDB flats, and what lifting the ban would take. 15. Zalizan, Taufiq. “Already burnt out, some cat rescuers mull quitting after spike in abandonment cases, uncertainty over new regulations.” *CNA*, July 6, 2024. Already burnt out, some cat rescuers mull quitting after spike in abandonment cases, uncertainty over new regulations.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:03:23.852418",
  "title": "Stray cats in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Stray_cats_in_Singapore"
}