{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:03:21.431057"
  },
  "content": "Currency of the Straits SettlementsThis article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(December 2012)* *(Learn how and when to remove this message)* The **Straits dollar** was the currency of the [Straits Settlements](/wiki/Straits_Settlements) from 1898 until 1939. At the same time, it was also used in the [Federated Malay States](/wiki/Federated_Malay_States), the [Unfederated Malay States](/wiki/Unfederated_Malay_States), [Kingdom of Sarawak](/wiki/Kingdom_of_Sarawak), [Brunei](/wiki/Brunei), and [British North Borneo](/wiki/British_North_Borneo). ## History ### Background In the early nineteenth century, the most common currency used in the [East Indies](/wiki/East_Indies) was the [Spanish dollar](/wiki/Spanish_dollar), including issues both from Spain and from the new world Spanish colonies, which for the [East Indies](/wiki/East_Indies) emanated from the [Philippines](/wiki/Philippines) in the [Spanish East Indies](/wiki/Spanish_East_Indies) originating from [Mexico](/wiki/Mexico) and [Peru](/wiki/Peru) as part of the [Spanish colonial empire](/wiki/Spanish_Empire). Locally issued coinages included the [Kelantan](/wiki/Kelantan_keping) and [Trengganu keping](/wiki/Trengganu_keping), and the [Penang dollar](/wiki/Penang_dollar). In 1826, the Straits Settlements were formed under the auspices of the East India Company. The East India Company attempted to implement the Indian rupee as the sole official currency in the Straits Settlements, however it was unsuitable for trade and Mexican dollars (the successor to the Spanish dollar) continued to be used for trade. Private banks also printed their own private banknotes which were redeemable to silver dollars. 1844 saw the authorization of copper coinage for the Straits Settlements using a system of 100 cents = 1 dollar, with the dollar equal to the [Spanish dollar](/wiki/Spanish_dollar) or its regional successors within the [Spanish Empire](/wiki/Spanish_Empire) such as the [Philippine peso](/wiki/Philippine_peso) or [Mexican peso](/wiki/Mexican_peso). This coinage was declared current in the Straits Settlements on 1 June 1847. In 1867, the administration of the Straits Settlements were transferred to the British colonial office, and the Indian rupee also lost its status as legal tender within the Straits Settlements. However, due to a shortage of silver dollars from the Spanish Empire, the British also began issuing trade dollars in 1895. The [Board of Commissioners of Currency for the Straits Settlements](/wiki/Board_of_Commissioners_of_Currency_for_the_Straits_Settlements) was created in 1897, and from 1899 began issuing Straits Settlement currency notes. Private banks were also prohibited from issuing new banknotes. ### Straits dollars In 1903, the board issued the Straits dollar, valued at par with the British trade dollar, while also demonetizing the British, Mexican, and other silver dollars. In 1906, the Straits dollar was pegged to two [shillings](/wiki/Shilling) four [pence](/wiki/Pence) (or twenty-eight pence) [sterling](/wiki/Pound_sterling), which was in turn on a [gold standard](/wiki/Gold_standard) at the time. In 1931, the sterling was taken off the gold standard, putting the Straits dollar on a sterling-exchange standard. ### Replacement The Straits dollar was replaced at par by the [Malayan dollar](/wiki/Malayan_dollar) in 1939. [Brunei](/wiki/Brunei) and [Singapore](/wiki/Singapore) acknowledged the successor to this currency unit, although Malaysia rescinded in 1973. A [memorandum of understanding](/wiki/Memorandum_of_understanding), Currency Interchangeability Agreement, was signed between the [Brunei–Singapore relations](/wiki/Brunei%E2%80%93Singapore_relations) which makes both [Brunei dollar](/wiki/Brunei_dollar) and [Singapore dollar](/wiki/Singapore_dollar) banknotes and coins legal tender [vice versa](/wiki/Vice_versa) in each other's country. ## Coins The first coins issued for the Straits Settlements in 1845 were 1⁄4, 1⁄2 and 1 cent denominations in copper. They were issued by the [East India Company](/wiki/British_East_India_Company) and did not bear any indication of where they were to be used. The original dies were engraved by [William Wyon](/wiki/William_Wyon), Chief Engraver at the [Royal Mint](/wiki/Royal_Mint). They were first struck at the [Calcutta Mint](/wiki/India_Government_Mint,_Kolkata), and later in 1858 also at the Madras Mint. In 1858, administration of the Straits Settlements was transferred from the East India Company to the Crown, and the Straits Settlements came under the Government of British India. A second issue of the same denominations was struck in 1862 at the Indian Government Mint, Calcutta. These bore the inscription \"India – Straits\". In 1871, silver coins were issued in the name of the Straits Settlements for 5, 10 and 20 cents, followed by copper 1⁄4, 1⁄2 and 1 cent the next year and silver 50 cents in 1886. Silver dollars were first minted in 1903. A 3-page special issue of the Straits Settlements Government Gazette published in Singapore on 24 August 1904, contained the following proclamation by then Governor, Sir John Anderson: > From 31 August 1904, British, Mexican and Hong Kong Dollars would cease to be legal tender and would be replaced by the newly introduced Straits Settlements Dollar. The purpose of this action was to create a separate exchange value for the new Straits dollar as compared with the other silver dollars that were circulating in the region, notably the [British trade dollar](/wiki/British_trade_dollar). The idea was that when the exchange value had diverged significantly from that of the other silver dollars, then the authorities would peg it to sterling at that value, hence putting the Straits Settlements unto the [gold exchange standard](/wiki/Gold_exchange_standard). This pegging occurred when the Straits dollar reached the value of two shillings and four pence (2s 4d) against sterling. Within a few years, the value of silver rose rapidly such as to make the silver value of the Straits dollar higher than its gold exchange value. To prevent these dollars from being melted down, a new smaller dollar was issued in 1907 with a reduced silver content. A parallel story occurred in the Philippines at the same time. The last 1⁄4 cent coins were issued in 1916. Dollars were last struck for circulation in 1926, with 50 cents production ending in 1921. The remaining coins continued in production until 1935. ## Banknotes The Board of Commissioners of Currency introduced 5 and 10 dollar notes in 1898, followed by 50 and 100 dollars in 1901 and 1 dollar in 1906. Emergency issues of 10 and 25 cents were made between 1917 and 1920. 1000 dollar notes were issued in 1930 but during the remainder of the 1930s only 1, 5 and 10 dollar notes were issued. ### Straits Settlements government issues (1899–1942) #### Victoria (1837–1901) The Government of [Straits Settlements](/wiki/Straits_Settlements) was first authorised to issue currency notes by Ordinance VIII of 1897 during [Queen Victoria](/wiki/Queen_Victoria)'s reign, which came into operation on 31 August 1898. These notes, although dated 1 September 1898, were not issued to the public until 1 May 1899. Both the [Chartered Bank](/wiki/Standard_Chartered_Bank) and [Hong Kong and Shanghai Bank](/wiki/Hong_Kong_and_Shanghai_Bank) continued to issue banknotes, which circulated side by side with the official currency. All notes were freely exchangeable with the [Mexican dollar](/wiki/Mexican_dollar) or the various other silver coins that were legal tender in the Colony. #### Edward VII (1901–1910) [Edward VII](/wiki/Edward_VII_of_the_United_Kingdom) ascended the throne in January 1901. In the previous issue the 5-dollar note had been of almost the same size and design as the 10-dollar. It was now reduced in size to help recognition. The series dated 1 February 1901 were printed by [Thomas de la Rue & Co. Ltd.](/wiki/De_La_Rue) of [London](/wiki/London). In 1903, a dollar-sized coin in silver was minted specially for the [Straits Settlements](/wiki/Straits_Settlements), and this became the standard unit of value. All other silver dollars at that time circulation were demonetised by 1904. A steep rise in the price of silver, however, soon forced the government to call in the first issue of this Straits dollar and to replace it with a coin of lower silver content. During the change over period, fear of a shortage of coin led to the introduction of the one-dollar note, fixed at an exchange rate against gold instead of silver. To effect this, the [British gold sovereign](/wiki/British_sovereign_coin) was for the first time declared legal tender, and the Straits dollar was given an arbitrary value of two shillings and four pence sterling. This dollar note proved so popular that it was retained in all future issues, so that to a very large extent it replaced the need for the silver coin. By the end of 1906, the currency circulation had risen to $21,866,142, while that of the private banks had fallen to $1,329,052 (*20th Century Impressions of British Malaya* p. 138). The one-dollar notes, which were dated 1 September 1906, were printed by the [London](/wiki/London) firm of [Thomas de la Rue & Co. Ltd.](/wiki/De_La_Rue) A five-dollar and a ten-dollar note both dated 8 June 1909, were printed [Thomas de la Rue & Co. Ltd.](/wiki/De_La_Rue) The Chinese text on top of the banknote reads: 叻嶼呷國庫銀票, 叻嶼呷 is the abbreviation for the Straits Settlements (叻 = Singapore, 嶼 = Penang Island, 呷 = Malacca). It is roughly equivalent to \"banknote of the Straits Settlements\". The Malay text is rendered in Jawi script at the bottom and three Straits Settlements are also explicitly given, reading *\"wang kertas ini kerajaan tiga buah negeri iaitu [Singapura](/wiki/Singapura), [Pulau Pinang](/wiki/Pulau_Pinang), dan [Melaka](/wiki/Melaka) mengaku pembayarannya.\"* (This banknote is recognised as legal tender by the states of Singapore, Penang and Malacca) #### George V (1910–1936) During [George V](/wiki/George_V)'s reign the range of currency notes was extended up to one thousand dollars for the convenience of inter-bank clearing transactions. In 1915, it was decided to make a complete change in the design of the 50, 100 and 1000 dollar notes. These denominations were first issued to the public in February 1920, October 1919 and May 1917 respectively. They were printed by [Thomas de la Rue](/wiki/De_La_Rue). A 10,000 note was first issued in October 1922. This was not available to the public, but was used exclusively in inter-bank transfers. #### Edward VIII (1936) No special issue of notes was made during the brief reign of [Edward VIII](/wiki/Edward_VIII_of_the_United_Kingdom). #### George VI (1936–1952) In September 1933, Sir [Basil Phillott Blackett](/wiki/Basil_Phillott_Blackett) was appointed by the [Secretary of State for the Colonies](/wiki/Secretary_of_State_for_the_Colonies) to lead a commission to consider the participation of the various [Malay States](/wiki/Malay_States), including [Brunei](/wiki/Brunei), in the profits and liabilities of the [Straits Settlements](/wiki/Straits_Settlements) currency. The Blackett Report recommended that the sole power of issuing currency for the area should be entrusted to a pan-Malayan Currency Commission. This recommendation was adopted by the Government of the Straits Settlements, the [Federated Malay States](/wiki/Federated_Malay_States), [Unfederated Malay States](/wiki/Unfederated_Malay_States), and [Brunei](/wiki/Brunei). Legislation was enacted by the Straits Settlements Currency Ordinance (No. 23) of 1938, in [George VI](/wiki/George_VI_of_the_United_Kingdom)'s reign, and ratified by the various states during 1939 and the [Malayan dollar](/wiki/Malayan_dollar) became legal tender in the Straits Settlements. ## Sources - Emerson, Rupert, 1964, *Malaysia A Study in Direct and Indirect Rule*, Macmillan Company. - Shaw, William, 1971, *Paper Currency of Malaysia, Singapore and Brunei (1849–1970)*, Museum Department of States of Malaya. Preceded by: **[Indian rupee](/wiki/Indian_rupee)** **Reason:** administration separated from India**Currency of [Straits Settlements](/wiki/Straits_Settlements)** 1845 – 1901 **Concurrent with:** [Indian rupee](/wiki/Indian_rupee) (1845–1867)**Currency of [Brunei](/wiki/Brunei), [Straits Settlements](/wiki/Straits_Settlements)** 1901 – 1939Succeeded by: **[Malayan dollar](/wiki/Malayan_dollar)** **Location:** [Straits Settlements](/wiki/Straits_Settlements), [Federated Malay States](/wiki/Federated_Malay_States), [Brunei](/wiki/Brunei), [Labuan](/wiki/Labuan_Territory)Preceded by: **[Brunei pitis](/wiki/Brunei_pitis)** **Reason:** protectorate agreement - Money portal - Numismatics portal\n",
  "language": "en",
  "processed_at": "2026-01-12T12:03:21.430719",
  "title": "Straits dollar",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Straits_dollar"
}