{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:03:16.953409"
  },
  "content": "Singapore-based conglomerateThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Straits Trading Company\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2024)* *(Learn how and when to remove this message)* The **Straits Trading Company Limited** is a [Singapore](/wiki/Singapore)-based corporation with operations in Singapore and [Malaysia](/wiki/Malaysia), as well as various localities in Asia and Australia. Founded in 1887, the company was the result of a partnership for [tin](/wiki/Tin) [smelting](/wiki/Smelting) between James Sword, a [Scottish](/wiki/Scotland) businessman, and Herman Muhlinghaus, a [German](/wiki/Germany) entrepreneur; the Straits Trading Company was later incorporated in Singapore on 8 November 1887 with a hefty capital of S$150,000 during its days. The company eventually rose to become one of the largest tin smelters in the world, operating at tin rich deposits in the [Kinta Valley](/wiki/Kinta_Valley) and [Klang Valley](/wiki/Klang_Valley) of then [British Malaya](/wiki/British_Malaya) ([Peninsular Malaysia](/wiki/Peninsular_Malaysia)). By the late-20th century, the company began diversifying into hotel and [property management](/wiki/Property_management), and financial investment; it also became a member of the Tecity Group. Mining and smelting operations that the Straits Trading Company was originally engaged in were eventually carried out by its 73%-owned subsidiary, the **Malaysia Smelting Corporation Berhad** ([MYX](/wiki/Bursa_Malaysia): 5916), a public listed company on [Bursa Malaysia](/wiki/Bursa_Malaysia). - [Walter Nutt](/wiki/Walter_Nutt), Managing Director of Straits Trading Company (1918-1921) - Sir [John Bagnall](/wiki/John_Bagnall), Chairman and Managing Director of Straits Trading Company (1923-1947) - Official Straits Trading Company website - Official Malaysia Smelting Corporation website This Asian corporation or company article is a stub. You can help Wikipedia by expanding it. - v - t - e This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This Malaysian corporation or company article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:03:16.953131",
  "title": "Straits Trading Company",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Straits_Trading_Company"
}