{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:03:29.564134"
  },
  "content": "Form of educational migration to Singapore **\"Study mama\"** is a [Singaporean](/wiki/Singapore) term describing foreign women who accompany their children to [Singapore](/wiki/Singapore) to benefit from [its education system](/wiki/Education_in_Singapore) by receiving primary and secondary-level education. The study mama phenomenon began around 2000, after the Singaporean government relaxed its immigration policies to allow more foreigners to study or work in the country. Most often, these study mamas are from [mainland China](/wiki/Mainland_China), where they are also known as **péidú māmā** (陪读妈妈), but nationalities from other countries such as [Australia](/wiki/Australia), [Malaysia](/wiki/Malaysia), [South Korea](/wiki/South_Korea) and [Taiwan](/wiki/Taiwan) have also been observed. ## Overview ### Introduction The [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority) (ICA) of Singapore possesses records that suggest that there were at least 10,300 study mamas of various nationalities, with two-thirds of the study mamas in Singapore in July 2005 coming from mainland China. Of these 6,800 study mamas, only 1,500 have been issued work permits. Most working study mamas are employed in the service sector. ### Jobs In an article in China's *[People's Daily](/wiki/People%27s_Daily)*, it is estimated that peidu mamas require [RMB](/wiki/RMB)¥1 million (approx [S$](/wiki/S$)217,000) of living and education expenses for their child to receive education from Primary 1 to Secondary 4 in Singapore. Subsequently, the Singaporean government will allow them to come to Singapore, primarily to accompany their children during their studies here. Peidu mamas are only allowed to obtain work permits after staying in Singapore for a year and are permitted to work in certain service sectors only. ### Restrictions The government places restrictions on the employment of study mamas, arguing that the primary purpose of their stay is to take care of their children. Hence, they should not be working, especially not as [hostesses](/wiki/Hostess_bar) in bars or [pubs](/wiki/Pub) at night. They are not allowed to work at food stalls, but can work in other services industries if a permit was given. - [Kyoiku mama](/wiki/Kyoiku_mama) Portals: - Education - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T12:03:29.563811",
  "title": "Study mama",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Study_mama"
}