{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:03:34.795633"
  },
  "content": "Singaporean entrepreneur **Su Zhu** (born April 1987) is a Singaporean entrepreneur. Alongside his longtime friend and business partner Kyle Davies, he is a founder of the now-defunct [cryptocurrency](/wiki/Cryptocurrency) [hedge fund](/wiki/Hedge_fund) [Three Arrows Capital](/wiki/Three_Arrows_Capital) and a founder of Open Exchange (OPNX), a [cryptocurrency exchange](/wiki/Cryptocurrency_exchange). ## Early life and education Zhu was born in China and moved to the United States at the age of 6. He attended high school at [Phillips Academy](/wiki/Phillips_Academy) in [Andover, Massachusetts](/wiki/Andover,_Massachusetts), graduating in 2005, and graduated [summa cum laude](/wiki/Summa_cum_laude) from [Columbia University](/wiki/Columbia_University) with a bachelor's degree in mathematics. ## Career Zhu moved to Tokyo to trade [derivatives](/wiki/Derivative_(finance)) at [Credit Suisse](/wiki/Credit_Suisse) before working as a trader at [Flow Traders](/wiki/Flow_Traders), a trading shop in Singapore, in 2009. In 2011, he briefly worked as a trader at [Deutsche Bank](/wiki/Deutsche_Bank) in [Hong Kong](/wiki/Hong_Kong). ### Three Arrows Capital In 2012 Zhu and Davies founded Three Arrows Capital (3AC) in San Francisco. The two raised approximately $1 million in [seed capital](/wiki/Seed_money) by borrowing money from their parents. According to Davies in an interview on the podcast *UpOnly*, 3AC had doubled their money within the first two months. In 2013 Zhu and Davies re-registered the hedge fund in Singapore to avoid [capital gains tax](/wiki/Capital_gains_tax). According to *[New York Magazine](/wiki/New_York_(magazine))*, in its early stage, the hedge fund focused on \"arbitraging emerging-market foreign-exchange derivatives.\" This continued until banks cut off 3AC from that market in 2017, which initiated the fund's shift to cryptocurrencies. At its peak in March 2022, 3AC managed an estimated $10 billion in cryptocurrency assets. As a result of popularity among cryptocurrency-related topics, Zhu amassed over 500,000 followers on Twitter (now X) shortly before the fund failed. #### Liquidation On 16 June 2022, the *[Financial Times](/wiki/Financial_Times)* reported that 3AC had failed to meet its [margin calls](/wiki/Margin_call). Six days later, *[The Wall Street Journal](/wiki/The_Wall_Street_Journal)* reported that the 3AC had failed to repay a $665 million [Bitcoin](/wiki/Bitcoin) and [USD Coin](/wiki/USD_Coin) loan to [Voyager Digital](/wiki/Voyager_Digital), another cryptocurrency hedge fund. The same day, a court in the [British Virgin Islands](/wiki/British_Virgin_Islands) ordered the liquidation of 3AC, overseen by [Teneo](/wiki/Teneo). On 2 July 2022, 3AC filed for [Chapter 15 bankruptcy](/wiki/Chapter_15,_Title_11,_United_States_Code) to protect its US assets from creditors. The [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) banned Zhu and Davies from participation in the financial sector for nine years. In an interview with *[Bloomberg](/wiki/Bloomberg_News)* held at an \"undisclosed location\" in July 2022, Zhu and Davies stated that they plan to move to the [United Arab Emirates](/wiki/United_Arab_Emirates), a country that does not have extradition treaties with either Singapore or the United States.[*better source needed*] In June 2023, 3AC liquidators said they were seeking to recover $1.3 billion from Davies and Zhu. According to *[The New York Times](/wiki/The_New_York_Times)*, during the liquidation process, Zhu and Davies were in [Bali](/wiki/Bali), where Zhu attempted surfing and Davies dabbled in painting. Zhu and his family had relocated to Singapore, where they lived in a \"good-class bungalow\" with a \"permaculture farm — an elaborate system of lakes and gardens meant to replicate self-sustaining ecosystems in nature. It’s home to ducks, chickens and numerous types of dragonflies.\" ### OPNX In late 2022, Zhu and Davies started a second venture called Open Exchange (OPNX) based in Hong Kong, which began offering its own cryptocurrency in 2023. ### OX.FUN Exchange In early 2024, Zhu and Davies joined as advisors for the OX.FUN exchange, a platform that aims to merge features of centralized and decentralized exchanges. ### Three Arrowz Capitel ($3AC) Token The founders also been connected to a token project called Three Arrowz Capitel ($3AC), launched in late 2024. The token, structured as a \"memecoin,\" was marketed on various social media platforms and designed with a 1% transaction tax to provide liquidity and incentives for token holders. However, the token’s launch was met with criticism due to its high concentration of insider-held supply and limited liquidity on decentralized exchanges, leading to significant price volatility. ## Arrest and imprisonment In late September 2023, Zhu was arrested at [Changi Airport](/wiki/Changi_Airport) in Singapore, while trying to leave the country. Zhu was arrested pursuant to committal orders which sentenced him to four months in prison for failing to cooperate with the liquidators. Zhu was ultimately imprisoned for three months, and claimed it was a \"really enjoyable experience overall\" in a video published on [X](/wiki/Twitter).\n",
  "language": "en",
  "processed_at": "2026-01-12T12:03:34.795323",
  "title": "Su Zhu (businessman)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Su_Zhu_(businessman)"
}