{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:03:43.839516"
  },
  "content": "Squall line in Sumatra, Indonesia A **Sumatra squall** (plural: Sumatra squalls or **Sumatras**) is a [squall line](/wiki/Squall_line)—a line of [thunderstorms](/wiki/Thunderstorms)—that develops over the [Indonesian](/wiki/Indonesia) island of [Sumatra](/wiki/Sumatra) and moves eastwards over the [Straits of Malacca](/wiki/Straits_of_Malacca), producing heavy rain and gusty winds in [Peninsular Malaysia](/wiki/Peninsular_Malaysia), [Singapore](/wiki/Singapore) and [Riau Islands](/wiki/Riau_Islands), [Indonesia](/wiki/Indonesia). Sumatra squalls typically form in the predawn hours and early morning, and last for a few hours. They may occur at any time of the year, but are most common from April to November, coinciding with the [southwest monsoon](/wiki/Southwest_monsoon) and inter-monsoon periods when the prevailing winds have a greater westerly component. The passage of Sumatra squalls can result in fallen trees, [flash floods](/wiki/Flash_flood), and property damage. Shipping along the Straits of Malacca may also be affected. ## Effects Typically, Sumatra squalls affect Malaysia and Singapore for one to two hours in the night or morning, producing heavy rains along with wind gusts of 40–80 km/h (25–50 mph). The highest recorded wind gust in Singapore—144.4 km/h (89.7 mph) on 25 April 1984, in [Tengah](/wiki/Tengah,_Singapore)—was produced by a Sumatra squall. In 1996, a Sumatra squall caused record-high rainfall and damaging flash floods in [Seberang Perai](/wiki/Seberang_Perai), Malaysia. A particularly severe Sumatra squall that affected Singapore on 12 June 2014 produced a gust of 103.7 km/h (64.4 mph), and resulted in 54 incidents of fallen trees or branches. Another severe Sumatra squall affected Singapore on 10 July 2014, causing flash floods in [Commonwealth](/wiki/Commonwealth,_Singapore) and along a slip road on the [Kranji Expressway](/wiki/Kranji_Expressway). The squall also felled a tree near the [Singapore Institute of Management](/wiki/Singapore_Institute_of_Management). On 17 September 2018, a Sumatra squall impacted the Malaysian state of [Perlis](/wiki/Perlis), killing four and damaging 56 houses and 36 schools. Fallen trees and power outages were also reported. In the evening of 17 September 2024, a Sumatra squall felled several trees across Singapore, damaging vehicles and blocking roads. Loose items were flung around by winds gusting up to 83.2 km/h (51.7 mph), and a glass roof at [UOB Plaza](/wiki/UOB_Plaza) was damaged. Along the [Straits of Malacca](/wiki/Strait_of_Malacca), one of the world's most important shipping lanes, the gusty winds of Sumatra squalls make the narrow strait difficult to navigate, which could result in maritime accidents. A letter published in the *[Quarterly Journal of the Royal Meteorological Society](/wiki/Quarterly_Journal_of_the_Royal_Meteorological_Society)* in 1923 noted that boats in the Straits of Malacca were blown ashore by Sumatra squalls. Sumatra squalls are also responsible for significant lightning activity over the strait. The [wind shear](/wiki/Wind_shear) associated with squalls can pose a risk to nearby aircraft, especially during landing or takeoff, as the [airspeed](/wiki/Airspeed) becomes challenging to control. Accurately predicting the development of Sumatra squalls is difficult as the relatively small size of Sumatra squalls make them difficult for conventional [weather models](/wiki/Weather_model) to resolve. Individual forecasters subjectively assessing the outputs of various regional- and global-scale models and analysing real-time observations can have moderately accurate results, though the process is slow and laborious. ## Frequency A 2016 paper by Lo and Orton used data on 1,337 Sumatra squalls affecting Singapore from January 1988 to December 2009 to compile a climatology of Sumatra squalls. They found that Sumatra squalls occur most commonly during the inter-monsoon periods (April–May and October–November) with an average of seven squalls a month, and slightly less frequently during the southwest monsoon (June–September), with an average of six a month. In comparison, approximately 2.5 squalls per month are observed during the northeast monsoon from December to March. Sumatra squalls observe a clear diurnal pattern and are much more likely to occur in the predawn hours (12 a.m. to 6 a.m. UTC+8) and morning (6 a.m. to 12 p.m. UTC+8); over half the squalls observed made landfall in Singapore between 3 a.m. and 8 a.m. [local time](/wiki/Singapore_Time). Fewer squalls are observed during [El Niño](/wiki/El_Ni%C3%B1o) years, such as 1997 and 2015. This is due to reduced [convection](/wiki/Atmospheric_convection) over the Western Pacific Ocean and Southeast Asia, resulting in a weaker southwest monsoon. Conversely, [La Niña](/wiki/La_Ni%C3%B1a) events may result in more frequent Sumatra squalls. The [Madden–Julian oscillation](/wiki/Madden%E2%80%93Julian_oscillation), despite its influence on thunderstorm activity in the tropics, has no effect on the frequency of Sumatra squalls, though it may serve to enhance their intensity. The presence of [tropical cyclones](/wiki/Tropical_cyclone) over the [South China Sea](/wiki/South_China_Sea) can serve to increase the frequency of Sumatra squalls by shifting the prevailing winds to the west or southwest. ## Life cycle The mechanisms behind the formation and propagation of Sumatra squalls are not well understood, as observations are sparse and there is thus little data to work with. Several hypotheses exist to explain the development of the initial convective cells that later form the Sumatra squall: heating of air parcels at the surface by the warm waters of the Straits of Malacca, [convergence](/wiki/Convergence_zone) of [land breezes](/wiki/Land_breeze) from the east coast of Sumatra and the west coast of [Peninsular Malaysia](/wiki/Peninsular_Malaysia), or [mountain waves](/wiki/Mountain_waves) generated by air flowing down the eastern slopes of the [Barisan Mountains](/wiki/Barisan_Mountains). Once these thunderstorms develop, the presence of vertical [wind shear](/wiki/Wind_shear), caused by contrasting westerlies in the lower [troposphere](/wiki/Troposphere) below an altitude of 4 km (2.5 mi) and easterlies above that, is necessary for the individual cells to organise into and persist as a [squall line](/wiki/Squall_line). After the initial development phase, the Sumatra squall behaves as a typical squall line, with a front-to-rear [jet](/wiki/Jet_(fluid)) characterised by intense [updrafts](/wiki/Updraft) at the squall's leading edge, a [rear-inflow jet](/wiki/Rear-inflow_jet) below the front-to-rear jet transporting air back to the surface, and a cold pool at the surface just behind the leading edge. The Sumatra squall then moves eastwards and grows in size and intensity over the Straits of Malacca, driven by the formation of new convective cells at the squall's leading edge (and not by the prevailing winds). The squall forms a [bow-shape](/wiki/Bow_echo) on [weather radar](/wiki/Weather_radar) as it intensifies, but does not evolve further to a comma-shape as the turning effect of the [Coriolis force](/wiki/Coriolis_force) near the [equator](/wiki/Equator) is too insignificant to generate enough rotation. The squall peaks in intensity near or over Malaysia and Singapore, and becomes more diffuse and disorganised after exiting land, eventually dissipating over the South China Sea. Portals: - Weather - Singapore - Malaysia\n",
  "language": "en",
  "processed_at": "2026-01-12T12:03:43.839211",
  "title": "Sumatra squall",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sumatra_squall"
}