{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:03:57.048124"
  },
  "content": "Austronesian ethnic groupEthnic group**This article contains [Sundanese script](/wiki/Sundanese_alphabet).** Without proper rendering support, you may see [question marks, boxes, or other symbols](/wiki/Specials_(Unicode_block)#Replacement_character) instead of Sundanese characters. The **Sundanese**[c] ([Sundanese](/wiki/Sundanese_language): ᮅᮛᮀ ᮞᮥᮔ᮪ᮓ, romanized: *Urang Sunda*; [Indonesian](/wiki/Indonesian_language): *Orang Sunda*) are an [Austronesian](/wiki/Austronesian_people) [ethnic group](/wiki/Ethnic_group) native to western part of [Java island](/wiki/Java_island) in [Indonesia](/wiki/Indonesia), with the term *Tatar Pasundan* (ᮒᮒᮁ ᮕᮞᮥᮔ᮪ᮓᮔ᮪) which covers most of the administrative areas of the provinces of [West Java](/wiki/West_Java), [Banten](/wiki/Banten), and western part of [Central Java](/wiki/Central_Java). They number approximately 42 million and form [Indonesia's second largest ethnic group](/wiki/Ethnic_groups_in_Indonesia), and the fourth largest in [Southeast Asia](/wiki/Southeast_Asia). They speak the [Sundanese language](/wiki/Sundanese_language), which is part of the [Austronesian languages](/wiki/Austronesian_languages). Sundanese migrants can also be found in [Lampung](/wiki/Lampung), [South Sumatra](/wiki/South_Sumatra), and, to a lesser extent, in [Central Java](/wiki/Central_Java) and [East Java](/wiki/East_Java). The Sundanese people can also be found on several other islands in Indonesia such as [Sumatra](/wiki/Sumatra), [Kalimantan](/wiki/Kalimantan), [Sulawesi](/wiki/Sulawesi), [Bali](/wiki/Bali) and [Papua](/wiki/Papua_(province)). ## Origins ### Migration theories The Sundanese are of [Austronesian](/wiki/Austronesian_peoples) origins and are thought to have originated in [Taiwan](/wiki/Taiwan). They migrated through the Philippines and reached Java between 1,500 BC and 1,000 BC. Nevertheless, there is also a hypothesis that argues that the Austronesian ancestors of contemporary Sundanese people originally came from [Sundaland](/wiki/Sundaland), a massive sunken peninsula that today forms the Java Sea, the Malacca and Sunda Straits and the islands between them. According to a recent genetic study, Sundanese, together with [Javanese](/wiki/Javanese_people) and [Balinese](/wiki/Balinese_people), has a significant admixture of [Austroasiatic](/wiki/Austroasiatic) and [Austronesian](/wiki/Austronesian_peoples) ancestries. ### Origin myth The *[Sunda Wiwitan](/wiki/Sunda_Wiwitan)* belief contains the mythical origin of Sundanese people; [Sang Hyang Kersa](/wiki/Sang_Hyang_Kersa), the supreme divine being in ancient Sundanese belief created seven [bataras](/wiki/Batara_Guru) (deities) in *Sasaka Pusaka Buana* (The Sacred Place on Earth). The oldest of these bataras is called Batara Cikal and is considered the ancestor of the [Kanekes people](/wiki/Baduy_people). The other six bataras ruled various locations in Sunda lands in Western Java. A Sundanese legend of [Sangkuriang](/wiki/Sangkuriang) contains the memory of the prehistoric [ancient lake in Bandung basin](/wiki/Lake_Bandung) highland, which suggest that Sundanese already inhabit the region since the [Mesolithic](/wiki/Mesolithic) era, at least 20,000 years ago.[*citation needed*] Another popular Sundanese proverb and legend mentioned the creation of [Parahyangan](/wiki/Parahyangan) (Priangan) highlands, the heartland of the Sundanese realm; \"When the [hyangs](/wiki/Hyang) (gods) were smiling, the land of Parahyangan was created\". This legend suggested the Parahyangan highland as the playland or the abode of gods, as well as suggesting its natural beauty. ## History ### Hindu-Buddhist Kingdoms era The earliest historical polity that appeared in the Sundanese realm in the Western part of Java was the kingdom of [Tarumanagara](/wiki/Tarumanagara), which flourished between the 4th and 7th centuries. [Hindu](/wiki/Hindu) influences reached the Sundanese people as early as the 4th century AD, as is evident in [Tarumanagara inscriptions](/wiki/Tugu_inscription). The adoption of this dharmic faith in the Sundanese way of life was, however, never as intense as their Javanese counterparts. It seems that despite the central court beginning to adopt Hindu-Buddhist culture and institution, the majority of common Sundanese still retained their native natural and ancestral worship. By the 4th century, the older megalithic culture was probably still alive and well next to the penetrating Hindu influences. Court cultures flourished in ancient times, for example, during the era of [Sunda Kingdom](/wiki/Sunda_Kingdom). However, the Sundanese appear not to have had the resources nor desire to construct large [religious monuments](/wiki/Candi_of_Indonesia). The traditional rural Sundanese method of rice farming, by *ladang* or *[huma](/wiki/Slash-and-burn)* (dry rice farming), also contributed to small populations of sparsely inhabited Sundanese villages. Geographic constraints that isolate each region also led Sundanese villages to enjoy their simple way of life and their independence even more. That was probably the factor that would contribute to the carefree nature, egalitarian, conservative, independent and somewhat individualistic social outlook of the Sundanese people. The Sundanese seems to love and revere their nature in spiritual ways, leading to them adopting some taboos to conserve nature and maintain the ecosystem. The conservative tendency and their somewhat opposition to foreign influences are demonstrated in extreme isolationist measures adopted keenly by Kanekes or [Baduy people](/wiki/Baduy_people). They have rules against interacting with outsiders and adopting foreign ideas, technology, and ways of life. They have also set some taboos, such as not cutting trees or harming forest creatures, to conserve their natural ecosystem. One of the earliest historical records that mention the name \"Sunda\" appears in the [Kebon Kopi II inscription](/wiki/Kebon_Kopi_II_inscription) dated 854 saka (932 AD) discovered in [Bogor](/wiki/Bogor_Regency). In 1225, a Chinese writer named [Chou Ju-kua](/wiki/Chou_Ju-kua), in his book *[Chu-fan-chi](/wiki/Chu-fan-chi)*, describes the port of *Sin-t'o* ([Sunda](/wiki/Sunda_Kingdom)), which probably refers to the port of [Banten](/wiki/Bantam_(city)) or [Kalapa](/wiki/Sunda_Kelapa). By examining these records, it seems that the name \"Sunda\" started to appear in the early 11th century as a Javanese term used to designate their western neighbours. A Chinese source more specifically refers to it as the port of Banten or Sunda Kelapa. After the formation and consolidation of the [Sunda Kingdom](/wiki/Sunda_Kingdom)'s unity and identity during the [Pajajaran](/wiki/Pajajaran) era under the rule of [Sri Baduga Maharaja](/wiki/Sri_Baduga_Maharaja) (popularly known as [King Siliwangi](/wiki/King_Siliwangi)), the shared common identity of Sundanese people was more firmly established. They adopted the name \"Sunda\" to identify their kingdom, their people and their [language](/wiki/Sundanese_language). ### Dutch colonial era Inland Pasundan is mountainous and hilly, and until the 19th century, it was thickly forested and sparsely populated. The Sundanese traditionally live in small and isolated hamlets, rendering control by indigenous courts difficult. The Sundanese, traditionally engage in dry-field farming. These factors resulted in the Sundanese having a less rigid social hierarchy and more independent social manners. In the 19th century, Dutch colonial exploitation opened much of the interior for [coffee](/wiki/Coffee), [tea](/wiki/Tea), and quinine production, and the highland society took on a frontier aspect, further strengthening the individualistic Sundanese mindset. ### Contemporary era There is a widespread belief among Indonesian ethnicities that the Sundanese are famous for their beauty. In his report \"Summa Oriental\" on the early 16th century [Sunda Kingdom](/wiki/Sunda_Kingdom), Portuguese apothecary [Tomé Pires](/wiki/Tom%C3%A9_Pires) mentioned: \"The (Sundanese) women are beautiful, and those of the nobles chaste, which is not the case with those of the lower classes\". Sundanese women are, as the belief goes, one of the most beautiful in the country due to the climate (they have a lighter complexion than other Indonesians) and a diet featuring raw vegetables (they are said to possess especially soft skin). Bandungite ladies, popularly known as *Mojang [Priangan](/wiki/Priangan)* are reputedly pretty, fashion smart and forward-looking. Probably because of this, many Sundanese people today pursue careers in the entertainment industry. ## Language The [Sundanese language](/wiki/Sundanese_language) is spoken by approximately 36 million people in 2010 and is the second most widely spoken regional language in Indonesia. The 2000 Indonesia Census put this figure at 30.9 million. This language is spoken in the southern part of the [Banten](/wiki/Banten) province, and most of [West Java](/wiki/West_Java) and eastwards as far as the [Pamali River](/wiki/Pemali_River) in Brebes, [Central Java](/wiki/Central_Java). Sundanese is also closely related to [Malay](/wiki/Malay_language) and [Minang](/wiki/Minangkabau_language) as it is to Javanese, as seen by the Sundanese utilising different language levels denoting rank and respect – a concept borrowed from the Javanese. It shares similar vocabularies with Javanese and Malay. There are several dialects of Sundanese, from the Sunda–Banten dialect to the Sunda–Cirebonan dialect in the eastern part of West Java until the western part of Central Java Province. Some of the most distinct dialects are from Banten, Bogor, Priangan, and Cirebon. In Central Java, Sundanese is spoken in some of the Cilacap region and some of the Brebes region. It is known that the most refined Sundanese dialect — which is considered as its original form – are those spoken in Ciamis, Tasikmalaya, Garut, Bandung, Sumedang, Sukabumi, and especially Cianjur (The dialect spoken by people living in Cianjur is considered as the most refined Sundanese). The dialect spoken on the north coast, Banten and Cirebon are considered less refined, and the language spoken by [Baduy people](/wiki/Baduy_people) is considered the archaic type of Sundanese language, before the adoption of the concept of language stratification to denote rank and respect as demonstrated (and influenced) by [Javanese](/wiki/Javanese_language). Today, the Sundanese language is primarily written in [Latin script](/wiki/Latin_script). However, there is an effort to revive the [Sundanese script](/wiki/Sundanese_script), which was used between the 14th and 18th centuries. For example, street names in Bandung and several cities in West Java are now written in both Latin and Sundanese scripts. ## Religion The initial religious systems of the Sundanese were [animism](/wiki/Animism) and [dynamism](/wiki/Dynamism_(metaphysics)) with reverence to ancestral (*karuhun*) and natural spirits identified as *[hyang](/wiki/Hyang)*, yet bears some traits of [pantheism](/wiki/Pantheism). The best indications are found in the oldest epic poems (*wawacan*) and among the remote [Baduy](/wiki/Baduy_people) tribe. This religion is called *[Sunda Wiwitan](/wiki/Sunda_Wiwitan)* (\"early Sundanese\"). The [rice](/wiki/Rice) agriculture had shaped the culture, beliefs and ritual system of traditional Sundanese people, among other the reverence to [Nyai Pohaci Sanghyang Asri](/wiki/Dewi_Sri) as the goddess of rice and fertility. The land of Sundanese people in western Java is among the earliest places in the Indonesian archipelago that were exposed to Indian Hindu-Buddhist influences. [Tarumanagara](/wiki/Tarumanagara) followed by [Sunda Kingdom](/wiki/Sunda_Kingdom) adopted [Hinduism](/wiki/Hinduism) as early as the 4th century. The [Batujaya](/wiki/Batujaya_Archaeological_Site) [stupa](/wiki/Stupa) complex in Karawang shows Buddhist influences in West Java, while [Cangkuang](/wiki/Cangkuang) Shivaic temple near [Garut](/wiki/Garut) shows Hindu influence. The 16th-century sacred text [Sanghyang siksakanda ng karesian](/wiki/Sanghyang_siksakanda_ng_karesian) contains the religious and moral rules, guidance, prescriptions and lessons for ancient Sundanese people. Around the 15th to 16th centuries, [Islam](/wiki/Islam) began to spread among the Sundanese people by Indian Muslim traders, and its adoption accelerated after the fall of the Hindu-animist [Sunda Kingdom](/wiki/Sunda_Kingdom) and the establishment of the Islamic Sultanates of [Banten](/wiki/Banten_Sultanate) and [Cirebon](/wiki/Sultanate_of_Cirebon) in coastal West Java. Numerous [ulama](/wiki/Ulama) (locally known as \"[kyai](/wiki/Kyai)\") penetrated villages in the mountainous regions of [Parahyangan](/wiki/Parahyangan) and established mosques and schools ([pesantren](/wiki/Pesantren)) and spread the Islamic faith amongst the Sundanese people. Small traditional Sundanese communities retained their indigenous social and belief systems, adopting self-imposed isolation, and refused foreign influences, proselytism and [modernisation](/wiki/Modernisation) altogether, such as those of the [Baduy](/wiki/Baduy_people) (Kanekes) people of inland [Lebak Regency](/wiki/Lebak_Regency). Some Sundanese villages such as those in Cigugur Kuningan retained their [Sunda Wiwitan](/wiki/Sunda_Wiwitan) beliefs, while some villages such as [Kampung Naga](/wiki/Kampung_Naga) in Tasikmalaya, and Sindang Barang Pasir Eurih in Bogor, although identifying themselves as Muslim, still uphold pre-Islamic traditions and taboos and venerated the *karuhun* (ancestral spirits). Today, most Sundanese are [Sunni](/wiki/Sunni_Islam) Muslims. Part of a series onReligion of [Java](/wiki/Java)Java - [Java](/wiki/Java) - [Javanese culture](/wiki/Javanese_culture) - [Javanese people](/wiki/Javanese_people) - [Sundanese culture](/wiki/Sundanese_culture) - Sundanese people - [Religion in Indonesia](/wiki/Religion_in_Indonesia) Early religiosity - [Dewi Sri](/wiki/Dewi_Sri) - [Hyang](/wiki/Hyang) - [Kapitayan](/wiki/Kapitayan) - [Sunda Wiwitan](/wiki/Sunda_Wiwitan) Hinduism - [Hinduism in Java](/wiki/Hinduism_in_Java) Buddhism - [Buddhism in Indonesia](/wiki/Buddhism_in_Indonesia) - [Sanghyang Adi Buddha](/wiki/Sanghyang_Adi_Buddha) - [Ashin Jinarakkhita](/wiki/Ashin_Jinarakkhita) Islam - [Spread of Islam in Indonesia](/wiki/Spread_of_Islam_in_Indonesia) - [Santri](/wiki/Santri) - [Abangan](/wiki/Abangan) - [Wali Sanga](/wiki/Wali_Sanga) - [Kyai](/wiki/Kyai) - [Muhammadiyah](/wiki/Muhammadiyah) - [Nahdlatul Ulama](/wiki/Nahdlatul_Ulama) Kebatinan - [Kebatinan](/wiki/Kebatinan) - [Subud](/wiki/Subud) - [Aliran kepercayaan](/wiki/Aliran_kepercayaan) Christianity - [Christianity in Indonesia](/wiki/Christianity_in_Indonesia) - [Divine Word Missionaries](/wiki/Divine_Word_Missionaries) - [Ganjuran Church](/wiki/Ganjuran_Church) - v - t - e After western Java fell under the control of [Dutch East India Company](/wiki/Dutch_East_India_Company) (VOC) in the early 18th century, and later under the [Dutch East Indies](/wiki/Dutch_East_Indies), [Christian](/wiki/Christianity) evangelism towards the Sundanese people was started by missionaries of Genootschap voor In- en Uitwendige Zending te Batavia (GIUZ). This organisation was founded by Mr F. L. Anthing and Pastor E. W. King in 1851. However, it was Nederlandsche Zendelings Vereeniging (NZV) that sent their missionaries to convert the Sundanese peoples. They started the mission in Batavia, later expanding into several towns in [West Java](/wiki/West_Java) such as [Bandung](/wiki/Bandung), [Cianjur](/wiki/Cianjur), [Cirebon](/wiki/Cirebon), [Bogor](/wiki/Bogor) and [Sukabumi](/wiki/Sukabumi). They built schools, churches and hospitals for native people in West Java. Compared to the large Sundanese Muslim population, the numbers of Christian Sundanese are scarce. Today, Christians in West Java are mostly [Chinese Indonesians](/wiki/Chinese_Indonesian) residing in West Java, with only small numbers of native Sundanese Christians. [Pasundan Christian Church](/wiki/Pasundan_Christian_Church) is an example of the ethnic church. In contemporary Sundanese social and religious life, there is a growing shift towards [Islamism](/wiki/Islamism), especially amongst urban Sundanese. Compared to the 1960s, many Sundanese Muslim women today have decided to wear [hijab](/wiki/Hijab). The same phenomenon was also found earlier in the [Malay community](/wiki/Ethnic_Malays) in Sumatra and Malaysia. Modern history saw the rise of political Islam through the birth of [Darul Islam Indonesia](/wiki/Darul_Islam_(Indonesia)) in Tasikmalaya, West Java, back in 1949, although this movement was later cracked down by the Indonesian Republic. In modern contemporary political landscapes, the Sundanese realm in West Java and Banten also provides widespread support for Islamic parties such as the [Prosperous Justice Party](/wiki/Prosperous_Justice_Party) (PKS) and the [United Development Party](/wiki/United_Development_Party) (PPP). There are numbers of Sundanese ulama and Islamic preachers who have been successful in gaining national popularity, such as Kyai [Abdullah Gymnastiar](/wiki/Abdullah_Gymnastiar), Ustadz [Adi Hidayat](/wiki/Adi_Hidayat) and [Mamah Dedeh](/wiki/Mamah_Dedeh) who have become TV personalities through their *dakwah* show. There is an increasing number of Sundanese people who consider the [Hajj](/wiki/Hajj) (pilgrimage to Mecca) as something that enjoys social prestige. On the other hand, there is also a movement led by the minority Sundanese conservative traditionalist *adat*, the *[Sunda Wiwitan](/wiki/Sunda_Wiwitan)* community, who are struggling to achieve wider acceptance and recognition of their faith and way of life. ## Culture ### Family and social relations Sundanese culture is similar to that of Javanese culture. However, it differs in that it has a much less rigid system of social hierarchy. The Sundanese, in their mentality and behavior, greater egalitarianism and antipathy to yawning class distinctions, and community-based material culture, differ from the feudal hierarchy apparent among the people of Javanese principalities. Central Javanese court culture nurtured an atmosphere conducive to elite, stylised, impeccably polished forms of art and literature. Sundanese culture bore few traces of these traditions. Culturally, the Sundanese people adopt a [bilateral kinship system](/wiki/Bilateral_descent), with male and female descent of equal importance. In Sundanese families, the important rituals revolved around life cycles, from birth to death, adopting many previous Animist and Hindu-Buddhist, as well as Islamic, traditions. For example, during the seventh month of pregnancy, there is a prenatal ritual called *Nujuh Bulanan* (identical to [Naloni Mitoni](/wiki/Naloni_Mitoni) in Javanese tradition) which traces its origins to Hindu ritual. Shortly after the birth of a baby, a ritual called *Akekahan* (from Arabic word: [Aqiqah](/wiki/Aqiqah)) is performed; an Islamic tradition in which the parents slaughter a goat for a baby girl or two goats for a baby boy, the meat later being cooked and distributed to relatives and neighbors. The [circumcision](/wiki/Circumcision) ceremony is performed on prepubescent boys and celebrated with Sisingaan (lion) dance. The wedding ceremony is the highlight of Sundanese family celebration involving complex rituals from *naroskeun* and *neundeun omong* (marriage proposal and agreement conducted by parents and family elders), *siraman* (bridal shower), *seserahan* (presenting wedding gifts for the bride), *akad nikah* (wedding vows), *saweran* (throwing coins, mixed with flower petals and sometimes also candies, for the unmarried guests to collect and believed to bring better luck in romance), *huap lingkung* (bride and groom feed each other by the hand, with arms entwined to symbolize love and affection), *bakakak hayam* (bride and groom ripping a grilled chicken through holding each of its legs; a traditional way to determine which one will dominate the family which is the one that gets the larger or head part), and the wedding feast inviting whole family and business relatives, neighbours, and friends as guests. Death in a Sundanese family is usually performed through a series of rituals in accordance with traditional Islam, such as the *pengajian* (reciting Al Quran) including providing *berkat* (rice box with side dishes) for guests. The Koranic recitation is performed daily, from the day of death through the seventh day following; later performed again on the 40th day, a year, and the 1,000th day after the passing. This tradition today, however, is not always closely and faithfully followed since growing numbers of Sundanese are adopting a less traditional Islam which does not maintain many of the older traditions.[*citation needed*] ### Artforms\n",
  "language": "en",
  "processed_at": "2026-01-12T12:03:57.047869",
  "title": "Sundanese people",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sundanese_people"
}