{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:03:55.142367"
  },
  "content": "Sundanese diaspora in SingaporeEthnic group **Sundanese Singaporeans** is a small group of [Sundanese people](/wiki/Sundanese_people) in the part of [Indonesian diaspora](/wiki/Indonesian_diaspora) who are classified as [Malay nation/race](/wiki/Singaporean_Malays) according to the population census by [Government of the Republic of Singapore](/wiki/Singapore). Their original territory came from the western part of [Java Island](/wiki/Java_Island) in [Indonesia](/wiki/Indonesia) which currently includes [West Java](/wiki/West_Java), [Banten](/wiki/Banten), [Jakarta](/wiki/Jakarta), and a western part of [Central Java](/wiki/Central_Java) ([Brebes](/wiki/Brebes_Regency) and [Cilacap](/wiki/Cilacap_Regency)). ## Population At the beginning of the 21st century, there were not many Singaporeans who still had [Sundanese](/wiki/Sundanese_people) ancestry. They are also not the first descendants, in the sense that they have experienced a lot of mixing with other ethnic groups, especially the mainstream [Malay people](/wiki/Singaporean_Malays). In Singapore, they are classified as the Malay nation/race. Singapore constitutionally recognizes four different nations/races, namely [Chinese](/wiki/Chinese_Singaporeans), Malays, [Indians](/wiki/Indians_in_Singapore), and [Eurasian](/wiki/Eurasian_Singaporeans). According to a Sundanese descendant in Singapore, Zachry Hasard (40), it is estimated that the number of Sundanese people or their descendants was only around 500 to 600 people in 2003. Even then, most of them are no longer of pure Sundanese descent. Of this number, the majority come from the East Priangan area which includes [Garut](/wiki/Garut), [Tasikmalaya](/wiki/Tasikmalaya), [Kuningan](/wiki/Kuningan_Regency), and [Majalengka](/wiki/Majalengka). Their ancestors first arrived in Singapore, mostly working as traders. This is because the Sundanese people from the East Priangan region are known as tenacious traders. Meanwhile, from the West Priangan area, such as [Bandung](/wiki/Bandung), [Cianjur](/wiki/Cianjur), [Sukabumi](/wiki/Sukabumi), [Bogor](/wiki/Bogor), and also from [Banten](/wiki/Banten), most of them work as *ambtenar* (government employees). However, it cannot be ignored that most of the population of the [Priangan](/wiki/Priangan) region at the beginning of the 20th century also worked as farmers. Currently, their professions are not much different from those of the general population of Singapore. Among them are private employees, government employees, traders, and various other professions. ## Language and culture Currently, not many Sundanese descendants are able to speak [Sundanese language](/wiki/Sundanese_language) or at least understand it. Nevertheless, the awareness and interest in the language and culture of their ancestors by Sundanese descendants can be said to be quite positive. This can be seen from the active participation of the Sundanese descendants in the [Sundanese gamelan](/wiki/Sundanese_gamelan) and [pencak silat](/wiki/Pencak_silat) arts groups called \"Sunda Padjadjaran\". In preserving the cultural heritage of their ancestors, most of them are descendants of the three Sundanese people in Singapore, is quite serious about training and at certain times also brings in trainers who come directly from [West Java](/wiki/West_Java), Indonesia. This is intended to provide a stronger Sundanese character, because it can be said that the Sundanese community in Singapore, today it has become Malay, both in terms of language, art, and culture. The gamelan group \"Sunda Padjadjaran\" in Singapore was founded in 1948, pioneered by Zachry Hasard's parents. Its development did experience difficult times, but it finally became active again and its management was reorganized since the end of the 1980s. At this time, apart from practicing for the scope of Sundanese descent events only. The \"Sunda Padjadjaran\" gamelan group often performs at various special events, especially weddings, then also appeared in events sponsored by the government and private parties. ## Religion Like other ethnic groups classified as Malay nation/race by the Government of the Republic of Singapore, Most or almost all of the Sundanese people in Singapore followed to [Sunni Islam](/wiki/Sunni_Islam). In the text of the manuscript *Raden Demang Panji Nagara*, which is contained in the *Van Ronkel Catalog*, it is said that a Sundanese nobleman descended from the [Sumedang Larang](/wiki/Sumedang_Larang_Kingdom) in [Sumedang](/wiki/Sumedang_Regency) went to perform the [hajj](/wiki/Hajj) pilgrimage in [Mecca](/wiki/Mecca) together with 24 of his followers. They departed on 14 August 1852 from Sumedang heading to [Cirebon](/wiki/Cirebon) via the Tomo village. From [Port of Cirebon](/wiki/Port_of_Cirebon), the group anchored in [Singapore](/wiki/Singapore) via [Muntok](/wiki/Muntok) in [Bangka](/wiki/Bangka_Island) and [Riau](/wiki/Riau). From Singapore, which was then a [British colony](/wiki/British_Malaya), they continued their journey on an Arab ship carrying around 250 pilgrims. - [Sundanese people](/wiki/Sundanese_people) - [Demographics of Singapore](/wiki/Demographics_of_Singapore) - [Indonesian diaspora](/wiki/Indonesian_diaspora) - Komunitas Orang Sunda di Singapore on [Facebook](/wiki/Facebook)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:03:55.142071",
  "title": "Sundanese Singaporeans",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sundanese_Singaporeans"
}