{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:04:09.635229"
  },
  "content": "River **Sungei Serangoon**[note 1] ([Malay](/wiki/Malay_language) for **Serangoon River**; [Chinese](/wiki/Simplified_Chinese): 实龙岗河) is a [river](/wiki/River) in the [north-eastern](/wiki/North-East_Region,_Singapore) part of Singapore. The 8-kilometre river starts as a [canal](/wiki/Canal) near Tampines Road, and flows through [Hougang](/wiki/Hougang), where it is joined by tributary Sungei Pinang just before [Sengkang](/wiki/Sengkang), before flowing towards [Lorong Halus](/wiki/Lorong_Halus), where it is joined by another tributary Sungei Blukar, before emptying into the [Serangoon Harbour](/wiki/Serangoon_Harbour). The river is also known as the Serangoon Estuary. Since 2011, the river has been converted into a reservoir - Serangoon Reservoir. ## Ecology Although sections of the river have been canalized at Hougang and Lorong Halus, wildlife at the river is relatively unaffected. Birds like [herons](/wiki/Heron), [terns](/wiki/Tern), [kingfishers](/wiki/Kingfisher) can still be found at the river. The area near Lorong Halus is considered one of the best [bird-watching](/wiki/Bird-watching) spots in Singapore. [Monitor lizards](/wiki/Monitor_lizard) and sometimes [otters](/wiki/Otter) can also be found near the [banks](/wiki/Bank_(geography)). The stretch of the river near Hougang has a 2.2 km [jogging](/wiki/Jogging) track (known as the Serangoon Park Connector) running along its western bank. Although this stretch is close to residential areas, a variety of garden, grassland and estuarine birds can still be found there. ## Developments A number of development projects at Sungei Serangoon had been carried out, which include the construction of an overhead bridge linking Old Tampines Road and the [KPE expressway](/wiki/Kallang%E2%80%93Paya_Lebar_Expressway) to Sengkang and the metal bridge linking Punggol East and Lorong Halus. Originally slated to be completed in 2009, another significant project was the damming of the [estuary](/wiki/Estuary) of Sungei Serangoon to form a [reservoir](/wiki/Water_reservoir) in 2011. - [Serangoon](/wiki/Serangoon) - [Sungei Punggol](/wiki/Sungei_Punggol) ## Notes 1°24′03″N 103°55′49″E﻿ / ﻿1.40083°N 103.93028°E﻿ / 1.40083; 103.93028 This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:04:09.634961",
  "title": "Sungei Serangoon",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sungei_Serangoon"
}