{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:04:07.285203"
  },
  "content": "Planning Area in North Region, Singapore **Sungei Kadut** ([IPA](/wiki/International_Phonetic_Alphabet): /ˈsʊŋaɪ ˌkɑːdoʊt, -ʊt/ *SUUNG-eye KAH-doht* or *KAH-duut*, Malay pronunciation: [suŋai kadot̚]) is an industrial estate and [planning area](/wiki/Planning_Areas_of_Singapore) located in the [North Region](/wiki/North_Region,_Singapore) of [Singapore](/wiki/Singapore). It is bounded by [Bukit Panjang](/wiki/Bukit_Panjang) and [Choa Chu Kang](/wiki/Choa_Chu_Kang) to the south, [Mandai](/wiki/Mandai) to the east, as well as [Lim Chu Kang](/wiki/Lim_Chu_Kang) and the [Western Water Catchment](/wiki/Western_Water_Catchment) to the west. Its northern boundary is defined by the [Straits of Johor](/wiki/Straits_of_Johor). Sungei Kadut is divided into five [subzones](/wiki/Subzones_of_Singapore), namely [Kranji](/wiki/Kranji), Turf Club, Gali Batu, Pang Sua and Reservoir View. ## Etymology and history In the [Malay language](/wiki/Malay_language), *Sungei* (alternative form of standard *sungai*) refers to river and *Kadut* refers to sack cloth. In the 1900s, around Sungei Kadut is a [mangrove swamp](/wiki/Mangrove_swamp) that stretches to the now [Kranji Reservoir](/wiki/Kranji_Reservoir). During [World War II](/wiki/World_War_II), Sungei Kadut was one of the first sites where the Japanese soldiers entered Singapore. It was later developed into an industrial site. In the 1970s and 1980s, furniture making and milling factories sprung across the estate. These clusters of factories housing perishable combustibles subsequently became a source of fire hazard in the region and a fire post was set up in the region. Several years ago, blazing fires had even caused MRT trains along [North South MRT line](/wiki/North_South_MRT_line) to stop operation. On August 3, 2008, the worst blaze occurred in a factory. Initial attempts to control the blaze failed as it spread to several stacks of wooden pellets and tires nearby. It took more than 4 hours and 100 firemen to put out the fire. As several factories were not insured, many companies suffered huge losses. ### Redevelopment plans In 2025, [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lawrence Wong](/wiki/Lawrence_Wong) announced the redevelopment of the [Singapore Turf Club](/wiki/Singapore_Turf_Club) site during the 2025 National Day rally. Under these plans, the 130-hectare plot will be redeveloped into a new estate, with an estimated total number of 14,000 homes. The new estate will be served by [Kranji MRT station](/wiki/Kranji_MRT_station) and a new MRT station, the [Sungei Kadut MRT station](/wiki/Sungei_Kadut_MRT_station), which is expected to be operational by 2035. ## Transportation [Kranji station](/wiki/Kranji_MRT_station) on the [North–South Line](/wiki/North%E2%80%93South_Line_(Singapore)) (NSL) is currently the only station serving the vicinity. The future [Sungei Kadut](/wiki/Sungei_Kadut_MRT_station) station on the NSL and [Downtown Line](/wiki/Downtown_Line) (DTL), and an [unnamed station](/wiki/DE1_MRT_station) on the DTL, are planned to open in 2035. Currently, [SMRT](/wiki/SMRT_Buses) Bus Service 925 serves the Sungei Kadut Industrial Estate, which operates from [Woodlands](/wiki/Woodlands_Temporary_Bus_Interchange) to [Choa Chu Kang Bus Interchange](/wiki/Choa_Chu_Kang_Bus_Interchange) daily except for Sundays and public holidays. Other services that passes by Woodlands Road include 160, 170, 170A, 178, 927, 960, 961 & 961M. ## Facilities Sungei Kadut is predominantly an industrial area and as such, there are very few housing and amenities. The area was formerly well-known for horse-racing, with the [Singapore Turf Club](/wiki/Singapore_Turf_Club) located adjacent to Kranji MRT station. The Singapore Turf Club will cease operations in March 2027 due to demand of land for housing and other projects, with its final race held on 5 October 2024. The land will be returned to the government by 2027. There is also a go-kart arena, KF1 Karting Circuit in the turf club area. Kranji War Memorial is a notable attraction in the area, located to the west of the Turf Club. The memorial is maintained by the [Commonwealth War Graves Commission](/wiki/Commonwealth_War_Graves_Commission) The only housing estate in Sungai Kadut is Jalan Rasok, located to the south of the Kranji War Memorial. It is a small estate consisting only of landed properties and there are no public housing in the area. Besides landed properties, there are also a few migrant worker dormitories in the area, notably Westlite Mandai, Westlite Kranji Way and Kranji Lodge 1. There is also a recreation centre for migrant workers. Sungei Kadut also houses the [Gali Batu MRT Depot](/wiki/Gali_Batu_Depot). Operated by [SBS Transit](/wiki/SBS_Transit), it is the main stabling and maintenance facility for [Downtown line](/wiki/Downtown_Line) trains. There is a namesake bus terminal in its premises, operated by [SMRT Buses](/wiki/SMRT_Buses). The bus terminal is currently out of bounds to the general public. There is also a Gali Batu bus depot currently under construction and is expected to replace the existing [Kranji Bus Depot](/wiki/Kranji_Bus_Depot).\n",
  "language": "en",
  "processed_at": "2026-01-12T12:04:07.284888",
  "title": "Sungei Kadut",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sungei_Kadut"
}