{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:04:14.183333"
  },
  "content": "Leading Singaporean tort and contract law case**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)*This article **has an unclear citation style**. The references used may be made clearer with a different or consistent style of citation and footnoting. *(February 2023)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Sunny Metal & Engineering Pte Ltd v Ng Khim Ming Eric** 3 SLR(R) 782 is a leading case in the Singapore law of contract and tort. It clarified the law of causation in tort, outlined the test for causation in contract as being the same as the but-for test in tort, and considered when the doctrine of [res ipsa loquitur](/wiki/Res_ipsa_loquitur) may apply. ## Facts Sunny Metal & Engineering Pte Ltd is a company that intended to build a new factory in 1994. It engaged a contractor to do so, with Eric Ng as a project architect. A [design-and-build contract](/wiki/Design%E2%80%93build) was entered into by Sunny Metal and the contractor, which detailed one of Ng's responsibilities as an architect as \"assist[ing] the Superintending Officer in the supervision of the Works\" (cl 12A). Additionally, cll 17A and s 17B of the contract respectively stipulated that \"[t]he Contractor shall programme and complete the Works... in such a manner that the Contractor's Architect can apply and obtain for the Employer a Temporary Occupation Permit\" and \"[t]he Contractor shall effect and complete any amendment required by the relevant authorities and... ensure that the Architect apply and obtain the Certificate of Statutory Completion...\" An indemnity deed was also signed between Sunny Metal and Ng, with cl 1 stipulating that Ng had to \"exercise reasonable skill, care and diligence *in the performance of their duties* to the Contractor and/or the Employer\". Prior to and during construction, Ng also adopted a number of responsibilities, including the chairmanship of meetings, monitoring of project work, and liaison with the contractor regarding a conflict of interest issue. Eventually, due to delays, SME terminated the contract and sued Ng for breach of contract and negligence. The contractor was liquidated in 2000. SME contended that Ng owed multiple duties in addition to his work as an architect, specifically: 1. An implied contractual additional duty to monitor and supervise the works, and procure documents required for a temporary occupation permit, given that the construction of cl 1 of the deed, and that he had adopted various responsibilities during prior to and during construction; 2. A tortious professional duty of care to monitor and supervise the works, and procure said documents. ## Judgment The case was heard before the [High Court](/wiki/High_Court_of_Singapore) but was later appealed to the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore). On the first issue, the trial court had found that Ng had adopted a duty under cl 1 for three reasons: > First, the trial judge held that the purpose of cl 1 could not be to merely reiterate the limited duties which Eric Ng owed to SME as a QP since, if this were the correct interpretation, cl 1 would not have any real effect and would be an exercise in \"legal redundancy and futility\" (at and ). Secondly, the trial judge found that the context under which the third D&B contract was entered into between SME and PMC, including the discomfort SME felt in entering into the said contract, showed \"why [SME] wanted the *additional* (legal) protection afforded by the Deed\" [emphasis in original] (at ). Thirdly, the trial judge also relied on the fact that Eric Ng had performed various duties that clearly went beyond the narrow scope of duties he alleged he had assumed, including carrying out various administrative roles... On appeal, the court rejected this finding, ruling that cl 1 was merely meant to create a legal relationship between Ng and Sunny Metal, serving as a collateral warranty that allowed Sunny Metal the contractual privity to sue Ng if Ng did not perform his duties. It did not confer upon Ng any additional duties. The court arrived to this conclusion considering the context in which the contract was entered into. On the second issue in negligence, the court found that Ng did not owe an additional tortious duty of care to Sunny Metal, as there was no proximity between Sunny Metal and Ng. As the court previously found that the deed did not impose additional responsibilities on Ng, they concluded that the deed did not also impose duties in tort. The court also considered whether a tortious duty existed notwithstanding the deed not imposing additional duties. They found that no such duty existed, as Sunny Metal did not rely on Ng, for there was already a project coordinator who Sunny Metal relied upon to supervise the project. Apart from a finding of duty, the court considered if there was causation between Ng's purported breach and the losses incurred by Sunny Metal. They found no causation. The court arrived at this conclusion by first differentiating causation and remoteness as two separate legal concepts. Causation as a concept was further differentiated into \"causation in fact\" and \"causation in law\", the former being an inquiry of \"cause and effect\" and the latter being an inquiry of whether a causer of an event should be held legally responsible for their actions. Legal causation may not be found if there is a *novus actus interveniens*. As for remoteness, the court found that the test for establishing if an effect was sufficiently remote from a cause would be that of reasonable foreseeability. Considering the present facts, the court noted that the \"but for\" test of causation would apply in issues of both contract and tort. They found that there was no causation on the \"but for\" test. The court also considered whether a reversel of the burden of proof would be appropriate in the present case. The court ruled that whilst \"an inference of causation may be drawn even in the absence of affirmative scientific evidence of causation, or where the claimant's evidence of causation is minimal\", the present case was not one where the burden of proof could be reversed for \"the claimant, defendant, and harm were not indeterminate\". ## Significance Justice [Andrew Phang](/wiki/Andrew_Phang) in the High Court's judgment had attempted to reconcile the competing English cases of [Caparo](/wiki/Caparo_Industries_plc_v_Dickman) and [Anns](/wiki/Anns_v_Merton_LBC) in the judgment, but [V. K. Rajah](/wiki/V._K._Rajah) in the Court of Appeal left the matter open, only for the test to be conclusively decided by Phang in the appeals case of [Spandeck v Defence Science and Technology Agency](/wiki/Spandeck_Engineering_v_Defence_Science_and_Technology_Agency). The High Court judgment was one of Phang's attempts at resolving the test of tortious duty in Singapore, and has remained influential in a number of academic articles, particularly in reference to understanding the Spandeck judgment. Phang's original judgment, before it was overturned, was noted to have been the first case in which \"a design professional employed by a contractor owes a duty of care to the employed under a design-and-build contract and that his duty is owed until the completion of works.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:04:14.183035",
  "title": "Sunny Metal & Engineering Pte Ltd v Ng Khim Ming Eric",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sunny_Metal_%26_Engineering_Pte_Ltd_v_Ng_Khim_Ming_Eric"
}