{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:04:16.366188"
  },
  "content": "Indonesian mutton soup dish **Sup kambing** or **sop kambing** ([Indonesian](/wiki/Indonesian_language) and [Malay](/wiki/Malay_language) for '[goat](/wiki/Goat_meat) [soup](/wiki/Soup)') is a [Southeast Asian](/wiki/Southeast_Asian) [mutton](/wiki/Mutton) [soup](/wiki/Soup), commonly found in [Brunei Darussalam](/wiki/Bruneian_cuisine), [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysian_cuisine), [Singapore](/wiki/Singaporean_cuisine). It is prepared with [goat meat](/wiki/Goat_meat), tomato, celery, [spring onion](/wiki/Spring_onion), ginger, [candlenut](/wiki/Candlenut) and lime leaf, its broth is yellowish in colour. *Sup kambing* is quite widespread as numbers of similar goat meat soup recipes can be found throughout Malaysia, Indonesia and Singapore. In Indonesia, it is mostly associated with [Malay](/wiki/Malay_cuisine) of [Medan](/wiki/Medan), [Betawi](/wiki/Betawi_cuisine) and [Madurese cuisine](/wiki/Madurese_cuisine), although it is also common in Java. Nevertheless, [Javanese](/wiki/Javanese_cuisine) are more likely to cook their goat meat as *[tongseng](/wiki/Tongseng)* or Javanese-style soupy *[gulai](/wiki/Gulai)* instead. Traditionally, *sup kambing* together with *gulai* and *[sate kambing](/wiki/Sate_kambing)* are quite widespread during [Eid al-Adha](/wiki/Eid_al-Adha), as large amount of goat meat and offals being distributed among people. In Malaysia, *sup kambing* is also associated with the Muslim [Malaysian Indian](/wiki/Malaysian_Indian_cuisine) community and believed to be of Indian origin. In Singapore, the dish is also associated with the Muslim [Indian community](/wiki/Indian_Singaporeans) of the island. ## History Despite its wide popularity in [Maritime Southeast Asia](/wiki/Maritime_Southeast_Asia), the question of origin however, might be owed to the Arabs and Muslim Indian migrations into the region. *Sup kambing* is believed to be of Arab origin, brought by the influx of [Arabs](/wiki/Arab_Indonesians) migrants into the [Malay Archipelago](/wiki/Malay_Archipelago) between the 18th century to 19th century, during [colonial era](/wiki/Dutch_East_Indies). The Arabs settlers introduced and promoted [goat](/wiki/Goat_meat), [lamb and mutton](/wiki/Lamb_and_mutton) as their preferred meat, thus several dishes influenced by Arab and Muslim Indian culinary traditions were introduced to Sumatra, Malay peninsula and Java. Around the same period, other mutton or goat-based dishes such as *[sate kambing](/wiki/Sate_kambing)*, *[gulai](/wiki/Gulai) kambing* and *[tongseng](/wiki/Tongseng)* also appeared in [Java](/wiki/Java). The early Arab immigrants settled in coastal towns of Sumatra and Java, and subsequently influenced the culture of native ethnic groups including [Malays](/wiki/Malay_Indonesian), the [Betawis](/wiki/Betawi_people) of Batavia (Jakarta), also [Javanese](/wiki/Javanese_people) and [Madurese](/wiki/Madurese_people) of East Java. The *sup kambing* was adopted by locals, and often linked to the Islamic festival of *kurban* (Eid al-Adha), where large numbers of cattle – including goats, are slaughtered and distributed among people. As the result, despite its Arab origin, today in Indonesia *sup kambing* is more associated with Malay, Madurese, and Betawi cuisine. Indonesian *sup kambing* uses carrot, tomato, and sometimes potato, which hints its European (possibly Portuguese or Dutch) influences. Tomato and potato are not available in Southeast Asia until European colonials brought them from the Americas around the 17th century. The *sup kambing* from [Medan](/wiki/Medan) in North Sumatra however, is closer to the Malaysian version, since they commonly derived from Muslim Indian culture. In [Malay Peninsula](/wiki/Malay_Peninsula) region, which today includes Malaysia and Singapore, the most popular version is *sup kambing Mamak* which is believed to have been invented by the Muslim [Indian community](/wiki/Malaysian_Indian) there, where the use of typical spices is quite notable. There is no exact equivalent of this soup in Indian sub-continent, although the spices used and the style of cooking clearly demonstrates Indian influence. The most famous *sup kambing* in Singapore is the *sup tulang merah* which was invented by Baharudeen, Abdul Hameed (mammaka) and Abdul Kadir who were migrants from a remote village Thopputhurai in Tamilnadu. These three shops are located at Jalan Sultan, Beach Road. The dish is also adopted by native [Malays](/wiki/Ethnic_Malays) in both countries. ## Ingredients There are many versions of *sup kambing* recipes, however there are two main groups of *sup kambing* traditions; the Indonesian version are derived mainly from Arab, and to some extent, Dutch influences, while Malaysian and Singaporean version is often called as *sup kambing Mamak* which solely derived from Muslim Indian influences. Other main differences are the Malaysian and Singaporean version consists of the chunks of goat meat in yellowish, rather thick and oily broth with rich spices; while in Indonesian version, the goat meat often also includes its bones (ribs or leg bones), has a lighter broth and balanced spices, and it also contains slices of vegetables including tomato, leek, celery, carrot and sometimes potato. A simple *sup kambing* recipe uses [goat meat](/wiki/Goat_meat), slices of tomato, leek, celery, and ground spices which includes; [ginger](/wiki/Ginger), pepper, garlic, [shallot](/wiki/Shallot) and salt. However, another elaborate recipes might add more complex [spices](/wiki/Spices), which might includes [cardamom](/wiki/Cardamom), [cinnamon](/wiki/Cinnamon), [candlenut](/wiki/Candlenut), [nutmeg](/wiki/Nutmeg), [clove](/wiki/Clove) and [star anise](/wiki/Star_anise) to add aroma and taste. ## Variations In Indonesia the soup is prepared in rich savoury broth with spices and ingredients similar to other Indonesian favourite, *[sop buntut](/wiki/Oxtail_soup#Indonesian_oxtail_soup)* (oxtail soup). Common *sop kambing* uses goat meat, also its ribs; however, in Indonesia there is a more specific *sop kambing* called *sop kepala kambing* which uses [offals](/wiki/Offal) of goat's head, which includes its tongue, ear, lips and cheek meats, eyes and sometimes brain. Another specific *sup kambing* is called *sop kaki kambing* which uses goat's trotters. - Food portal - Indonesia portal - Malaysia portal - Singapore portal - [List of Indonesian soups](/wiki/List_of_Indonesian_soups) - [Mamak stall](/wiki/Mamak_stall) - Various Indonesian Sup Kambing recipes (in Indonesian) - Jakarta-Style Goat Feet Soup from Indonesia Eats\n",
  "language": "en",
  "processed_at": "2026-01-12T12:04:16.365878",
  "title": "Sup kambing",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sup_kambing"
}