{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:04:20.105140"
  },
  "content": "Muslim prayer space in Queenstown, Singapore The **Surau Ghim Moh** is a [surau](/wiki/Surau) located at [Ghim Moh](/wiki/Ghim_Moh) in [Queenstown, Singapore](/wiki/Queenstown,_Singapore). Established in 1981, it serves as a mosque and Islamic center for residents living in the Ghim Moh neighbourhood. It is the only [musalla](/wiki/Musalla) in Singapore to be situated under a void deck of a block of flats. ## History The prayer space was established in 1981, as Muslim residents of the Ghim Moh housing estate requested a place for congregational prayers due to the fact the nearest mosque was accessible only by bus, which was not convenient for the majority at the time who were elderly. Former *Member-of-Parliament* [Abbas Abu Amin](/wiki/Abbas_Abu_Amin) and former *Cabinet Minister* [Ahmad Mattar](/wiki/Ahmad_Mattar) pushed for the idea of constructing a surau at the void deck of Block 2, Ghim Moh Road, which was met with criticism from other governmental authorities. Eventually, the government agreed to their requests and permitted the construction of the surau. Surau Ghim Moh gained popularity in 2019 after a video of it that became viral was shared on social media platforms. Later in 2020, the surau was one of the few Muslim prayer spaces that were still active during the [COVID-19 pandemic](/wiki/COVID-19_pandemic) while all mosques were shut down. The surau is still active and used for [Tarawih](/wiki/Tarawih) prayers as well as Qur'an recitations and religious classes. ## Construction Enclosed by concrete walls, the surau occupies the space underneath Block 2, Ghim Moh Road. The surau has wooden flooring and is equipped with electric fans and lighting, while a space for ablution can be found outside. Originally, the surau was smaller and was only enclosed using cardboard and canvas, however, with funding, the surau was able to be upgraded into its current form. - [Surau Al-Firdaus](/wiki/Surau_Al_Firdaus) - [List of mosques in Singapore](/wiki/List_of_mosques_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:04:20.104851",
  "title": "Surau Ghim Moh",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Surau_Ghim_Moh"
}