{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:04:21.432510"
  },
  "content": "A subsidiary of Temasek holding **Surbana Jurong Private Limited** is a [Singaporean government](/wiki/Government_of_Singapore)-owned consultancy company focusing on infrastructure and urban development. It was formed in June 2015 with the merger of Surbana International Consultants and Jurong International Holdings. As of July 2025, it is wholly owned by [Temasek Holdings](/wiki/Temasek_Holdings) and had 16,000 employees. ## History In February 2015, [JTC Corporation](/wiki/JTC_Corporation) and Temasek Holdings announced plans to merge several of their subsidiaries. According to the agreement, JTC Corporation owned Jurong International Holdings and Temasek Holdings owned Surbana International Consultants were to be merged into a single entity with 49:51 partnership between JTC and Temasek. The merger was completed in June 2015 with the merged entity named Surbana Jurong. In June 2016, Temasek Holdings acquired JTC's shares in Surbana Jurong. ## Predecessors ### Surbana International Consultants Surbana International Consultants (formerly part of [Housing and Development Board](/wiki/Housing_and_Development_Board)) was a consultancy company specialising in sustainable urban solutions. Headquartered in Singapore, it was owned by [CapitaLand](/wiki/CapitaLand) and Temasek Holdings, an investment company owned by the [Government of Singapore](/wiki/Government_of_Singapore). It was formerly the Building and Development Division in Singapore's [Housing and Development Board](/wiki/Housing_and_Development_Board). Surbana International Consultants was corporatised in 2003 as a consultancy business and subsequently expanded to over 90 cities in 26 countries. One of its major international projects was the 2009 master plan for [Kigali City](/wiki/Kigali_City) in Rwanda to turn it into a financial hub for Africa. In 2014 Surbana International Consultants and Jurong International holdings began collaboration on a project from the Indian government to create [Amaravati](/wiki/Amaravati_(state_capital)) as the new capital city of [Andhra Pradesh](/wiki/Andhra_Pradesh). A year later the two firms merged to form Surbana Jurong. ### Jurong International Holdings Jurong International Holdings was a wholly owned subsidiary of JTC Corporation specialising in industrial development. It has built townships and provided marine and infrastructure developments. The company had operations in China, India and Middle East. ## Milestones ### Notable projects Surbana Jurong was involved in master-planning and infrastructure planning for an industrial park and deep-sea port in the state of [Rakhine](/wiki/Rakhine_State), Myanmar. In March 2016, Surbana Jurong secured two major contracts in Africa. The contract in Ghana, involved master-planning of [Buipe](/wiki/Buipe) and [Tamale](/wiki/Tamale,_Ghana) along with the conceptual planning of the Northern Savannah Ecological Zone. In Gabon it was involved in the master-planner for the Greater Libreville region. ### Notable acquisitions On 22 June 2015, Surbana Jurong announced the acquisitions of KTP Consultants Pte Ltd in Singapore and Sino-Sun Architects & Engineers Co. Ltd in China. On 11 November 2015, Surbana Jurong acquired 20% equity stake in China's CITICC (Africa) Holding Limited and an 8.4% stake in FLUX Factory, Inc. (a spin-off from Google X). On 1 August 2016, Surbana Jurong announced the acquisition of Australia-based [SMEC Holdings](/wiki/SMEC_Holdings) for S$400 million. On 13 October 2016, Surbana Jurong acquired security firm, AETOS Holdings for an undisclosed amount. On 29 November 2017, Surbana Jurong acquired Robert Bird Group, a global consulting engineering firm. On 16 October 2018, Surbana Jurong acquired SAA Architects, a leading full-service architecture practice headquartered in Singapore. On 12 November 2020, Surbana Jurong acquired Atelier Ten, a London-based environmental engineering firm. ### Partnerships On 14 September 2018, Surbana Jurong Capital (a wholly owned subsidiary of Surbana Jurong) and [Mitsubishi Corporation](/wiki/Mitsubishi_Corporation) signed an agreement to form Mitbana, a fund management company (FMC). The FMC will be operated as a 50:50 joint venture, and shall invest in urban development projects in Asia. This marks Surbana Jurong's first foray into the fund management business. ## Future headquarters On 18 January 2019, Surbana Jurong broke ground on its future headquarters in the future Jurong Innovation District. It will be located close to [Nanyang Technological University](/wiki/Nanyang_Technological_University), which set up the SJ-NTU Corporate Lab in 2018. When completed by 2021, the 68,915 square metre development will support 4,000 employees, and will be used to trial urban solutions before commercialisation. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:04:21.432256",
  "title": "Surbana Jurong",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Surbana_Jurong"
}