{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:04:23.846023"
  },
  "content": "Singaporean Malay-language television channelTelevision channel **Suria** (*Sun*) is a [Malay-language](/wiki/Malay_language) [free-to-air](/wiki/Free-to-air) [terrestrial television channel](/wiki/Television_channel) in [Singapore](/wiki/Singapore), owned by state media conglomerate [Mediacorp](/wiki/Mediacorp). The channel broadcasts general entertainment and news programming in the Malay language, including original programming, and imported programmes from [Malaysia](/wiki/Malaysia), [Indonesia](/wiki/Indonesia) and the [Philippines](/wiki/Philippines). The channel first launched on 31 January 1984 as **SBC 12** (or **Channel 12**), Singapore's third television channel; from its establishment through 1995, the channel was focused primarily on arts and cultural programming, while later adding a focus on sports programming. In 1994, Malay programming moved to 12 following Channel 5's switch to an English-language schedule. In 1995, the channel was renamed **Prime 12** and switched to primarily carrying Malay and [Tamil-language](/wiki/Tamil_language) programming (the former moving from [Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)) after moving exclusively to Chinese programming), with cultural programmes moved to the new channel [Premiere 12](/wiki/Central_(TV_channel)). With Tamil programming moving to Premiere 12 upon its rebranding as Central, Prime 12 rebranded again as the Malay-specific Suria in 2000. The channel currently broadcasts from 9:00 a.m. to 12:00 a.m. [SGT](/wiki/Singapore_Time) daily (except on national holidays when it broadcasts for 24 hours); a simulcast of Mediacorp's Malay radio station [Ria 897](/wiki/Ria_897) is carried after [sign-off](/wiki/Sign-on_and_sign-off). ## History Since the inception of television broadcasting in Singapore, programming in Singapore's four [official languages](/wiki/Languages_of_Singapore) had been provided by [Channel 5](/wiki/Channel_5_(Singaporean_TV_channel)), and later [Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)). Beginning on 30 March 1973, the two services began to focus on two languages each, with Channel 5 handling English- and Malay-language programmes. Plans for a third television channel in Singapore were mooted as far back as 13 January 1972 when the Centre for Production and Training of Adult Education Television (CEPTA TV) suggested that the new channel was to be used to boost adult education. The government said the following day that it had no plans to start the channel. In August 1983, the Singapore Broadcasting Corporation (SBC) set that Channel 12 would broadcast for a period of two to three hours a day, opening at 7 p,m. nightly. Such an arrangement would cause greater flexibility for the SBC to carry live [Singapore Symphony Orchestra](/wiki/Singapore_Symphony_Orchestra) performances or other features making more use of the evening airtime. The plans were set amidst threats of [the launch of a third channel in Malaysia](/wiki/TV3_(Malaysian_TV_network)) in the middle of 1984. Furthermore, the existing SBC channels would have to move the slots of their newscasts while current affairs programming like *Feedback*, *Friday Background* (Channel 5) or the *Mandarin Focus* (Channel 8) were going to move to the new service, prompting more airtime for local productions. In December 1983, the SBC announced that Channel 12 would carry 15-minute news bulletins at the end of its nightly schedule. On 22 December, the channel's launch was announced for a 31 January 1984 date (pushed back from 1 February due to concerns regarding the Lunar New Year celebrations), and was built upon the pillars of quality (regardless of language) and accessibility (as the service would use the 8-10pm time slots to catch up with the highest possible number of viewers including students unable to stay awake later). ### Launch of SBC 12 The idea for SBC 12 stemmed from the buying of 100 hours worth of documentaries from the Reiner Moritz Productions catalog, which Sandra Buenaventura thought would take \"a long time\" to air them all in the slots available at the time. These would also be shown late at night, considered to be \"a waste of time and money\" by Buenaventura. From that, SBC started buying more highbrow material to fill the third channel. The service was going to run akin to networks such as the UK's [Channel 4](/wiki/Channel_4) and Australia's [Network 0–28](/wiki/Special_Broadcasting_Service), with some of the content bought for SBC 12 having originally been commissioned for those networks. Test broadcasts started on 15 January 1984, showing the test pattern between 9am and 7pm, while was officially and formally inaugurated by [Minister for Culture](/wiki/Ministry_of_Communications_and_Information) [S. Dhanabalan](/wiki/S._Dhanabalan) on 31 January 1984 at 7:30pm [SGT](/wiki/Singapore_Time) with cultural programming on its line-up and broadcast night to four hour and ten minutes per-night broadcasting from 7:30pm to 11:40pm [SGT](/wiki/Singapore_Time). Ahead of the launch, Channel 12 was promoted on other SBC channels. The Housing Development Board started a plan for all of its flats to pick up the new service. The installation period ended in late March. Expatriates living in Singapore saw mostly favourable comments about the new service, while still believing that the channel would be improved to a level similar to that of [BBC 2](/wiki/BBC_Two) at the time. During the channel's first week, it aired eighteen programmes, those being: - Two about ballet; - Six documentaries on the brain; - A documentary about human conception; - A documentary about Polish history; - A documentary about the British army parachute regiment; - An edition of Feedback; - Three programmes about classical music; - One English opera; - One Broadway performance; - Four dramas, one of which being a Shakespeare play. However, the programming on offer was of little to no interest to the Singaporean viewers. Reception was mixed. Some did praise the channel's qualities, others criticized the channel for its content being either \"much too European\" or \"monotonous\", which in the latter case alienated 75% of the national population. SBC wasn't deeply worried about the channel's limited schedule and viewers. The average number of viewers rounded at around 20,000. Advertising was limited to two commercials on some nights and none on most nights. An SBC spokesman assured that Channel 12 was \"a long-term project\", with its viewership growing depending on the rising interest of the local population in the types of programming it was going to offer. In an attempt to lure away from a heavy highbrow output, SBC executive Sandra Buenaventura decided to cut the number of operas on the channel to one broadcast every month from March 1985. To boost viewers, mini-series and documentaries were added to the schedule. Faced by low viewing figures, concerns had emerged that Channel 12 had an \"elitist\" outlook, as a small proportion of Singapore's population regularly watched the channel. From a Straits Times survey conducted in late 1985, out of 1,008 viewers, only one percent watched the channel during prime time, compared to Channel 5's 15% and Channel 8's 30%. Since launch, none of its programmes managed to reach the twenty most-watched, despite the issues within the corporation and from viewers, Sandra Buenaventura showed potential for its content. A particular example Buenaventura mentioned in February 1986 was a yet upcoming showing of the [Marilyn Monroe](/wiki/Marilyn_Monroe) film [Gentlemen Prefer Blondes](/wiki/Gentlemen_Prefer_Blondes_(1953_film)) over [Madonna](/wiki/Madonna)'s poses being influenced by the actress, showing that the youth had interest in at least some of the content seen on the channel. The Straits Times said that the main problem of the channel was \"an image problem\". Facing the potential for increase, Buenaventura had noticed that selected \"highbrow\" programming had surpassed 100,000 viewers. Among them, The Silk Road, Civilisation, Vietnam and Heart of the Dragon. Buenaventura stated that the channel's primary philosophy of providing \"alternative programming\" hadn't changed since the outset of the channel, and was trying to make the channel \"more entertaining\". British sitcoms were added to Channel 12 in late 1985, and the feature films seen on the service were starting to diversify, by adding thriller mini-series and later classic films on Saturdays. The channel aired some sports events such as the Summer and Winter Olympics, Asian Games, SEA Games, Commonwealth Games, FIFA World Cup, UEFA European Championship, European Cup (later renamed the UEFA Champions' League) and the English Premier League. In a boost to gain ratings, SBC 12 poached [WWF](/wiki/World_Wrestling_Entertainment) slots from SBC 5 and create more slots for sports programming, justifying the channel's flexibility in its programming. The channel ended 1984 with an average 17,000 viewers tuning in, and the addition of Asian films and Chinese operas helped stabilise. Sandra Buenaventura hoped that SBC 12's viewership would increase from 35,000 to 50,000 from Tuesdays to Thursdays, when the slots dedicated to sporting events would air. In addition, the channel advanced its opening time to 7:30pm. The inclusion of sports slots from 13 October 1986, as well as light entertainment (mostly from the United States) was seen by the Straits Times as a move \"downmarket\" In January 1989, SBC 12 introduced two new sports programmes, Sports Centre and Sportsview, replacing the Tamil/Hindi Cinema which aired on those slots. Between June and September of 1989, SBC 12 began airing plays, feature films and drama serials based on textbooks to assist O and A level students who take English Literature. The channel converted to stereo broadcasts on 1 August 1990. In February 1991, SBC 12 began airing simulcasts of CNN, airing Mondays to Fridays and sponsored by several companies. From 10 June 1991, it only aired twice a day for an hour at 7 am and 7 pm until 1992, when the subscription channel NewsVision was set to launch. The *Japan Hour* slot first aired on 15 December 1991, aiming at [Japanese immigrants in Singapore](/wiki/Japanese_people_in_Singapore) and Singaporeans interested in learning [Japanese](/wiki/Japanese_language). The slot, sponsored by the Singaporean subsidiary of [Sumitomo Corporation](/wiki/Sumitomo_Corporation), was divided in two segments: a half-hour weekly news summary covering events in Japan, without subtitles, followed by a documentary or magazine programme with English subtitles. The slot was created considering Singapore's highest consideration of Japanese expatriates at the time. In June 1992, SBC 12 began to air sports on Sunday mornings with content from ESPN. SBC says that ESPN will \"expose viewers to other sporting events popular elsewhere\". It was meant to supplement the SBC-produced World Of Sports. Effective 1993, the CDIS blocktime slot produced by the Ministry of Education would be aired as part of the Channel 12 programming schedule. ### Channel 12 and Prime 12, expansion of Malay programming SBC announced in September 1993 that it would move all of its Malay output, previously seen on Channel 5, to Channel 12 effective 1 January 1994. The move would enable an increase of the weekly proportion of Malay programmes from nine hours a week to fifteen hours a week, and 5 to relaunch as an English-language channel. The Malay news bulletin, *Berita*, was set to expand from 20 minutes to a half hour slot upon the move. The channel subsequently rebranded on 29 January 1994, with a new identity. On 26 August 1994, Minister for Information and the Arts [George Yeo](/wiki/George_Yeo) announced the plan for the creation of a fourth free-to-air television channel in Singapore, offering a predominantly cultural lineup. Under this plan, Channel 8 would switch to an entirely-Chinese format, causing the Tamil shows there to move to Channel 12, using its new format to concentrate primarily on Malay and Indian content, whereas the cultural output that was on the former Channel 12 would move to a new UHF channel, due to the lack of VHF slots available. As of September 1994, Malay programming on Channel 12 was limited to a mere one hour after Berita and on weekend afternoons, with no Malay programmes on Fridays. On 1 October 1994, SBC was privatised into the new holding company Singapore International Media (SIM); Channel 12 was assigned to its subsidiary [Singapore Television Twelve (TV12)](/wiki/Mediacorp_TV12). The Singapore Broadcasting Authority allocated $40 million per annum of money to TV12 to provide 45 out of the 60 hours a week of public service broadcasting, with 19 hours for arts, sports and culture programming, 15 for Malay programming and 11 for Indian-language programming (majority being in Tamil). The rest of the hours was funded by TV12. Channel 12's advertising revenue had increased since the privatization, as it had been perceived as a highbrow channel with fewer viewers. 40% of the revenue came from its sports programmes as they were unable to operate with solely arts programming. On 27 July 1995, the [Singapore Broadcasting Authority](/wiki/Infocomm_Media_Development_Authority) granted TV12 authority to broadcast its new service on UHF channel 27. The new channel would be known as Premiere 12, and would inherit the cultural programmes that had been seen on Channel 12 up until this point. Concurrently, Channel 12 would rebrand as **Prime 12**. Sandra Buenaventura, CEO of TV12, said that the two channels were \"like a tin of assorted biscuits\", reflecting the individual nature of the specialist programming of the new services. The launch of Prime 12 on 1 September 1995 meant that Malay programming was increased to 20.5 hours a week instead of 15 hours, while Tamil programming received 16 hours a week instead of 10 hours when they were on Channel 8. Malay news was moved to 8 p.m. while the newly relocated Tamil newscast now aired at a \"higher-profile\" 7:30 p.m. and expanded to 30 minutes instead of the former 15. The channel would also air the European art-house films slot Cinematheque on Wednesday nights and self-improvement and lifestyle programmes for four hours on weekdays. By 1996, Prime 12 began to air Malay programmes commissioned by production houses, including profiles of Malay personalities, a morning chat show, variety shows and two drama series. Over six companies made bids for Malay programmes in 1996, rising to fourteen in 1997. A talk show, Suria 12, produced by Communications 2000, debuted in July 1996. A survey conducted by ACNielsen in 1996 revealed that 90% of the Malay population watched Malay programmes on Prime 12 in one month, with 40% tuned in to the channel between 8 and 10 p.m. In 1997, Prime 12 aired Japanese dramas, with three titles airing every week, all in Japanese. However, the ratings for such airings were at an average of 2%, as they were targeted at the Japanese community; nevertheless, these dramas attracted local viewers as well, calling them \"a refreshing change\" to the Western dramas. It also bought *Made in Thailand* and *Made in the Philippines* from MTV Asia, owing to the growing interest in Philippine and Thai music among Singaporean youth. The programmes were presented in their original languages, in line with the channel's philosophy. The awards show, [Pesta Perdana/Pradana Vizha](/wiki/Pesta_Perdana), originally catering to Malay and Tamil programmes, was held on 25 December 1997 before splitting into separate awards in 1998. In October 1998, the Japanese dramas and *Japan Hour* moved to Premiere 12. With the change, Prime 12 was limited to Malay and Tamil programming. In 1998, Prime 12's Malay programming featured the first locally made animated series, *[Jo Kilat](/wiki/Jo_Kilat)* (which won an award in December 1998) and the first local soap opera produced for the channel, *Gelora*. ### Suria In September 1999, it was revealed that as part of a realignment of MediaCorp's channels, Prime 12 would be relaunched as a full-time Malay-language channel known as Suria in 2000. The new name, meaning \"sun\", was intended to reflect a \"new light\" in Malay television in Singapore, along with the new millennium. The channel would expand its broadcasting hours to 56 hours a week from 36.5, promising locally produced programming, collaborations with producers in Malaysia and other neighbours such as Indonesia and Brunei, and Malay [dubs](/wiki/Dubbing) of imported programming. Suria planned to broadcast internationally via satellite in three years' time, reaching to 200 million people in the Malay archipelago. On 30 January 2000, Prime 12 relaunched as Suria; Tamil programming was moved to a block on Premiere 12, which concurrently relaunched as [Central](/wiki/Central_(TV_channel)). In 2001, Suria recorded the highest channel share among Malays \"aged 4 and above\" at 35%. The drama series, *Jeritan Sepi* had a viewership of 8%, similar to Channel 5's *[Phua Chu Kang](/wiki/Phua_Chu_Kang_Pte_Ltd)*. In 2007, Suria had aired the original 2000–2002 version of [Philippine teleserye](/wiki/Philippine_television_drama) produced by [ABS-CBN Studios](/wiki/ABS-CBN_Studios) titled *[Pangako Sa 'Yo](/wiki/Pangako_Sa_%27Yo)* (The Promise) which starred [Kristine Hermosa](/wiki/Kristine_Hermosa) and [Jericho Rosales](/wiki/Jericho_Rosales) and was dubbed in Malay, becoming a ratings hit as the first Philippine TV drama to be aired in Singapore. In August 2013, Suria along with [Warna 942](/wiki/Warna_942) and [Ria 897](/wiki/Ria_897) became part of Mediacorp's \"Malay Broadcast Division\", the dedicated section promoting Malay-language programming to Singaporeans and people across the Malay-speaking world. Suria celebrated its 40th anniversary in 2024 and the Silver Jubliee of its relaunch in 2025.[*how?*] - Suria's official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:04:23.845706",
  "title": "Suria (TV channel)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Suria_(TV_channel)"
}