{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:03:03.361805"
  },
  "content": "Hereditary portion of a personal nameThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Surname\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2023)* *(Learn how and when to remove this message)* In many societies, a **surname**, **last** **family name**, or **first** **family name** is the mostly hereditary portion of one's [personal name](/wiki/Personal_name) that indicates one's family. It is typically combined with a [given name](/wiki/Given_name) to form the [full name](/wiki/Full_name) of a person, although several given names and surnames are possible in the full name. In modern times most surnames are [hereditary](/wiki/Heredity), although in most countries a person has a right to [change their name](/wiki/Name_change). Depending on culture, the surname may be placed either at the start of a person's name, or at the end. The number of surnames given to an individual also varies: in most cases it is just one, but in Portuguese-speaking countries and many Spanish-speaking countries, two surnames (one inherited from the mother and another from the father) are used for legal purposes. Depending on culture, not all members of a family unit are required to have identical surnames. In some countries, surnames are modified depending on gender and family membership status of a person. Compound surnames can be composed of separate names. The use of names has been documented in even the oldest historical records. Examples of surnames are documented in the 11th century by the [barons](/wiki/Baron) in England. English surnames began to be formed with reference to a certain aspect of that individual, such as their trade, father's name, location of birth, or physical features, and were not necessarily inherited. By 1400 most English families, and those from Lowland Scotland, had adopted the use of hereditary surnames. The study of proper names (in family names, personal names, or places) is called [onomastics](/wiki/Onomastics). ## History ### Origin While the use of given names to identify individuals is attested in the oldest historical records, the advent of surnames is relatively recent. Many cultures have used and continue to use additional descriptive terms in identifying individuals. These terms may indicate personal attributes, location of origin, occupation, parentage, patronage, adoption, or clan affiliation. In China, according to legend, family names started with Emperor [Fu Xi](/wiki/Fuxi) in 2000 BC. His administration standardised the naming system to facilitate census-taking, and the use of census information. Originally, [Chinese surnames](/wiki/Chinese_surname) were derived [matrilineally](/wiki/Matronymic), although by the time of the [Shang dynasty](/wiki/Shang_dynasty) (1600 to 1046 BC) they had become [patrilineal](/wiki/Patronymic_surname). Chinese women do not change their names upon marriage. In China, surnames have been the norm since at least the 2nd century BC. In the early [Islamic](/wiki/Islamic) period (640–900 AD) the use of [patronymics](/wiki/Patronymics) is well attested. The famous scholar [Rhazes](/wiki/Rhazes) (c. 865–925 AD) is referred to as \"al-Razi\" (lit. the one from Ray) due to his origins from the city of [Ray](/wiki/Ray,_Iran), Iran. In the [Levant](/wiki/Levant), surnames were in use as early as the [High Middle Ages](/wiki/High_Middle_Ages) and it was common for people to derive their surname from a distant ancestor, and historically the surname would be often preceded with 'ibn' or 'son of'. Arab family names often denote either one's [tribe](/wiki/Tribe), [profession](/wiki/Profession), a famous ancestor, or the place of origin; but they were not universal. For example, [Hunayn ibn Ishaq](/wiki/Hunayn_ibn_Ishaq) (fl. 850 AD) was known by the nisbah \"al-'Ibadi\", a federation of Arab Christian tribes that lived in [Mesopotamia](/wiki/Mesopotamia) prior to the advent of [Islam](/wiki/Islam). In Ancient Greece, as far back as the [Archaic Period](/wiki/Archaic_Greece) clan names and [patronymics](/wiki/Patronymic) (\"son of\") were also common, as in [Aristides](/wiki/Aristides) as Λῡσῐμᾰ́χου – a genitive singular form meaning son of Lysimachus. For example, [Alexander the Great](/wiki/Alexander_the_Great) was known as [*Heracleides*](/wiki/Heracleidae), as a supposed descendant of [Heracles](/wiki/Heracles), and by the dynastic name [*Karanos*/*Caranus*](/wiki/Caranus_of_Macedon), which referred to the founder of the [dynasty to which he belonged](/wiki/Argead_dynasty). These patronymics are already attested for many characters in the works of [Homer](/wiki/Homer). At other times formal identification commonly included the place of origin. Over the course of the Roman Republic and the later Empire, naming conventions went through multiple changes. (*See [Roman naming conventions](/wiki/Roman_naming_conventions).*) The [*nomen*](/wiki/Nomen_gentilicium), the name of the [gens](/wiki/Gens) (tribe) inherited patrilineally, is thought to have already been in use by 650 BC. The *nomen* was to identify group kinship, while the *[praenomen](/wiki/Praenomen)* (forename; plural *praenomina*) was used to distinguish individuals within the group. Female *praenomina* were less common, as women had reduced public influence, and were commonly known by the feminine form of the *nomen* alone. ### Medieval era and beyond Later with the gradual influence of Greek and [Christian culture](/wiki/Christian_culture) throughout the Empire, Christian religious names were sometimes put in front of traditional *cognomina*, but eventually people reverted to single names.[*citation needed*] By the time of the fall of the Western Roman Empire in the 5th century, family names were uncommon in the [Eastern Roman Empire](/wiki/Eastern_Roman_Empire). In Western Europe, where Germanic culture dominated the aristocracy, family names were almost non-existent. They would not significantly reappear again in Eastern Roman society until the 10th century, apparently influenced by the familial affiliations of the Armenian military aristocracy.[*citation needed*] The practice of using family names spread through the Eastern Roman Empire, however it was not until the 11th century that surnames came to be used in West Europe. Medieval Spain used a patronymic system. For example, Álvaro, a son of Rodrigo, would be named Álvaro Rodríguez. His son, Juan, would not be named Juan Rodríguez, but Juan Álvarez. Over time, many of these patronymics became family names, and they are some of the most common names in the Spanish-speaking world today. Other sources of surnames are personal appearance or habit, e.g. Delgado (\"thin\") and Moreno (\"dark\"); geographic location or ethnicity, e.g. Alemán (\"German\"); and occupations, e.g. Molinero (\"miller\"), Zapatero (\"shoe-maker\") and Guerrero (\"warrior\"), although occupational names are much more often found in a shortened form referring to the trade itself, e.g. Molina (\"mill\"), Guerra (\"war\"), or Zapata (archaic form of *zapato*, \"shoe\"). In England the introduction of family names is generally attributed to the preparation of the [Domesday Book](/wiki/Domesday_Book) in 1086, following the [Norman Conquest](/wiki/Norman_Conquest). Evidence indicates that surnames were first adopted among the feudal nobility and gentry, and slowly spread to other parts of society. Some of the early Norman nobility who arrived in England during the Norman conquest differentiated themselves by affixing 'de' (of) before the name of their village in France. This is what is known as a territorial surname, a consequence of feudal landownership. By the 14th century, most [English](/wiki/English_surnames) and most [Scottish](/wiki/Scottish_surnames) people used surnames and in Wales following unification under Henry VIII in 1536. A four-year study led by the [University of the West of England](/wiki/University_of_the_West_of_England), which concluded in 2016, analysed sources dating from the 11th to the 19th century to explain the origins of the surnames in the [British Isles](/wiki/British_Isles). The study found that over 90% of the 45,602 surnames in the dictionary are native to Britain and Ireland, with the most common in the UK being [Smith](/wiki/Smith_(surname)), [Jones](/wiki/Jones_(surname)), [Williams](/wiki/Williams_(surname)), [Brown](/wiki/Brown_(surname)), [Taylor](/wiki/Taylor_(surname)), [Davies](/wiki/Davies), and [Wilson](/wiki/Wilson_(name)). The findings have been published in the *Oxford English Dictionary of Family Names in Britain and Ireland*, with project leader Richard Coates calling the study \"more detailed and accurate\" than those before. He elaborated on the origins: \"Some surnames have origins that are occupational – obvious examples are Smith and Baker. Other names can be [linked to a place](/wiki/Toponymic_surname), for example, Hill or Green, which relates to a [village green](/wiki/Village_green). Surnames that are 'patronymic' are those which originally enshrined the father's name – such as [Jackson](/wiki/Jackson_(surname)), or [Jenkinson](/wiki/Jenkinson). There are also names where the origin describes the original bearer such as Brown, [Short](/wiki/Short_stature), or Thin – though Short may in fact be an ironic 'nickname' surname for a tall person.\" In the modern era, governments have enacted laws to require people to adopt surnames. This served the purpose of uniquely identifying subjects for taxation purposes or for inheritance. In the late [Middle Ages](/wiki/Middle_Ages) in England, mandatory surnames were resisted as they were associated with taxes. ### Modern era During the modern era many cultures around the world adopted family names, particularly for administrative reasons, especially during the age of European expansion and particularly since 1600. The Napoleonic Code, adopted in various parts of Europe, stipulated that people should be known by both their given name(s) and a family name that would not change across generations. Other notable examples include the Netherlands (1795–1811), Japan (1870s), Thailand (1920), and Turkey (1934). The structure of the [Japanese name](/wiki/Japanese_name) was formalized by the government as *family name* + *given name* in 1868. In Breslau Prussia enacted the Hoym Ordinance in 1790, mandating the adoption of Jewish surnames. Napoleon also insisted on Jews adopting fixed names in a decree issued in 1808. Names can sometimes be changed to protect individual privacy (such as in [witness protection](/wiki/Witness_protection)), or in cases where groups of people are escaping persecution. After arriving in the United States, European Jews who fled Nazi persecution sometimes [anglicized](/wiki/Anglicization) their surnames to avoid discrimination. Governments can also forcibly change people's names, as when the [National Socialist](/wiki/National_Socialist) government of Germany assigned German names to European people in the territories they conquered. In the 1980s, the [People's Republic of Bulgaria](/wiki/People%27s_Republic_of_Bulgaria) forcibly changed the first and last names of its [Turkish citizens](/wiki/Turks_in_Bulgaria) to Bulgarian names. ## Origins of particular surnames ### Patronymic and matronymic surnames These are the oldest and most common type of surname. They may be a first name such as \"Wilhelm\", a [patronymic](/wiki/Patronymic) such as \"[Andersen](/wiki/Andersen)\", a [matronymic](/wiki/Matronymic) such as \"[Beaton](/wiki/Beaton_(surname))\", or a clan name such as \"[O'Brien](/wiki/O%27Brien_dynasty)\". Multiple surnames may be derived from a single given name: e.g. there are thought to be over 90 Italian surnames based on the given name \"[Giovanni](/wiki/Giovanni_(name))\". #### Examples - **Patronal** from patronage (*Hickman* meaning Hick's man, where Hick is a pet form of the name Richard) or strong ties of religion *Kilpatrick* (follower of [Patrick](/wiki/Patrick_(given_name))) or *Kilbride* (follower of Saint [Brigid of Kildare](/wiki/Brigid_of_Kildare)).[*dubious – discuss*] *Kil-* refers to a church or monastery (see [Kilbride](/wiki/Kilbride_(disambiguation)) and [Kilpatrick](/wiki/Kilpatrick_(disambiguation))). - **[Patronymics](/wiki/Patronymic), [matronymics](/wiki/Matronymic) or ancestral**, often from a person's given name. e.g., from male name: *[Richardson](/wiki/Richardson_(surname))*, *[Stephenson](/wiki/Stephenson)*, *[Jones](/wiki/Jones_(surname))* (Welsh for Johnson), *[Williams](/wiki/Williams_(surname))*, *[Jackson](/wiki/Jackson_(surname))*, *[Wilson](/wiki/Wilson_(surname))*, *[Thompson](/wiki/Thompson_(surname))*, *[Benson](/wiki/Benson_(surname))*, *[Johnson](/wiki/Johnson_(surname))*, *[Harris](/wiki/Harris_(surname))*, *[Evans](/wiki/Evans_(surname))*, *[Simpson](/wiki/Simpson_(surname))*, *[Willis](/wiki/Willis_(surname))*, *[Davies](/wiki/Davies)*, *[Reynolds](/wiki/Reynolds_(surname))*, *[Adams](/wiki/Adams_(surname))*, *[Dawson](/wiki/Dawson_(surname))*, *[Lewis](/wiki/Lewis_(surname))*, *[Rogers](/wiki/Rogers_(surname))*, *[Murphy](/wiki/Murphy)*, *[Morrow](/wiki/Morrow_(surname))*, *[Nicholson](/wiki/Nicholson_(surname))*, *[Robinson](/wiki/Robinson_(name))*, *[Powell](/wiki/Powell_(surname))*, *[Ferguson](/wiki/Ferguson_(name))*, *[Davis](/wiki/Davis_(surname))*, *[Edwards](/wiki/Edwards_(surname))*, *[Hudson](/wiki/Hudson_(surname))*, *[Roberts](/wiki/Roberts_(surname))*, *[Harrison](/wiki/Harrison_(name))*, *[Watson](/wiki/Watson_(surname))*, or female names *Molson* (from Moll for Mary), *[Madison](/wiki/Madison_(name))* (from Maud), *Emmott* (from Emma), *Marriott* (from Mary) or from a clan name (for those of Scottish origin, e.g., *[MacDonald](/wiki/Macdonald_(name))*, *[Forbes](/wiki/Clan_Forbes)*, *[Henderson](/wiki/Henderson_(surname))*, *[Armstrong](/wiki/Armstrong_(surname))*, *[Grant](/wiki/Grant_(surname))*, *[Cameron](/wiki/Cameron_(surname))*, *[Stewart](/wiki/Stewart_(name))*, *[Douglas](/wiki/Douglas_(surname))*, *[Crawford](/wiki/Crawford_(name))*, *[Campbell](/wiki/Campbell_(surname))*, *[Hunter](/wiki/Hunter_(name))*) with \"Mac\" [Gaelic](/wiki/Goidelic_languages) for son. ### Cognominal surnames This is the broadest class of surnames, originating from nicknames, encompassing many types of origin. These include names based on appearance such as \"Schwartzkopf\", \"Short\", and possibly \"Caesar\", and names based on temperament and personality such as \"Daft\", \"Gutman\", and \"Maiden\", which, according to a number of sources, was an English nickname meaning \"effeminate\". A group of nicknames look like occupational ones: [King](/wiki/King_(surname)), [Bishop](/wiki/Bishop_(surname)), [Abbot](/wiki/Abbot_(surname)), [Sheriff](/wiki/Sheriff_(surname)), [Knight](/wiki/Knight_(surname)), etc. but it is rather unlikely that a person with surname King was a king or descended from a king. [Bernard Deacon](/wiki/Bernard_Deacon_(linguist)) suggests that the first nickname/surname bearer may have acted like a king or bishop, or was as corpulent as a bishop. etc. A considerable group of surname-producing nicknames may be found among [ethnonymic surnames](/wiki/Ethnonymic_surname). ### Ornamental/artificial surnames **Ornamental surnames** (also known as **artificial surnames**) are not specific to any attribute (place, parentage, occupation, caste) of the first person to acquire the name. They were generally acquired later in history and generally when those without surnames needed them. In 1526, [King Frederik I of Denmark-Norway](/wiki/Frederick_I_of_Denmark) ordered that noble families must take up fixed surnames, and many of them took as their name some element of their coat of arms; for example, the [Rosenkrantz](/wiki/Rosenkrantz_(noble_family)) (\"rose wreath\") family took their surname from a wreath of roses forming the torse of their arms, and the [Gyldenstierne](/wiki/Gyldenstierne_(noble_family)) (\"golden star\") family took theirs from a 7-pointed gold star on their shield. Subsequently, many middle-class Scandinavian families desired names similar to those of the nobles and adopted \"ornamental\" surnames as well. Most other naming traditions refer to them as \"acquired\". They might be given to people newly immigrated, conquered, or converted, as well as those with unknown parentage, formerly enslaved, or from parentage without a surname tradition.[*citation needed*] Ornamental surnames are more common in communities that adopted (or were forced to adopt) surnames in the 18th and 19th centuries. They occur commonly in Scandinavia, and among [Sinti](/wiki/Sinti) and [Romani](/wiki/Romani_people) and Eastern [Ashkenazi](/wiki/Ashkenazi) Jews in Germany and Austria. ### Acquired/assigned surnames During the era of the [Trans-Atlantic slave trade](/wiki/Trans-Atlantic_slave_trade) many Africans were given new names by their masters. Many of the family names of many African-Americans have their origins in slavery (*i.e.* [slave name](/wiki/Slave_name)). Some freed slaves later created family names themselves. Another category of acquired names is [foundlings](/wiki/Child_abandonment)' names. Historically, children born to unwed parents or extremely poor parents would be abandoned in a public place or anonymously placed in a [foundling wheel](/wiki/Baby_hatch#History). Such abandoned children might be claimed and named by religious figures, the community leaders, or adoptive parents. Some such children were given surnames that reflected their condition, like (Italian) [Esposito](/wiki/Esposito), [Innocenti](/wiki/Innocenti_(surname)), [Della Casagrande](/wiki/Casagrande), [Trovato](/wiki/Trovato), Abbandonata, or (Dutch) Vondeling, Verlaeten, Bijstand. Other children were named for the street/place they were found (Union, Liquorpond (street), di Palermo, Baan, Bijdam, van den Eyngel (shop name), van der Stoep, von Trapp), the date they were found ([Monday](/wiki/Monday_(surname)), Septembre, Spring, di Gennaio), or festival/feast day they found or christened (Easter, SanJosé). Some foundlings were given the name of whoever found them. ### Occupational surnames [Occupational](/wiki/Vocation) names include *[Smith](/wiki/Smith_(surname))*, Taylor (Tailor), *[Miller](/wiki/Miller_(name))*, *[Farmer](/wiki/Farmer_(surname))*, *[Thatcher](/wiki/Thatcher_(disambiguation)#Surname)*, *[Shepherd](/wiki/Shepherd_(surname))*, *[Potter](/wiki/Potter_(surname))*, and so on, and analogous names in many other languages; see, for example, various surnames associated with the occupation of smith. There are also more complicated names based on occupational titles. In England it was common for servants to take a modified version of their employer's occupation or first name as their last name,[*citation needed*] adding the letter *s* to the word, although this formation could also be a [patronymic](/wiki/Patronymic). For instance, the surname *[Vickers](/wiki/Vickers_(surname))* is thought to have arisen as an occupational name adopted by the servant of a vicar, while *[Roberts](/wiki/Roberts_(surname))* could have been adopted by either the son or the servant of a man named Robert. A subset of occupational names in English are names thought to be derived from the medieval [mystery plays](/wiki/Mystery_play#English_mystery_plays). The participants would often play the same roles for life, passing the part down to their oldest sons. Names derived from this may include *[King](/wiki/King_(surname))*, *[Lord](/wiki/Lord_(surname))* and *Virgin*.[*citation needed*] *A Dictionary of English Surnames* says that \"surnames of office, such as [Abbot](/wiki/Abbot_(surname)), [Bishop](/wiki/Bishop_(surname)), [Cardinal](/wiki/Cardinal_(surname)) and King, are often nicknames\". The original meaning of names based on medieval occupations may no longer be obvious in modern English.[*citation needed*] ### Toponymic surnames Location (toponymic, habitation) names derive from the inhabited location associated with the person given that name. Such locations can be any type of settlement, such as homesteads, farms, enclosures, villages, hamlets, strongholds, or cottages. One element of a habitation name may describe the type of settlement. Examples of [Old English](/wiki/Old_English) elements are frequently found in the second element of habitational names. The habitative elements in such names can differ in meaning, according to different periods, different locations, or with being used with certain other elements. For example, the Old English element *tūn* may have originally meant \"enclosure\" in one name, but can have meant \"farmstead\", \"village\", \"manor\", or \"estate\" in other names. Location names, or habitation names, may be as generic as \"Monte\" (Portuguese for \"mountain\"), \"Górski\" (Polish for \"hill\"), or \"Pitt\" (variant of \"pit\"), but may also refer to specific locations. \"Washington\", for instance, is thought to mean \"the homestead of the family of Wassa\", while \"Lucci\" means \"resident of [Lucca](/wiki/Lucca)\". Although some surnames, such as \"London\", \"Lisboa\", or \"Białystok\" are derived from large cities, more people reflect the names of smaller communities, as in [Ó Creachmhaoil](/wiki/%C3%93_Creachmhaoil), derived from a village in [County Galway](/wiki/County_Galway). This is thought to be due to the tendency in Europe during the Middle Ages for migration to chiefly be from smaller communities to the cities and the need for new arrivals to choose a defining surname. In [Portuguese-speaking countries](/wiki/Portuguese-speaking_countries), it is uncommon, but not unprecedented, to find surnames derived from names of countries, such as Portugal, França, Brasil, Holanda. Surnames derived from country names are also found in English, such as \"England\", \"Wales\", \"Spain\". Some [Japanese surnames](/wiki/Japanese_name) derive from geographical features; for example, [Ishikawa](/wiki/Ishikawa_(surname)) (石川) means \"stone river\" (and is also [the name of one of Japan's prefectures](/wiki/Ishikawa_Prefecture)), [Yamamoto](/wiki/Yamamoto) (山本) means \"the base of the mountain\", and [Inoue](/wiki/Inoue) (井上) means \"above the well\". Arabic names sometimes contain surnames that denote the city of origin. For example, in cases of [Saddam Hussein](/wiki/Saddam_Hussein) al Tikriti, meaning Saddam Hussein originated from [Tikrit](/wiki/Tikrit), a city in [Iraq](/wiki/Iraq). This component of the name is called a *[nisbah](/wiki/Nisbat_(onomastics))*. #### Examples - **Estate names** For those descended from land-owners, the name of their holdings, castle, manor or estate, e.g. [Ernle](/wiki/Ernle), [Windsor](/wiki/House_of_Windsor), [Staunton](/wiki/Staunton_(surname)) - **Habitation (place) names** e.g., [Burton](/wiki/Burton_(name)), [Flint](/wiki/Flint_(surname)), [Hamilton](/wiki/Hamilton_(surname_and_title)), [London](/wiki/London_(name)), [Laughton](/wiki/Laughton_(surname)), [Leighton](/wiki/Leighton_(surname)), [Murray](/wiki/Murray_(surname)), [Sutton](/wiki/Sutton_(surname)), [Tremblay](/wiki/Tremblay_(surname)) - **[Topographic surnames](/wiki/Topographic_surname)** (geographical features) e.g., [Bridge](/wiki/Bridge_(surname)) or [Bridges](/wiki/Bridges_(surname)), [Brook](/wiki/Brook_(surname)) or [Brooks](/wiki/Brooks_(surname)), [Bush](/wiki/Bush_(surname)), [Camp](/wiki/Camp_(surname)), [Hill](/wiki/Hill_(surname)), [Lake](/wiki/Lake_(surname)), [Lee](/wiki/Lee_(English_name)) or [Leigh](/wiki/Leigh_(surname)), [Wood](/wiki/Wood_(surname)), [Grove](/wiki/Grove_(surname)), [Holmes](/wiki/Holmes_(surname)), [Forest](/wiki/Forest_(name)), [Underwood](/wiki/Underwood_(surname)), [Hall](/wiki/Hall_(surname)), [Field](/wiki/Field_(surname)), [Stone](/wiki/Stone_(surname)), [Morley](/wiki/Morley_(name)), [Moore](/wiki/Moore_(surname)), [Perry](/wiki/Perry_(surname)) ### Other The meanings of some names are unknown or unclear. The most common European name in this category may be the Irish name [Ryan](/wiki/Ryan_(surname)), which means 'little king' in Irish. Also, Celtic origin of the name Arthur, meaning '[bear](/wiki/Artur)'. Other surnames may have arisen from more than one source: the name [De Luca](/wiki/DeLuca), for instance, likely arose either in or near Lucania or in the family of someone named Lucas or Lucius; in some instances, however, the name may have arisen from Lucca, with the spelling and pronunciation changing over time and with emigration. The same name may appear in different cultures by coincidence or romanization; the surname [Lee](/wiki/Lee_(English_name)) is used in English culture, but is also a romanization of the Chinese surname *[Li](/wiki/Li_(surname_%E6%9D%8E))*. In the [Russian Empire](/wiki/Russian_Empire), illegitimate children were sometimes [given artificial surnames](/wiki/Russian_surnames_of_illegitimate_children) rather than the surnames of their adoptive parents. ## Order of names In many cultures (particularly in [European](/wiki/Culture_of_Europe) and European-influenced cultures in the Americas, Oceania, etc., as well as West Asia/North Africa, South Asia, and most Sub-Saharan African cultures), the surname or family name (\"last name\") is placed after the personal, [forename](/wiki/Given_name) (in Europe) or given name (\"first name\"). In other cultures the surname is placed first, followed by the given name or names. The latter is often called the [Eastern naming order](/wiki/Name_order) because Europeans are most familiar with the examples from the [East Asian cultural sphere](/wiki/East_Asian_cultural_sphere), specifically, [Greater China](/wiki/Chinese_name), [Korea (both North and South)](/wiki/Korean_name), [Japan](/wiki/Japanese_name), and [Vietnam](/wiki/Vietnamese_name). This is also the case in [Cambodia](/wiki/Cambodia) and among the [Hmong](/wiki/Hmong_people) of [Laos](/wiki/Laos) and [Thailand](/wiki/Thailand). The [Telugu](/wiki/Telugu_language) people of south India also place surname before personal name, and historically the [Tamil](/wiki/Tamil_language) people did the same. There are some parts of Europe, in particular [Hungary](/wiki/Hungary), where the surname is placed before the personal name. In [Dalarna](/wiki/Dalarna) and nearby parts of [Sweden](/wiki/Sweden) the old naming system is name of the family farm, personal name, patronymic; the name of the family farm takes the function of a family name. Since given name is normally written first in European societies, the term first name is commonly used for the given name, while in [Japan](/wiki/Japan) (with [vertical writing](/wiki/Vertical_writing)) the given name may be referred to as \"lower name\" (*shita-no-namae* (下の名前)). When people from areas using Eastern naming order write their personal name in the [Latin alphabet](/wiki/Latin_alphabet), it is common to reverse the order of the given and family names for the convenience of Westerners, so that they know which name is the family name for official/formal purposes. Reversing the order of names for the same reason is also [customary](/wiki/Norm_(social)) for the [Mordvins](/wiki/Mordvins) and the [Hungarians](/wiki/Hungarian_people), but other [Uralic peoples](/wiki/Uralic_languages) traditionally did not have surnames, perhaps because of the [clan](/wiki/Clan) structure of their societies. The [Samis](/wiki/Samis), depending on the circumstances of their names, either saw no change or did see a transformation of their name. For example: Sire in some cases became Siri, and Hætta Jáhkoš Ásslat became [Aslak Jacobsen Hætta](/wiki/Aslak_H%C3%A6tta) – as was the [norm](/wiki/Convention_(norm)). Recently, integration into the EU and increased communications with foreigners prompted many Samis to reverse the order of their full name to given name followed by surname, to avoid their given name being mistaken for and used as a surname.[*citation needed*] Indian surnames may often denote village, profession or [caste](/wiki/Caste) and are invariably mentioned along with the personal or first names. However, hereditary last names are not universal. In [Telugu](/wiki/Telugu_language)-speaking families in south India, surname is placed before the personal or first name and in most cases it is only shown as an initial (for example 'S.' for Suryapeth). In English and other languages, although the usual order of names is \"first middle last\", for the purpose of cataloging in libraries and in citing the names of authors in scholarly papers, the order is changed to \"last, first middle,\" with the last and first names separated by a comma, and items are alphabetized by the last name. In France, Italy, Spain, [Belgium](/wiki/Belgium) and Latin America, administrative usage is to put the surname before the first on official documents.[*citation needed*] ## Gender-specific versions of surname In most [Balto-Slavic languages](/wiki/Balto-Slavic_languages) (such as Latvian, Lithuanian, Bulgarian, Macedonian, Russian, Polish, Slovak, Czech, etc.) as well as in [Greek](/wiki/Greek_language), Irish, [Icelandic](/wiki/Icelandic_language), and [Azerbaijani](/wiki/Azerbaijani_language), some surnames change form depending on the gender of the bearer. Forms of gendered names LanguageMale formFemale formReference[Icelandic patronymics](/wiki/Icelandic_name)Suffix *-son*Suffix *-dóttir*[Greek surnames](/wiki/Greek_name#Family_names)Suffixes *-os*, *-as*, *-is*Suffixes *-ou*, *-a*, *-i*[Irish surnames](/wiki/Irish_name#Surnames_and_prefixes)Prefixes *Mac*, *Ó*, *Ua*, *Mag*Prefixes *Bean Uí*, *Nic*, *Bean Mhic*, *Ní*, *Mhic*, *Nig*[Lithuanian surnames](/wiki/Lithuanian_name#Feminine_forms)Suffixes *-as*, *-ys*, *-is*, *-us*Suffixes *-ienė*, *-uvienė*, *-aitė*, *-utė*, *-iūtė*, *-ytė*, *-ė*[Latvian surnames](/wiki/Latvian_name)Suffixes *-us*, *-is*, *-s*, *-iņš*Suffixes *-a*, *-e*, *-iņa*[Scottish Gaelic surnames](/wiki/Scottish_Gaelic#Names)Prefix *Mac-*Prefix *Nic-*[Bulgarian](/wiki/Bulgarian_name) and [Macedonian surnames](/wiki/Macedonian_name)Suffixes *-ov*, *-ev*, *-ski*Suffixes *-ova*, *-eva*, *-ska*[East Slavic surnames and patronymics](/wiki/Eastern_Slavic_naming_customs#Grammar)Suffixes *-ov*, *-ev*, *-in*, *-iy*, *-oy*, *-yy*, *-ou* Patronymics *-ovich*, *-ovych*, *-yovych*, *-avich*Suffixes *-ova*, *-eva*, *-ina*, *-aya* Patronymics *-ovna*, *-ivna*, *-yivna*, *-ouna*[Czech](/wiki/Czech_name#Female_surnames) and [Slovak surnames](/wiki/Slovak_name)Suffixes *-ov*, *-ý*, *-ský*, *-cký*Suffixes *-ová*, *-á*, *-ská*, *-cká*[Polish surnames](/wiki/Polish_names)Suffixes *-ski*, *-cki*, *-dzki*Suffixes *-ska*, *-cka*, *-dzka*[Azerbaijani surnames and patronymics](/wiki/Azerbaijani_name)Suffixes *-ov*, *-yev*, Patronymic *oğlu*Suffixes *-ova*, *-yeva*, Patronymic *qızı* In Slavic languages, substantivized adjective surnames have commonly symmetrical adjective variants for males and females (*Podwiński*/*Podwińska* in Polish, *Nový*/*Nová* in Czech or Slovak, etc.). In the case of nominative and quasi-nominative surnames, the female variant is derived from the male variant by a possessive suffix (Novák/Nováková, Hromada/Hromadová). In Czech and Slovak, the pure possessive would be *Novákova*, *Hromadova*, but the surname evolved to a more adjectivized form *Nováková*, *Hromadová*, to suppress the historical possessivity. Some rare types of surnames are universal and gender-neutral: examples in Czech are *Janů*, *Martinů*, *Fojtů*, *Kovářů*. These are the archaic form of the possessive, related to the plural name of the family. Such rare surnames are also often used for transgender persons during transition because most common surnames are gender-specific.[*citation needed*] The informal dialectal female form in Polish and Czech dialects was also *-ka* (*Pawlaczka*, *Kubeška*). With the exception of the *-ski*/*-ska* suffix, most feminine forms of surnames are seldom observed in Polish.[*citation needed*] Generally, inflected languages use names and surnames as living words, not as static identifiers. Thus, the pair or the family can be named by a plural form which can differ from the singular male and female form. For instance, when the male form is Novák and the female form Nováková, the family name is *Novákovi* in Czech and *Novákovci* in Slovak. When the male form is Hrubý and the female form is Hrubá, the plural family name is Hrubí (or \"rodina Hrubých\").[*citation needed*] In Greece, if a man called Papadopoulos has a daughter or wife, she will likely be named Papadopoulou, the genitive form, as if the daughter/wife is \"of\" a man named Papadopoulos. Likewise, the surnames of daughters and wives of males with surnames ending in -as will end in -a, and those of daughters and wives of males with the -is suffix will have the -i suffix. Latvian, like Lithuanian, uses strictly feminized surnames for women, even in the case of foreign names. The function of the suffix is purely grammatical. Male surnames ending *-e* or *-a* need not be modified for women. Exceptions are: - The female surnames which correspond to nouns in the sixth declension with the ending \"*-s*\" – \"Iron\", (\"iron\"), \"rock\" - Surnames of both genders, which are written in the same nominative case form because they correspond to nouns in the third declension ending in \"*-us*\" (\"*Grigus*\", \"*Markus*\") - Surnames based on an adjective have indefinite suffixes typical of adjectives: \"*-s*, *-a*\" (\"*Stalts*\", \"*Stalta*\") or the specified endings \"*-ais*, *-ā*\" (\"*Čaklais*\", \"*Čaklā*\") (\"diligent\").[*citation needed*] In Iceland, surnames have a gender-specific suffix (-dóttir = daughter, -son = son). This was also the case in Denmark, Norway, and Sweden, until they were abolished by law in 1856, 1923, and 1966 respectively. Finnish used gender-specific suffixes up to 1929 when the Marriage Act forced women to use the husband's form of the surname. In 1985, this clause was removed from the act. Until at least 1850, women's surnames were suffixed with an -in in Tyrol. ### Indication of family membership status Some Slavic cultures originally distinguished the surnames of married and unmarried women by different suffixes, but this distinction is no longer widely observed. Some Czech dialects (Southwest-Bohemian) use the form \"*Novákojc*\" as informal for both genders. In the culture of the [Sorbs](/wiki/Sorbs) (a.k.a. Wends or Lusatians), [Sorbian](/wiki/Sorbian_languages) used different female forms for unmarried daughters (*Jordanojc*, *Nowcyc*, *Kubašec*, *Markulic*), and for wives (*Nowakowa*, *Budarka*, *Nowcyna*, *Markulina*). In Polish, typical surnames for unmarried women ended *-ówna*, *-anka*, or *-ianka*, while the surnames of married women used the possessive suffixes *-ina* or *-owa*. In Serbia, unmarried women's surnames ended in -eva, while married women's surnames ended in -ka. In Lithuania, if the husband is named Vilkas, his wife will be named Vilkienė and his unmarried daughter will be named Vilkaitė. Male surnames have suffixes -as, -is, -ius, or -us, unmarried girl surnames aitė, -ytė, -iūtė or -utė, wife surnames -ienė. These suffixes are also used for foreign names, exclusively for grammar; Welby, the surname of [a former Archbishop of Canterbury](/wiki/Justin_Welby) for example, becomes *Velbis* in Lithuanian, while his wife is *Velbienė*, and his unmarried daughter, *Velbaitė*.[*citation needed*] Many surnames include prefixes that may or may not be separated by a space or punctuation from the main part of the surname. These are usually not considered true compound names, rather single surnames are made up of more than one word. These prefixes often give hints about the type or origin of the surname (patronymic, toponymic, notable lineage) and include words that mean from [a place or lineage], and son of/daughter of/child of.[*citation needed*] The common Celtic prefixes \"*Ó*\" or \"*Ua*\" (descendant of) and \"*Mac*\" or \"*Mag*\" (son of) can be spelled with the prefix as a separate word, yielding \"*Ó Briain*\" or \"*Mac Millan*\" as well as the anglicized \"*O'Brien*\" and \"*MacMillan*\" or \"*Macmillan*\". Other Irish prefixes include *Ní*, *Nic* (daughter of the son of), *Mhic*, and *Uí* (wife of the son of).[*citation needed*] A surname with the prefix \"Fitz\" can be spelled with the prefix as a separate word, as in \"Fitz William\", as well as \"FitzWilliam\" or \"Fitzwilliam\" (like, for example, [Robert FitzRoy](/wiki/Robert_FitzRoy)). \"[Fitz](/wiki/Fitz)\" comes from French (*fils*) thus making these surnames a form of patronymic.[*citation needed*] ## Surname law A family name is typically a part of a person's [personal name](/wiki/Personal_name) and, according to law or custom, is passed or given to children from at least one of their parents' family names. The use of family names is common in most cultures around the world, but each culture has its own rules as to how the names are formed, passed, and used. However, the style of having both a family name (surname) and a given name (forename) is far from universal (see §History below). In many cultures, it is common for people to have one name or mononym, with some cultures not using family names. Issues of family name arise especially on the passing of a name to a newborn child, the adoption of a common family name on marriage, the renunciation of a family name, and the changing of a family name.[*citation needed*] [Surname laws](/wiki/Surname_law) vary around the world. Traditionally in many European countries for the past few hundred years, it was the custom or the law for a woman, upon marriage, to use her husband's surname and for any children born to bear the father's surname. If a child's paternity was not known, or if the [putative father](/wiki/Putative_father) denied paternity, the newborn child would have the surname of the mother. That is still the custom or law in many countries. The surname for children of married parents is usually inherited from the father. In recent years, there has been a trend towards equality of treatment in relation to family names, with women being not automatically required, expected or, in some places, even forbidden, to take the husband's surname on marriage, with the children not automatically being given the father's surname. In this article, both family name and surname mean the [patrilineal](/wiki/Patrilineal) surname, which is handed down from or inherited from the father, unless it is explicitly stated otherwise. Thus, the term \"maternal surname\" means the *patrilineal* surname that one's mother inherited from either or both of her parents. For a discussion of *[matrilineal](/wiki/Matrilineal)* ('mother-line') surnames, passing from mothers to daughters, see [matrilineal surname](/wiki/Matrilineal_surname).[*citation needed*] ## Surname of women King [Henry VIII](/wiki/Henry_VIII) of England (reigned 1509–1547) ordered that marital births be recorded under the surname of the father. In England and cultures derived from there, there has long been a tradition for a woman to change her surname upon marriage from her [birth name](/wiki/Name_at_birth) to her husband's family name. (See [Maiden and married names](/wiki/Maiden_and_married_names).)[*citation needed*] In the Middle Ages, when a man from a lower-status family married an only daughter from a higher-status family, he would often adopt the wife's family name.[*citation needed*] In the 18th and 19th centuries in Britain, bequests were sometimes made contingent upon a man's changing (or hyphenating) his family name, so that the name of the [testator](/wiki/Testator) continued.[*citation needed*] The United States followed the naming customs and practices of English common law and traditions until recent times. The first known instance in the United States of a woman insisting on the use of her birth name was that of [Lucy Stone](/wiki/Lucy_Stone) in 1855, and there has been a general increase in the rate of women using their birth name. Beginning in the latter half of the 20th century, traditional naming practices (writes one commentator) were recognized as \"com[ing] into conflict with current sensitivities about children's and women's rights\". Those changes accelerated a shift away from the interests of the parents to a focus on the best interests of the child. The law in this area continues to evolve today mainly in the context of paternity and custody actions. Naming conventions in the US have gone through periods of flux, however, and the 1990s saw a decline in the percentage of name retention among women. As of 2006, more than 80% of American women adopted the husband's family name after marriage. It is rare but not unknown for an English-speaking man to take his wife's family name, whether for personal reasons or as a matter of tradition (such as among [matrilineal](/wiki/Matrilineal) [Canadian aboriginal](/wiki/First_Nations_in_Canada) groups, such as the [Haida](/wiki/Haida_people) and [Gitxsan](/wiki/Gitxsan)). Upon marriage to a woman, men in the United States can change their surnames to that of their wives, or adopt a combination of both names with the federal government, through the [Social Security Administration](/wiki/Social_Security_Administration). Men may face difficulty doing so on the state level in some states.[*citation needed*] It is exceedingly rare but does occur in the United States, where a married couple may choose an entirely new last name by going through a legal change of name. As an alternative, both spouses may adopt a [double-barrelled name](/wiki/Double-barrelled_name). For instance, when John Smith and Mary Jones marry each other, they may become known as \"John Smith-Jones\" and \"Mary Smith-Jones\". A spouse may also opt to use their birth name as a middle name, and e.g. become known as \"Mary Jones Smith\".[*citation needed*] An additional option, although rarely practiced[*citation needed*], is the adoption of the last name derived from a blend of the prior names, such as \"Simones\", which also requires a legal name change. Some couples keep their own last names but give their children hyphenated or combined surnames. In 1979, the United Nations adopted the *[Convention on the Elimination of All Forms of Discrimination Against Women](/wiki/Convention_on_the_Elimination_of_All_Forms_of_Discrimination_Against_Women)* (\"CEDAW\"), which declared in effect that women and men, and specifically wife and husband, shall have the same rights to choose a \"family name\", as well as a profession and an occupation. In some places, civil rights lawsuits or constitutional amendments changed the law so that men could also easily change their married names (e.g., in British Columbia and California). [Québec](/wiki/Qu%C3%A9bec) law permits neither spouse to change surnames. In France, until 1 January 2005, children were required by law to take the surname of their father. Article 311-21 of the French [Civil code](/wiki/Civil_code) now permits parents to give their children the family name of either their father, mother, or hyphenation of both – although no more than two names can be hyphenated. In cases of disagreement, both names are used in alphabetical order. This brought France into line with a 1978 declaration by the [Council of Europe](/wiki/Council_of_Europe) requiring member governments to take measures to adopt equality of rights in the transmission of family names, a measure that was echoed by the United Nations in 1979. Similar measures were adopted by [West Germany](/wiki/West_Germany) (1976), Sweden (1982), [Denmark](/wiki/Denmark) (1983), Finland (1985) and Spain (1999). The European Community has been active in eliminating gender discrimination. Several cases concerning discrimination in family names have reached the courts. *Burghartz v. Switzerland* challenged the lack of an option for husbands to add the wife's surname to his surname, which they had chosen as the family name when this option was available for women. *Losonci Rose and Rose v. Switzerland* challenged a prohibition on foreign men married to Swiss women keeping their surname if this option was provided in their national law, an option available to women. *Ünal Tekeli v. Turkey* challenged prohibitions on women using their surname as the family name, an option only available to men. The Court found all these laws to be in violation of the convention. From 1945 to 2021 in the Czech Republic women by law had to use family names with the ending -ová after the name of their father or husband (so-called *přechýlení*). This was seen as discriminatory by a part of the public. Since 1 January 2022, Czech women can decide for themselves whether they want to use the feminine or neutral form of their family name. ## Compound surnames\n",
  "language": "en",
  "processed_at": "2026-01-12T11:03:03.361029",
  "title": "Surname",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Family_name"
}