{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:04:26.613588"
  },
  "content": "Malay cultural phenomenon, needles as talismansThis article **may need to be rewritten** to comply with Wikipedia's quality standards. Relevant discussion may be found on the talk page. You can help. The talk page may contain suggestions. *(May 2012)* **Susuk** or **charm needles**, are [needles](/wiki/Sewing_needle) made of [gold](/wiki/Gold) or other [precious metals](/wiki/Precious_metal), which are inserted into the [soft tissues](/wiki/Soft_tissue) of the body (face, chest, breast, lower back, limbs) to act as [talismans](/wiki/Amulet) in several communities of [Southeast Asia](/wiki/Southeast_Asia). Susuk has various supposed purposes, ranging from the purely aesthetic to the treatment of joint pains and other minor ailments. This practice is also used as protection against injuries and accidents. With the advent age of modern medical technology i.e. [radiography](/wiki/Radiography), the presence of susuk must be highlighted, as they may be mistaken for undesired [foreign objects](/wiki/Foreign_body). ## Description Susuk has been traditionally practiced in [Malaysia](/wiki/Malaysia), [Indonesia](/wiki/Indonesia), [Brunei](/wiki/Brunei), and [Singapore](/wiki/Singapore). Some practitioners perform rituals when inserting susuk needles, depending on their beliefs. These can include the susuk wearer memorising various incantations, oil rubbing, and chanting. Some susuk wearers are advised to avoid specific foods, such as lady finger bananas, papayas, and satay sticks.[*citation needed*] It is also believed by some that the susuk needs to be removed before death or the person will have difficulty dying. As such, susuk can be removed once the person concerned is becoming old or falls ill. Within [Islam](/wiki/Islam) the practice of susuk is considered [haram](/wiki/Haram), and is forbidden. This due to the belief that susuk is a form of black magic. The first time a susuk was photographed with radiography was in 1928. Medical professionals usually don't remove susuk, unless the needles are causing medical issues like an infection. Removing the susuk also needs the skill of a knowledgeable person; usually the same person who inserted it in the first place. However, removing the susuk, which was originally for beauty, is believed to cause the person's face to revert to its natural age within six months. Susuk wearers are often advised to keep their existence secret by their shaman, as it is believed that telling others will prevent the susuk from working. Often, the susuk needles are unable to be seen or felt under the skin. This can cause surprise and concern when medical professionals suddenly find the needles on x-rays. The susuk needles are usually made from a gold alloy, consisting of gold, copper, and trace elements of silver and aluminium.[*citation needed*] Feelings of guilt and shame may characterize the practice, as some young people (such as a young wife) may strongly be pushed into following this traditional belief. ## Known users Daisy Fajarina, mother of model [Manohara Odelia Pinot](/wiki/Manohara_Odelia_Pinot), was said to have diamond and gold susuks in her chin. Her ex-husband, George Manz said, \"Once when we were together, I took Daisy to a dentist who was then shocked when he saw her X-ray. She had small gold needles and diamond stones embedded inside her chin.\" - [Acupuncture](/wiki/Acupuncture) - [Body piercing](/wiki/Body_piercing) - Canadian Medical Association Journal article on the analysis of the health effects of multiple susuks in a patient, as detected by radiology - Royal College of Physicians, Edinburgh article on the detection and analysis of susuks; includes photos of skull x-rays with susuks Archived 2007-10-17 at the [Wayback Machine](/wiki/Wayback_Machine) (requires [Acrobat Reader](/wiki/Acrobat_Reader)) - Dentomaxillofacial Radiology article on susuks Archived 2011-10-03 at the [Wayback Machine](/wiki/Wayback_Machine) - Analysis of the Islamic stance on susuks, at Islam Online Archived 2011-01-04 at the [Wayback Machine](/wiki/Wayback_Machine) This [Malaysia](/wiki/Malaysia)-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:04:26.613271",
  "title": "Susuk",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Susuk"
}