{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:04:35.530109"
  },
  "content": "Singaporean singer (born 1983) **Sylvester Sim** (born 19 January 1983) is a [Singaporean](/wiki/Singapore) singer. ## Life and career Sim contested in the first *[Singapore Idol](/wiki/Singapore_Idol)* talent contest in 2004 was placed second place behind [Taufik Batisah](/wiki/Taufik_Batisah). He is also known as **Sly**. He used to be part of the J-rock band L'zefier. ### Sim v Lim (scheduled muay thai fight) On 31 July 2017, it was announced that Sim will be fighting prominent local celebrity Steven Lim in a [muay thai](/wiki/Muay_Thai) \"celebrity bout\". The fight was supposed to be held on 23 September 2017 at the inaugural Asia Fighting Championship event in Singapore. However, one day before the actual fight, Sim reportedly dropped out of the fight due to \"insufficient insurance coverage provided by the organisers and restrictions on increased coverage as stipulated by the insurance companies.\" According to Sim's management agency, \"this decision was made after careful considerations of the potential risks involved and ensuring Sylvester’s safety and well-being is of paramount importance.\" However, many locals believed that Sim pulled out as Lim, through a series of posts on social media, demonstrated that he was training for the fight seriously. As such, the fight, informally dubbed Sim-Lim in the Square (after local landmark Sim Lim Square), never took place. Lim later revealed Sim pulled out due to a lack of insurance coverage and was reported by *[The Straits Times](/wiki/The_Straits_Times)*, a local newspaper, that Sim had pulled out due to insurance coverage. Sim was replaced by Pradip Subramanian, the President of the World Bodybuilding and Physique Sports Federation in Singapore. During the match, Subramanian took a \"few blows to the head\" and lost to Lim via a [technical knockout](/wiki/Technical_knockout). Subramanian lost consciousness shortly after and died from a cardiac arrest respiratory failure. It was reported that there were people who blamed Sim's \"last-minute pull-out\", suggesting that Sim's action was a cause of Subramanian's death, but \"there were many others who disagreed with this opinion\". Lim was declared the winner. ## Personal life Sim married Sisy Wang, a dance choreographer from [China](/wiki/China), at Singapore Recreation Centre on 7 August 2012. They later had a daughter, Naomi Sim, who was born in 2016. ## Discography - *Qi Fei (Take Flight)* (April 2005) - \"New Hope\" (January 2016) ## Filmography ### Film YearTitleRoleRef2013*[Everybody's Business](/wiki/Everybody%27s_Business_(2013_film))*English music video artisteSpecial appearance - Sylvester Sim at [IMDb](/wiki/IMDb_(identifier)) This article about a Singaporean musician is a stub. You can help Wikipedia by expanding it. - v - t - e This Asian biographical article related to television is a stub. You can help Wikipedia by expanding it. - v - t - e This article about a Singaporean singer is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:04:35.529847",
  "title": "Sylvester Sim",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Sylvester_Sim"
}