{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:04:44.219925"
  },
  "content": "Singaporean semiconductor fabrication company **Systems on Silicon Manufacturing Company Pte. Ltd.** (more commonly known as **SSMC**) is a Singaporean [semiconductor fabrication company](/wiki/Semiconductor_fabrication_plant) located in [Pasir Ris Wafer Fab Park](/wiki/Pasir_Ris). It was incorporated in 1999 and is a joint venture between [NXP Semiconductors](/wiki/NXP_Semiconductors) (until 2006 [Philips](/wiki/Philips)) and [TSMC](/wiki/TSMC). Founded by [Philips](/wiki/Philips) and [EDB Investments](/wiki/Economic_Development_Board), the plant was completed in 2000. ## History Founded in December 1998, the company is a joint venture between [NXP Semiconductors](/wiki/NXP_Semiconductors) (until 2006 semiconductor division of [Philips](/wiki/Philips)) and [TSMC](/wiki/TSMC). Key technologies that the organisation specializes in range from 0.25-micron to 0.14-micron that support logic, embedded flash memory, mixed signal and RF applications. In addition to manufacturing, the company also offers commercial advice and support services to customer's business process. In 2006, both NXP and TSMC increased their shares in the company to 61.2% and 38.8% respectively by purchasing shares held by EDB Investments. ## Facilities Systems on Silicon Manufacturing frequently upgrades their manufacturing capabilities and products which are influenced by the demand cycles of the semiconductor industry. In 2007, the company established a research and development center to develop specialized manufacturing process, automotive, [near field communication](/wiki/Near_field_communication) and RF markets. In 2010, SSMC shifted its focus from producing chips catering to devices such as, smartphones and laptops, to high-performance mixed signal (HPMS) semiconductor chips, which are mostly used in [biometric passports](/wiki/Biometric_passports), to support technology applications aimed at solving everyday challenges. A new plant was constructed at a cost of [S$](/wiki/Singapore_dollar)2 billion, the gross floor area of the plant is about 90,000 square metres (970,000 sq ft). Construction of the plant started in 2000 and was completed by 2001, with a production output of 30,000 wafers per month. The manufacturing facilities are upgraded constantly to meet market demands and in 2010, its monthly production capacity increased to 53,000 wafers. In late 2018, SSMC expanded their automotive and specialty chip manufacturing footprint in Singapore with a S$300 million 4,400 square metres (47,000 sq ft) clean room. - [Semiconductor device fabrication](/wiki/Semiconductor_device_fabrication) - [List of Semiconductor Fabrication Plants](/wiki/List_of_Semiconductor_Fabrication_Plants) - [List of companies of Singapore](/wiki/List_of_companies_of_Singapore) - Official website This article about a technological corporation or company is a stub. You can help Wikipedia by expanding it. - v - t - e This article related to a [manufacturing](/wiki/Manufacturing) company is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:04:44.219626",
  "title": "Systems on Silicon Manufacturing",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Systems_on_Silicon_Manufacturing"
}