{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:02.911765"
  },
  "content": "2002 Singaporean film ***Talking Cock the Movie*** is a Singapore film released in May 2002. It is the brainchild of [Colin Goh](/wiki/Colin_Goh), founder of Singaporean website, [TalkingCock.com](/wiki/TalkingCock.com), which satirises local current affairs and politics, highlighting the importance of supporting [free speech](/wiki/Free_speech) in [Singapore](/wiki/Singapore). ## About The film includes the use of [Malay](/wiki/Malay_language), [Tamil](/wiki/Tamil_language), various [Chinese](/wiki/Chinese_language) dialects, as well as the unique blend of [vernacular](/wiki/Vernacular) English called [Singlish](/wiki/Singlish). The film was completely subtitled in English. ### Cast The film stars non-professional locals plucked from the heartland, in several scenes depicting the lives of exaggerated stereotype characters of the heartland. ## Story The film features four short stories, linked by a series of sketches and animated sequences based on some of TalkingCock.com's most popular characters, such as the *Turbanator* and *Lim Peh*. The stories are briefly as follows: ### eAhLong.com A young polytechnic graduate wants to *dotcom* his father's [loan shark](/wiki/Loan_shark) business. A wry look at an old profession's collision with the new economy. ### Wrong Number It is about a young man who loses his mobile phone in a taxi, and the strange circumstances that ensue when he meets the person who has found it. ### Steam A young girl working in a [dim sum](/wiki/Dim_sum) shop decides to woo one of her customers... with unexpected results. ### Razi Learns To Rock A hard rock band scrambles to find a substitute after losing their lead singer and has to educate him in the art of being cool. ### Auntie Auntie Power An office worker insults a tea-lady. Unbeknownst to him, the tea-lady has a network of friends, who she enlists to enact revenge. They taint the man's soup with laxatives, pour itching powder on his toilet-paper, and fine him for illegal parking before he can drive off. - Singapore portal - Film portal - Talking Cock the Movie - Talking Cock the Movie at the *Internet Movie Database* This film article about a 2000s comedy film is a stub. You can help Wikipedia by expanding it. - v - t - e This article related to a Singaporean film is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:02.911465",
  "title": "Talking Cock the Movie",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Talking_Cock_the_Movie"
}