{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:13.900723"
  },
  "content": "Legendary kris **Taming Sari** (which means \"flower shield\", \"beautiful shield\" or \"the main shield\" in [Malay](/wiki/Malay_language)) is a [kris](/wiki/Kris) knife, famous in [Malay folklore](/wiki/Malay_folklore). It is believed to have been wielded by the legendary [Malaccan](/wiki/Malacca) warrior [Hang Tuah](/wiki/Hang_Tuah), and is fabled to grant physical invulnerability to its wielder. ## Description The Kris Taming Sari was said to have been made of 21 different types of metal. The whole of the *sampir* (upper wooden part) and *batang* (lower part of the wooden sheath), was covered in [gold leaf](/wiki/Gold_leaf). It is classified as a *keris gabus* (sharp) or *keris terapang* (having a cross-piece or sheath covered with gold). ## Folklore The [Malay Annals](/wiki/Malay_Annals) ([Malay](/wiki/Malay_language): *Sejarah Melayu*) tells that the kris was made by a [Javanese](/wiki/Javanese_people) blacksmith (*pandai besi*) and wielded by the champion of [Majapahit](/wiki/Majapahit), a [pendekar](/wiki/Pendekar) named Taming Sari from which the weapon derives its name. It was said to be so skillfully crafted that anyone wielding it was unbeatable. In some versions of the legend, the weapon was imbued with an enchantment that would make its user physically invulnerable. The [Malaccan](/wiki/Malacca) admiral [Hang Tuah](/wiki/Hang_Tuah) eventually won a duel to the death after which Singhavikramavardhana, the king of [Majapahit](/wiki/Majapahit) presented the weapon to the victor. Later, when Hang Tuah failed to bring back the princess from [Mount Ledang](/wiki/Mount_Ledang), he gave the kris to Tun Mamat to be returned to [Sultan Mahmud Shah](/wiki/Sultan_Mahmud_Shah); Hang Tuah then disappeared without trace. In another version of the legend Hang Tuah threw the dagger into the river, saying that he would return when the kris re-appeared. The Kris Taming Sari is said to have mystical powers such as hovering in the air during times of crisis or leaping out of its sheath to fight on behalf of its wielder. ## History When [Malacca](/wiki/Malacca) was captured by the Portuguese in 1511, Sultan Mahmud retreated to [Kampar](/wiki/Kampar_Regency) in [Sumatra](/wiki/Sumatra) with all of Malacca's state regalia. He passed the weapon along with the other royal regalia to his son Muzaffar Shah, who later became the ruler of [Perak](/wiki/Perak). It is still kept in the palace of his descendant [Sultan Nazrin Muizzuddin Shah](/wiki/Sultan_Nazrin_Muizzuddin_Shah) as part of the state's royal regalia. Before Taming Sari became part of the Perak royalty's regalia, it is believed to have belonged to the family of the hereditary [laksamana](/wiki/Laksamana) (admiral) who for generations ruled as the territorial chief of [Hilir Perak](/wiki/Hilir_Perak). It is believed that the last territorial chief who had the famed kris in his possession was Laksamana Mohd Amin Alang Duakap. In 1876 he and many other [aristocrats](/wiki/Aristocracy_(class)) were arrested for their alleged involvement in the murder of the first [British Resident](/wiki/British_Resident), [James W.W. Birch](/wiki/James_W.W._Birch). Together with Datuk Shahbandar Uda Kediti (the territorial chief of Kerian), Sultan Abdullah (the reigning Perak monarch of the time) and Menteri Paduka Ngah Ibrahim (the administrator of tin-rich [Larut](/wiki/Larut)), Laksamana Mohd Amin was banished to the [Seychelles](/wiki/Seychelles). - [Taming Sari Tower](/wiki/Taming_Sari_Tower)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:13.900404",
  "title": "Taming Sari",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Taming_Sari"
}