{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:10.155453"
  },
  "content": "Dravidian language**This article contains [Indic text](/wiki/Brahmic_scripts).** Without proper rendering support, you may see [question marks or boxes](/wiki/Mojibake), misplaced vowels or missing conjuncts instead of Indic text.Tamil is written in a non-Latin script. Tamil text used in this article is transliterated into the Latin script according to the [ISO 15919](/wiki/ISO_15919) standard. **Tamil**[b] (தமிழ், *Tamiḻ*, pronounced [t̪amiɻ] ), is a [Dravidian language](/wiki/Dravidian_language) spoken by the [Tamil people](/wiki/Tamil_people) of [South Asia](/wiki/South_Asia). It is one of the longest-surviving [classical languages](/wiki/Classical_language) in the world, attested since c. [300 BCE](/wiki/300_BC). Tamil was the [lingua franca](/wiki/Lingua_franca) for early maritime traders in South India, with [Tamil inscriptions](/wiki/Tamil_inscriptions) found outside of the Indian subcontinent, such as [Indonesia](/wiki/Indonesia), [Thailand](/wiki/Thailand), and [Egypt](/wiki/Egypt). The language has a well-documented history with literary works like [Sangam literature](/wiki/Sangam_literature), consisting of over 2,000 poems. Tamil script evolved from Tamil Brahmi, and later, the vatteluttu script was used until the current script was standardized. The language has a distinct grammatical structure, with agglutinative morphology that allows for complex word formations. Tamil is the official language of the state of [Tamil Nadu](/wiki/Tamil_Nadu) and union territory of [Puducherry](/wiki/Puducherry_(union_territory)) in India. It is also one of the official languages of [Sri Lanka](/wiki/Sri_Lanka) and [Singapore](/wiki/Singapore). [Tamil-speaking diaspora communities](/wiki/Tamil_diaspora) exist in several countries across the world. Tamil was the first to be recognized as a [classical language of India](/wiki/Classical_languages_of_India) by the [Central Government](/wiki/Government_of_India) in 2004. ## Etymology The earliest extant Tamil literary works and their commentaries celebrate the [Pandiyan Kings](/wiki/Pandiyan_Kingdom) for the organization of long-term [Tamil Sangams](/wiki/Tamil_Sangams), which researched, developed and made amendments to the Tamil language. Although the name of the language which was developed by these Tamil Sangams is mentioned as Tamil, the period when the name \"Tamil\" came to be applied to the language is unclear, as is the precise etymology of the name. The earliest attested use of the name is found in [Tholkappiyam](/wiki/Tholkappiyam), which is also the oldest extant Tamil text, dated as early as the 2nd century BCE. The [Hathigumpha inscription](/wiki/Hathigumpha_inscription), inscribed around a similar period (150 BCE) by [Kharavela](/wiki/Kharavela), the Jain king of [Kalinga](/wiki/Kalinga_(historical_region)), also refers to a *Tamira Samghatta* (*Tamil confederacy*). The [Samavayanga Sutra](/wiki/Samavayanga_Sutra), dated to the 3rd century BCE, contains a reference to a Tamil script named 'Damili'. Southworth suggests that the name comes from *tam-miḻ* > *tam-iḻ* \"self-speak\", or \"our own speech\". [Kamil Zvelebil](/wiki/Kamil_Zvelebil) suggests an etymology of *tam-iḻ*, with *tam* meaning \"self\" or \"one's self\", and \"*-iḻ*\" having the connotation of \"unfolding sound\". Alternatively, he suggests a derivation of *tamiḻ* < *tam-iḻ* < **tav-iḻ* < **tak-iḻ*, meaning in origin \"the proper process (of speaking)\". However, this is deemed unlikely by Southworth due to the contemporary use of the compound 'centamiḻ', which means refined speech in the earliest literature. The Tamil Lexicon of the [University of Madras](/wiki/University_of_Madras) defines the word \"Tamil\" as \"sweetness\". S. V. Subramanian suggests the meaning \"sweet sound\", from *tam* – \"sweet\" and *il* – \"sound\". David Shulman cites Cuntaramurti's *[Tevaram](/wiki/Tevaram)*, in which he writes to [Shiva](/wiki/Shiva), \"Do you know proper Tamil?\" and ascribes it the meaning \"Do you know how to behave properly as a male lover should? Can you understand the hints and implicit meaning that a proficient lover ought to be able to decipher?\" He also states that at some point in history, Tamil meant something like \"knowing how to love\", in a poetic sense, and that to \"know Tamil\" could also mean \"to be a civilized being\". ## Classification *Tamil* belongs to the [southern](/wiki/Southern_Dravidian_languages) branch of the [Dravidian languages](/wiki/Dravidian_languages), a family of around 26 languages native to the [Indian subcontinent](/wiki/Indian_subcontinent). It is also classified as being part of a [Tamil language family](/wiki/Tamil_languages) that, alongside Tamil proper, includes the languages of about 35 ethno-linguistic groups such as the [Irula](/wiki/Irula_language) and [Yerukula](/wiki/Yerukala_language) languages (see [SIL Ethnologue](/wiki/SIL_Ethnologue)). The closest major relative of Tamil is [Malayalam](/wiki/Malayalam); the two began diverging around the 9th century CE. Although many of the differences between Tamil and Malayalam demonstrate a pre-historic divergence of the western dialect, the process of separation into a distinct language, Malayalam, was not completed until sometime in the 13th or 14th century. Additionally Kannada is also relatively close to the Tamil language and shares the format of the formal ancient Tamil language. While there are some variations from the Tamil language, Kannada still preserves a lot from its roots. As part of the southern family of Indian languages and situated relatively close to the northern parts of India, Kannada also shares some Sanskrit words, similar to Malayalam. Many of the formerly used words in Tamil have been preserved with little change in Kannada. This shows a relative parallel to Tamil, even as Tamil has undergone some changes in modern ways of speaking.[*page needed*] ## History ### Legendary origins According to Hindu legend, Tamil or in personification form [Tamil Thāi](/wiki/Tamil_Thai) (Mother Tamil) was created by Lord [Shiva](/wiki/Shiva). [Murugan](/wiki/Murugan), revered as the Tamil God, along with sage [Agastya](/wiki/Agastya), brought it to the people. ### Historical origins Tamil, like other Dravidian languages, ultimately descends from the [Proto-Dravidian language](/wiki/Proto-Dravidian_language), which was most likely spoken around the third millennium BCE, possibly in the region around the lower [Godavari](/wiki/Godavari) river basin. The material evidence suggests that the speakers of Proto-Dravidian were of the culture associated with the [Neolithic](/wiki/Neolithic) complexes of South India. Scholars categorise the attested history of the language into three periods: Old Tamil (300 BCE–700 CE), Middle Tamil (700–1600) and Modern Tamil (1600–present). ### Brahmi script About 60,000 of the approximately 100,000 inscriptions found by the [Archaeological Survey of India](/wiki/Archaeological_Survey_of_India) in India are in Tamil Nadu. Of them, most are in Tamil, with only about 5 percent in other languages such as Telugu, Kannada, Sanskrit and Marathi. In 2004, a number of skeletons were found buried in earthenware [urns](/wiki/Urn) dating from at least 696 BCE in [Adichanallur](/wiki/Adichanallur). Some of these urns contained writing in [Tamil Brahmi](/wiki/Tamil_Brahmi) script, and some contained skeletons of Tamil origin. Between 2017 and 2018, 5,820 artifacts have been found in [Keezhadi](/wiki/Keezhadi_excavation_site). These were sent to Beta Analytic in [Miami](/wiki/Miami), [Florida](/wiki/Florida), for [Accelerator Mass Spectrometry](/wiki/Accelerator_Mass_Spectrometry) (AMS) dating. One sample containing [Tamil-Brahmi](/wiki/Tamil-Brahmi) inscriptions was claimed to be dated to around 580 BCE. [John Guy](/wiki/John_Guy_(historian)) states that Tamil was the [lingua franca](/wiki/Lingua_franca) for early maritime traders from India. [Tamil language inscriptions](/wiki/Tamil_Brahmi) written in Brahmi script have been discovered in [Sri Lanka](/wiki/Sri_Lanka) and on trade goods in Thailand and Egypt. In November 2007, an excavation at Quseir-al-Qadim (likely the classical-era port town [Myos Hormos](/wiki/Myos_Hormos)) revealed Egyptian pottery dating back to first century BCE with ancient Tamil Brahmi inscriptions. There are a number of apparent [Tamil loanwords in Biblical Hebrew](/wiki/Tamil_loanwords_in_Biblical_Hebrew) dating to before 500 BCE, the oldest attestation of the language. ### Old Tamil Old Tamil is the period of the Tamil language spanning the 3rd century BCE to the 8th century CE. The earliest records in Old Tamil are short inscriptions written in a variant of the [Brahmi script](/wiki/Brahmi_script) called [Tamil-Brahmi](/wiki/Tamil-Brahmi). The earliest long text in Old Tamil is the *[Tolkāppiyam](/wiki/Tolk%C4%81ppiyam)*, an early work on Tamil grammar and poetics, whose oldest layers could be as old as the late 2nd century BCE. Many literary works in Old Tamil have also survived. These include a corpus of 2,381 poems collectively known as [Sangam literature](/wiki/Sangam_literature). These poems are usually dated to between the 1st century BCE and 5th century CE. ### Middle Tamil The evolution of [Old Tamil](/wiki/Old_Tamil) into [Middle Tamil](/wiki/Middle_Tamil), which is generally taken to have been completed by the 8th century, was characterised by a number of phonological and grammatical changes. In phonological terms, the most important shifts were the virtual disappearance of the aytam (ஃ), an old phoneme, the coalescence of the alveolar and dental nasals, and the transformation of the alveolar [plosive](/wiki/Plosive) into a [rhotic](/wiki/Rhotic_consonant). In grammar, the most important change was the emergence of the present tense. The present tense evolved out of the verb **kil** (கில்), meaning \"to be possible\" or \"to befall\". In Old Tamil, this verb was used as an [aspect marker](/wiki/Grammatical_aspect) to indicate that an action was micro-durative, non-sustained or non-lasting, usually in combination with a time marker such as **ṉ** (ன்). In Middle Tamil, this usage evolved into a present tense marker – **kiṉṟa** (கின்ற) – which combined the old aspect and time markers. ### Modern Tamil The [Nannūl](/wiki/Nann%C5%ABl) remains the standard normative grammar for modern literary Tamil, which therefore continues to be based on Middle Tamil of the 13th century rather than on Modern Tamil. Colloquial spoken Tamil, in contrast, shows a number of changes. The negative conjugation of verbs, for example, has fallen out of use in Modern Tamil – instead, negation is expressed either morphologically or syntactically. Modern spoken Tamil also shows a number of sound changes, in particular, a tendency to lower high vowels in initial and medial positions, and the disappearance of vowels between plosives and between a plosive and rhotic. Contact with European languages affected written and spoken Tamil. Changes in written Tamil include the use of European-style punctuation and the use of consonant clusters that were not permitted in Middle Tamil. The syntax of written Tamil has also changed, with the introduction of new aspectual auxiliaries and more complex sentence structures, and with the emergence of a more rigid word order that resembles the [syntactic argument structure](/wiki/Theta_role) of English. In 1578, Portuguese Christian missionaries published a Tamil prayer book in old Tamil script named *[Thambiran Vanakkam](/wiki/Thambiran_Vanakkam)*, thus making Tamil the first Indian language to be printed and published. The *[Tamil Lexicon](/wiki/Tamil_Lexicon)*, published by the [University of Madras](/wiki/University_of_Madras), was one of the earliest dictionaries published in Indian languages. A strong strain of [linguistic purism](/wiki/Linguistic_purism) emerged in the early 20th century, culminating in the [Pure Tamil Movement](/wiki/Pure_Tamil_Movement) which called for removal of all Sanskritic elements from Tamil. It received some support from [Dravidian parties](/wiki/Dravidian_parties). This led to the replacement of a significant number of [Sanskrit](/wiki/Sanskrit) loanwords by Tamil equivalents, though many others remain. According to a 2001 survey, there were 1,863 newspapers published in Tamil, of which 353 were dailies. ## Geographic distribution Tamil is the primary language of the majority of the people residing in [Tamil Nadu](/wiki/Tamil_Nadu), [Puducherry](/wiki/Puducherry_(union_territory)), (in India) and in the [Northern](/wiki/Northern_Province,_Sri_Lanka) and [Eastern](/wiki/Eastern_Province,_Sri_Lanka) provinces of [Sri Lanka](/wiki/Sri_Lanka). The language is spoken among small minority groups in other states of India which include [Karnataka](/wiki/Karnataka), [Telangana](/wiki/Telangana), [Andhra Pradesh](/wiki/Andhra_Pradesh), [Kerala](/wiki/Kerala), [Maharashtra](/wiki/Maharashtra), [Gujarat](/wiki/Gujarat), [Delhi](/wiki/Delhi), [Andaman and Nicobar Islands](/wiki/Andaman_and_Nicobar_Islands) in India and in certain regions of Sri Lanka such as [Colombo](/wiki/Colombo) and [the hill country](/wiki/Central_Province,_Sri_Lanka). Tamil or dialects of it were used widely in the state of Kerala as the major language of administration, literature and common usage until the 12th century CE. Tamil was also used widely in inscriptions found in southern [Andhra Pradesh](/wiki/Andhra_Pradesh) districts of [Chittoor](/wiki/Chittoor_district) and [Nellore](/wiki/Nellore_district) until the 12th century CE. Tamil was used for inscriptions from the 10th through 14th centuries in southern Karnataka districts such as [Kolar](/wiki/Kolar_District), [Mysore](/wiki/Mysore), [Mandya](/wiki/Mandya) and [Bengaluru](/wiki/Bengaluru). There are currently sizeable [Tamil-speaking populations](/wiki/Tamil_diaspora) descended from colonial-era migrants in [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore), [Philippines](/wiki/Philippines), [Mauritius](/wiki/Mauritius), [South Africa](/wiki/Tamil_South_Africans), Indonesia, Thailand, [Burma](/wiki/Burma), [Brunei](/wiki/Brunei), and [Vietnam](/wiki/Vietnam). Tamil is used as one of the languages of education in [Malaysia](/wiki/Malaysia), along with English, Malay and Mandarin. A large community of [Pakistani Tamils](/wiki/Tamils_in_Pakistan) speakers exists in [Karachi](/wiki/Karachi), [Pakistan](/wiki/Pakistan), which includes Tamil-speaking Hindus as well as Christians and Muslims – including some Tamil-speaking Muslim refugees from Sri Lanka. There are about 100 Tamil Hindu families in [Madrasi Para](/wiki/Madrasi_Para) colony in Karachi. They speak impeccable Tamil along with Urdu, Punjabi and Sindhi. Many in [Réunion](/wiki/R%C3%A9union), [Guyana](/wiki/Guyana), [Fiji](/wiki/Fiji), [Suriname](/wiki/Suriname), and [Trinidad and Tobago](/wiki/Trinidad_and_Tobago) have Tamil origins, but only a small number speak the language. In Reunion where the Tamil language was forbidden to be learnt and used in public space by [France](/wiki/France) it is now being relearnt by students and adults. Tamil is also spoken by migrants [from Sri Lanka](/wiki/Sri_Lankan_Tamil_diaspora) and India in [Canada](/wiki/Tamil_Canadians), the [United States](/wiki/Tamil_Americans), the [United Arab Emirates](/wiki/United_Arab_Emirates), the [United Kingdom](/wiki/British_Tamils), [South Africa](/wiki/Tamil_South_Africans), and [Australia](/wiki/Tamil_Australians). ## Status ### Official status Tamil is the [official language](/wiki/Official_language) of the Indian state of Tamil Nadu and one of the [22 languages under schedule 8 of the constitution of India](/wiki/Languages_with_official_status_in_India). It is one of the official languages of the union territories of [Puducherry](/wiki/Puducherry_(union_territory)) and the [Andaman and Nicobar Islands](/wiki/Andaman_and_Nicobar_Islands). Tamil is also one of the official languages of [Singapore](/wiki/Singapore). Tamil is one of the official and national languages of Sri Lanka, along with [Sinhala](/wiki/Sinhala_language). It was once given nominal official status in the Indian state of [Haryana](/wiki/Haryana), purportedly as a rebuff to [Punjab](/wiki/Punjab_(India)), though there was no attested Tamil-speaking population in the state, and was later replaced by [Punjabi](/wiki/Punjabi_language), in 2010. In addition, with the creation in October 2004 of a legal status for classical languages by the [Government of India](/wiki/Government_of_India) and following a political campaign supported by several Tamil associations, Tamil became the first legally recognised [Classical language](/wiki/Languages_of_India#Classical_languages_of_India) of India. The recognition was announced by the contemporaneous [President of India](/wiki/President_of_India), [Abdul Kalam](/wiki/Abdul_Kalam), who was a Tamil himself, in a joint sitting of both houses of the [Indian Parliament](/wiki/Parliament_of_India) on 6 June 2004. ### Education In Malaysia, 543 primary education government schools are available fully in [Tamil as the medium of instruction](/wiki/Tamil_primary_schools_in_Malaysia). The establishment of Tamil-medium schools has been in process in [Myanmar](/wiki/Myanmar) to provide education completely in Tamil language by the Tamils who settled there 200 years ago. Tamil language is available as a course in some local school boards and major universities in [Canada](/wiki/Canada) and the month of January has been declared \"Tamil Heritage Month\" by the [Parliament of Canada](/wiki/Parliament_of_Canada). Tamil enjoys a special status of protection under Article 6(b), Chapter 1 of the [Constitution of South Africa](/wiki/Constitution_of_South_Africa) and is taught as a subject in schools in [KwaZulu-Natal](/wiki/KwaZulu-Natal) province. Recently, it has been rolled out as a subject of study in schools in the [French overseas department](/wiki/Overseas_France) of [Réunion](/wiki/R%C3%A9union). ### Mass media Tamil-language paper media such as [newspapers](/wiki/Newspaper) are very common, with a 2001 survey claiming there were 1,863 newspapers published in Tamil (including 353 dailies). Tamil-language digital media is also abundant, with films being especially common. ## Dialects\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:10.155077",
  "title": "Tamil language",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tamil_language"
}