{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:16.011974"
  },
  "content": "Planning area in and regional centre of East Region, SingaporePlanning area and regional centre in East Region, Singapore **Tampines** ([IPA](/wiki/International_Phonetic_Alphabet): /ˈtæmpəniːs/ *TAM-pə-nees*) is the [regional centre](/wiki/Regional_centre_(Singapore)) of the [East Region](/wiki/East_Region,_Singapore) of [Singapore](/wiki/Singapore). With a population of 290,090 living across its five subzones as of 2025, it is the most populous [planning area](/wiki/Planning_Areas_of_Singapore) in Singapore. Tampines is bordered to the west by [Bedok](/wiki/Bedok) and [Paya Lebar](/wiki/Paya_Lebar), to the north by [Pasir Ris](/wiki/Pasir_Ris), to the east by [Changi](/wiki/Changi), and to the south by the [Straits of Singapore](/wiki/Singapore_Strait). Situated in the historical region of [Tanah Merah](/wiki/Tanah_Merah,_Singapore), its present-day terrain is particularly flat due to large-scale sand quarrying in the 1960s. Tampines is composed of five subzones — Tampines North, Tampines East, Tampines West, [Simei](/wiki/Simei) and Xilin. These subzones were created in the early 1990s predominantly for urban planning purposes and have no relation to the three [political constituencies](/wiki/Constituencies_of_Singapore) in Tampines. All subzones are largely residential with the exception of Xilin, which has a mix of commercial, industrial and recreational facilities. Xilin is home to [Singapore Expo](/wiki/Singapore_Expo), the largest convention center in Singapore, and features the largest agglomeration of golf courses in Singapore. Located approximately 12 km (7.5 miles) east of the [city-centre](/wiki/Central_Area,_Singapore), it was the first regional centre in Singapore, having progressed from a remote neighbourhood in the 1980s to a vibrant commercial hub. As a regional centre, it serves to decentralise economic activity to other parts of the island, an idea which was first proposed in the 1991 Concept Plan. Several large insurance companies, real estate corporations and financial institutions, such as [OCBC](/wiki/OCBC_Bank) and [UOB](/wiki/UOB_Plaza), have shifted their back-end operations to the regional centre. According to the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), it now has 200,000 m2 of office space and 112,000 m2 of retail space. Tampines is also home to [Changi Business Park](/wiki/Changi_Business_Park), Singapore’s largest integrated business park. It is a 71,000 m2 project that houses many multinational corporations, including [J.P. Morgan](/wiki/J.P._Morgan_%26_Co.), [Credit Suisse](/wiki/Credit_Suisse), [IBM](/wiki/IBM) and [Standard Chartered](/wiki/Standard_Chartered_Singapore). As of 2016, it has 152,400 resident working persons, the second-highest in Singapore, according to the Department of Statistics. [Tampines New Town](/wiki/New_towns_of_Singapore) in the north is a densely populated residential town, and regarded as the core of the planning area. Its boundaries, as delineated by the [Housing Development Board](/wiki/Housing_and_Development_Board), exclude Xilin and the private housing estates of Simei. It spans 1,200 hectares, of which 549 hectares is residential area, the largest of any town in Singapore. As of 2024, it is the most populous HDB town in Singapore, with 242,610 residents residing in HDB flats. Tampines is expected to continue its rapid growth with a projected ultimate of 110,000 dwelling units, amidst ongoing development in Tampines North and Tampines West. Regarded as a mature estate by the Government, it is the first estate in Singapore to employ its own municipal services office, given the variety of municipal issues it has to handle. Enforcement of certain minor infractions has also been delegated to Tampines Municipal Services through its enforcement officers. ## Etymology The name Tampines traces back to the Franklin and Jackson map of 1828, one of the earliest detailed surveys of Singapore. It is named after [Sungei Tampines](/wiki/Sungei_Tampines), a river that flows through the northern part of the region. The river, in turn, derived its name from the *tempinis* trees ([Malay](/wiki/Malay_language) for *[Streblus elongatus](/wiki/Streblus_elongatus)*, pronounced [təmpinis]) that were said to be growing by it. According to the National Heritage Board, the *tempinis* tree population became virtually extinct in Singapore, due to unsustainable exploitation during the early stages of Singapore’s development. In 1995, a replanting initiative was launched to reintroduce the tree across various parts of Tampines. The spelling \"Tampines\" reflects its colonial-era anglicisation, with letters modified from the original Malay name. ## History ### Early history In the past, Tampines was covered by forests, swamps, and sand quarries. [Riau ironwood](/wiki/Ironwood) trees, or *tempinis* in [Malay](/wiki/Malay_language), grew abundantly. One of the earliest known roads in the area, Tampines Road, began as a bridle path for horses and pedestrians before being converted into a cart track in 1864. The road stretched from the 6th milestone of Serangoon Road (now Kovan) to Changi Road in the east. Early settlers established villages along this route, including Kampong Teban, Teck Hock Village, Hun Yeang Village, and Kampong Tampines. Most residents lived in zinc and attap houses. ### 1900s: Plantations By the turn of the 20th century, Tampines became a major plantation zone, with coconut palms, rubber and fruit trees. One of the earliest and most prominent was owned by Tempenis Para and Coconut Plantations Limited, which held over 3,000 acres of land in 1910. Its board included notable figures such as [Tan Chay Yan](/wiki/Tan_Chay_Yan) and [Lim Boon Keng](/wiki/Lim_Boon_Keng). Other key plantation owners included Khoo Hun Yeang and [Lim Nee Soon](/wiki/Lim_Nee_Soon). A 1932 map showed Tampines dotted with plantations, including the Yeo Tek Ho, Yap, Thai Hin, Hun Yeang, and Loh Lam estates, as well as land owned by Bukit Sembawang Estates Limited and the Singapore United Rubber Plantation. Tampines Road continued to serve as the main access route for workers. Livestock rearing and vegetable farming were modest. The area also served as part of a military training area until about 1987. ### 1940s: Japanese occupation During the Japanese Occupation, a tennis court in Tampines served as a military screening centre where over 300 men were detained and interrogated by Japanese forces. The detainees were held under tight surveillance for two nights as they awaited questioning by military police. Among them were 22 men from a single family linked to war hero Lim Bo Seng, who was actively sought by the Japanese. Soldiers had raided their home early one morning, forcibly separating the men and women before tying up the men and marching them to the screening site. Of those from that family, nine were taken away and never returned. ### 1960s: Sand quarrying boom Sand quarrying in Tampines began as early as 1912, but it was during the 1960s quarrying boom that the industry rapidly expanded due to high demand for sand driven by urban redevelopment. At its peak, Tampines hosted over 20 sand quarries, drawing local farmers and fishermen into new roles. This marked a key transformation in the landscape of Tampines. However, the industry caused severe environmental damage. Silt and mud runoff polluted nearby waterways, leading to landslides and floods that devastated farmland. The air was constantly thick with dust clouds during this period. In response to growing environmental concerns, the Singapore government began regulating quarry operations in 1981. By 1991, all quarrying in Tampines had ceased. Some of the abandoned quarries were repurposed by entrepreneurs into fishing ponds and recreational areas. Others were reclaimed as part of the development of Tampines New Town. Notably, one former quarry became Bedok Reservoir, while another quarry near Tampines Avenue 10 still remains disused today. ### 1980s: Development boom Tampines New Town was established in 1978. Construction of Neighbourhoods 1 and 2 began shortly after and was prioritised, with completion taking place between 1983 and 1987. Development of Neighbourhoods 8 and 9 followed between 1985 and 1989. Neighbourhood 5 was completed in 1989, together with the Tampines Town Centre. Neighbourhood 4 was completed with the new Tampines North Division between 1986 and 1988. Due to its rapid growth, Tampines New Town was divided into four divisions: Tampines East, Tampines West, Tampines North, and Tampines Changkat. Early Singapore MRT planning documents referenced \"Tampines North\" and \"Tampines South\" as part of the proposed transit network. These provisional names reflected the perception that both areas were part of a single larger township. They were officially renamed in 1985 to Tampines and [Simei](/wiki/Simei), respectively. New construction methods expedited the development of the town's infrastructure. More attractive designs, colours, and finishings were incorporated into Tampines than earlier public housing, which consisted of uniform slabs of concrete laid out row after row with more thought given to function than form. The Town Centre was planned as an hourglass shape to create a unique urban design form. The [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) managed the construction of the town until 1991, when it handed the reins over to the Tampines Town Council. The Town Council is run by [grassroot](/wiki/Grassroot) leaders and the residents themselves. The Building and Social Housing Foundation (BSHF) of the United Nations awarded the [World Habitat Award](/wiki/World_Habitat_Awards) to Tampines, which was selected as a representative of Singapore's [new towns](/wiki/New_towns), on 5 October 1992. The award was given to recognise an outstanding contribution towards human [settlement](/wiki/Colonization) and development. Neighbourhoods 3 and 7 were only fully completed in 1997, and the constituencies had been reformed to include the new Tampines Central division. ### 2010s: Residential expansion Construction was paused until the developments of Tampines Central were started in 2010, which consists of The Premiere @ Tampines, Tampines GreenLeaf, Centrale 8, Tampines Trilliant, and Citylife @ Tampines, including some of the other leftover pockets of residential developments such as Tampines GreenTerrace, Arc @ Tampines, Q Bay Residences and The Santorini. Neighbourhood 6, which is also known as Tampines North New Town, has started construction with the first [Build-To-Order](/wiki/Build_to_order_(HDB)) (BTO) flats Tampines GreenRidges being announced at the end of November 2014. Tampines GreenRidges is also part of the first phase of the Tampines North New Town's Park West District, which is the first district to be constructed in the Tampines North New Town development. Tampines Court, had been en-bloc since July 2017 and all residents vacated their premises by 12 December 2018. It is a former HUDC flat that was privatised in 2002. It was replaced by the condominium Treasure at Tampines in 2023. ## Demographics ### Population history Resident Population 2000-2025YearPop.±%2000253,110—2001252,280−0.3%2002252,530+0.1%2003249,300−1.3%2004249,430+0.1%2005250,850+0.6%2006252,590+0.7%2007254,200+0.6%2008256,760+1.0%2009261,340+1.8%2010261,740+0.2%2011260,850−0.3%2012259,990−0.3%2013259,470−0.2%2014258,810−0.3%2015261,230+0.9%2016259,119−0.8%2017258,310−0.3%2018257,119−0.5%2019256,730−0.2%2020259,900+1.2%2021258,080−0.7%2022265,340+2.8%2023274,360+3.4%2024284,560+3.7%2024290,090+1.9%Source: As of 2025, Tampines East is the most populous subzone in Tampines and Singapore, with 126,910 residents. ### Age profile The data below is from the population report published by the Singapore Department of Statistics as of June 2025. Age group (years)MalesFemalesTotal population% of total population0–47,7807,05014,8305.115–97,5807,29014,8705.1310–146,7806,32013,1004.5215–196,7506,23012,9804.4720–246,9506,80013,7504.7425–299,4709,53019,0006.5530–3413,41014,03027,4409.4635–3912,24012,50024,7408.5340–449,85010,61020,4607.0545–498,6309,12017,7506.1250–548,1009,15017,2505.9555–598,51010,03018,5406.3960–6410,05011,34021,3907.3765–699,93010,90020,8307.1870–747,6707,92015,5905.3775–794,5604,9609,5203.2880–841,7002,3704,0701.4085–899501,6102,5600.8890+3901,0401,4300.49Age group (years)MalesFemalesTotal population% of total population0–1422,14020,66042,80014.7515–6493,96099,340193,30066.6365+25,20028,80054,00018.61 The population distribution of Tampines in 2025 demonstrates a balanced age structure. There is a higher population concentration among younger and middle-aged groups, with males and females both peaking around the 30 to 34 age range at 4.62% and 4.84% of the population respectively. The population decreases progressively among older age groups, reflecting typical aging patterns. The proportion of elderly residents above age 65, 18.6%, is similar to the national average of 18.8%. ### Household The population distribution in Tampines, as detailed in the 2025 population report, reveals that 246,930 residents, or 85.1% of the population, reside in [HDB](/wiki/Housing_and_Development_Board) flats. This is higher than the national proportion of HDB dwellers (75.8%), reflecting a greater prevalence of public housing as compared to the national average. Among the population, 110,180 residents, or 38.0% of the population, live in 4-Room HDB flats, making it the most common type of dwelling. 37,160 residents (12.8%) reside in condominiums and other apartments, while 4,340 (1.50%) live in landed properties. The average household size in Tampines as of 2020 is 3.34. The three most common household sizes are two, three, and four persons. There are 17,995 households with two persons, 18,183 households with three persons, and 17,600 households with four persons. Overall, there are 83,681 households in Tampines. Tampines has a [home ownership](/wiki/Owner-occupancy) rate of 93.2% as of 2020. This is significantly higher than the national home ownership rate of 87.9%, making Tampines the second-highest in home ownership rate among all planning areas in Singapore. This reflects a greater prevalence of homeowners in Tampines. ### Ethnicity Ethnic groups in Tampines (2000−2020) Year[Chinese](/wiki/Chinese_Singaporeans)[Malays](/wiki/Malay_Singaporeans)[Indians](/wiki/Indian_Singaporeans)Others[Pop.](/wiki/Population)PercentagePop.PercentagePop.PercentagePop.Percentage**2000**176,02169.54%57,04422.54%15,5136.13%4,5351.79%**2010**173,67766.35%57,58422%21,4118.18%9,0713.47%**2015**175,47067.17%56,01021.44%21,5608.25%8,2003.14%**2020**173,66066.82%56,57021.77%21,7008.35%7,9703.07% Tampines is one of the most ethnically diverse planning areas in Singapore. According to the Census of Population 2020 (Table 89), Tampines ranks second, after [Woodlands](/wiki/Woodlands,_Singapore), in terms of the largest [Malay](/wiki/Malays_(ethnic_group)) population among planning areas, with 56,570 people making up 21.77% of its residents. [Indians](/wiki/Indian_people) constitute 8.35% of the population, while the remaining 3.07% are classified under 'Others' in the census data. ### Religion Religion in Tampines reflects a diverse and vibrant community. [Buddhism](/wiki/Buddhism) is the largest religion, with 64,965 people, or 28.62% of the population, practising it. [Islam](/wiki/Islam) is also prominent in Tampines, with 59,177 Muslims, making it the second-largest Muslim population in Singapore after Woodlands. [Christianity](/wiki/Christianity) is practised by 38,372 residents, with 13,594 or 10.92% identifying as [Catholics](/wiki/Catholic_Church). Other religious affiliations in Tampines include [Taoism](/wiki/Taoism) (7.97%), [Hinduism](/wiki/Hinduism) (3.68%), and [Sikhism](/wiki/Sikhism) (0.31%). A notable portion of the population, 16.23%, identifies as having [no religion](/wiki/Irreligion). ### Education 58,090 residents in Tampines have attained a university qualification, the third highest of all planning areas in Singapore. However, by proportion, Tampines ranks 27th, with only 28.11%. This is because a large proportion of the population is still studying. Tampines ranks 11th in Singapore, by proportion of residents enrolled in a university in 2020, with 6,906 students accounting for 15.96% of the population. ### Language Languages most frequently spoken at home, Tampines (2020 census)Languagespercent[English](/wiki/Singapore_English)46.5%[Mandarin Chinese](/wiki/Mandarin_Chinese)26.6%[Malay](/wiki/Malay_Language)16.2%[Chinese dialects](/wiki/Chinese_dialects)8.1%[Tamil](/wiki/Tamil_Language)1.3%[Indian languages](/wiki/Languages_of_India)0.83%Others0.42% [English](/wiki/English_language) is the most spoken language in Tampines, as is the case in the rest of Singapore. Of the resident population aged 5 years and over, 110,367 frequently speak English at home, either solely or with another language. There are 63,129 frequent speakers of [Mandarin](/wiki/Mandarin_Chinese), 12,843 of which solely speak the language. 19,234 frequently speak [Chinese dialects](/wiki/Varieties_of_Chinese), 38,464 speak [Malay](/wiki/Malay_language), 5,159 speak [Indian languages](/wiki/Languages_of_India), of which 3,180 are [Tamil](/wiki/Tamil_language), while 2,977 residents speak other languages at home. 97.5% of the population is literate. 157,045 residents are [bilingual](/wiki/Bilingual), with the most common language pair being English and Chinese (i.e. Mandarin and dialects). 12,846 residents in Tampines are literate in three or more languages. ### Employment and income In Tampines, 144,548 residents aged 15 years and over are employed, out of the 153,785 in its [labour force](/wiki/Workforce). This equates to an employment rate of 94.0%, on par with the [national employment rate](/wiki/Employment_in_Singapore) of 94.2%. The remaining 73,197 residents aged above 15 in Tampines are outside the labour force. Most residents in Tampines aged 15 years and over earn between S$3,000 and S$3,999, with 19,714 being in that gross monthly income category. 46,817 earn less than S$3,000 per month, while 16,078 earn between S$4,000 and S$4,999. At the higher income range, 7,842 residents earn above S$15,000 per month. According to the 2020 Census of Population, there are 9,644 resident households with a monthly income of S$20,000 and above. The second highest category for monthly household income is S$7,000-$7,999, encompassing 4,646 households. ### Crime In 2016, Tampines had the second highest number of snatch thefts (6), the third highest number of robberies (7), and the third highest number of unlicensed moneylending harassment cases (186) in Singapore. Additionally, Tampines averaged the third highest number of car thefts, with an annual increase of 17.8 cases from 2012 to 2016. However, these figures are largely attributed to the large population in Tampines. The crime rate in Tampines is not noticeably higher than the overall rate in Singapore, which remains among the lowest in the world. Five Preventable Crimes (5Ps) Recorded By Tampines Neighbourhood Police Centre (NPC) CrimeRank (2023)2023202220212020201920182017201620152014201320122011Housebreaking7=5313512551311927Outrage Of Modesty1342415236464535323845504349Robbery4=130001278761017Snatch Theft5=1102001643131110Theft Of Motor Vehicle1=51331581872117192531Total (for 5Ps)11546156425655585776859998134 In 2023, Tampines ranks 7th (tied with five others) among neighbourhoods in Singapore by number of housebreaking crimes, with five cases. This was down from 27 in 2011. Tampines NPC also had 42 cases of outrage of modesty in 2023, the 13th highest in Singapore. This number has remained relatively constant over the past decade. Tampines [NPC](/wiki/Neighbourhood_Police_Centre) had only one recorded snatch theft case in 2023, a significant drop from 13 a decade ago. The number of robbery cases dropped from 17 in 2011 to only one in 2023. Similarly, the number of motor vehicle thefts dropped from 31 in 2011 to five in 2023. This is reflective of the overall trend in Singapore. Changi NPC, which has the southern subzones of Tampines under its jurisdiction, saw one housebreaking, one motor vehicle theft and one snatch theft case in 2023. There were no robbery cases in its records for 2023. ## Economy ### Cost of living #### Housing In the first quarter of 2024, Tampines had the highest median rent for executive apartments in Singapore, at S$4,000. It had the seventh highest rent for 5-room HDB flats, at S$3,600. #### Food Tampines is the 12th most expensive planning area for food, according to the 2016 Makan Index by the [Lee Kuan Yew School of Public Policy (LKYSPP)](/wiki/Lee_Kuan_Yew_School_of_Public_Policy). Over the years, the cost of living in Tampines has risen significantly. In 2023, the Makan Index revealed that Tampines had the highest price among 26 residential neighbourhoods for a lunch or dinner at a [kopitiam](/wiki/Kopi_tiam), food court or [hawker centre](/wiki/Hawker_centre). It cost S$14.90 for a plate of chicken briyani with iced [Milo](/wiki/Milo_(drink)). It also had the highest average price for a breakfast set in the East Region at S$3.39. As for beverages, Tampines had the highest average price for kopi at S$1.24 and for lime juice at S$1.81. Its kopitiams also sold iced Milo at an average price of S$1.92, the highest in the country. These high food prices can be attributed to the high rents in Tampines. In 2024, a kopitiam in Tampines broke the record for the highest tendered rent, since the HDB's Price-Quality Method (PQM) for tenders began in 2016. There were 20 participating tenders in that particular exercise, with the successful tenderer setting the rent at $88,889.00. Four of the six most expensive coffeeshops under this tender method are in Tampines. In 2022, Tampines also set the record for the most expensive coffee shop by resale price in Singapore, at $41.68 million. ### Industries Together with the adjacent planning areas, Tampines contributes to the economy of the East Region of Singapore, which had a nominal GDP of US$50.246 million in 2023. The 71-hectare Changi Business Park is home to logistics enterprises and leading technology corporations, like AMD. It is also home to numerous finance institutions, like DBS, Citibank, and JP Morgan. The manufacturing industries are located in Tampines South and Changi South. Tampines Central is a hub for various financial institutions, ranging from banks to insurance companies, like OCBC, UOB, Income and AIA. ## Politics ### Electoral boundaries Tampines has been represented under various [Single Member Constituencies](/wiki/Single_Member_Constituencies) (SMCs) and [Group Representation Constituencies](/wiki/Group_Representation_Constituencies) (GRCs) over the years. Originally, Tampines was under the [Tampines SMC](/wiki/Tampines_Single_Member_Constituency), during a period when the town was still under development. As its population grew rapidly, the electoral boundaries were redrawn in 1988 to form the [Tampines GRC](/wiki/Tampines_Group_Representation_Constituency) and [Eunos GRC](/wiki/Eunos_Group_Representation_Constituency). Eunos GRC was eventually dissolved in 1997. Following this, the Tampines North ward was split and partially absorbed into both [Pasir Ris GRC](/wiki/Pasir_Ris_Group_Representation_Constituency) and Tampines GRC. The rest of the former was absorbed back into Tampines GRC. Pasir Ris GRC itself was dissolved in 2001, after just one electoral cycle. From 2001 to 2025, Tampines was represented across three GRCs—the namesake [Tampines](/wiki/Tampines_GRC) (for Tampines North, Tampines East and Tampines West), [Aljunied](/wiki/Aljunied_GRC) (for the area around [Temasek Polytechnic](/wiki/Temasek_Polytechnic)) and [East Coast](/wiki/East_Coast_GRC) (covering Xilin and Simei). Minor changes were made to its electoral boundaries for some elections. Since 2025, Tampines has been reorganised into East Coast GRC, Tampines GRC, and the newly formed [Tampines Changkat SMC](/wiki/Tampines_Changkat_Single_Member_Constituency). Tampines New Town now falls solely under the latter two constituencies, with the portion that was previously part of Aljunied GRC incorporated into Tampines GRC. Simei and Xilin remain under East Coast GRC. ### Contesting parties Most of Tampines has been represented by the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) since the independence of Singapore. The [National Solidarity Party](/wiki/National_Solidarity_Party_(Singapore)) (NSP) has contested Tampines GRC in every general election since the constituency was first established in 1988, with the exception of 1997 when the party was disqualified. It contested under the [Singapore Democratic Alliance](/wiki/Singapore_Democratic_Alliance) (SDA) in the 2001 and 2006 elections. The [Workers' Party](/wiki/Workers%27_Party_(Singapore)) (WP) had contested parts of the town in Tampines North, under the now-defunct Eunos GRC, in the 1988 and 1991 general elections. In both elections, WP lost narrowly with 49.11% and 47.62% of the votes respectively, despite fielding well-known candidates—[Francis Seow](/wiki/Francis_Seow), former [Solicitor-General of Singapore](/wiki/Solicitor-General_of_Singapore), and [Lee Siew Choh](/wiki/Lee_Siew_Choh), a former PAP MP and former [Barisan Sosialis](/wiki/Barisan_Sosialis) leader. The WP returned to Tampines in the 2006 general election to contest in the parts under Aljunied GRC and East Coast GRC, and has continued to do so in subsequent elections. In 2011, they won Aljunied GRC, gaining the party’s first electoral foothold in Tampines, albeit only a small portion. In 2025, WP expanded its presence by contesting Tampines GRC and Tampines Changkat SMC, marking the first time the party contested across the entire Tampines Planning Area. The [People's Power Party](/wiki/People%27s_Power_Party_(Singapore)) (PPP) contested Tampines GRC in the 2025 general election, making it the only GRC that year to feature a four-cornered contest. The team was led by the party's Secretary-General, [Goh Meng Seng](/wiki/Goh_Meng_Seng), who had previously contested in Tampines GRC in the 2011 election under the NSP. ### Members of Parliament [Minister of Communications and Information](/wiki/Ministry_of_Communications_and_Information_(Singapore)) [Tay Eng Soon](/wiki/Tay_Eng_Soon) was responsible for the Tampines North ward in Eunos GRC from 1988 until his death in 1993. He died while in office due to heart failure. [Mah Bow Tan](/wiki/Mah_Bow_Tan) had contested in and led the constituency from 1988 until his retirement from politics in 2015. Between 2011 and 2020, [Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore) and [Minister for Finance](/wiki/Minister_for_Finance_(Singapore)) [Heng Swee Keat](/wiki/Heng_Swee_Keat) headed the PAP team, before he was transferred to [East Coast GRC](/wiki/East_Coast_GRC). Since 2020, Tampines GRC has been led by [Minister of the Environment and Water Resources](/wiki/Ministry_of_the_Environment_and_Water_Resources) and [Muslim Affairs](/wiki/Minister-in-charge_of_Muslim_Affairs) [Masagos Zulkifli](/wiki/Masagos_Zulkifli), who has been contesting since the 2006 general election. ## Sports ### BG Tampines Rovers F.C. The town has a professional football club, [BG Tampines Rovers Football Club](/wiki/Tampines_Rovers_FC). It competes in the [Singapore Premier League](/wiki/Singapore_Premier_League), the top tier of the [Singapore football league system](/wiki/Singapore_football_league_system). It is sometimes referred to by its official nickname, The Stags. Founded in 1945, the club has won five [league titles](/wiki/Singapore_Premier_League), four [Singapore Cups](/wiki/Singapore_Cup), a record five [Community Shield](/wiki/Singapore_Community_Shield) and one [ASEAN Club Championship](/wiki/ASEAN_Club_Championship). This makes it one of the most decorated football clubs in Singapore. The club used to play at the old Tampines Stadium until its demolition in 2013. After the completion of [Our Tampines Hub](/wiki/Our_Tampines_Hub) on the same site, the club now plays its home fixtures at the 5,000-seat football stadium located within the integrated complex. ## Education The eleven primary schools, nine secondary schools, three tertiary institutions, and two international schools to provide education for Tampines residents and those living in the region. There are plans to add new schools in Tampines due to a high demand in the [East Region](/wiki/East_Region,_Singapore) of the [city-state](/wiki/City-state) of Singapore. ### Primary schools - Angsana Primary School - Changkat Primary School - [Chongzheng Primary School](/wiki/Chongzheng_Primary_School) - [East Spring Primary School](/wiki/East_Spring_Primary_School) - [Gongshang Primary School](/wiki/Gongshang_Primary_School) - [Junyuan Primary School](/wiki/Junyuan_Primary_School) - [Saint Hilda's Primary School](/wiki/Saint_Hilda%27s_Primary_School) - [Tampines North Primary School](/wiki/Tampines_North_Primary_School) - [Tampines Primary School](/wiki/Tampines_Primary_School) - [Yumin Primary School](/wiki/Yumin_Primary_School) - Poi Ching School ### Secondary schools - [Changkat Changi Secondary School](/wiki/Changkat_Changi_Secondary_School) - [Dunman Secondary School](/wiki/Dunman_Secondary_School) - [East Spring Secondary School](/wiki/East_Spring_Secondary_School) - [Junyuan Secondary School](/wiki/Junyuan_Secondary_School) - [Ngee Ann Secondary School](/wiki/Ngee_Ann_Secondary_School) - [Pasir Ris Secondary School](/wiki/Pasir_Ris_Secondary_School) - Springfield Secondary School - [Saint Hilda's Secondary School](/wiki/Saint_Hilda%27s_Secondary_School) - [Tampines Secondary School](/wiki/Tampines_Secondary_School) ### Tertiary institutions List - [ITE College East](/wiki/ITE_College_East) - [Singapore University of Technology and Design](/wiki/Singapore_University_of_Technology_and_Design) - [Temasek Junior College](/wiki/Temasek_Junior_College) (temporarily located in Tampines East from Jan 2024 to Dec 2027, during which the Bedok South campus is reconstructed) - [Temasek Polytechnic](/wiki/Temasek_Polytechnic) [Temasek Polytechnic](/wiki/Temasek_Polytechnic) is a post-secondary academic institution in Tampines West. Established in April 1990, it is the third [polytechnic](/wiki/Polytechnic_(Singapore)) in Singapore. Since its inception, it has grown to become a significant educational institution in the East Region, with 13,000 students enrolled. Temasek Polytechnic's extensive 36-hectare campus houses six different schools. It offers 37 full-time and more than 40 part-time diploma courses that cater to different industries, from aerospace engineering to accountancy and cybersecurity. In 1998, [Institute of Technical Education (ITE)](/wiki/Institute_of_Technical_Education) established a small campus in Tampines Changkat, as part of a five-million dollar ITE 2000 plan to improve itself. ITE provides vocational and technical education to students, preparing them for careers in various industries. In 2005, [ITE College East](/wiki/ITE_College_East) opened its doors in Simei. The 10.7-hectare campus offers a diverse range of courses that cater to the evolving needs of the workforce. In an effort to consolidate the older satellite campuses into this new campus, ITE College Tampines closed in 2010. ITE College East now comprises four schools, of which the School of Health Sciences is exclusive to the East campus. Its student population has grown steadily to 9,000 in 2023. The [Singapore University of Technology and Design (SUTD)](/wiki/Singapore_University_of_Technology_and_Design), established in 2012, moved to its permanent campus in Xilin in 2015. As the fourth public university in Singapore, SUTD specialises in design and technology education, and offers full-time undergraduate courses in five majors. It also offers seven Master programmes and three PhD programmes, and houses several research centres, including the Lee Kuan Yew Centre for Innovation Cities. The university ranks 128th in the 2023 QS Asian University Rankings. The former Tampines Junior College was located in Tampines East, and provided pre-university education for [GCE A-Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) graduates. It merged with [Meridian Junior College](/wiki/Meridian_Junior_College) in 2020 to form [Tampines Meridian Junior College](/wiki/Tampines_Meridian_Junior_College), and moved into its sister campus in [Pasir Ris](/wiki/Pasir_Ris). ### Specialised institutions List - [Pathlight School (Tampines)](/wiki/Pathlight_School) - Metta School [Pathlight School](/wiki/Pathlight_School) will be opening a permanent campus in Tampines West in 2025. Together with the other existing campus in [Ang Mo Kio](/wiki/Ang_Mo_Kio), Pathlight School provides specialised educational programmes to the needs of students with autism and other developmental challenges. Built on the site former occupied by East View Primary School, the Tampines campus will take in 500 pupils with special educational needs (SEN). Metta School, located in Simei, is a specialised institution catering to students aged 7 to 21 with mild intellectual disabilities (MID) and autism (ASD). Formed as an offshoot of [Movement for the Intellectually Disabled of Singapore (MINDS)](/wiki/Movement_for_the_Intellectually_Disabled_of_Singapore), the school provides both certification and non-certification vocational training programmes tailored to meet the diverse learning needs of its students. ### International schools List - [UWCSEA East](/wiki/United_World_College_of_South_East_Asia) - Middleton International School [United World College of South East Asia (UWCSEA)](/wiki/United_World_College_of_South_East_Asia) established its East Campus in Tampines in 2008. UWCSEA East provides a learning environment for 2,500 local and international students of ages 4 to 18. Middleton International School is the second international school in Tampines, located on the site of the previous ITE College Tampines. ## Amenities Tampines, which includes Tampines North and [Simei](/wiki/Simei) is home to over 237,800 residents living in 152,000 HDB flats spread out over 20.89 square kilometres: - [Tampines North](/wiki/Tampines_North) - [Tampines East](/wiki/Tampines_East) - Tampines Changkat - [Tampines Central](/wiki/Tampines_Central) - [Tampines West](/wiki/Tampines_West) - [Simei](/wiki/Simei) - Others (*mainly commercial and industrial parks, with no nearby residential areas*) - Tampines Retail Park - Tampines Industrial Park A - Tampines LogisPark - Tampines Wafer Fab Park - Tampines Hi-Tech Park - Tampines Advance Display Park ### Tampines Regional Centre The [urban planning](/wiki/Urban_planning) policy of Singapore is to create partially self-sufficient towns, in terms of commercial needs, to relieve strain on traffic drawn to the city centre. Thus, an array of facilities are provided primarily for residents in the new towns. Tampines is one of Singapore's four regional centres (along with [Woodlands](/wiki/Woodlands,_Singapore), [Jurong East](/wiki/Jurong_East) and future [Seletar](/wiki/Seletar)), under the plan of the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority). As a result, the Tampines Regional Centre serves the Tampines residents and the entire [East Region](/wiki/East_Region,_Singapore). ### Commercial services There are three hotels in Tampines — Dusit Thani Laguna Singapore, Park Avenue Changi and capri by Fraser. Catered to business travellers, they are all located in and around Changi Business Park. Retail [shopping](/wiki/Shopping) in the Tampines Regional Centre is done at four main shopping malls — [Tampines Mall](/wiki/Tampines_Mall), [Century Square](/wiki/Century_Square), [Tampines 1](/wiki/Tampines_1) and [Our Tampines Hub](/wiki/Our_Tampines_Hub). Commercial tenants of the shopping centres include restaurants, supermarkets, [department stores](/wiki/Department_store), cinemas, [bookstores](/wiki/Bookstore), international money remittance and gift shops. There are other malls outside the New Town as well, namely [Eastpoint Mall](/wiki/Eastpoint_Mall,_Singapore), [Singapore Expo](/wiki/Singapore_Expo), and [Changi City Point](/wiki/Changi_City_Point). On 30 November 2006, [IKEA](/wiki/IKEA) opened its second outlet and first megastore in Singapore at Tampines Retail Park, adjacent to [Courts](/wiki/Courts_(retailer)) and [Giant](/wiki/Giant_Hypermarket), together, these three are the first to have retail warehouse stores in Singapore. On 9 April 2009, [UNIQLO](/wiki/UNIQLO) opened its first outlet in Southeast Asia at [Tampines 1](/wiki/Tampines_1). ### Community services [Tampines Regional Library](/wiki/Tampines_Regional_Library), the first regional public library in Singapore, was initially located along Tampines Avenue 7 and officially opened on 3 December 1994. It served as a \"prototype library\" to test new services and features before their implementation at other branch libraries. It was converted into a cybersecurity facility called *Tachyon @ 31* in September 2023. The library was relocated to [Our Tampines Hub](/wiki/Our_Tampines_Hub) in 2017, an integrated community and lifestyle hub. This new location continues to serve the eastern part of Singapore, offering expanded facilities and services. The library's initial concept was to be a \"library of the future,\" aligning with the Library 2000 Review Committee's vision. Tampines has six community clubs, which are managed by the [People's Association](/wiki/People%27s_Association) and provide a wide range of services. Among them, Tampines Central Community Club is housed within Our Tampines Hub. These community clubs are common spaces for residents to come together, and they occasionally provide information from the government on national policies through events and booths. ### Healthcare [Changi General Hospital](/wiki/Changi_General_Hospital) (CGH) is a major restructured hospital operated by [SingHealth](/wiki/SingHealth) in Simei, one of the subzones in the Tampines. It is the fourth largest healthcare facility in Singapore, with a capacity of 1,000 beds. As Singapore's first purpose-built general hospital, it caters to communities in the East Region of Singapore. The hospital houses six specialist centres and encompass a wide range of disciplines, such as cardiology, orthopaedic surgery, and sports medicine. In [Newsweek's](/wiki/Newsweek) World's Best Specialized Hospitals 2024 ranking, CGH ranks 48th in pulmonology, 69th in neurosurgery, 113rd in orthopedics, and 164th in oncology. Other healthcare facilities include two [polyclinics](/wiki/SingHealth#Polyclinics), with one in Tampines East and the other in Tampines North. These polyclinics offer a wide array of health services for residents, from management of chronic diseases to treatment of acute medical conditions. Besides the polyclinics, Tampines has several nursing homes and elderly day care centres to support its ageing population. ### Neighbourhood centres List - N1: Tampines Street 11 Neighbourhood Centre - N2: Tampines N2 Shopping Street - N3: Tampines Mart - N4: N4 Neighbourhood Centre - N5: Tampines Central Shopping Street - N6: *Tampines Avenue 11 mixed-use site* (working name; under construction) - N8: ShopTWest - N9: *Tampines Street 94 mixed-use site* (working name; tender in progress) As of 2025, there are six neighbourhood centres in Tampines, as gazetted in the URA Master Plan. They are located in neighbourhoods 1 to 5 and 8. Tampines Street 11 Neighbourhood Centre is the first in the planning area. Developments in the neighbourhood centre include the Tampines Town Council and Tampines Round Market & Food Centre, which opened in 1983 as the first hawker centre in Tampines. Tampines N2 Shopping Street has Singapore's most expensive coffee shop, which was sold for a record $41.68 million. The 604-square-metre establishment, known as 21 Street Eating House, features 18 stalls. This purchase price translates to approximately $6,411 per square foot, nearly matching the average rate for ground-level retail units in Far East Plaza and Lucky Plaza along Orchard Road. Tampines Central Shopping Street and ShopTWest see a comparatively high footfall, due to their proximity to Tampines MRT Station and Temasek Polytechnic respectively. Two additional neighbourhood centres have been planned. One of them will be located on a mixed-use site in Tampines North, sharing the land plot with the Tampines North Integrated Transport Hub. In 2022, a consortium comprising UOL Group, Singapore Land, and CapitaLand Development submitted the highest bid of S$1.206 billion to develop the site. The other future neighbourhood centre will be constructed in the Tampines South estate, as part of a proposed mixed-use development. On 27 June 2024, the HDB launched the sale of the site via public tender. This site has the potential to accommodate 585 residential units and will feature a gross floor area of 61,837 square metres. The development will include an early childhood development centre (ECDC), a supermarket, a food court, and a community plaza, with an underpass connection to Tampines West MRT station. ### Our Tampines Hub [Our Tampines Hub](/wiki/Our_Tampines_Hub) is a new development in Tampines. Construction began in June 2013 and it opened on 9 November 2016. It is located at the site of the former [Tampines Stadium](/wiki/Tampines_Stadium) along Avenue 4 and 5, together with the swimming pool. It is built for the residents of Tampines and provides a community space where residents can gather, interact, and bond with others from the community. Facilities available include a community centre, sports and recreation centres, swimming pools, bowling alleys, karaoke facilities, information centres, and several offices. The [Tampines Regional Library](/wiki/Tampines_Regional_Library) was also relocated here. ## Parks and recreation ### Large parks There are three main parks in Tampines New Town. Sun Plaza Park, located at Tampines Avenue 7 and 9, is one of the first parks in Tampines and previously featured a crocodile-shaped playground in the 1990s. [Tampines Eco Green](/wiki/Tampines_Eco_Green), one of [NPark's](/wiki/NParks) few nature parks, is 36.5 hectares and located northeast of Sun Plaza Park. Home to over 75 species of birds, Tampines Eco Green remains largely preserved in its existing ecological state, with marshlands, secondary forests and freshwater ponds. Tampines Boulevard Park stretches from Tampines Avenue 9 to the future [Tampines North MRT station](/wiki/Tampines_North_MRT_station), and forms the spine of Tampines North. These three parks are adjacent to each other and interconnected by footpaths and cycling paths. The former Tampines Bike Park, was located west of Tampines Avenue 12, at the current site of Tampines Boulevard Park. Managed by [Sport Singapore](/wiki/Sport_Singapore), it had the only [BMX](/wiki/BMX) track in Singapore and a 13km-long mountain bike trail. An estimated 2,600 riders visited the park each month. In 2010, Tampines Bike Park hosted BMW events during the [2010 Summer Youth Olympics](/wiki/2010_Summer_Youth_Olympics). It officially closed on 17 September 2014, to make way for housing and future developments in Tampines North. There are other parks in Tampines outside the New Town. Changi Business Park Garden is one of them, serving employees in the area. It runs through the centre of the business park, with The Signature building to its south. There are two large ponds and an amphitheatre in the garden. Zone H of [East Coast Park](/wiki/East_Coast_Park) features the only beach in Tampines. Located just south of the National Service Resort & Country Club (NSRCC), the beach in this zone can extend up to 100 metres out to sea during extreme low tides. East Coast Park offers residents an uninterrupted cycling path to the [Central Business District (CBD)](/wiki/Central_Area,_Singapore). It also connects to Changi Airport to its northeast. ### Community parks and nature ways The other parks in Tampines New Town are mainly community parks — Tampines North Park, Tampines Leisure Park, Tampines Central Park, Tampines Park, Festival Park, Tampines Green, Tampines Tree Garden, and some neighbourhood parks. These small parks serve as outdoor spaces for residents to engage in exercise activities near their homes. Occasionally, community-related events are held at Festival Park. They also serve as nodes of the Tampines Nature Way. Tampines Nature Way, characterised by its lush vegetation of trees and shrubs, is designed to mimic natural forest ecosystems. One of many nature ways in Singapore, it serves as a vital corridor for wildlife, like including birds and butterflies, to move between green spaces. Tampines Nature Way connects Tampines Eco Green, [Bedok Reservoir](/wiki/Bedok_Reservoir) and [Pasir Ris Park](/wiki/Pasir_Ris_Park), which have rich biodiversity, to the urban areas in Tampines. This also fosters a deeper appreciation of Singapore's [City in Nature initiative](/wiki/Singapore_Green_Plan_2030). Simei Nature Way serves a similar purpose, connecting green spaces in adjacent neighbourhoods. It also connects the extensive Tampines Nature Way to the Upper Changi Nature Way. In the future, more green spaces will be added in Tampines. According to the [URA](/wiki/Urban_Redevelopment_Authority) Masterplan 2019, a plot of land beside the future Tampines GreenQuartz neighbourhood in Tampines West has been earmarked for a future community park. ### Park connector Tampines Park Connector is one of many under the [Park Connector Network (PCN)](/wiki/Park_Connector_Network) in Singapore that aims to promote cycling and connect parks together with shared-use paths. With a combined length of 7 kilometres, the Tampines Park Connector provides residents with an alternative means of traversing the town and visiting other parks in Singapore. The northeastern section of Tampines Park Connector runs along [Sungei Tampines](/wiki/Sungei_Tampines). Between 2018 and 2022, the concrete canal was rebuilt into a naturalised waterway under a contract by PUB, marking the third project of its kind in Singapore. The project, which cost S$48.827 million, features lookout decks on both sides, allowing visitors to experience the waterway up close. ### Undesignated park On the outskirts of Tampines lies an undesignated park, Tampines Quarry Park. It used to be a sand quarry in the early to mid-1900s, to support the development boom in the 20th century. Rainwater has since filled the quarry. It is not equipped with any facilities, but this park still remains popular among nearby residents and off-road cycling enthusiasts. As it is hidden behind lush greenery, there are no signs or entrances to the park, though there are hidden pathways to enter. ## Transport ### Road network Three [expressways](/wiki/Controlled-access_highway), namely the [Pan-Island Expressway](/wiki/Pan-Island_Expressway), [East Coast Parkway](/wiki/East_Coast_Parkway) and [Tampines Expressway](/wiki/Tampines_Expressway) provide Tampines with connectivity to other parts of Singapore. Within the town, a network of arterial roads supports efficient intra-town movement. Notably, Tampines Avenue 10 serves as the eastern end of the [Outer Ring Road System](/wiki/Outer_Ring_Road_System), a semi-expressway designed to enhance regional connectivity. An upcoming addition to the road network is the Changi Northern Corridor, starting near Tampines Avenue 7, which will ease congestion in Tampines East and enhance connectivity to Loyang Industrial Estate and Changi Airfreight Centre. ### Mass Rapid Transit There are currently six [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) stations that serve the planning area across two lines, the [East West line](/wiki/East_West_MRT_line) and [Downtown line](/wiki/Downtown_Line). Both lines have two interchange stations at [Tampines MRT station](/wiki/Tampines_MRT_station) and [Expo MRT station](/wiki/Expo_MRT_station) on the Changi Airport Branch line. The stations of the Downtown line were opened on 21 October 2017 as part of DTL3. The six stations are: - **EW2** **DT32** [Tampines](/wiki/Tampines_MRT_station) - **EW3** [Simei](/wiki/Simei_MRT_station) - **DT31** [Tampines West](/wiki/Tampines_West_MRT_station) - **DT33** [Tampines East](/wiki/Tampines_East_MRT_station) - **DT34** [Upper Changi](/wiki/Upper_Changi_MRT_station) - **DT35** **CG1** [Expo](/wiki/Expo_MRT_station) (until 2040) - **DT36** [Xilin](/wiki/Xilin_MRT_station) (future) - **CR6** [Tampines North](/wiki/Tampines_North_MRT_station) (future) Xilin MRT station is a future underground station as part of the DTL3 extension, which will be completed in 2026, in tandem with Stage 5 of the [Thomson–East Coast line](/wiki/Thomson%E2%80%93East_Coast_Line). [Tampines North MRT station](/wiki/Tampines_North_MRT_station) is another station under construction in Tampines, and will be located in the Tampines North Integrated Transport Hub. It is part of the 29-kilometre Phase 1 of the [Cross Island line](/wiki/Cross_Island_Line), which will be operational from 2030. ### Bus There are three bus interchanges — [Tampines Bus Interchange](/wiki/Tampines_Bus_Interchange), [Tampines North Bus Interchange](/wiki/Tampines_North_Bus_Interchange) and [Tampines Concourse Bus Interchange](/wiki/Tampines_Concourse_Bus_Interchange). All of them are located in Tampines New Town. Tampines Bus Interchange is the primary bus interchange serving Tampines New Town in Singapore, operated by SBS Transit Ltd and owned by the Land Transport Authority. It complements the high-capacity rail network and supports the hub-and-spoke transport model. Tampines Bus Interchange hosts 23 bus services that cater to approximately 325,000 passengers daily, making it the fourth busiest bus interchange in Singapore. The interchange has evolved from the original Tampines Bus Terminal established in 1983, which was later replaced by a larger temporary terminal to accommodate the increasing population and transport demand. The current Tampines Bus Interchange, located in Tampines Central, began operations in phases starting in November 1987. Built at a cost of S$5 million, it features 85 bus bays and a comprehensive set of trunk and feeder services linking Tampines to the rest of Singapore. The interchange underwent refurbishments in 2008 to become barrier-free, and again in 2017 to add new alighting berths to prevent bus bunching. Tampines Concourse Bus Interchange opened on 18 December 2016, to manage peak-hour demand and passenger load at the adjacent Tampines Bus Interchange. It was designated for new services with lower demand. Tampines North Bus Interchange opened on 27 November 2022 to serve new residents in Tampines North. It will be redeveloped to be part of the Tampines North Integrated Transport Hub (ITH). [Changi Business Park Bus Terminal](/wiki/Changi_Business_Park#Changi_Business_Park_Bus_Terminal) is a bus terminal in the northern part of Changi Business Park. The terminal, which opened on 20 December 2015, introduced two new Bus Services Enhancement Programme (BSEP) bus services to enhance transportation options around the Changi Business Park. ## Infrastructure ### Transportation depot The [East Coast Integrated Depot (ECID)](/wiki/East_Coast_Integrated_Depot) in Xilin, currently under construction and expected to be completed in 2026, will serve three MRT lines: the East–West Line, the Downtown Line, and the Thomson–East Coast Line. Located beside the soon-to-be-demolished [Changi Depot](/wiki/Changi_Depot), it will be Singapore's first MRT depot to support three MRT lines and the third to integrate a bus depot. This integrated model is expected to save 44 hectares of land. It will accommodate over 200 trains of various sizes and lengths, along with more than 550 buses. ### District cooling system Tampines is set to become the first town centre in Singapore to implement a district cooling system, a significant milestone announced on 18 April. This innovative Distributed District Cooling (DDC) network will connect seven commercial buildings in Tampines Central. Scheduled to be operational by the first half of 2025, the DDC will utilise the existing cooling systems of these buildings to produce and distribute chilled water through interconnected pipes, thereby providing efficient cooling across the network. The implementation of the DDC network in Tampines is expected to significantly reduce carbon emissions and achieve substantial energy savings. SP Group and Temasek project that the network will lower carbon emissions by 1,359 tonnes annually, equivalent to removing 1,236 cars from Singapore's roads, and save over 2.8 million kilowatt-hours (kWh) of energy each year, enough to power more than 905 three-room HDB households. By optimising the existing chiller plants and using injection nodes at Century Square, Our Tampines Hub, and Tampines One, the system will enhance cooling efficiency and reduce equipment costs for building owners. This project not only demonstrates the potential for integrating sustainable solutions into existing urban infrastructures but also aligns with Singapore’s broader climate ambitions, contributing to a low-carbon future. ### Emergency services The 2nd [SCDF](/wiki/Singapore_Civil_Defence_Force) Division Headquarters, located on the western border of Tampines, has been operational since 26 January 2006. It features an underground command post, which enhances its command and control capabilities during emergencies. A public education centre was also set up to promoting community preparedness. The Tampines Fire Station, co-located with the Division Headquarters, occupies the first two levels of the seven-story building. Staffed by 140 personnel, the fire station's location along the Tampines Avenue 10 thoroughfare allows for rapid response to emergencies in the residential areas of Tampines and Pasir Ris, as well as high-risk premises in the nearby industrial parks. Tampines [Neighbourhood Police Centre (NPC)](/wiki/Neighbourhood_Police_Centre) is a mid-sized police station in Tampines West. It is under the regional command of the [Bedok Police Division](/wiki/Bedok_Police_Division). Tampines NPC was one of the first NPCs to adopt the new Community Policing System (COPS), which aims to improve the way NPCs work with the community. Tampines East Neighbourhood Police Post (NPP) and Tampines North NPP were also established for residents to access police services with ease, such as submitting police reports and applying for various permits. ### Cycling town Tampines is Singapore's pioneering cycling town. It established its first dedicated cycling paths as early as 2010. These paths link residential areas in Tampines, with key amenities such as MRT stations and community centres. In 2017, the Land Transport Authority (LTA) recently announced plans to triple the existing 6.9km cycling path network to about 21km, exceeding the cycling infrastructure in other new towns. Enhancements include widening existing paths, improving bicycle crossings with additional signage, and establishing trunk routes connecting Tampines to neighbouring towns and key employment hubs such as Changi Business Park.[*citation needed*] This cycling town project aims to promote cycling as a sustainable mode of transport, and enhance the overall liveability and accessibility of Tampines.[*citation needed*] In Tampines, there is a wide availability of shared bicycles provided by two operators, [HelloRide](/wiki/Hello_(Chinese_company)) and Anywheel. These services offer convenient access to bicycles for both residents and visitors, facilitating short trips around the town at low cost.[*citation needed*] ## Notes ### Bibliography - National Heritage Board (2002), *Singapore's 100 Historic Places*, Archipelago Press, [ISBN](/wiki/ISBN_(identifier)) 981-4068-23-3 - Tampines Town Council\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:16.011688",
  "title": "Tampines",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tampines"
}