{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:21.665850"
  },
  "content": "Regional library in Singapore 1°21′08″N 103°56′28″E﻿ / ﻿1.3522°N 103.9412°E﻿ / 1.3522; 103.9412 **Tampines Regional Library** ([Chinese](/wiki/Simplified_Chinese_character): 淡滨尼区域图书馆; [Malay](/wiki/Malay_language): *Perpustakaan Wilayah Tampines; [Tamil](/wiki/Tamil_language):* ***தெம்பினிஸ் வட்டார நூலகம்***) is a [library](/wiki/Library) located at [Our Tampines Hub](/wiki/Our_Tampines_Hub), Singapore. It is the first regional library in Singapore. The library was opened in 1994 at [Tampines New Town](/wiki/Tampines_New_Town) and was closed in June 2017 for upgrading. It was re-opened on 5 August 2017 at Our Tampines Hub. ## History It was first opened at Tampines Avenue 7 on 3 December 1994 by [Senior Minister of State for Education](/wiki/Minister_for_Education_(Singapore)) and [Health](/wiki/Minister_for_Health_(Singapore)), [Aline Wong](/wiki/Aline_Wong). The 6,208-square metre library was upgraded in 1998 to include better facilities. A [Chinese](/wiki/Chinese_language) library service was inaugurated in May 1998, after the signing of Understanding of Memorandum with the National Libraries of [Beijing](/wiki/Beijing) and [Shanghai](/wiki/Shanghai). The library also has [conference](/wiki/Conference_room) and [exhibition](/wiki/Art_exhibition) facilities. The library houses over 235,000 books with 63,000 books in Chinese, the largest collection of [Chinese books](/wiki/Chinese_literature) in the library network. There is a vast collection of materials on [overseas Chinese](/wiki/Overseas_Chinese) and children's books. The library also had a children's [playhouse](/wiki/Wendy_house) on the ground floor, [IT](/wiki/Information_technology) and [business](/wiki/Business) books and [microfilm](/wiki/Microfilm) services. It was temporarily closed on 4 June 2017 for upgrading and relocation. ## Current Building It was reopened on 5 August 2017 at its new location within, [Our Tampines Hub](/wiki/Our_Tampines_Hub) (OTH). The renovation increased floor space to 10,900-square meters, while boosting the library's collection to approximately 350,000 books. The interior consists of five publicly available floors, occupying sections of the second to sixth levels of OTH. New facilities included a culinary studio, programme zone, co-working lounge and indoor playground. Another addition was a branch of the National Library Board's MakeIT, a studio open to the public, allowing library members to utilise technology like [3D printers](/wiki/3D_printers) and hardware kits for free while creating a space for technology-related workshops and talks. ## Transport links Situated close to the [Tampines MRT station](/wiki/Tampines_MRT_station) and [bus interchange](/wiki/Tampines_Bus_Interchange), the library covers a floor area of 12,600 square metres. - National Library Board This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:21.665571",
  "title": "Tampines Regional Library",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tampines_Regional_Library"
}