{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:19.944938"
  },
  "content": "Bus interchange in Tampines, SingaporeThe topic of this article **may not meet Wikipedia's notability guideline for geographic features**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Tampines North Bus Interchange\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2022)* *(Learn how and when to remove this message)* **Tampines North Bus Interchange** is a bus interchange serving [Tampines](/wiki/Tampines) in Singapore. Operated by [SBS Transit](/wiki/SBS_Transit), the bus interchange is located along Tampines Street 62. The bus interchange opened on 27 November 2022 and features wheelchair-friendly facilities for the disabled. The new interchange is designed by SDA Architects. ## History The interchange was built at a cost of about S$12.8 million, and was opened on 27 November 2022. The interchange provides bus connections to Tampines North estate. Bus Service 18 and 129 are the first bus routes to serve Tampines North Bus Interchange, which previously terminated at [Tampines Concourse Bus Interchange](/wiki/Tampines_Concourse_Bus_Interchange) prior to being amended to their current route. ## Bus Contracting Model Under the [Bus Contracting Model](/wiki/Bus_contracting_model_of_Singapore), all bus services operating from Tampines North Bus Interchange were under Tampines Bus Packages, operated by [SBS Transit](/wiki/SBS_Transit) ### List of Bus Services OperatorPackageRoutes**Go-Ahead Singapore**Tampines18, 129, 298, 299, 454 (From July 2026)**SBS Transit**Tampines18, 129, 298, 299, 454 (Until July 2026) ## Redevelopment As part of [LTA](/wiki/Land_Transport_Authority)'s Land Transport Masterplan 2040, the current bus interchange at Tampines North will serve as an interim bus interchange, before it is redeveloped as part of the Tampines North Integrated Transport Hub (ITH), providing rail connection with the future [Tampines North MRT station](/wiki/Tampines_North_MRT_station). The ITH will be part of a mixed-used development comprising a shopping mall and a condominium. In July 2023, the land parcel along Tampines Avenue 11 and 6 was awarded to Topaz Residential and Topaz Commercial, which will be responsible for the construction of the mixed-used development, including the ITH. The development is scheduled to be completed in 2030, in tandem with the opening of [Tampines North MRT station](/wiki/Tampines_North_MRT_station). - Interchanges and Terminals (SBS Transit) This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e This bus station-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:19.944622",
  "title": "Tampines North Bus Interchange",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tampines_North_Bus_Interchange"
}