{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:31.201478"
  },
  "content": "The **Tan Kim Seng Fountain** is a [fountain](/wiki/Fountain) in [Esplanade Park](/wiki/Esplanade_Park), Singapore, that was erected in 1882 in honor of philanthropist [Tan Kim Seng](/wiki/Tan_Kim_Seng) for his donations for the Singapore's first reservoir and waterworks. ## History The erection of the Tan Kim Seng Fountain by the British Colonial Government was in response to Tan's donation of $130,050 to the government for the construction of Singapore's Castle.[*dubious – discuss*] The Tan Kim Seng Fountain was erected by the Municipal Commissioners to commemorate Tan's donation. However, his donation was squandered away by the Government Engineer, who hoped to make water run uphill through water pipes. In 1882, possibly out of shame and to mark the British colonial government's appreciation, the fountain was installed at Fullerton Square to perpetuate his name, where it would grace the busy traffic intersection for four decades. The fountain was made by [Andrew Handyside and Company](/wiki/Andrew_Handyside_and_Company) from England, and officially unveiled on 19 May 1882. The fountain was moved to Battery Road in 1905 and later in 1925 to the [Esplanade](/wiki/Esplanade,_Singapore), while the [Fullerton Building](/wiki/Fullerton_Building) was being constructed, where it currently stands. In January 1994, it was shut down for repairs that lasted seven months. As part of this S$1.12-million restoration project, the 7m-high cast-iron fountain was also rust-proofed and a new foundation was built. On 28 December 2010, the Tan Kim Seng Fountain was gazetted as a national monument. It currently sits alongside other monuments such as the [Lim Bo Seng Memorial](/wiki/Lim_Bo_Seng_Memorial) and [Cenotaph](/wiki/The_Cenotaph,_Singapore) at the [Esplanade Park](/wiki/Esplanade_Park). ## Design and appearance The [Victorian-style](/wiki/Victorian_decorative_arts) iron fountain has three tiers and is decorated with classical figures. The fountain features four [Muses](/wiki/Muses) in its lower bowl, each bearing an object of her patronage. [Calliope](/wiki/Calliope) carries a writing tablet, [Clio](/wiki/Clio) carries a scroll, [Erato](/wiki/Erato) carries a lyre, and [Melpomene](/wiki/Melpomene) carries a wreath. Beneath the sculptures of the Muses are four faces of [Poseidon](/wiki/Poseidon), with each face spouting water. The fountain bears close resemblance to the [Carriedo Fountain](/wiki/Carriedo_Fountain) in [Manila](/wiki/Manila), which also dates from 1882, and was possibly manufactured by the same founder.[*citation needed*] - [National monuments of Singapore](/wiki/National_monuments_of_Singapore) - [Queen Elizabeth Walk](/wiki/Queen_Elizabeth_Walk) - NLB.GOV.SG\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:31.201191",
  "title": "Tan Kim Seng Fountain",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tan_Kim_Seng_Fountain"
}