{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:35.269973"
  },
  "content": "Century old Chinese temple in Singapore **Tan Si Chong Su**, or Ancestral Hall of the Tan Clan, is a Chinese temple in Singapore. It is located on Magazine Road in the [Singapore River Planning Area](/wiki/Singapore_River_Planning_Area) within Singapore's [central business district](/wiki/Central_Area,_Singapore). It was constructed between 1876 and 1878 as the [ancestral temple](/wiki/Ancestral_Hall) for those with the same Tan surname, based on the premise that Chinese people with the same surname would share a common [ancestry](/wiki/Ancestry) and therefore belong to the same clan. The Temple also dedicated to [Kai Zhang Sheng Wang](/wiki/Tan_Goan-kong), the Patron Deity and founder of [Zhangzhou City](/wiki/Zhengzhou_City) in China. The temple is also known as the \"**Tan Seng Haw**\" and **Po Chiak Keng** (保赤宮, also written as *Bao Chi Gong* and other variants), meaning \"palace for the protection of the innocent\", reflecting its earlier role as a place that provided help for those in disputes as well as new Chinese immigrants in Singapore. ## History The first president of the temple was [Tan Kim Tian](/wiki/Tan_Kim_Tian). An [indenture](/wiki/Indenture) dated 28 July 1880 gave the names of the temple [trustees](/wiki/Trustee) as Tan Cheng Kiat, Tan Chew Cha, Tan Siak Kiew, Tan Mah Arang, Tan Hai Tiew and Tan Sim Boh. It was gazetted as a [national monument](/wiki/National_Monuments_of_Singapore) on 19 November 1974. ## Function The temple was built as the ancestral temple of Tan clan. The Chinese believed that people with the same surname share a common ancestry. An ancestral temple like Tan Si Chong Su provides their clan members a place to honour and respect their ancestors. It is here where the [spirit tablets](/wiki/Spirit_tablets) of deceased clan members are enshrined and venerated. The complex consists of an entrance [hall](/wiki/Hall), a main hall where the [Deities](/wiki/Shen_(Chinese_religion)) are enshrined, and a rear hall where the ancestral tablets of illustrious Tans are kept. The halls are separated by open [courtyards](/wiki/Courtyard). The temple also served as the [assembly](/wiki/Deliberative_assembly) hall for the Tan clan whose members extended beyond Singapore to [Malaysia](/wiki/Malaysia). Among some famous Tans associated with the temple was the former [Finance Minister](/wiki/Finance_Minister) of Malaysia, [Tun Tan Siew Sin](/wiki/Tan_Siew_Sin), and his father, [Tun Dato' Sir Tan Cheng Lock](/wiki/Tan_Cheng_Lock), founder and first president of the [Malaysian Chinese Association](/wiki/Malaysian_Chinese_Association), an important political party in Malaysia. Tan Cheng Lock and Tan Siew Sin were from Malacca as were the fathers of the temple's original founders. The temple's founders, Tan Kim Ching and Tan Beng Swee, were also associated with Malacca Peranakan clans. Another famous Tan is [Tan Chin Tuan](/wiki/Tan_Chin_Tuan), a retired banker and noted philanthropist and one of the temple's trustees. ## Architecture The temple tackles issues of geomancy, axiality and orientation in relationship with its surrounding buildings, roads and circulation. For example, geomancy was said that a Chinese temple is not favorable to be allocated at the end of a narrow and tight street due to bad luck and to avoid holy mess. ## News articles - \"Po Chiak Keng: Only Tans could pray here before 1982\". [The Straits Times](/wiki/The_Straits_Times) (online). 16 February 2017. Retrieved 10 July 2022. - Official Website - Uniquely Singapore website - Singapore eCitizen website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:35.269704",
  "title": "Tan Si Chong Su",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tan_Si_Chong_Su"
}