{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:42.013423"
  },
  "content": "Singaporean businessman and brokerThis article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)* **Tan Wee Beng** (born 14 February 1977) is a Singaporean businessman and [commodity broker](/wiki/Commodity_broker) currently on a [most wanted list](/wiki/Most_wanted_list) maintained by the United States [Federal Bureau of Investigation](/wiki/Federal_Bureau_of_Investigation) for [money laundering](/wiki/Money_laundering). ## Career A graduate of [Nanyang Technological University, Singapore](/wiki/Nanyang_Technological_University,_Singapore), Tan serves as the director of Wee Tiong and the managing director of WT Marine. In 2011, he was named the Emerging Entrepreneur of the Year by [Ernst & Young](/wiki/Ernst_%26_Young). Under his leadership, annual revenue at Wee Tiong reportedly grew by some 131 percent in ten years to more than [USD$](/wiki/United_States_dollar)300m in 2015. In the late 2000s, Tan sold sugar to two North Koreans, Ri Nam Sok and Jon Chol Ho, and received payment via Wee Tiong and Morgan Marcos, sister company of Wee Tiong, which he was also the director. The trade was not illegal as the time of the dealings. Between November 2016 and October 2017, local banks [United Overseas Bank](/wiki/United_Overseas_Bank) and [OCBC Bank](/wiki/OCBC_Bank) questioned Tan about the deposits in the companies' accounts which were payments for the trade to Ri and Jon. Tan, together with shipping manager Bong Hui Ping, falsified invoices by changing names of the buyers and destination ports to hide the trades as he was worried that both banks will terminate the companies' accounts on the basis of the North Korean dealings. On 11 October 2021, Tan was convicted of seven counts of falsifying invoices with 13 similar charges taken into consideration for sentencing. ### Money laundering case On 25 October 2018, the [United States Department of Justice](/wiki/United_States_Department_of_Justice) officially filed charges against Tan for his \"conspiring to use the U.S. financial system to conduct millions of dollars’ worth of transactions to finance shipments of goods to the [Democratic People’s Republic of Korea](/wiki/Democratic_People%E2%80%99s_Republic_of_Korea)\". At the same time, the [United States Department of the Treasury](/wiki/United_States_Department_of_the_Treasury) announced sanctions against Tan and the two companies under his leadership. Tan categorically denied the criminal allegations. ## Personal life The *[South China Morning Post](/wiki/South_China_Morning_Post)* described Tan as a \"Ferrari-loving entrepreneur\" based on his alleged penchant for [sports cars](/wiki/Sports_car). According to his *Business Times* profile, Tan is also a member of the London-based Refined Sugar Association. - FBI Profile Portals: - Biography - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:42.013132",
  "title": "Tan Wee Beng",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tan_Wee_Beng"
}