{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:24.459462"
  },
  "content": "Mansion in Singapore **Tan Chin Tuan Mansion** is a historic mansion at the junction of Cairnhill Road and Cairnhill Circle in Cairnhill, Singapore. Completed in 1926, it served as the residence of banker and philanthropist [Tan Chin Tuan](/wiki/Tan_Chin_Tuan) and his family. In 2007, it was integrated into a condominium as its clubhouse. ## Architecture The mansion was built in the [Beaux-Arts style](/wiki/Beaux-Arts_architecture). It features a [porte-cochère](/wiki/Porte-coch%C3%A8re) accompanied by columns of the [Ionic order](/wiki/Ionic_order). The mansion's façade features \"rich ornamentation and detailing.\" The building features a bell-shaped turret, which was once a common feature of mansions and bungalows in Singapore. Its interior features teak doors and panels, as well as [terrazzo](/wiki/Terrazzo) tiles of the [Art Nouveau](/wiki/Art_Nouveau) style. Plaster cornices can be found on the ceiling of the room above the mansion's porch. ## History The mansion was designed by Chung Hong Woot of the architectural firm Chung & Wong. It was built for community leader [Tan Kah Kee](/wiki/Tan_Kah_Kee) in 1926. However, he sold off the mansion to raise funds for the construction of the [Xiamen University](/wiki/Xiamen_University) in [Fujian, China](/wiki/Fujian). In 1939, prominent banker and philanthropist [Tan Chin Tuan](/wiki/Tan_Chin_Tuan) purchased the mansion. It served as the private residence of Tan and his family for decades. The mansion was gazetted for conservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) on 19 May 2003. A 20-storey luxury condominium was built over the mansion in the 2000s, with the mansion being restored and integrated into the development as its clubhouse. The construction work cost $3 million and took four years, completing in 2007. In 2008, the building received the URA Architectural Heritage Award for its \"successful integration of old and new.\" Rachel Lau of *Rice Media* included the mansion on her list of the \"lamest attempts\" at building conservation in Singapore, writing that the mansion is \"destined forever to be the bigger building's footstool\". 1°18′19″N 103°50′15″E﻿ / ﻿1.30526°N 103.83755°E﻿ / 1.30526; 103.83755\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:24.459161",
  "title": "Tan Chin Tuan Mansion",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tan_Chin_Tuan_Mansion"
}