{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:38.376628"
  },
  "content": "* *Tan Teow Yeow** ([Chinese](/wiki/Simplified_Chinese_characters): 陈朝耀; [pinyin](/wiki/Pinyin): *Chén Cháoyào*) (1946 – 6 August 2008) was a [judicial commissioner](/wiki/Judicial_commissioner) of the [Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore) and a former president of the Industrial Arbitration Court. ## Early life and education Tan graduated from the [National University of Singapore Faculty of Law](/wiki/National_University_of_Singapore_Faculty_of_Law) in 1967. ## Career Tan served in the legal sector for 40 years. He started his career first as a deputy public prosecutor and then as a [magistrate](/wiki/Magistrate). In 1973, he was appointed as the head of the Crime Division of the Attorney-general's Chambers. He was then appointed as the president of the Industrial Arbitration Court from 1988 to 1991. He was elevated to the bench in 1989 and served a two-year term as [Judicial Commissioner](/wiki/Judicial_Commissioner) of the [Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore) from 1989 to 1991. During his two-year term as judicial commissioner, one of the cases presided over by Tan was the case of [Hensley Anthony Neville](/wiki/Hensley_Anthony_Neville) (1957–1992), a Singaporean who was wanted by Singaporean authorities for the 1984 rape and murder of [Lim Hwee Huang](/wiki/Lim_Hwee_Huang), a 19-year-old interior designer who was thrown to her death from the kitchen window of Neville's flat at [Kallang Bahru](/wiki/Kallang_Bahru). Neville, who was arrested in Malaysia in March 1987, was reportedly the first person to represent himself without a lawyer during a murder trial in Singapore. Although Neville argued that both he and Lim had consensual sex and that Lim could have either accidentally or suicidally fallen to her death, both Tan and another trial judge, [Lai Kew Chai](/wiki/Lai_Kew_Chai), overruled Neville's claims and instead, they both determined that he had \"wilfully and cruelly\" killed Lim after he raped the 19-year-old victim, and hence sentenced him [to death](/wiki/Capital_punishment_in_Singapore) on 22 November 1990. ## See also - [Judicial officers of the Republic of Singapore](/wiki/Judicial_officers_of_the_Republic_of_Singapore) This article about a politician from Singapore is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:38.376324",
  "title": "Tan Teow Yeow",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tan_Teow_Yeow"
}