{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:40.016648"
  },
  "content": "Malaysian politician (1914–1985)This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Tan Tong Hye\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2009)* *(Learn how and when to remove this message)* [Tan Sri](/wiki/Malay_styles_and_titles#Tan_Sri) **Mohammed Tahir Tan Tong Hye**, also known as **T. H. Tan** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 陈东海; [traditional Chinese](/wiki/Traditional_Chinese_characters): 陳東海; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Tân Tong-hái*) (31 October 1914 – 3 November 1985), was a [Singapore](/wiki/Singapore)-born journalist and politician who became the Secretary of the [Malayan Chinese Association](/wiki/Malayan_Chinese_Association) (MCA) and the first honorary Secretary-General of the Alliance Party in Malaya. He is mainly remembered for being among the three men (the others being [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman) and [Tun Abdul Razak](/wiki/Tun_Abdul_Razak)) who took part in the [UMNO](/wiki/UMNO)-MCA Alliance delegation to London in 1954 to demand for an effective elected majority in the Federal Legislative Council of Malaya. ## Early life Born in [Singapore](/wiki/Singapore), Tan attended St. Joseph's Institution and [Raffles Institution](/wiki/Raffles_Institution). At Raffles Institution he was a contributor to the school newspaper, The Rafflesian, which would set him on the path to journalism. ## Career After his Senior [Cambridge](/wiki/Cambridge) Examination, he became a cub reporter with the [Malaya Tribune](/wiki/Malaya_Tribune). He became acquainted with the then chairman of the newspaper, [Tan Cheng Lock](/wiki/Tan_Cheng_Lock), who would become his friend, mentor and later colleague in the pursuit of Malayas independence. Tan rose quickly in the ranks, soon becoming a sub-editor and editor of the [Sunday Tribune](/wiki/Sunday_Tribune). He later joined the [Straits Times](/wiki/Straits_Times) group and became one of the leading writers of the [Singapore Free Press](/wiki/Singapore_Free_Press) and night editor of the [Sunday Times](/wiki/Sunday_Times). During the Japanese Occupation, Tan and his colleagues organized a news service for [Commonwealth](/wiki/Commonwealth_of_Nations) prisoners of war at Sime Road camp and [Changi Prison](/wiki/Changi_Prison). After the war, the English-only policy for top positions at the Straits Times led Tan to join the Singapore edition of the Tiger Standard, the paper established by [Aw Boon Haw](/wiki/Aw_Boon_Haw). In 1950, a Standard-owned [DC-3](/wiki/DC-3) airplane crash-landed in [Thailand](/wiki/Thailand), paper's substantial profits, but Aw refused on account that his son was also a victim. As a result of this difference in opinion, Tan resigned from the paper. Upon resignation, Tan joined the MCA in 1953 as Chief Executive Secretary, a position that he retained for nearly three years. In May 1954, an UMNO-MCA Alliance delegation composed of [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman), [Tun Abdul Razak](/wiki/Tun_Abdul_Razak) and Tan arrived in London to demand for an effective elected majority in the new [Federal Legislative Council](/wiki/Federal_Legislative_Council). The MCA president, [Tan Cheng Lock](/wiki/Tan_Cheng_Lock), was not asked to attend. He authorized Tan Tong Hye to represent him in the talks as proposed by Razak and Tengku, for the trip. Tan was instructed by MCA to hand a memorandum issued by the MCA and Chinese educational bodies opposing colonial education policy and Chinese demands over to the British Undersecretary of State for Colonies, [Oliver Lyttelton](/wiki/Oliver_Lyttelton) . But Tan did not hand over the memorandum as Razak felt that the delegation should speak in one voice to the British colonials. However, the mission failed, leading the Alliance leaders to push for a boycott of the [Federal Legislative Council](/wiki/Federal_Legislative_Council) and other bodies to put further pressure on the British government to heed Alliance terms for independence. The boycott lasted three weeks and ended when the [High Commissioner](/wiki/High_Commissioner) agreed to consult the leader of the majority party on the filling of five of the seven nominated seats in the [Federal Legislative Council](/wiki/Federal_Legislative_Council). Shortly after, the Alliance registered as a political party – the Alliance Party. Tan served as the Secretary General of the Alliance Party until May 1971. He retired from politics in 1975 after a series of heart attacks. Other than in the field of politics, Tan also had substantial accomplishments in business and industry, as a prime mover in the establishment of Malaya's first integrated multimillion-dollar steel mill (Malayawata) and as the leader of the [Selangor](/wiki/Selangor) and All-Malaya Chinese Chambers of Commerce. He organized the first Sino-Malay Economic Co-operation Council in [Malaysia](/wiki/Malaysia). He was also chairman and member of the board of directors in many Malaysian companies, including Southern Bank Bhd. In charity work, he was President of the [Malaysian Leprosy Relief Association](/wiki/Malaysian_Leprosy_Relief_Association). While a Buddhist by birth and he was decorated by the King of Malaysia for his service in the propagation of Buddhism in 1964. ## Honours ### Honours of Malaysia - [Malaya](/wiki/Federation_of_Malaya) - Companion of the [Order of the Defender of the Realm](/wiki/Order_of_the_Defender_of_the_Realm#Companion) (JMN) (1958) - [Malaysia](/wiki/Malaysia) - Commander of the [Order of the Defender of the Realm](/wiki/Order_of_the_Defender_of_the_Realm#Commander) (PMN) - **Tan Sri** (1964) - Mention of the \"late\" Mohammad Tahir Tan Tong Hye\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:40.016395",
  "title": "Tan Tong Hye",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tan_Tong_Hye"
}