{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:31.890209"
  },
  "content": "Singaporean politician (born 1964) **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(July 2023)* *(Learn how and when to remove this message)* **Tan See Leng**[a] (born 24 December 1964) is a Singaporean politician and former medical practitioner who has been serving as [Minister for Manpower](/wiki/Ministry_of_Manpower_(Singapore)) since 2021 and [Second Minister for Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) since 2020. A member of the [People's Action Party](/wiki/People%27s_Action_Party) (PAP), he has been the [Member of Parliament](/wiki/15th_Parliament_of_Singapore) (MP) representing the [Chua Chu Kang](/wiki/Chua_Chu_Kang) division of [Chua Chu Kang Group Representation Constituency](/wiki/Chua_Chu_Kang_Group_Representation_Constituency) since 2025. Before entering politics, Tan was a medical practitioner by profession. He founded Healthway Medical Group and had served in top positions in [Parkway Holdings](/wiki/Parkway_Holdings), [Parkway Pantai](/wiki/Parkway_Pantai) and [IHH Healthcare](/wiki/IHH_Healthcare). He made his political debut in the [2020 general election](/wiki/2020_Singaporean_general_election) as part of a five-member PAP team and won about 57% of the vote in Marine Parade GRC. ## Early life and education Tan was born to Teochews in Singapore in 1964. He attended Monk's Hill Primary School and [Monk's Hill Secondary School](/wiki/Monk%27s_Hill_Secondary_School). He received a Promsho scholarship to study the humanities at Hwa Chong Junior College. But in his first year at JC, his mother fell seriously ill and went into a coma. This led to his decision to switch from the humanities programme. He studied at the [National Junior College](/wiki/National_Junior_College) before graduating from the [Faculty of Medicine](/wiki/Faculty_of_Medicine) at the [National University of Singapore](/wiki/National_University_of_Singapore) in 1988 with a [Bachelor of Medicine, Bachelor of Surgery](/wiki/Bachelor_of_Medicine,_Bachelor_of_Surgery) (MBBS). While in National Junior College, he joined the choir as part of his [Co-Curricular Activity](/wiki/Co-curricular_activity_(Singapore)) (CCA). Tan funded his university education all by himself, with an annual school fee of S$3,000, by tutoring [junior college](/wiki/Junior_college_(Singapore)) students in subjects like [mathematics](/wiki/Mathematics), [biology](/wiki/Biology), [physics](/wiki/Physics) and [chemistry](/wiki/Chemistry). With up to eight students at a time, he earned about S$800 to S$1,000 per month. He subsequently went on to complete a [Master of Medicine](/wiki/Master_of_Medicine) degree in [family medicine](/wiki/Family_medicine) at the National University of Singapore in 1998. In 2003, he was awarded the Fellow of College of Family Physicians by the College of Family Physicians Singapore. In 2004, he obtained a [Master of Business Administration](/wiki/Master_of_Business_Administration) degree from the [University of Chicago Booth School of Business](/wiki/University_of_Chicago_Booth_School_of_Business). In 2014, he became a Fellow of the [Academy of Medicine Singapore](/wiki/Academy_of_Medicine,_Singapore). ## Career In 1992, at the age of 27, Tan founded Healthway Medical Group with a group of friends, through a bank loan of S$90,000 and an initial capital investment of S$5,000 from each of the initial stakeholders. As co-founder and chairman of the company, he grew the group to become the second largest private primary care group in Singapore. In 2004, he successfully divested the group to [British United Provident Association Healthcare](/wiki/Bupa). In 2004, Tan joined [Parkway Holdings](/wiki/Parkway_Holdings) as the [chief operating officer](/wiki/Chief_operating_officer) of [Mount Elizabeth Hospital](/wiki/Mount_Elizabeth_Hospital) and was eventually promoted to as the executive director of Pantai Holdings, [chief executive officer](/wiki/Chief_executive_officer) of Pantai Hospitals Division and the head of Malaysia operating division of Parkway until 2008. From 2010 to 2019, Tan was the group chief executive officer and managing director of Parkway Holdings and [Parkway Pantai](/wiki/Parkway_Pantai) Limited. From 2014 to 2019, he was also the chief executive officer and managing director of [IHH Healthcare](/wiki/IHH_Healthcare) BHD. During his tenures, some of his contributions included delisting Parkway Holdings in 2010 and relisting IHH Healthcare in 2012 into one of the largest initial public offerings in the world in 2012, expanding and growing the group from 15 hospitals in 2009 to 84 hospitals as of the end of 2019, leading the mergers and acquisitions of Acibadem Healthcare (Turkey), Fortis Healthcare (India), and multiple hospitals across Asia. Under his leadership, IHH Healthcare Berhad has won multiple awards, including the Best Managed and Best Overall Corporate Governance Poll awards by Asiamoney in 2016. In 2019, he retired from the position of group chief executive officer and managing director of Parkway Holdings and Parkway Pantai Limited. Over the years, Tan has held numerous ministerial advisory and medical committee appointments. For instance, since 2009, he has been a member of the board of trustees of the College of Family Physicians Singapore (CFPS). He also served in various capacities with CFPS Holdings Pte Ltd, including as its chairman from 2008 to 2010 and vice president from 2011 to 2013. In November 2013, he was appointed by the [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) as a member of the MediShield Life review committee. Moreover, he has maintained active involvement in academia through board memberships and appointments. From 2011 to 2019, he was adjunct assistant professor of [Duke-NUS Graduate Medical School](/wiki/Duke-NUS_Graduate_Medical_School) Singapore, Office of Education. He has also sat on the advisory board of [Lee Kong Chian School of Business](/wiki/Lee_Kong_Chian_School_of_Business) at [Singapore Management University](/wiki/Singapore_Management_University). Apart from the medical field, he has also contributed to the business scene. In 2012, Tan was appointed a council member of the Singapore-Guangdong Collaboration Council. The council aims to deepen Singapore's engagement with China's [Guangdong province](/wiki/Guangdong) and benefit Singapore businesses through joint exploration of new opportunities in the region. ## Political career Tan was fielded in the [2020 general election](/wiki/2020_Singaporean_general_election) to succeed former prime minister [Goh Chok Tong](/wiki/Goh_Chok_Tong) who retired from politics, as part of a five-member PAP team led by Speaker [Tan Chuan-Jin](/wiki/Tan_Chuan-Jin) contesting in [Marine Parade GRC](/wiki/Marine_Parade_Group_Representation_Constituency) and won. Thereafter, he was elected as the [Member of Parliament](/wiki/Parliament_of_Singapore) (MP) representing the Marine Parade division of Marine Parade GRC. Upon his team's electoral victory, Tan was appointed second minister for manpower and [second minister for trade and industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) concurrently on 27 July 2020. On 15 May 2021, Tan succeeded [Josephine Teo](/wiki/Josephine_Teo) as [Minister for Manpower](/wiki/Ministry_of_Manpower_(Singapore)) while holding onto his portfolio as second minister for trade and industry. In response to the questions filed by six MPs, during a parliamentary debate on 3 October 2022, on how the foreign workforce was complementing the local talent pipeline and how locals were getting fair consideration for jobs, Tan said that it is not a zero-sum game and that bringing in global talents create jobs for locals. Despite the PAP's earlier announcement that Tan would be the anchor minister for [Marine Parade-Braddell Heights GRC](/wiki/Marine_Parade%E2%80%93Braddell_Heights_Group_Representation_Constituency) in the [2025 general election](/wiki/2025_Singaporean_general_election), on Nomination Day on 23 April 2025, Tan was fielded as a candidate for [Chua Chu Kang GRC](/wiki/Chua_Chu_Kang_Group_Representation_Constituency). In response to questions about the move, he stated that \"I don't think I've ever abandoned Marine Parade. It was a walkover, it was a walkover. It was a walkover. I've said it three times\", and further explained that accordingly he had decided to \"stand up when called upon to go to anywhere that the party and the country think they need me to go\". ## Controversy On March 7, 2025, during the Singapore Parliament's Appropriations Committee's summary of the Ministry of Manpower's expenditure budget debate, Progress Singapore Party MP [Leong Mun Wai](/wiki/Leong_Mun_Wai) questioned the lack of transparency in the official employment rate data, including the data's failure to distinguish between \"native-born\" and \"foreign\" Singapore citizens, and the authorities' \"ignorance of the impact of foreigners obtaining local permanent residency on the relevant statistics.\" Even after Tan See Leng, as Minister of Manpower, explained several times, Leong Mun Wai was still not satisfied with his answer. At this point, Tan See Leng picked up his phone and read out Andy Lau's line from the movie [Blood Brothers](/wiki/Jiang_Hu_(2004_film)) in fluent Cantonese: \"Speak, but you don't listen; listen, but you don't understand; understand, but you don't do; do, but you do it wrong; do it wrong, but you don't admit it; admit it, but you don't change; change, but you're not convinced; so what do you want?\" This action caused controversy and even attracted the attention of Hong Kong media. Many Singaporeans who could understand Cantonese felt that Tan See Leng's action showed contempt for Leong Mun Wai and a condescending attitude. Some questioned that Singapore only has four national languages, and Cantonese is not included. They argued that Tan See Leng's remarks might exclude some ethnic minorities and sparked a debate about the legitimacy of using dialects in public. Leong Mun Wai later responded in Cantonese on his social media, saying that Tan See Leng still had not provided the data he requested. \"You said nothing, and you've gone on and on. Of course, I have to keep asking. He hasn't answered me, and now he's complaining. It's no wonder, the minister is so high and mighty. How could he understand the difficulties that the normal people face in life?\" ## Personal life Tan is married with three children. He enjoys singing and was previously a member of the school choir. ## Accolades - 2004: Tan was awarded the Long Service Award from the [People’s Association](/wiki/People%27s_Association_(Singapore)) (PA).[*citation needed*] - 2007: Tan was awarded the prestigious College of Family Physicians Singapore Albert and Mary Lim Award, the highest accolade awarded for contribution and services rendered to the college and to the discipline of Family Medicine. This was in appreciation of his contribution to CFPS, where he successfully organised the 18th Wonca World Conference in Singapore, which netted CFPS a net profit of more than US$1.3 million. - 2015: Named Asia Innovator of the Year at the 14th CNBC Asia Business Leaders Awards (ABLA) 2015 - 2016: Asiamoney Best Executive in Malaysia, Asiamoney best CEO in Investor Relations - 2017: Won the ABLA Corporate Social Responsibility Award - 2019: Singapore Medical Association Merit Award 2019 ## Notes Political officesPreceded by[Ng Chee Meng](/wiki/Ng_Chee_Meng) **[Minister in the Prime Minister’s Office](/wiki/Prime_Minister%27s_Office_(Singapore))** 2020 – 2021 Served alongside: **[Indranee Rajah](/wiki/Indranee_Rajah), [Maliki Osman](/wiki/Maliki_Osman)****Incumbent**Preceded by[Josephine Teo](/wiki/Josephine_Teo) **[Minister for Manpower](/wiki/Ministry_of_Manpower_(Singapore))** 2021 – present**Incumbent**[Parliament of Singapore](/wiki/Parliament_of_Singapore)Preceded by[Seah Kian Peng](/wiki/Seah_Kian_Peng) [Fatimah Lateef](/wiki/Fatimah_Lateef) [Edwin Tong](/wiki/Edwin_Tong) [Tan Chuan-Jin](/wiki/Tan_Chuan-Jin) [Goh Chok Tong](/wiki/Goh_Chok_Tong) **Member of Parliament for [Marine Parade GRC](/wiki/Marine_Parade_GRC)** 2020–2025 Served alongside: **[Seah Kian Peng](/wiki/Seah_Kian_Peng), [Fahmi Aliman](/wiki/Fahmi_Aliman), [Edwin Tong](/wiki/Edwin_Tong), [Tan Chuan-Jin](/wiki/Tan_Chuan-Jin)****GRC abolished** Preceded by[Zhulkarnain Abdul Rahim](/wiki/Zhulkarnain_Abdul_Rahim) [Don Wee](/wiki/Don_Wee) [Gan Kim Yong](/wiki/Gan_Kim_Yong) [Low Yen Ling](/wiki/Low_Yen_Ling) **Member of Parliament for [Chua Chu Kang GRC](/wiki/Chua_Chu_Kang_GRC)** 2025–present Served alongside: **(2025–present): [Choo Pei Ling](/wiki/Choo_Pei_Ling), [Zhulkarnain Abdul Rahim](/wiki/Zhulkarnain_Abdul_Rahim), [Jeffrey Siow](/wiki/Jeffrey_Siow)****Incumbent**\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:31.889942",
  "title": "Tan See Leng",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tan_See_Leng"
}