{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:25.994893"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*The topic of this article **may not meet Wikipedia's notability guidelines for companies and organizations**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Tan Chong International Limited\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2025)* *(Learn how and when to remove this message)*This article **does not cite any sources containing significant coverage**. Please help improve this article by adding citations to sources containing significant coverage. Articles without significant coverage do not demonstrate notability and may be deleted. *Find sources:* \"Tan Chong International Limited\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2025)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Hong-Kong based multi-industry investment holding company **Tan Chong International Limited** ([SEHK](/wiki/Hong_Kong_Stock_Exchange): 693[SGX](/wiki/Singapore_Exchange): T15 ), also known as **TCIL**, is a [Hong Kong](/wiki/Hong_Kong) based [diversified conglomerate](/wiki/Conglomerate_(company)). Incorporated in Bermuda on March 19, 1997, the company concurrently listed on the [Singapore Exchange](/wiki/Singapore_Exchange) and the [Hong Kong Stock Exchange](/wiki/Hong_Kong_Stock_Exchange). The company's operations span vehicle retail and distribution, finance, property, and transportation. Tan Chong International Limited is an independent [holding company](/wiki/Holding_company) as a result of restructuring and spin-off of non-Malaysian operations from [Tan Chong Motor Holdings Berhad](/wiki/Tan_Chong_Motor) in 1997. Although the company's automotive businesses in [ASEAN](/wiki/ASEAN) countries currently overlap with those of Tan Chong Motor, the two entities are not affiliated. ## History ### Foundation The roots of Tan Chong International Limited can be traced back to 1957, under the business units of [Tan Chong Motor Holdings Berhad](/wiki/Tan_Chong_Motor) (TCMH). To adapt to changes in the business market, TCMH underwent a major business unbundling and restructuring in the 1990s (up until 1999). This resulted in the spin-off of four independent listed entities: - **Tan Chong Motor Holdings Berhad** (responsible for domestic automotive manufacturing and sales in Malaysia) - **APM Automotive Holdings Berhad** (involved in automotive parts) - **Warisan TC Holdings Berhad** (managing non-automotive businesses like heavy machinery, interior decorations, and car rental) - **Tan Chong International Limited** (TCIL) (handling all overseas automotive sales operations as of the restructuring) Since no new shares were issued, Tan Chong International was listed by way of introduction on the [Hong Kong Stock Exchange](/wiki/Hong_Kong_Stock_Exchange) with the counter 693 and the [Singapore Exchange](/wiki/Singapore_Exchange) with the counter T15 on July 7, 1998. TCIL's Singapore headquarters are located at the Tan Chong Motor Centre, 911 [Bukit Timah Road](/wiki/Bukit_Timah_Road). Its Hong Kong headquarters are at Unit 3001, 30th Floor, Shui On Centre, 6-8 [Harbour Road](/wiki/Harbour_Road), [Wan Chai](/wiki/Wan_Chai), Hong Kong. Additionally, TCIL established Taiwan Motor Image Co., Ltd. in 2007 to import and distribute [Subaru](/wiki/Subaru) vehicles from Japan into [Taiwan](/wiki/Taiwan). ### Recent Developments Tan Chong International Limited continues to make strategic adjustments to its business. For example, in 2009, the company acquired a truck manufacturing plant in Thailand for the production and distribution of [Fuso](/wiki/Fuso_(company)) trucks. They also invested in an automotive parts factory in [Nanjing](/wiki/Nanjing), [China](/wiki/China), to enhance their seat manufacturing capabilities. More recently, the group has focused on asset optimization, including the potential sale or long-term lease of its automotive manufacturing plant in Thailand (with automotive production expected to cease by the end of 2024). They are also committed to expanding their equipment and car rental businesses in China and Singapore, respectively.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:25.994580",
  "title": "Tan Chong International Limited",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tan_Chong_International_Limited"
}