{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:50.468615"
  },
  "content": "Ferry terminal in Singapore The **Tanah Merah Ferry Terminal** is a ferry terminal in Singapore, located at [Changi](/wiki/Changi). The terminal serves ferry services to the Indonesian islands of [Batam](/wiki/Batam) and [Bintan](/wiki/Bintan_Island), and [Desaru](/wiki/Desaru), in Johor, Malaysia. It is owned and managed by [Singapore Cruise Centre](/wiki/Singapore_Cruise_Centre). ## History The terminal was constructed in 1995 at a cost of S$29 million with the intention of boosting tourism. The terminal began operations on 26 August. In 2007, the terminal, along with the [Singapore Cruise Centre](/wiki/Singapore_Cruise_Centre), received a $2.5 million IT upgrade, along with a $3 million facelift. In 2010, bus service 570 was introduced to carry passengers between the terminal and [Tanah Merah MRT station](/wiki/Tanah_Merah_MRT_station) and [Bedok MRT station](/wiki/Bedok_MRT_station). Bus service 35 has since replaced it. On 25 November 2016, a 54-year old woman named Maimunah Awang, who worked as a cleaner at the terminal, was found dead in a drain at the ferry terminal compound. A 23-year old Malaysian man was subsequently charged with her murder. The man, identified as [Ahmad Muin Yaacob](/wiki/Ahmad_Muin_Yaacob), was a colleague of Maimunah. He was found guilty of murder and sentenced to [life imprisonment](/wiki/Life_imprisonment_in_Singapore) and [eighteen strokes of the cane](/wiki/Caning_in_Singapore) in November 2020. On 21 June 2022, the [Maritime and Port Authority of Singapore](/wiki/Maritime_and_Port_Authority_of_Singapore) announced that they have approved ferry services between the terminal and Desaru Coast Ferry Terminal in Johor, Malaysia. Ferry services to Desaru Coast began on 7 July 2022 and is operated by Desaru Link Ferry Services. On 2 February 2024, Singapore Cruise Centre announced that the terminal will undergo a S$20m upgrade. As part of the upgrade, the terminal will see its capacity increase by 20% and the installation of self-service check-in kiosks and unmanned bag-drop machines. There would also be new ferry operator counters, more food and beverage options for passengers, as well as an expanded and redesigned departure hall with a 70% capacity increase and an additional lounge. The upgrades were completed and unveiled by Minister of State for Transport and Law [Murali Pillai](/wiki/Murali_Pillai) on 22 March 2025. Aside from new facilities, the terminal now has a playground for families while waiting for their trips.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:50.468174",
  "title": "Tanah Merah Ferry Terminal",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tanah_Merah_Ferry_Terminal"
}