{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:48.126165"
  },
  "content": "Region in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **may need to be rewritten** to comply with Wikipedia's quality standards. Relevant discussion may be found on the talk page. You can help. The talk page may contain suggestions. *(December 2025)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Tanah Merah, Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2025)* *(Learn how and when to remove this message)*This article includes a list of references, related reading, or external links, **but its sources remain unclear because it lacks inline citations**. Please help improve this article by introducing more precise citations. *(December 2025)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Place in East Region, Singapore **Tanah Merah** ([IPA](/wiki/International_Phonetic_Alphabet): /ˈtɑːnɑː ˌmeɪrɑː, -ˌmɛrɑː/, [Jawi](/wiki/Jawi_script): تانه ميره, [Chinese](/wiki/Chinese_language): 丹那美拉, [Tamil](/wiki/Tamil_language): தானா மேரா), is a geographical region located along the south-eastern coast of the [East Region](/wiki/East_Region,_Singapore) of [Singapore](/wiki/Singapore). Although its boundaries are not exactly clear, it is widely accepted that the term refers to the southern coast of present-day [planning areas](/wiki/Planning_areas_of_Singapore) of [Bedok](/wiki/Bedok), [Tampines](/wiki/Tampines), [Changi](/wiki/Changi) and [Changi Bay](/wiki/Changi_Bay). ## Etymology The name \"Tanah Merah\" appears in the seventeenth century (1604) map by [Manuel Godinho de Erédia](/wiki/Manuel_Godinho_de_Er%C3%A9dia) on Singapore, written as *Tana Mera*. This place name is likely to have been an important reference point for the *[orang laut](/wiki/Orang_laut)* (sea people) in their activities in the region. The [Malay](/wiki/Malay_language) name for this area is derived from the red [lateritic](/wiki/Laterite) cliffs along the [coast](/wiki/Coast) that were visible from the sea, hence the name *Tanah Merah* or \"**Red Land**\". The earliest written reference comes from [James Horsburgh](/wiki/James_Horsburgh)'s 1806 chart of \"Singapore and [Malacca](/wiki/Malacca)\", which has the name \"**Red Cliffs**\". Later, two sets of red cliffs were identified in Franklin and [Jackson](/wiki/Philip_Jackson_(surveyor))'s 1830 map: \"Large Red Cliff\" (Tanah Merah area) and \"Small Red Cliff\" (present [Bedok](/wiki/Bedok) area) and \"2nd Red Cliffs\" (Tanah Merah area). J.E. Tassin's 1836 *Map of Singapore* refers to the area as \"1st Red Cliffs\" (Bedok area) and \"2nd Red Cliffs\" (Tanah Merah area). Old maps also show the existence of Tanah Merah Road as early as the 1840s, which stretched from [Kallang River](/wiki/Kallang_River) to [Changi](/wiki/Changi) Point. Now, the road ran mostly along the original route but was renamed [Geylang](/wiki/Geylang) Road, Changi Road and Upper Changi Road, with a section between [Siglap](/wiki/Siglap) Road and Tanah Merah Kechil Road lost after the hills of [Chai Chee](/wiki/Chai_Chee) and [Bedok](/wiki/Bedok) were levelled, and another short section lost under [Changi Airport](/wiki/Changi_Airport). Later, the road leading to \"Large Red Cliff\" was named \"Tanah Merah Besar Road\" while the other was named \"Tanah Merah Kechil Road\". *Besar* means \"large\" while *Kechil* means \"little\" in Malay. The presence of [weathered](/wiki/Weathering) lateritic [soil](/wiki/Soil) provided the red-orange colouring of the area that led to its name even before [Raffles](/wiki/Stamford_Raffles)' founding of Singapore. The exposed red lateritic soils were probably visible to many passing boats and hence the \"landmark\" was captured in early maps of Singapore. ## History When land reclamation works began in the early 1970s, most of the coastal hills were levelled and dumped into the sea to create the present [East Coast](/wiki/East_Coast_Park). The [East Coast Parkway](/wiki/East_Coast_Parkway) was constructed almost completely on reclaimed land. The location of *Tanah Merah Kechil* cliff is where [Temasek Primary School](/wiki/Temasek_Primary_School) now stands. One can still see where the hills abruptly end at the junction of Bedok South Avenue 3 and Upper East Coast Road at one end, and New Upper Changi Road at the other end. *Tanah Merah Besar* was a large coastal cliff located approximately at the southern end of [Changi Airport Terminal 3](/wiki/Singapore_Changi_Airport). Its base was exposed to large tidal surges which created a 'thunderous roar' as the waves crashed on its rocky base and the sound echoed in the hollows and cavelets. It was reported that the booming sound was loud enough to be heard at a nearby village, especially during the [monsoon](/wiki/Monsoon) season. Hence the name of that village, *Kampong Ayer Gemuroh*, or Thundering Water Village. Now, the only reference to the village is a drainage canal sometimes referred to as Ayer Gemuroh Canal, which was once *Sungei Ayer Gemuroh*, that runs along the West Perimeter Fence of Changi Airport, behind [Changi Prison](/wiki/Changi_Prison). Number 48A, Tanah Merah Besar Road was the home of David Marshall. He was a barrister in what was then The Malay Federation,a champion defender of the poor and of the accused facing execution (which he abhorred). Marshall became Singapore's first Chief Minister when it separated from the British Colonial rule of the Malay Federation. ## Transport Tanah Merah's [suburbs](/wiki/Suburbs) has a number of available transport routes in and out of the area, making its accessibility little cause for concern. New Upper Changi Road, which runs through the residential area of Tanah Merah, offers a number of bus services, some of which travel long distances. Raised above the middle of New Upper Changi Road is [Tanah Merah MRT station](/wiki/Tanah_Merah_MRT_station), a railway station which also operates as an interchange for passengers who wish to travel by train to [Singapore Expo](/wiki/Singapore_Expo), [Changi Business Park](/wiki/Changi_Business_Park) and [Singapore Changi Airport](/wiki/Singapore_Changi_Airport). Its neighbouring stations are [Expo MRT station](/wiki/Expo_MRT_station), [Bedok MRT station](/wiki/Bedok_MRT_station) and [Simei MRT station](/wiki/Simei_MRT_station). The bus stops next to Tanah Merah MRT station are usual pick-up and drop-off points for buses which take passengers to nearby places such as National Service Resort & Country Club and [Changi Naval Base](/wiki/Changi_Naval_Base). By sea, it is also home to the [Tanah Merah Ferry Terminal](/wiki/Tanah_Merah_Ferry_Terminal) with regular service to the Indonesian [Riau Islands](/wiki/Riau_Islands), as well as Sebana Cove and [Tanjung Pengelih](/wiki/Tanjung_Pengelih) in [Malaysia](/wiki/Malaysia). ## Recreation Being home to four recreational clubs, Tanah Merah offers a vast spectrum of recreational choices such as golfing, tennis, bowling, swimming and water sports amongst other activities. - **Tanah Merah Country Club (TMCC)** has one of the most expensive club membership rates in the country. This is justified by its plethora of amenities including golf courses, swimming pools, a gymnasium, a jackpot room, tennis, squash and basketball courts as well as lessons and courses on various interests such as dancing. - **National Service Resort and Country Club (NSRCC)**, established to be a recreational spot for full-time National Servicemen, abuts the East Coast beach on the outskirts of Tanah Merah. - **Laguna National Golf & Country Club**, aside from being a golfing club, offers spa services and other recreational activities such as tennis. - **Singapore Armed Forces Yacht Club (SAFYC)**, founded by a group of sailing enthusiasts in 1967, specialises in sea sports and activities. It offers water sports courses and an array of other amenities for [MICE](/wiki/Meetings,_Incentives,_Conferencing,_Exhibitions) and private functions. Residents of Tanah Merah also enjoy using the Bedok Park Connector – which is a route that connects Bedok Reservoir to East Coast Parkway. It spans several kilometres long, and runs along a canal/waterway. Residents often use the connector for daily walks or runs. Some also use it for roller blading, or cycling, whilst some even fish, although is not strictly legal. There are many dining options in Tanah Merah. This includes the restaurants located in East Village, a hawker centre in The Bedok Marketplace and restaurants in the shop houses along Jalan Pari Burong. - Victor R Savage, Brenda S A Yeoh (2004), *Toponymics – A Study of Singapore Street Names*, Eastern University Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-364-3\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:48.125873",
  "title": "Tanah Merah, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tanah_Merah,_Singapore"
}