{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:53.272696"
  },
  "content": "Former theme park in Singapore The **Tang Dynasty City** (唐城), formerly **Tang Dynasty Village**, was a theme park once located at 2 Yuan Ching Road in [Jurong](/wiki/Jurong), [Singapore](/wiki/Singapore). ## History The [S$](/wiki/Singapore_dollar)50 million movie town project of the [Tang dynasty](/wiki/Tang_dynasty) era cultural village next to [Jurong Lake](/wiki/Jurong_Lake) was first announced on 11 May 1988, with strong backing of four government agencies [Economic Development Board](/wiki/Economic_Development_Board), [Jurong Town Corporation](/wiki/Jurong_Town_Corporation), [Singapore Tourism Promotion Board](/wiki/Singapore_Tourism_Promotion_Board) and [Ministry of Community Development](/wiki/Ministry_of_Community_Development,_Youth_and_Sports_(Singapore)). Supported with funding and plans of the development of the park from the Singapore subsidiary of UK-based Dominion International, United Industrial Corporation and other Dutch and Thai investors. The project's tender was awarded to Asia TV Holdings Ltd of Hong Kong owned by [Deacon Chiu](/wiki/Deacon_Chiu) of the Far East Holdings International. The joint venture and operations of [Asia Television](/wiki/Asia_Television) and [Singapore Broadcasting Corporation](/wiki/Singapore_Broadcasting_Corporation) being formed under the name of Tang Dynasty Village Singapore Pte Ltd to manage the theme park. The project was named **Tang Dynasty Village** and would be modeled based on the Sung Dynasty Village in Hong Kong. It was to lead to the development of Singapore's own movie industry. The groundbreaking ceremony was started on 21 February 1989 and the theme park was expected to open two years later in 1991. The Tang Dynasty Village Motion Pictures Pte Ltd was also set up on 12 May 1989 to plan and write for movies and TV shows to be produced on theme park. Costs of constructing the theme park and its expansion was further increased to S$70 million. ### Opening Although the theme park was about 50% completed, the Tang Dynasty Village was opened on 12 January 1992 to much fanfare. Following the Lunar New Year on February, the theme park was renamed to Tang Dynasty City. ### Attractions - The Open City - Arch Bridge and artificial lake - TV & Movie Studios - [Asia Television](/wiki/Asia_Television) - [Singapore Broadcasting Corporation](/wiki/Singapore_Broadcasting_Corporation) (later [Television Corporation of Singapore](/wiki/Television_Corporation_of_Singapore) in 1994) - The Tang Dynasty Village Motion Pictures Pte Ltd - Underground Palace & [Small Wild Goose Pagoda](/wiki/Small_Wild_Goose_Pagoda) - Underground Palace replica: Terracotta warriors replicas - Small Wild Goose Pagoda replica: seven storey tower - [Daming Palace](/wiki/Daming_Palace) & Hanyan Hall replicas: partially constructed and abandoned - [Huaqing Pool](/wiki/Huaqing_Pool) & lodging houses replicas: abandoned ### Downfall and closure The visitor attendance to the theme park was low due to its high admission prices and its lacklustre exhibits. This situation further worsened following the [1997 Asian financial crisis](/wiki/1997_Asian_financial_crisis). The theme park was eventually closed, its buildings were left dilapidated and the exhibits deteriorated. ### Demolition In April 2001, a consortium of three Singaporean companies signed a memorandum of understanding, with plans to build a [Shaolin](/wiki/Shaolin_Monastery) themed resort on the former theme park, modeled after the famed temple and monastery in China. However the plans fell through when the landlord [JTC Corporation](/wiki/JTC_Corporation) put out notice in October 2007 seeking for contractors to carry out the demolition works to level the former theme park on January next year. The theme park was demolished in January 2008.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:53.272443",
  "title": "Tang Dynasty City",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tang_Dynasty_City"
}