{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:06:04.600265"
  },
  "content": "Department store in Singapore 1°17′05″N 103°48′35″E﻿ / ﻿1.2846°N 103.8096°E﻿ / 1.2846; 103.8096 This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Tangs\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2013)* *(Learn how and when to remove this message)* **TANGS** is a [department store](/wiki/Department_store) located on [Orchard Road](/wiki/Orchard_Road) in Singapore, owned by C.K. Tang Limited. The store is regarded as a principal shopping destination in the city, comparable to [Bloomingdale's](/wiki/Bloomingdale%27s) in New York City and [Selfridges](/wiki/Selfridges) in London. The company was founded by [Tang Choon Keng](/wiki/Tang_Choon_Keng) in 1932. Tangs historically used to not operate on Sundays as the Tang family were \"devout\" Christians. ## History C.K. Tang, the founder, migrated from China and began his business in a provisional store in 1932. CK Tang's first stores were on [River Valley Road](/wiki/River_Valley_Road), but in the 1950s, he purchased land on Orchard Road after noticing that expatriates from the [Holland Village](/wiki/Holland_Village,_Singapore) area would travel down this road to go downtown.[*citation needed*] When CK Tang bought the land, it was situated opposite a Chinese cemetery, which, according to cultural conventions, was perceived to bring bad luck. TANGS is credited with sparking the transformation of the area into Singapore's most famous shopping district. In 1982, C.K. Tang purchased the adjacent Tang Plaza, which currently houses the [Singapore Marriott Hotel](/wiki/Marriott_Hotels_%26_Resorts). In the late 1980s and early 1990s, one of CK Tang's sons, Tang Wee Sung, assumed control of the store. He became chairman of the company in 2000 following his father's death. His appointment led to changes in operating policies, such as allowing the store to remain open on Sundays and introducing marketing strategies to enhance [consumer choice](/wiki/Consumer_choice). In 2012, TANGS announced a S$45 million, three-year transformation plan for its flagship store on Orchard Road. ## Architecture The building form was influenced by traditional Chinese culture and architecture, modeled after the Palaces in the [Forbidden City](/wiki/Forbidden_City). The color scheme of C.K. Tang building mimics a traditional imperial palace, with the green roof tiles symbolizing the notion of growth and prosperity, the yellow facade symbolizing the color of royalty, and red columns representing happiness. The design follows the Chinese belief of ‘[feng-shui](/wiki/Feng-shui)’, a traditional Chinese philosophical system, which is prominent in the octagonal decorations consistent all over the building. The eight-sided shape is auspicious as the number ‘8’, pronounced as ‘fa´ in Chinese dialect implies prosperity. Apart from the visually prominent octagonal roof form of the tower, there are several other instances of octagonal designs all over the building. These include the floor tiling, column base and ceiling decorations, and railings. Other features like the distinctive ‘artichoke leaf’ or ‘xie-shan’ roof, designed to repel rain as well as allow wind circulation within the structure. The ridges of the roofs are aligned with figures of miniature mythical creatures which is a symbolism of formidableness in Chinese culture, along with the stone statues of lions up-front. Prior to its 2012 transformation, TANGS occupied 15,000 m2 (160,000 sq ft) and boasted five selling floors, designed by New York-based Hambrecht Terrell International, noted for its work with Saks Fifth Avenue and [Macy's](/wiki/Macy%27s). ## Expansion This section **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources in this section. Unsourced material may be challenged and removed. *Find sources:* \"Tangs\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2018)* *(Learn how and when to remove this message)* ### VivoCity In 2006, TANGS opened as an anchor tenant at shopping mall [VivoCity](/wiki/VivoCity). TANGS VivoCity occupies approximately 85,000 sq ft (7,900 m2) of retail space. The space was revamped in October 2022 and reopened in June 2023. ### Malaysia Tangs' first attempt at expanding to Malaysia was in 1993, when it signed a contract with Taiping Consodilated to open a 160,000 square feet (15,000 m2) outlet at Starhill Mall, Kuala Lumpur by mid-1995. The concept would be similar to its Singaporean counterpart at Orchard Road. The first outside of Singapore, the outlet opened on 27 October 1995. Tangs marked its return to the Malaysian market with a store within [Pavilion KL](/wiki/Pavilion_Kuala_Lumpur) in 2007. The store has since relocated to [1 Utama](/wiki/1_Utama), this was followed by new locations in [Subang Jaya](/wiki/Subang_Jaya) ([Empire Subang](/wiki/Empire_Subang)), and subsequent openings at [Genting Highlands](/wiki/Genting_Highlands) ([First World Plaza](/wiki/First_World_Plaza)) and [Malacca](/wiki/Malacca). Tangs once again withdraws from Malaysia in 2020, with the branches at Subang Jaya and Genting Highlands renamed as Galeries Voir, the Malacca branch renamed as Best Value Outlet, while the 1 Utama branch closed down. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:06:04.599968",
  "title": "Tangs",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tangs"
}