{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:06:01.022955"
  },
  "content": "Housing estate in Singapore **Tanglin Halt** is a [public housing estate](/wiki/Public_housing_estate), planning subzone and former industrial estate in [Queenstown](/wiki/Queenstown,_Singapore), Singapore. Most of the older buildings in the estate are set to be demolished by 2024 to make way for redevelopments under the [Selective En bloc Redevelopment Scheme](/wiki/Selective_En_bloc_Redevelopment_Scheme). It is the third housing estate to be redeveloped under the scheme. ## History The Tanglin Halt Industrial Estate was established sometime before the 1960s, serviced by the [Tanglin railway halt](/wiki/Tanglin_railway_station), and included the Setron Factory. The estate was named after the railway halt. Residential developments in the Tanglin Halt estate were first developed in 1962 as one of the first public housing estates in Singapore, with Tanglin Halt Road running through the neighbourhood. Despite the estate's name, the estate is located in the [Queenstown](/wiki/Queenstown,_Singapore) planning area, which is to the south of the [Tanglin](/wiki/Tanglin) planning area. The Tanglin Halt Neighbourhood Centre was opened in 1964 by [Lee Siew Choh](/wiki/Lee_Siew_Choh). The estate was also serviced by the Tanglin Halt Market. During the [1964 race riots](/wiki/1964_race_riots_in_Singapore), red riot vehicles frequently parked in the estate, resulting in the [Hokkien](/wiki/Hokkien) nickname, \"Ang Chia Keng\", which translates to \"red vehicle village\". In the 1980s, several factories relocated to larger industrial estates, and in 1991, the remaining factories were forced to relocate, as the industrial estate had been marked for redevelopment. In January 2003, it was announced that blocks 50-54 in the estate were set to be redeveloped under the [Selective En bloc Redevelopment Scheme](/wiki/Selective_En_bloc_Redevelopment_Scheme), with owners of flats in the blocks being allowed to purchase flats in blocks 89-91. In June 2014, it was announced that 31 blocks in the neighbourhood would be redeveloped. The redevelopment of the estate was the largest project undertaken by the scheme since its inception. The population of the neighbourhood, which mostly consisted of the elderly, would be relocated to newly redeveloped blocks in the Margaret Drive estate. However, the newer blocks were relatively far away from the FaithActs centre in Tanglin Halt, and concerns were raised regarding the mental health of the elderly in the relocation. Relocating elderlies have received the support and assistance of volunteer group My Community. 1°18′08″N 103°47′42″E﻿ / ﻿1.3021°N 103.7950°E﻿ / 1.3021; 103.7950 This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:06:01.022671",
  "title": "Tanglin Halt",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tanglin_Halt"
}