{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:05:56.183225"
  },
  "content": "Planning area in Central Region, SingaporePlanning Area in Central Region, Singapore **Tanglin**[note 1] is a [planning area](/wiki/Planning_Areas_of_Singapore) located within the [Central Region](/wiki/Central_Region,_Singapore) of [Singapore](/wiki/Singapore). Tanglin is located west of [Newton](/wiki/Newton,_Singapore), [Orchard](/wiki/Orchard,_Singapore), [River Valley](/wiki/River_Valley,_Singapore) and [Singapore River](/wiki/Singapore_River), south of [Novena](/wiki/Novena,_Singapore), east of [Bukit Timah](/wiki/Bukit_Timah), northeast of [Queenstown](/wiki/Queenstown,_Singapore) and north of [Bukit Merah](/wiki/Bukit_Merah). ## Etymology and history The name Tanglin is believed to be an [anglicisation](/wiki/Anglicisation) of *Tang Leng*, which was the Chinese name of the Scottish lawyer and newspaper editor [William Napier](/wiki/William_Napier_(lawyer))'s house that was located in the area. *Tang Leng* was said to be named after the area's Chinese name in [Teochew dialect](/wiki/Teochew_Min), '*Twa Tang Leng',* which translates to 'great east hill peaks' in reference to the hills surrounding the area. On 7 November 2006, the [Singapore Land Authority](/wiki/Singapore_Land_Authority) (SLA) called for proposals to liven up the Dempsey Road area when it launched two new [tenders](/wiki/Call_for_bids) for sites there. In doing so, it also announced that it has plans for the area up to 2015. Known as Tanglin Village, the former Central Manpower Base has now been transformed into a commercial plaza best accessed via car or taxi. The uniquely interesting barracks buildings have been well preserved and currently house a variety of retail establishments such as high end antique shops, restaurants, galleries and the like. ## Geography Tanglin planning area is bounded by Bukit Timah Road to the north, Farrer Road and Queensway to the west, Ridout Road, Kay Siang Road, Prince Charles Crescent, and [Alexandra Canal](/wiki/Alexandra_Canal,_Singapore) to the south as well as Zion Road, Grange Road, Tanglin Road, Orange Grove Road, and Balmoral Road to the east. There are four subzones within the planning area, Chatsworth, Nassim, Ridout and Tyersall. ## Infrastructure ### Transportation Major roads in Tanglin include [Napier Road](/wiki/Napier_Road,_Singapore) and [Holland Road](/wiki/Holland_Road,_Singapore), which are arterial roads that link the [Orchard Road](/wiki/Orchard_Road) district to Bukit Timah and Queenstown. The namesake Tanglin Road link Chatsworth, Queenstown and Bukit Merah to Napier and Orchard. Along its northern and northwestern boundaries, major roads that link Tanglin to adjacent planning areas include [Bukit Timah Road](/wiki/Bukit_Timah_Road), Dunearn Road and Farrer Road. [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) rail connections include [Farrer Road MRT station](/wiki/Farrer_Road_MRT_station) of the [Circle line](/wiki/Circle_Line_(Singapore)), [Botanic Gardens MRT station](/wiki/Botanic_Gardens_MRT_station), which is an interchange station between the Circle and [Downtown line](/wiki/Downtown_Line), as well as [Stevens MRT station](/wiki/Stevens_MRT_station) which is an interchange station between Downtown line and the [Thomson–East Coast line](/wiki/Thomson%E2%80%93East_Coast_Line). Other TEL stations include [Napier](/wiki/Napier_MRT_station), which is located at the foot of the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens) and [Orchard Boulevard](/wiki/Orchard_Boulevard_MRT_station), which is located at the border between [Orchard](/wiki/Orchard_Road) and Tanglin planning areas. ### Tourist attractions Tanglin is home to the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens), a [UNESCO World Heritage Site](/wiki/World_Heritage_Site) which was established in 1859. It is the oldest garden in Singapore and it is located near the Orchard Road shopping belt. The Botanic Gardens can be accessed via two main entrances: Bukit Timah Gate at the northern end and Tanglin Gate at the southern end. Other notable attractions include Dempsey Hill, a former British military barracks that has been redeveloped into a dining and lifestyle hub, featuring upscale restaurants, boutique shops, and galleries. Additionally, the [Museum of Ice Cream (MOIC)](/wiki/Museum_of_Ice_Cream), which opened in 2021, is located at Loewen Road. ### Embassies and international organisations Tanglin is home to several embassies and high commissions. The embassies of Australia, Brunei, France, Indonesia, Israel, Japan, Malaysia, Myanmar, People's Republic of China, Russia, The Philippines, the United States and the United Kingdom are located in Tanglin. Tanglin also houses the headquarters of the [Ministry of Foreign Affairs (MFA)](/wiki/Ministry_of_Foreign_Affairs_(Singapore)), [Interpol](/wiki/Interpol)'s Singapore's office, and the [British Council](/wiki/British_Council), which provides English language educational and cultural exchange programs. The official residence of the British High Commissioner, [Eden Hall](/wiki/Eden_Hall,_Singapore), is also located in Tanglin. ## Education Tanglin is home to several notable educational institutions. The Bukit Timah campus of the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS) houses the [Faculty of Law](/wiki/National_University_of_Singapore_Faculty_of_Law), Singapore's oldest law school, and the autonomous [Lee Kuan Yew School of Public Policy](/wiki/Lee_Kuan_Yew_School_of_Public_Policy). Located near the Singapore Botanic Gardens. [Crescent Girls' School](/wiki/Crescent_Girls%27_School) is the only government secondary school located in Tanglin. Additionally, Tanglin has several international schools catering to the expatriate community, including: - Astor International School - EtonHouse International School Orchard - Invictus International School (Dempsey Campus) - Melbourne International School - Wise Oaks International School ## Amenities ### Healthcare The main healthcare facility in Tanglin area is the [Gleneagles Hospital](/wiki/Gleneagles_Hospital), a private hospital located along Napier Road, next to Napier MRT station. ### Commercial Being in close proximity to the Orchard Road shopping belt, there are several shopping malls nearby such as Tanglin Mall, Tanglin Place, and Tudor Court which are located at Tanglin Road at the boundary between Orchard and Tanglin planning areas. Other shopping facilities include Cluny Court and Serene Centre, which are located at the northwestern tip of Tanglin. ### Food - [Zion Riverside Food Centre](/wiki/Zion_Riverside_Food_Centre) ## Housing Tanglin is one of the few residential districts in Singapore with very few [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) flats. Due to its prime location and high land value, the area primarily consists of private properties, including Good Class Bungalows (GCBs) and high-rise condominiums. Similar to Bukit Timah, Tanglin is home to many affluent residents and expatriates. Notable Tanglin residents include [Eduardo Saverin](/wiki/Eduardo_Saverin), co-founder of [Facebook](/wiki/Facebook), who reportedly resides on Nassim Road, and billionaire restaurateur [Zhang Yong](/wiki/Zhang_Yong_(restaurateur)), who owns a GCB on Gallop Road. ## Notes and references ### Notes ### Sources - Victor R Savage, Brenda S A Yeoh (2003), *Toponymics - A Study of Singapore Street Names*, Eastern Universities Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-205-1\n",
  "language": "en",
  "processed_at": "2026-01-12T12:05:56.182897",
  "title": "Tanglin",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tanglin"
}