{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:06:02.549550"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Tanglin Police Division\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2021)* *(Learn how and when to remove this message)* The **Tanglin Police Division** (or **'E' Division**) is one of the seven land divisions of the [Singapore Police Force](/wiki/Singapore_Police_Force). Tanglin Division oversees the safety and security of the central region in Singapore. The division's policing jurisdiction covers several areas which include residential estates, schools, hospitals, hotels, embassies, as well as iconic buildings such as the Istana and the Interpol Global Complex for Innovation. The division is also responsible for upholding law and order in popular retail and entertainment districts such as Orchard Road and Clarke Quay. The Tanglin Division Headquarters was formerly located at 17 Napier Road and the building was officially opened on 3 June 1981 by then Minister for Home Affairs, Mr Chua Sian Chin. As part of continual efforts to modernise the Force, Tanglin Division Headquarters was relocated on 6 May 2001 to its current premises at 21 Kampong Java Road. ## History Tanglin Division was headquartered at **Orchard Police Station** in the [Orchard Road](/wiki/Orchard_Road) area, before moving to [Tanglin Police Station](/wiki/Singapore_Police_Force#Defunct_Units/Facilities) at 17 [Napier Road](/wiki/Napier_Road,_Singapore), Singapore 258506 between Orchard Road and the [Botanical Gardens](/wiki/Singapore_Botanic_Gardens) in 1980. Tanglin Police Station was opened by the then [Minister for Home Affairs](/wiki/Minister_for_Home_Affairs), Mr [Chua Sian Chin](/wiki/Chua_Sian_Chin), in June 1981. When the [Toa Payoh Police Division](/wiki/Toa_Payoh_Police_Division) was closed in 1988, 'E' Division took over half its areas of control while [Ang Mo Kio Police Division](/wiki/Ang_Mo_Kio_Police_Division) took over the rest. With the implementation of the NPC system in July 2001, the headquarters was moved to its present site at 21 Kampong Java Road, Singapore 228892 on 6 May 2001. ## Establishments - Tanglin Division HQ - Bishan Neighbourhood Police Centre - Bishan Neighbourhood Police Post - Thomson Neighbourhood Police Post - Bukit Timah Neighbourhood Police Centre - Kim Seng Neighbourhood Police Post - Kampong Java Neighbourhood Police Centre - Moulmein Neighbourhood Police Post - Whampoa Neighbourhood Police Post - Orchard Neighbourhood Police Centre - Toa Payoh Neighbourhood Police Centre - Boon Teck Neighbourhood Police Post - Kim Keat Neighbourhood Police Post - Potong Pasir Neighbourhood Police Post - Aljunied Neighbourhood Police Post - Tanglin Police Division 1°18′43.20″N 103°50′47.00″E﻿ / ﻿1.3120000°N 103.8463889°E﻿ / 1.3120000; 103.8463889 This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:06:02.549295",
  "title": "Tanglin Police Division",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tanglin_Police_Division"
}