{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:06:13.773830"
  },
  "content": "Singapore-based shipping company **Tanker Pacific** is the largest privately owned tanking fleet globally. Founded in 1989, it is headquartered in [Singapore](/wiki/Singapore) and owned by [London](/wiki/London)-based [Israeli](/wiki/Israel) businessman [Idan Ofer](/wiki/Idan_Ofer). The company was under US sanctions for docking at [Iranian](/wiki/Iran) ports from 2011 to 2013. ## History Tanker Pacific was founded in 1989 by Israeli billionaire heir [Idan Ofer](/wiki/Idan_Ofer). Its headquarters are located in the [Millenia Tower](/wiki/Millenia_Tower) in Singapore. It operates twenty-nine [tankers](/wiki/Tanker_(ship)), including [Very Large Crude Carriers](/wiki/Oil_tanker), [Aframaxes](/wiki/Aframax), and Medium Range vessels. It employs a workforce of 3,000 on board their tankers and 106 in their offices. Its Chairman and chief executive officer is Alastair McGregor. In May 2011, US Secretary of State [Hillary Clinton](/wiki/Hillary_Clinton) imposed sanctions on the company, accusing them of violating [U.S. sanctions against Iran](/wiki/U.S._sanctions_against_Iran) by docking at Iranian ports. *[Haaretz](/wiki/Haaretz)*, a left-wing Israeli newspaper, revealed that thirteen vessels had docked at Iranian ports over the past decade. In response, they denied flouting any laws, explaining that they did dock at Iranian ports on their way to other destinations to reach international buyers, but did not sell anything to Iranian buyers. The sanctions meant that they were \"barred from securing financing from the [Export-Import Bank of the United States](/wiki/Export-Import_Bank_of_the_United_States), from obtaining loans over $10 million from U.S. financial institutions, and from receiving U.S. export licenses.\" However, the sanctions were removed in April 2013. This [Singaporean corporation or company](/wiki/List_of_companies_of_Singapore) article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:06:13.773370",
  "title": "Tanker Pacific",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tanker_Pacific"
}