{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:06:20.976413"
  },
  "content": "Singaporean para-badminton player (born 1988) **Tay Wei Ming** ([Chinese](/wiki/Chinese_language): 郑伟铭; [pinyin](/wiki/Pinyin): *Zhèng Wěimíng* born 23 August 1988) is a [Singaporean](/wiki/Singaporean) [para-badminton](/wiki/Para-badminton) player. He was Singapore's first ever Para-Badminton world champion. He won the [BWF Para-Badminton World Championships](/wiki/BWF_Para-Badminton_World_Championships) in 2017, when he partnered Indonesia's [Suryo Nugroho](/wiki/Suryo_Nugroho) to defeat the World No.1 Malaysian pair of [Cheah Liek Hou](/wiki/Cheah_Liek_Hou) and Hairol Fozi Saaba to claim gold in the men’s doubles SU5. ## Early life Tay was born on 23 August 1988 in Singapore to Tay Kok Heng. He is the only child in the family. Tay has a condition called [Erb's palsy](/wiki/Erb%27s_palsy) that arose due to trauma during his birth and damaged the nerves in his right arm which affected its growth. He picked up badminton when he was 10 after being introduced to the sport by his father. Despite his disability, Tay represented his school badminton teams throughout his academic years and was talent spotted by Singapore Disability Sports Council (SDSC) in 2006. He was called up to the national team in 2008. ## Career ### 2008–2011: ASEAN Para Games gold medalists Tay made his international debut in 2008 when he took part in the [4th ASEAN Para Games](/wiki/2008_ASEAN_Para_Games) held in [Nakhon Ratchasima](/wiki/Nakhon_Ratchasima), Thailand. He participated in two disciplines, the BMSTU4 men's singles and doubles events. He played well in the singles event and made it to the final where he would lose to Vietnam's Nguyen Van Tai, thus ending his campaign with a silver medal. In 2009, Tay bettered his previous achievement at the [5th ASEAN Para Games](/wiki/2009_ASEAN_Para_Games) held in [Kuala Lumpur](/wiki/Kuala_Lumpur), Malaysia by clinching Singapore's first ever badminton gold in ASEAN Para Games history. There, he defeated Vietnam's Tran Minh Nhuan in the final to made history. In 2011, Tay successfully defended his BMSTU4 men's singles crown at the [6th ASEAN Para Games](/wiki/2011_ASEAN_Para_Games) held in Surakarta, Indonesia when he beat Tran Minh Nhuan of Vietnam, 14–21, 21–17, 21–8 in the singles final. He also won a silver medal in the doubles event when he teamed up with compatriot Kelvin Pung but lost to Vietnam’s Pham Hong Tuan and Tran Monh Nhuan in the BMSTU4 men's doubles final. ### 2012–2014: Asian Para Championships silver and World Para Championships bronze medalists At the 2012 Asian Para-Badminton Championship in [Yeoju](/wiki/Yeoju), South Korea, Tay finished the tournament with two silver medals after he lost to Malaysia's [Cheah Liek Hou](/wiki/Cheah_Liek_Hou) in the SU5 men's singles final and his partner Suhalli Laiman in the SU5 men's doubles final. In 2013, Tay clinched two bronze medals on his first outing at the [BWF Para-Badminton World Championships](/wiki/2013_BWF_Para-Badminton_World_Championships) in [Dortmund](/wiki/Dortmund), Germany when he came in third in the SU5 men’s singles event and partnered Kelvin Pung to another bronze in the SU5 men’s doubles event. In 2014, Tay played at the Indonesia Para-Badminton International and reached the semi-finals of the SU5 men's doubles event before losing to the familiar foes of [Cheah Liek Hou](/wiki/Cheah_Liek_Hou) and Suhalli Laiman, in two sets. In the SU5 men's singles event, he reached the quarter-final before losing to Indonesia's [Suryo Nugroho](/wiki/Suryo_Nugroho) in three hard fought games. In October, Tay took part in his first ever [Asian Para Games](/wiki/Badminton_at_the_2014_Asian_Para_Games) held in [Incheon](/wiki/Incheon), South Korea. He reached the quarter-finals of the SU5 men's doubles event but lose out on a spot in the semis when he and his partner Kelvin Pung lost to the Indian pair of Rakesh Pandey and Raj Kumar. In the SU5 men's singles event, he did not advance from the group stage after losing both his group matches. ### 2015–2017: World No. 3, First international title and Para World Champion In his first tournament of 2015, Tay participated in the China Para-Badminton International and played well. In the SU5 men's singles event, his progress was impeded by China's Cai Jinghao at the quarter-finals when he lost 17–21, 21–23. He did one better in the SU5 men's doubles event where he and his partner, Kim Gi-Yeon from South Korea, managed to reach the semi-finals but would lose to the Chinese pair of Chen Kunxiong and Zhu Peiqiang in two games. Tay continued his good form into his next tournament at the Irish Para-Badminton International where he reached the final of both the SU5 men's singles and doubles events. He, however, would lose both finals in two tightly contested matches to Poland's [Bartłomiej Mróz](/wiki/Bart%C5%82omiej_Mr%C3%B3z) in the singles and again in the doubles with France's Colin Kerouanton to [Bartłomiej Mróz](/wiki/Bart%C5%82omiej_Mr%C3%B3z) and his partner, Turkey's Ilker Tuzcu. On the 13th of July, Tay achieved his highest world ranking of No. 3 in the latest ranking update released by BWF. In September, he participated in his second [BWF Para-Badminton World Championships](/wiki/2015_BWF_Para-Badminton_World_Championships) in [Stoke Mandeville](/wiki/Stoke_Mandeville), England and finished with a bronze medal when he and his partner, Colin Kerouanton, lost in the SU5 men's doubles semi-finals to Malaysian's pair, [Cheah Liek Hou](/wiki/Cheah_Liek_Hou) and Hairol Fozi Saaba. He did not medaled in the singles event after losing in the quarter-finals to India's Raj Kumar in rubber game. At the [8th ASEAN Para Games](/wiki/Badminton_at_the_2015_ASEAN_Para_Games) held in Singapore, he had a disappointing showing in his home turf and did not medaled in both SU5 events that he took part in. In 2016, Tay competed at the Irish Para-Badminton International and performed well. He reached the SU5 men's double final with [Bartłomiej Mróz](/wiki/Bart%C5%82omiej_Mr%C3%B3z) but once again lost to the Malaysian's pair of [Cheah Liek Hou](/wiki/Cheah_Liek_Hou) and Hairol Fozi Saaba. In the singles event of the same classification, he lost to [Cheah Liek Hou](/wiki/Cheah_Liek_Hou) in the semi-finals in two straight games. In August, he participated in the 3rd Indonesia Para-Badminton International but could not overcome the home favorites in both the SU5 men's singles and doubles. In the doubles event, he once again pair up with [Bartłomiej Mróz](/wiki/Bart%C5%82omiej_Mr%C3%B3z) but they would lose to Indonesia's [Suryo Nugroho](/wiki/Suryo_Nugroho) and Oddie Listyanto Putra in the semi-finals. In the singles event, he lost to Listyanto Putra in the quarter-finals. 2017 is probably Tay best season till date. In June, he played in only one event at the Thailand Para-Badminton International and advanced to the semi-finals of the SU5 men's singles event, where he lost to [Cheah Liek Hou](/wiki/Cheah_Liek_Hou). Similarly, at the Irish Para-Badminton International held later that month, Tay took part in only one event but will go on to win his first international open title after he defeated Meril Loquette of France in the SU5 men's singles final. In November, at the [BWF Para-Badminton World Championships](/wiki/2017_BWF_Para-Badminton_World_Championships) held in [Ulsan](/wiki/Ulsan), South Korea, he partnered Indonesia's [Suryo Nugroho](/wiki/Suryo_Nugroho) to defeat the World No.1 Malaysian's pair of [Cheah Liek Hou](/wiki/Cheah_Liek_Hou) and Hairol Fozi Saaba in three hard-fought games, 18–21, 23–21, 21–18 to claim gold in the SU5 men’s doubles event, thus becoming Singapore's first ever Para-Badminton world champion. In the singles event, he would once again lose to his archrival [Cheah Liek Hou](/wiki/Cheah_Liek_Hou) in the quarter-finals. ### 2018–2021: Second international title In 2018, Tay continued his winning form by clinching yet another international open title at the 7th Spanish Para-Badminton International when he defeated his rivals, [Bartłomiej Mróz](/wiki/Bart%C5%82omiej_Mr%C3%B3z) and Ilker Tuzcu in the SU5 men's singles semi-finals and final respectively. In April, he partake in the first ever Dubai Para-Badminton International and did well, reaching the SU5 men's singles semi-finals before crashing out to [Cheah Liek Hou](/wiki/Cheah_Liek_Hou) again in two straight games. In July, Tay played at Thailand Para-Badminton International and managed to clear the group stage but crashed out at the knockout stage after losing to Chinese Tapei's Fang Jen-Yu. In September, Tay took part in the Japan Para-Badminton International and reached the semi-finals before losing to Japan's Taiyo Imai. In August, at the [Asian Para Games](/wiki/Badminton_at_the_2018_Asian_Para_Games) held in [Jakarta](/wiki/Jakarta), Indonesia, he underperformed and did not qualify for the knockout stage after losing two of his three group stage matches. In November, at the Australia Para-Badminton International, Tay once again reached the semi-finals but would lose to [Suryo Nugroho](/wiki/Suryo_Nugroho) in three tightly contested games. In 2019, Tay began his season at the Turkish Para-Badminton International but lost to China's He Zhirui at the SU5 men's singles quarter-finals in rubber game. In May, he competed at Canada Para-Badminton International and advanced to the SU5 men's singles quarter-finals but lost to Taiyo Imai, this time in three sets. At the Irish Para-Badminton International held in June, he once again reached the SU5 men's singles quarter-finals but would lose to [Bartłomiej Mróz](/wiki/Bart%C5%82omiej_Mr%C3%B3z) in two close games. In August, Tay competed at his fourth [BWF Para-Badminton World Championships](/wiki/2019_BWF_Para-Badminton_World_Championships) held in [Basel](/wiki/Basel), Switzerland and made his fourth SU5 men's singles quarter-finals appearances of the year. He however, would lose to [Bartłomiej Mróz](/wiki/Bart%C5%82omiej_Mr%C3%B3z) in yet another closely contested two setters. In September, Tay finally advanced past the quarter-finals at the Thailand Para-Badminton International but he lost in the semi-finals to Fang Jen-Yu. A week later, he took part in the China Para-Badminton International and lost to the same opponent at the knockout stage in three sets as well. In October, he played at the Denmark Para-Badminton International but was defeated by Taiyo Imai at the SU5 men's singles quarter-finals. In November, Tay once again face off with Taiyo Imai at the Japan Para-Badminton International in the quarter-finals and lost. Due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic), Tay did not participate in any competition held in the calendar year of 2020 and 2021, hence he miss out on a place at the delayed [2020 Tokyo Paralympic](/wiki/Badminton_at_the_Summer_Paralympics) after dropping to 9th in the SU5 men's singles ranking (only the top 8 qualify for the event). ### 2022: Third and Fourth international titles After not competing internationally for more than two years, Tay returned to the circuit at the Bahrain Para Badminton International in May. Playing in his favorite event, the SU5 men's singles, he did not advance past the knockout stage after losing to India's Hardik Makkar in three tightly contested games. In September, he played at the Uganda Para Badminton International and emerged as the SU5 men's singles champion, his third international open title of his career. He defeated India's Prithiviraj Thillai Natarajan in two relatively untroubled sets to clinch his first title since 2018. Besides the singles event, he also took part in the men's doubles event with countryman, Ang Chee Hiong and they finished as runner-up to the No. 1 seed, India's Karan Paneer and Prithiviraj Thillai Natarajan. In November, Tay took part in his fifth [BWF Para-Badminton World Championships](/wiki/2022_BWF_Para-Badminton_World_Championships) held in [Tokyo](/wiki/Tokyo), Japan. He contested in the SU5 men's singles event only and did not advance from the group stage after losing two out of his three group matches to his rivals Ilker Tuzcu and [Bartłomiej Mróz](/wiki/Bart%C5%82omiej_Mr%C3%B3z). Tay finished his season strongly by winning his fourth international open title when he and his partner, Ang Chee Hiong defeated the Brazilian pair of Eduardo Oliveira and Yuki Roberto Rodrigues in the SU5 men's doubles final at the Peru Para Badminton International held in December. He also finished joint third in the SU5 men's singles event after he lost to Bartłomiej Mróz in the semi-finals. ### 2023: ASEAN Para Games bronze medalist In February, Tay participated in the [National Open Championships](/wiki/Singaporean_National_Badminton_Championships) and impressed in his matches against able-bodied players. He advanced to the third round after a gripping three-set match against Alaster Ng, where he made a remarkable comeback from being down 16–20 in the rubber game to win the match at 22–20. However, he was defeated in the following round by Ryan Tan Rui Yang, thus ending his chances of reaching the quarter-finals. At the Spanish Para Badminton International in Vitoria, Tay competed in both the singles and doubles events. In singles, he made it to the round of 16 after clearing the group stage, but lost to Meril Loquette of France. In doubles, Tay partnered with Bartłomiej Mroz of Poland and advanced to the semi-finals after progressing from the group stage. However, they were defeated by the tournament favorites Cheah Liek Hou and Muhammad Fareez Anuar. This was Tay's first international competition of the year. In March, Tay took part in the Spanish Para Badminton International in Toledo, but only in the doubles event. He teamed up with fellow Singaporean Ang Chee Hiong and they advanced to the quarterfinals after clearing the group stage as usual. However, they were defeated by the pair from Chinese Taipei, Fang Jen-Yu and Gui Yu Pu. In the next few months of competitions, his best showing came at the Brazil Para Badminton International, where he reached the men's doubles semi-finals after teaming up with Bartłomiej Mroz. In June, he participated in the [ASEAN Para Games](/wiki/Badminton_at_the_2023_ASEAN_Para_Games) and secured a joint bronze medal in the men's singles event. This marked his sixth medal achievement at the regional games. At the Hangzhou Para Games held in October, Tay endured a challenging series of matches, suffering losses in both the singles and doubles categories and did not advance past the group stage. For the remainder of the year, he participated in only two additional tournaments and managed to achieve a semi-finals appearance at the Dubai Para Badminton International in the doubles discipline, while partnering with Bartłomiej Mroz. ## Personal life Tay graduated with a Diploma in Sports and Wellness Management from [Nanyang Polytechnic](/wiki/Nanyang_Polytechnic) in 2015. ## Awards In 2013, Tay received the inaugural [Nanyang Polytechnic](/wiki/Nanyang_Polytechnic) Student Talent and Achievement Recognition (Star) Awards. In 2014, he received the Meritorious Award from SDSC. ## Achievements ### World Championships *Men's singles SU5* YearVenueOpponentScoreResult(/wiki/2013_BWF_Para-Badminton_World_Championships)Helmut-Körnig-Halle, [Dortmund](/wiki/Dortmund), Germany [Bartłomiej Mróz](/wiki/Bart%C5%82omiej_Mr%C3%B3z)19–21, 21–14, 13–21 **Bronze** *Men's doubles SU5* YearVenuePartnerOpponentScoreResult(/wiki/2013_BWF_Para-Badminton_World_Championships)Helmut-Körnig-Halle, Dortmund, Germany Kelvin Pung [Cheah Liek Hou](/wiki/Cheah_Liek_Hou) Suhaili Laiman19–21, 11–21 **Bronze**(/wiki/2015_BWF_Para-Badminton_World_Championships)Stoke Mandeville Stadium, [Stoke Mandeville](/wiki/Stoke_Mandeville), England Colin Kerouanton Cheah Liek Hou Hairol Fozi Saaba14–21, 18–21 **Bronze**(/wiki/2017_BWF_Para-Badminton_World_Championships)Dongchun Gymnasium, [Ulsan](/wiki/Ulsan), South Korea [Suryo Nugroho](/wiki/Suryo_Nugroho) Cheah Liek Hou Hairol Fozi Saaba18–21, 23–21, 21–18 **Gold** ### Asian Para Championships *Men's singles SU5* YearVenueOpponentScoreResult2012Yeoju Sports Center, [Yeoju](/wiki/Yeoju), South Korea [Cheah Liek Hou](/wiki/Cheah_Liek_Hou)18–21, 8–21 **Silver** *Men's doubles SU5* YearVenuePartnerOpponentScoreResult2012Yeoju Sports Center, [Yeoju](/wiki/Yeoju), South Korea Kelvin Pung [Cheah Liek Hou](/wiki/Cheah_Liek_Hou) Suhaili Laiman18–21, 13–21 **Silver** ### ASEAN Para Games *Men's singles BMSTU4/SU5* YearVenueOpponentScoreResult2008Vongchavalitkul University Gymnasium, [Nakhon Ratchasima](/wiki/Nakhon_Ratchasima), [Thailand](/wiki/Thailand) Nguyễn Văn Tài **Silver**2009[Axiata Arena](/wiki/Axiata_Arena), [Kuala Lumpur](/wiki/Kuala_Lumpur), [Malaysia](/wiki/Malaysia) Trần Minh Nhuận19–21, 21–12, 21–14 **Gold**2011Sritex Arena Sports Center, [Surakarta](/wiki/Surakarta), [Indonesia](/wiki/Indonesia) Trần Minh Nhuận14–21, 21–17, 21–8 **Gold**(/wiki/Badminton_at_the_2017_ASEAN_Para_Games)[Axiata Arena](/wiki/Axiata_Arena), [Kuala Lumpur](/wiki/Kuala_Lumpur), Malaysia [Cheah Liek Hou](/wiki/Cheah_Liek_Hou)22-20, 11-21, 15-21 **Bronze**(/wiki/Badminton_at_the_2023_ASEAN_Para_Games)[Morodok Techo National Sports Complex](/wiki/Morodok_Techo_National_Sports_Complex), [Phnom Penh](/wiki/Phnom_Penh), Cambodia [Dheva Anrimusthi](/wiki/Dheva_Anrimusthi)10-21, 11-21 **Bronze** *Men's doubles BMSTU4/SU5* YearVenuePartnerOpponentScoreResult2011Sritex Arena Sports Center, [Surakarta](/wiki/Surakarta), [Indonesia](/wiki/Indonesia) Kelvin Pung Phạm Hồng Tuấn Trần Minh Nhuận20–22, 15–21 **Silver** ### BWF Para Badminton World Circuit (2 titles, 1 runner-up) The BWF Para Badminton World Circuit – Grade 2, Level 1, 2 and 3 tournaments has been sanctioned by the Badminton World Federation from 2022. *Men's singles* YearTournamentLevelOpponentScoreResult2022Uganda Para Badminton InternationalLevel 3 Prithiviraj Thillai Natarajan21–8, 21–13 **Winner** *Men's doubles* YearTournamentLevelPartnerOpponentScoreResult2022Uganda Para-Badminton InternationalLevel 3 Ang Chee Hiong Karan Paneer Prithiviraj Thillai Natarajan16–21, 13–21 **Runner-up**2022Peru Para-Badminton InternationalLevel 2 Ang Chee Hiong Eduardo Oliveira Yuki Roberto Rodrigues21–16, 21–12 **Winner**2024Indonesia Para-Badminton InternationalLevel 2 Ibrahim Aliyev Hardik Makkar Ruthick Ragupathi12–21, 12–21 **Runner-up** ### International tournaments (2011–2021) (2 titles, 4 runners-up) *Men's singles SU5* YearTournamentOpponentScoreResult2015Irish Para-Badminton International [Bartłomiej Mróz](/wiki/Bart%C5%82omiej_Mr%C3%B3z)21–23, 21–23 **Runner-up**2017Irish Para-Badminton International [Meril Loquette](/wiki/Meril_Loquette)21–19, 21–14 **Winner**2018Spanish Para-Badminton International Ilker Tuzcu21–18, 21–11 **Winner** *Men's doubles SU5* YearTournamentPartnerOpponentScoreResult2014England Para-Badminton Championships [Bartłomiej Mróz](/wiki/Bart%C5%82omiej_Mr%C3%B3z) [Cheah Liek Hou](/wiki/Cheah_Liek_Hou) Hairol Fozi Saaba13–21, 18–21 **Runner-up**2015Irish Para-Badminton International Colin Kerouanton [Bartłomiej Mróz](/wiki/Bart%C5%82omiej_Mr%C3%B3z) Ilker Tuzcu18–21, 23–21, 20–22 **Runner-up**2016Irish Para-Badminton International Bartłomiej Mróz [Cheah Liek Hou](/wiki/Cheah_Liek_Hou) Hairol Fozi Saaba16–21, 21–19, 11–21 **Runner-up** - Tay Wei Ming at [BWF](/wiki/Badminton_World_Federation)Badminton.com - Tay Wei Ming at [BWF](/wiki/Badminton_World_Federation)Para.TournamentSoftware.com (archived)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:06:20.976119",
  "title": "Tay Wei Ming",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tay_Wei_Ming"
}