{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:06:23.059778"
  },
  "content": "Place in Singapore **Teban Gardens** is a residential precinct located in [Jurong East](/wiki/Jurong_East), Singapore. Immediately north of [Pandan Reservoir](/wiki/Pandan_Reservoir), it comprises exclusively public housing built by the [JTC Corporation](/wiki/JTC_Corporation) and [Housing and Development Board](/wiki/Housing_and_Development_Board). ## Geography The Teban Gardens estate is situated within the town of [Jurong East](/wiki/Jurong_East). The main road servicing the estate is Teban Gardens Road. Teban Gardens was originally a patch of [mangrove swamp](/wiki/Mangrove_swamp) bordering on the Sungei Pandan area but was subsequently reclaimed to make way for housing development projects by the [JTC Corporation](/wiki/JTC_Corporation) in 1970. Flanked on the south side by the [Pandan Reservoir](/wiki/Pandan_Reservoir), the east side by the bank of Sungei Pandan and situated at the fringe of Jurong Industrial Estate, Teban Gardens sits on the crossroad from Singapore's city center and other parts of the island towards the various industrial estates located within [Jurong](/wiki/Jurong), [Tuas](/wiki/Tuas) as well as the nearby [Jurong Island](/wiki/Jurong_Island). ## History ### Kampong Java Teban Teban Gardens was derived from the former village in the area near Sungei Pandan, Kampong Java Teban ([Malay](/wiki/Malay_language): *Kampung Jawa Teban*). ### Redevelopment Although the [land reclamation](/wiki/Land_reclamation) of the estate began in 1970, actual construction of the estate did not begin until after 1975 as the land needed time to settle after being reclaimed from the mangrove swampland of the Sungai Pandan. [JTC Corporation](/wiki/JTC_Corporation) undertook the construction of the public housing blocks in the estate as a means to provide additional housings for the families of the workers from the nearby areas of [Jurong Industrial Estate](/wiki/Jurong_Industrial_Estate). This was done to help ease the housing problem due in part by the overcrowding in the then nearby [Taman Jurong](/wiki/Taman_Jurong) housing estate, which was also built by JTC in 1969. In 1977, the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) – Singapore's state agency for public housing, took over the task of building more housing blocks, relieving JTC from this task to concentrate on its core mission of developing and managing the Jurong Industrial Estate. Currently, Teban Gardens and Pandan Gardens are satellite towns to the nearby [Jurong East New Town](/wiki/Jurong_East_New_Town). The first housing block was completed around 1978 with a running sequence from block 401 to 416 (both 415 and 416 are four-storey shophouses). Recently some of the blocks has been demolished. Notably, a number of companies such as [Alfa Romeo](/wiki/Alfa_Romeo), [Carrier air-conditioners](/wiki/Carrier_Corporation), [Leica Camera](/wiki/Leica_Camera), [Konica Minolta](/wiki/Konica_Minolta), [GE Industrial](/wiki/GE_Industrial), [Singapore Mint](/wiki/Singapore_Mint), Eltek Energy, Sin Tien Seng and Nordic Corp has set up their showroom, office or factory on a strip of land next to a road aptly named as Teban Gardens Crescent, which is sandwiched between the [Ayer Rajah Expressway](/wiki/Ayer_Rajah_Expressway) and the disused railway line of [KTM](/wiki/Keretapi_Tanah_Melayu) (Jurong Line) that runs through the back of the town. Additionally, an [International Business Park](/wiki/International_Business_Park) (IBP) was set up in the nearby town of [Jurong East](/wiki/Jurong_East) where companies and corporations such as [Acer Inc.](/wiki/Acer_Inc.), [Creative Technology](/wiki/Creative_Technology), [Johnson & Johnson](/wiki/Johnson_%26_Johnson), [MobileOne](/wiki/MobileOne) and the [JTC Corporation](/wiki/JTC_Corporation) are located. ## Transportation ### Roads The main roads in this precinct are Penjuru Road, West Coast Road and Jurong Town Hall Road, which connects the precinct to the rest of the island through the [Ayer Rajah Expressway](/wiki/Ayer_Rajah_Expressway) (AYE) (Exits 13 and 14), with minor roads (Teban Gardens Road and Pandan Gardens) winding through the various places in the precinct. ### Public transport #### Mass Rapid Transit - **JE7** [Pandan Reservoir](/wiki/Pandan_Reservoir_MRT_station) (future) Scheduled to complete in 2028, the [Pandan Reservoir MRT station](/wiki/Pandan_Reservoir_MRT_station) on the upcoming [Jurong Region Line](/wiki/Jurong_Region_MRT_Line) will be the first MRT station serving residents in the precinct. The station will be located along Jurong Town Hall Road, in between Teban Gardens and [Pandan Gardens](/wiki/Pandan_Gardens) estates. #### Feeder bus services There is only one feeder bus service, **143M**, which connects the precinct to [Jurong East MRT station](/wiki/Jurong_East_MRT_station). #### Trunk bus Services There are 7 trunk bus services plying through Teban Gardens, of which all (except **30, 176, and 201**) originate from either [Jurong East Bus Interchange](/wiki/Jurong_East_Bus_Interchange) or [Jurong Town Hall Bus Interchange](/wiki/Jurong_Town_Hall_Bus_Interchange), therefore providing connection for people staying in this precinct to Jurong East MRT station. Apart from providing trunk bus connection to Jurong East MRT station, - **51** connects the precinct to [West Coast](/wiki/West_Coast,_Singapore), [Pasir Panjang](/wiki/Pasir_Panjang), [Queenstown](/wiki/Queenstown,_Singapore), [Bukit Merah](/wiki/Bukit_Merah), [Tiong Bahru](/wiki/Tiong_Bahru), [Chinatown](/wiki/Chinatown), [Bugis](/wiki/Bugis), [Kallang](/wiki/Kallang), [Geylang](/wiki/Geylang), [Eunos](/wiki/Eunos,_Singapore) and [Hougang](/wiki/Hougang). - **78** connects the precinct to [Jurong Port](/wiki/Jurong_Port), West Coast and [Clementi](/wiki/Clementi,_Singapore). - **79** connects the precinct to Jurong Port, [Pioneer Sector](/wiki/Pioneer_Sector) and [Pioneer](/wiki/Pioneer,_Singapore). - **143** connects the precinct to West Coast, Clementi, Pasir Panjang, [Telok Blangah](/wiki/Telok_Blangah), [Harbourfront](/wiki/HarbourFront_(Singapore)), Chinatown, [Orchard Road](/wiki/Orchard_Road), and [Toa Payoh](/wiki/Toa_Payoh). The other 3 trunk bus services that do not provide connection to [Jurong East MRT station](/wiki/Jurong_East_MRT_station) are - **30** which connects the precinct to Pioneer, [Taman Jurong](/wiki/Taman_Jurong), West Coast, Pasir Panjang, [Buona Vista](/wiki/Buona_Vista), Telok Blangah, Harbourfront, [Tanjong Pagar](/wiki/Tanjong_Pagar), [Marina Bay](/wiki/Marina_Bay,_Singapore), East Coast, Kallang, Geylang, Eunos and [Bedok](/wiki/Bedok). - **176** which connects the precinct to [Bukit Batok](/wiki/Bukit_Batok), [Bukit Panjang](/wiki/Bukit_Panjang), [Yuhua](/wiki/Yuhua,_Singapore), West Coast, Pasir Panjang and Buona Vista. - **201** which connects the precinct to Clementi, West Coast and [Kent Ridge](/wiki/Kent_Ridge). - There are also trunk bus service **178** and **154** which passes through the northern border of Teban Gardens along AYE. #### City Direct and Premium services There are 1 premium and 1 city direct bus services plying through Teban Gardens, namely bus service 655 and 762 respectively. Both buses provide connection to the [Central Business District](/wiki/Central_Area,_Singapore) on the peak hours of weekdays. - **655** connects the precinct to West Coast, Tanjong Pagar, [Raffles Place](/wiki/Raffles_Place) and Marina Bay. - **762** connects the precinct to West Coast, Tanjong Pagar and Raffles Place. ### Past transportation - [Jurong Bus Depot / Interchange](/wiki/List_of_former_bus_stations_in_Singapore#Jurong) used to serve this precinct from 1978 to 1991 before all the bus services were re-routed, with most of them being rerouted to [Jurong East Bus Interchange](/wiki/Jurong_East_Bus_Interchange), which opened in 1988. - The [Keretapi Tanah Melayu](/wiki/Keretapi_Tanah_Melayu) railway from [Malaysia](/wiki/Malaysia) used to have an extension branching out from the [Bukit Timah](/wiki/Bukit_Timah) railway station to Shipyard Road and [Jurong Port](/wiki/Jurong_Port) via Teban Gardens, providing freight railway services. This railway extension was intended for goods transportation as Jurong lacked good roads at the time. It was opened in 1965 amid much fanfare, but failed to generate satisfactory traffic. It was consequently closed in the early 1990s, and has since been partially dismantled. ## Amenities ### Market and Food Centres Situated in the middle of the town is the Teban Gardens Wet Market & Food Centre, this serves the need of the residents as well as those from the nearby [Pandan Gardens](/wiki/Pandan_Gardens), which lacks one other than having a few shophouses of its own at blocks 415 and 416. ### Security Located at block 43, is the Ayer Rajah Neighbourhood Police Post (NPP) of [Clementi Police Division](/wiki/Clementi_Police_Division), which continues to serve the residents since its inauguration in 1985. ### Community Centre The precinct's community centre (**Ayer Rajah Community Club**) is located along Pandan Gardens, beside blocks 416 and 415. ### Recreation There are 3 parks in Teban Gardens, located along Teban Gardens Road, West Coast Road (opposite block 408) and along Sungei Pandan (in front of blocks 401 and 403) respectively. South of the precinct is the [Pandan Reservoir](/wiki/Pandan_Reservoir), where water-based sports activities are carried out. ## Schools Currently, there is 1 secondary school ([Commonwealth Secondary School](/wiki/Commonwealth_Secondary_School)) located in this precinct. 1 primary school ([Pandan Primary School](/wiki/Pandan_Primary_School)), 1 high school ([River Valley High School](/wiki/River_Valley_High_School,_Singapore)) and 1 junior college ([Jurong Junior College](/wiki/Jurong_Junior_College)) used to be located here. [Jurong Junior College](/wiki/Jurong_Junior_College) started at its original location in 1981 before moving to a new location in 1985. The site was then re-allocated for [River Valley High School](/wiki/River_Valley_High_School,_Singapore) from 1986 to 2003 before the school relocated to a temporary site along Malan Road in 2004 and its new permanent site in [Boon Lay](/wiki/Boon_Lay) in 2010. In November 2006, the site was re-used and it now houses [Commonwealth Secondary School](/wiki/Commonwealth_Secondary_School). Meanwhile, [Pandan Primary School](/wiki/Pandan_Primary_School) existed from 1981 to 2008 before being merged with [Fuhua Primary School](/wiki/Fuhua_Primary_School) in 2009. The site was later re-used as Pandan Examinations Centre by [Singapore Examinations and Assessment Board](/wiki/Singapore_Examinations_and_Assessment_Board) (SEAB) but left vacant ever since an unknown date. Today, the original building along 700 West Coast Road has since been demolished in 2023. ## Industrial Industrial developments are located at the northern part of the precinct, along [AYE](/wiki/Ayer_Rajah_Expressway). ## Politics As of May 2025[update], Teban Gardens is a part of the Ayer Rajah division within the [West Coast-Jurong West Group Representation Constituency (GRC)](/wiki/West_Coast%E2%80%93Jurong_West_Group_Representation_Constituency). Together with [Pandan Gardens](/wiki/Pandan_Gardens), parts of [Jurong East New Town](/wiki/Jurong_East_New_Town) and [Clementi West New Town](/wiki/West_Coast,_Singapore), the four estates formed the Single Member Constituency (SMC) of [Ayer Rajah SMC](/wiki/Ayer_Rajah_Single_Member_Constituency) prior to being absorbed into the [West Coast GRC](/wiki/West_Coast_Group_Representation_Constituency) during the 2006's election in Singapore. [Dr Tan Cheng Bock](/wiki/Dr_Tan_Cheng_Bock) was the incumbent member of Parliament, since the formation of the ward in 1980, he subsequently retired in 2006 after making way for his successor – Mr S Iswaran. It was replaced by Ms Foo Mee Har, part of the Ayer Rajah constituency. Prior to the [2025 general election](/wiki/2025_Singaporean_general_election), West Coast GRC was renamed to West Coast-Jurong West GRC after absorbing the Jurong Spring and [Taman Jurong](/wiki/Taman_Jurong) divisions from [Jurong GRC](/wiki/Jurong_Group_Representation_Constituency). At the same time, [Telok Blangah](/wiki/Telok_Blangah) and [Dover](/wiki/Dover,_Singapore) estates of West Coast GRC were absorbed into [Tanjong Pagar GRC](/wiki/Tanjong_Pagar_Group_Representation_Constituency), while [HarbourFront](/wiki/HarbourFront_(Singapore)) and [Sentosa](/wiki/Sentosa) were absorbed into [Radin Mas SMC](/wiki/Radin_Mas_Single_Member_Constituency). Ms Foo Mee Har has also retired and is currently succeeded by [Cassandra Lee](/wiki/Cassandra_Lee_(politician)). - [Taman Jurong](/wiki/Taman_Jurong) - [Jurong](/wiki/Jurong) - [Jurong East](/wiki/Jurong_East) - [Jurong East New Town](/wiki/Jurong_East_New_Town) - [Jurong Lake](/wiki/Jurong_Lake) - [Pandan Reservoir](/wiki/Pandan_Reservoir) - [Pandan Gardens](/wiki/Pandan_Gardens) - [West Coast Drive](/wiki/West_Coast,_Singapore) ## Gallery\n",
  "language": "en",
  "processed_at": "2026-01-12T12:06:23.059472",
  "title": "Teban Gardens",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Teban_Gardens"
}