{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:06:27.406350"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Teck Whye Secondary School\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2021)* *(Learn how and when to remove this message)*The topic of this article **may not meet Wikipedia's notability guidelines for companies and organizations**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Teck Whye Secondary School\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2023)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*State secondary school in Choa Chu Kang, Singapore **Teck Whye Secondary School** (TWSS) was a co-educational government secondary school in [Choa Chu Kang](/wiki/Choa_Chu_Kang), [Singapore](/wiki/Singapore). It was founded in 1966 and merged with [Chua Chu Kang Secondary School](/wiki/Chua_Chu_Kang_Secondary_School) in 2023. ## History In the days before English was the main medium of instruction, TWSS used to offer Chinese-medium and Malay-medium classes as well. The school itself was situated in Jalan Teck Whye for many of years, until it had been relocated to a new building in Teck Whye Crescent, 2002. Under the leadership of principal Adrian Cordeiro, the school revamped its school crest, school uniform and school song. A new principal, Ong Kong Hong, took over at the end of 2009. At the start of January 2014, Edwin Chan, former vice principal of [Crescent Girls' School](/wiki/Crescent_Girls%27_School), took over as principal when Ong Kong Hong took up the appointment of Cluster Superintendent at the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) headquarters. In 2019, N. Sivarajan took over as principal. The school merged with nearby [Chua Chu Kang Secondary School](/wiki/Chua_Chu_Kang_Secondary_School) in 2023. The merged school uses TWSS' campus. - Official website This Singapore school-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:06:27.405921",
  "title": "Teck Whye Secondary School",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Teck_Whye_Secondary_School"
}