{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:06:30.809656"
  },
  "content": "Singaporean food manufacturing company **Tee Yih Jia Food Manufacturing Pte Ltd** ([simplified Chinese](/wiki/Simplified_Chinese): 第一家), is a food manufacturing company headquartered in Singapore. Tee Yih Jia is the world leading manufacturer of [spring roll](/wiki/Spring_roll) pastry (also known as \"[popiah](/wiki/Popiah)\" in local context) that also manufactures a wide range of ready-to-eat Asian [convenience foods](/wiki/Convenience_foods) such as [roti](/wiki/Roti) [paratha](/wiki/Paratha), [crepes](/wiki/Crepes), [cocktail prawn rolls](/wiki/Prawn_roll), [glutinous rice](/wiki/Glutinous_rice) balls, spring rolls and [samosas](/wiki/Samosas). Apart from pastry-based food, Tee Yih Jia manufactures other frozen convenience food products such as [Dim Sum](/wiki/Dim_Sum), [Ramen](/wiki/Ramen), Oriental Buns (or [mantou](/wiki/Mantou)), and Asian Pizzas with flavours like [Peking duck](/wiki/Peking_duck) and [satay](/wiki/Satay) chicken. Tee Yih Jia's \"[Spring Home](/wiki/Spring_Home)\" brand products are manufactured in Singapore as well as in several regional facilities. Tee Yih Jia has a 400,000 square feet (37,000 m2) factory in Senoko (Singapore) and a Johor (Malaysia) factory of 200,000 square feet (19,000 m2), as well as manufacturing plants in the US and China. The company distribute their products all over the world, from the UK to South Africa and all the way to Australia. ## Company history ### Early years Tee Yih Jia started off as Tee Yih Jia Po Piah Dried Pastry Factory (Pte) Ltd in 1969. It was a small, labour-intensive spring roll pastry producer, using semi-mechanized machinery in its production and serving the local Singapore market. Its current Executive chairman, Sam Goi Seng Hui, acquired the company from its founders for $450,000 in 1977 as part of his business diversification plan. Recognizing the increasing potential of the growing ready-to-eat food industry, Sam took over active management in 1980 to explore and initiate greater growth opportunities for the company. ### The 1980s Investing heavily in technology in 1984, Tee Yih Jia commenced on the automation of its manufacturing and quality control processes to reinvent itself into a company that is equipped and capable of serving beyond the local markets. As a result, Tee Yih Jia became the first in the industry to introduce full automation into the production of spring roll pastry in the 1980s. In recognition of its continuous investments and effort in the development and enhancement of its processes to compete on a global scale, the National Productivity Board awarded Tee Yih Jia the National Productivity Award (currently under [SPRING Singapore](/wiki/SPRING_Singapore) National Awards programme) in 1986 for the company's emphasis on R&D, stringent quality control, aggressive marketing strategies and expansion plans, making it the first medium-sized company in Singapore to receive such an award. Since 1988, Tee Yih Jia started the expansion of its business activities beyond its initial markets into countries like China, Taiwan and the USA. It established two facilities in California, USA to produce Japanese noodles, cookies and cultured milk drinks. Tee Yih Jia also formed a joint venture with the China Pacific group to build a plant in Fuqing (Fujian Province) to manufacture spring rolls, samosas and biscuits. Tee Yee Jia was the first food processing company in Fujian to attain [HACCP](/wiki/HACCP) certification and [ISO 9002](/wiki/ISO_9002), as well as the first to receive EU clearance for the export of fishery products to Europe. In 1987, Tee Yih Jia's \"Spring Home\" brand Indian Samosas won the SIFST (Singapore Institute of Food Science and Technology) Best Product Award. In 1989, Spring Home won the [Monde Selection](/wiki/Monde_Selection)'s Gold Medal for its spring roll pasty. The company continued to build on the initial success of its flagship products and extended its product range to include other Asian ready-to-eat products. ### The 1990s For six consecutive years since the mid-1990s, Tee Yih Jia has been featured in the Singapore Enterprise 50 lists. In 1996, a special award was conferred onto Tee Yih Jia by the E50 committee for successfully marketing a traditional product overseas. Tee Yih Jia was also awarded the HACCP Certificate from the Singapore Productivity Board in 1998. In 1999, with the support of the [Economic Development Board](/wiki/Economic_Development_Board)'s (EDB) Innovation Development Scheme, Tee Yih Jia launched the frozen Roti Paratha – a unique product manufactured using a specially designed and fully automated production process. Traditionally roti paratha, an Indian flat bread, is laboriously made by hand. Through R&D, Tee Yih Jia adapted its method of preparation for large-scale, automated production. Tee Yih Jia also made its roti paratha a cholesterol free variant to distinguish its product as a healthier alternative to the traditional paratha that are usually made with [ghee](/wiki/Ghee) (clarified butter). Tee Yih Jia's Roti Paratha also made inroads into the mainstream European markets through a major supermarket chain that contracted Tee Yih Jia to specially produce roti paratha packaged with curry sauce. As Europe is a major market for the company, Tee Yih Jia's first overseas marketing office was set up in the United Kingdom in 1999 to serve as a marketing hub to increase its presence and accessibility to customers. ### 2000 and beyond In March 2000, Tee Yih Jia shifted its operations to a Senoko facility worth more than US$150 million . It continues to invest in the use of state-of-the-art technology and integrated, fully automated manufacturing processes to ensure consistent product quality as well as compliance with international HACCP standards for food safety. On 22 November 2000, Tee Yih Jia achieved the top spot among Singapore's best 50 companies, after having been part of the local prestigious award, Enterprise 50 fraternity consecutively for the prior 5 years—the company was ranked 26th in 1995, 17th in 1996, 12th in 1997, 3rd in 1998, and 2nd in 1999 before making it to Number 1 position in 2000. Tee Yih Jia continues to grow its global distribution channels through established supermarkets and foodservice companies, and plans to target mainstream consumers in foreign non-Asian markets by promoting the versatility in the applications of its products, such as serving its roti paratha as pita bread, a pizza base or as a wrap. ## In the news - Aug 2001 – Current [Senior Minister](/wiki/Senior_Minister_of_Singapore) of Singapore, Mr. [Goh Chok Tong](/wiki/Goh_Chok_Tong), highlighted Tee Yih Jia (and its Executive chairman Sam Goi) as an example of Singapore enterprises with potential for development into International Singapore Companies (ISC), and how Singaporean can be enterprising during his 2001 National Day Rally speech as Prime Minister. - Dec 2006 – Tee Yih Jia's and Super Coffee Mix joined Jiangsu Hengshun Vinegar Industry to build 500 million yuan (S$98.5 million) vinegar plant in Zhenjiang City, China. - Feb 2007 – Sam Goi, Tee Yih Jia's Executive chairman's investments of more than S$100 million in various Singapore companies, his overseas opportunities, and his connections and business networks. - Oct 2007 – Tee Yih Jia's partnership with an established Zhejiang firm was brought up as an example of how SMEs from Singapore and China can benefit from more exchanges and co-operation with the signing of the Singapore-China Memorandum of understanding to exchange information on SMEs. - Jan 2008 – Tee Yih Jia successfully lobbied for the grant of [Harmonized System](/wiki/Harmonized_System) (HS) Code under Singapore-India [Comprehensive Economic Cooperation Agreement](/wiki/Comprehensive_Economic_Cooperation_Agreement) (CECA) in December 2007 in a bid to reduce import tariffs on its products to India. ## Brands and products ### Spring Home **Spring Home** is the flagship brand of Tee Yih Jia and is used to market frozen ready-to-eat Asian [convenience foods](/wiki/Convenience_food) such as: - Spring roll pastry (Plain) – sizes: 10\" (250mm) sq, 8.5\" (215mm) sq, 8\" (200mm)sq, 7.5\" (190mm)sq, 6\" (150mm) sq, & 5\" (125mm)sq. - Spring roll pastry (Egg) – sizes: 8.5\" (215mm) sq & 5\" (125mm)sq. - [Samosa](/wiki/Samosa) pastry – size: 3”x10\" - [Roti](/wiki/Roti) [Paratha](/wiki/Paratha) (Plain, Onion, & Wholemeal) - Spring rolls (Vegetable, Chicken, Prawn, & Jumbo) - Samosa - [Dim Sum](/wiki/Dim_Sum) ([Dumpling](/wiki/Dumpling), Hargow, [Shaomai](/wiki/Shaomai), Pastry, [Wonton](/wiki/Wonton), [Tart](/wiki/Tart)) - Glutinous Rice Ball (Peanut, Red Bean, Sesame) - [Cocktail prawn roll](/wiki/Prawn_roll) Spring Home products are accredited with the [HACCP](/wiki/HACCP), [ISO 9002](/wiki/ISO_9002) and [Halal](/wiki/Halal) certifications. ### Happy Belly **Happy Belly** ([Chinese](/wiki/Simplified_Chinese_characters): 家乐宝; [pinyin](/wiki/Pinyin): *Jiālèbǎo*) is a brand used by Tee Yih Jia to market its oriental range of frozen food products such as [gyoza](/wiki/Gyoza) skins, [wonton](/wiki/Wonton) skins, [Peking Duck](/wiki/Peking_Duck) wrappers and oriental bread (i.e. *[mantou](/wiki/Mantou)*, which comes in plain, chocolate and [pandan](/wiki/Pandanus_amaryllifolius) flavours). ### Other brands Tee Yih Jia also has other brands for specific types of food. For example, **Master Chef** is the brand for its [crepe](/wiki/Crepe) pastry, while **Ryushobo** is the brand for its Japanese [ramen](/wiki/Ramen). Brands of Tee Yih Jia ## Origin of brand identity This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(March 2017)* *(Learn how and when to remove this message)* Due to the export-oriented nature of its business, and with many of its customers from overseas non-Chinese background having difficulty in pronouncing or spelling the company's name \"Tee Yih Jia\", Tee Yih Jia created a product brand identity and came up with the name \"Spring Home\". \"Spring\" because of spring rolls, its flagship product, as well as the feelings of freshness and new beginnings that it evokes. \"Home\" is a translation of the last word in the company's name \"Jia\" (家) – the place where most of Spring Home's products are used. - Companies portal - [List of frozen food brands](/wiki/List_of_frozen_food_brands) - Tee Yih Jia corporate homepage\n",
  "language": "en",
  "processed_at": "2026-01-12T12:06:30.809364",
  "title": "Tee Yih Jia",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tee_Yih_Jia"
}