{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:06:37.604170"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Telok Ayer Street\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2022)* *(Learn how and when to remove this message)*Place in Outram, Singapore **Telok Ayer Street** (Singapore English pronunciation: /ˈtəloʊʔ ˌɑː(j)ɛər, ˌ-ɑː(j)eɪ/ *TUH-lohk AH-yair* or *TUH-lohk AH-yay*, Malay pronunciation: [təloʔ aje]) is a street located in Singapore's [Chinatown](/wiki/Chinatown,_Outram) within the [Outram](/wiki/Outram,_Singapore) district, linking Church Street to Cecil Street. [Telok Ayer MRT station](/wiki/Telok_Ayer_MRT_station) is located at the junction of [Cross Street](/wiki/Cross_Street) and this road. ## Etymology Telok Ayer Street was originally a coastal road along the Telok Ayer Bay and was named after the bay. On [George Drumgoole Coleman](/wiki/George_Drumgoole_Coleman)'s 1836 *Map of Singapore*, it was known as *Teluk Ayer Street*. The Chinese name for the street is *da bo gong miao jie* which refers to the [Fuk Tak Chi Temple](/wiki/Fuk_Tak_Chi_Temple) located on Telok Ayer street. It was also known colloquially under two other names; The area near Merchant Street was called Guan Soon Street due to a firm, Chop Guan Soon, located there that brought in Indian [labourers](/wiki/Labourer), The other is in Hokkien, meaning the \"front street\" of [Thian Hock Keng](/wiki/Thian_Hock_Keng) which is dedicated to Goddess of the Sea, Mah Cho or [Matsu](/wiki/Matsu_(goddess)). ## History In 1822, Telok Ayer Street was the primary area set aside by [Sir Stamford Raffles](/wiki/Sir_Stamford_Raffles) for the Chinese community. As the main landing site for Chinese immigrants, Telok Ayer Street become one of the first streets in Chinatown and formed the backbone of development of the Chinese immigrant community in early Singapore. Thus, Telok Ayer Street was the original focal point of [settlement](/wiki/Town) in Chinatown. Until the late nineteenth century, Telok Ayer Street was the main commercial and residential [thoroughfare](/wiki/Thoroughfare) in Singapore. As immigration from China increased, so did the adverse qualities usually associated with a highly concentrated population. The high trade traffic along the road leads to the road being the center of the early Chinese slave trade in Singapore. Before land reclamation was done in the area, boats used to moor in Telok Ayer Bay waiting to get fresh water, carried by [bullock carts](/wiki/Bullock_cart), from a well at [Ann Siang Hill](/wiki/Ann_Siang_Hill). In 1863, a group of local businessmen including [Whampoa](/wiki/Hoo_Ah_Kay), went to [Governor](/wiki/Governor_of_the_Straits_Settlements) [Orfeur Cavenagh](/wiki/William_Orfeur_Cavenagh) to request reclaim land in the bay by building a [pier](/wiki/Pier) and a [seawall](/wiki/Seawall) and filling in the bay at their own expenses to build warehouses. However, the request was rejected at that time. In 1865, plans for reclamation were again put forward and reclamation work was carried out between 1878 and 1885. The land reclamation works including draining the existing [marshland](/wiki/Marshland), removing the [nutmeg](/wiki/Nutmeg) plantations, and Telok Ayer Bay was filled in with land removed from hills along the coast, including [Mount Wallich](/wiki/Mount_Wallich). Maritime buildings were then built on the reclaimed land. Thian Hock Keng which was previously sea facing was five blocks away from the sea front. [Robinson Road](/wiki/Robinson_Road,_Singapore) and [Anson Road](/wiki/Anson_Road) were subsequently built in the reclaimed area. The street also was the founding site of one of Singapore's oldest schools, [Gan Eng Seng School](/wiki/Gan_Eng_Seng_School), which was started in 1885 at 106 Telok Ayer Street as the Anglo-Chinese Free School. The historical site marker of the school is nearby at the junction of Telok Ayer and Cecil Streets. [Temples](/wiki/Chinese_temples) and [mosques](/wiki/Mosques) are plentiful in this area as they were built by Chinese and Indian Muslim immigrants to show their gratitude for safe passage. The numerous religious and [clan buildings](/wiki/Chinese_lineage_association) on Telok Ayer Street testify to their importance in the past. These buildings include: - [Thian Hock Keng Temple](/wiki/Thian_Hock_Keng_Temple) (1820s), the oldest Hokkien temple in Singapore, dedicated to [Matsu](/wiki/Matsu_(goddess)), Goddess of the Sea, Queen of Heaven and Patron Deity of Sailors, - [Fuk Tak Chi Temple](/wiki/Fuk_Tak_Chi_Temple) (1824), former temple first built by the [Cantonese](/wiki/Cantonese_people) and joined by the [Hakkas](/wiki/Hakka_people), colloquially known as the *mah cau toh peh kong*, converted into a museum. - [Ying Fo Fui Kun Hakka Association Hall](/wiki/Ying_Fo_Fui_Kun) (1882), - Ying Fo Fui Kun Temple (1823), the earliest building on the street built by the Hakkas, - [Nagore Durgha Shrine](/wiki/Nagore_Durgha,_Singapore) (1828–1830), - [Al-Abrar Mosque](/wiki/Al-Abrar_Mosque) (c. 1828), and - [Telok Ayer Chinese Methodist Church](/wiki/Telok_Ayer_Chinese_Methodist_Church) (1924). ## Conservation and architecture Telok Ayer Street has been [gazetted](/wiki/Gazette) under the government's [conservation](/wiki/Architectural_conservation) plan. When the conservation project was completed, some of the area's [shophouses](/wiki/Shophouse) were restored to their original appearance. Many of these shophouses are two- and three-storey, mostly the result of the land division of the time which consisted of deep sites with narrow [frontages](/wiki/Frontage). The frontages are based on the then available length of timber [beams](/wiki/Beam_(structure)), usually 16 feet (about 4.8 metres).\n",
  "language": "en",
  "processed_at": "2026-01-12T12:06:37.603776",
  "title": "Telok Ayer Street",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Telok_Ayer_Street"
}