{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:06:43.544071"
  },
  "content": "Early settlement on present-day Singapore ***Temasek*** ([IPA](/wiki/International_Phonetic_Alphabet): /təˈmɑːseɪk/ *tə-MAH-sayk* or /-ɪk/ *tə-MAH-sikk*, also spelt ***Temasik*** or ***Tumasik***) is an early recorded name of a settlement on the site of modern [Singapore](/wiki/Singapore). The name appears in early [Malay](/wiki/Malay_language) and [Javanese literature](/wiki/Javanese_language), and it is also recorded in [Yuan](/wiki/Yuan_dynasty) and [Ming](/wiki/Ming_dynasty) Chinese documents as 單馬錫 ([pinyin](/wiki/Pinyin): *Dānmǎxī*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Tan-má-sek*) or 淡馬錫 ([pinyin](/wiki/Pinyin): *Dànmǎxī*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Tām-má-sek*). Two distinct settlements were recorded in *Temasek* – *[Long Ya Men](/wiki/Long_Ya_Men)* (Malay: *Batu Berlayar*) and *[Ban Zu](/wiki/Ban_Zu)* (Malay: *Pancur*). The name *Temasek* continues to feature prominently in modern Singapore, particularly in the names of [national honours](/wiki/Orders,_decorations,_and_medals_of_Singapore), institutions, schools and corporations. ## Name The origin of the name *Temasek* was derived from the Malay word *tasik* meaning \"lake\" or \"sea\", and may mean here \"place surrounded by the sea\", or Sea Town. Another suggestion is that it may be a reference to a king of [Srivijaya](/wiki/Srivijaya), Maharaja *Tan ma sa na ho*. The name appears as *Tumasik* in the [Nagarakretagama](/wiki/Nagarakretagama), an [Old Javanese](/wiki/Javanese_language) eulogy written in 1365, and may be analysed as the word *tasik* \"sea\" infixed by *-um-* (active verb infix). The name is also mentioned twice in the *[Malay Annals](/wiki/Malay_Annals)* and referred to in the Javanese work *[Pararaton](/wiki/Pararaton)*. *Temasek* is described in the account by the Chinese traveller [Wang Dayuan](/wiki/Wang_Dayuan) who visited the island around 1330 and wrote about a [Malay](/wiki/Malay_people) settlement called *Danmaxi*, a transcription of the name *Temasek*. In a version of [Marco Polo](/wiki/Marco_Polo)'s account of his travel, a place named *Chiamassie* that could be Temasik was mentioned in relation to the island kingdom of *Malayur*. *Temasek* may have also been mentioned in Vietnamese records as *Sach Ma Tich* in the 14th century. George Henrik Werndly, writing in 1736, provided another explanation of *Temasek'*s origin and meaning. Citing Petrus van der Vorm, he claimed that the Malay word was itself from an Arabic expression *Tamasûkh* ( تمسوق ), a composite of *tama* (تم), and *sûkh* ( سوق ), meaning \"market\", \"marketplace\" or \"place of purchase\". *Tamasûkh* was a play on Ujong Tanah (\"end of land\"), which aptly describes Singapore's special position at the end of both the [Malay Peninsula](/wiki/Malay_Peninsula), as well as an imaginary line conceived by navigators to divide the [Indian Ocean](/wiki/Indian_Ocean) between the \"lands above the wind\", that is India and the Middle East and the \"lands below the wind\", the islands of the [Malay Archipelago](/wiki/Malay_Archipelago). Sometime in the 14th century, the name *Temasek* was replaced by [Singapura](/wiki/Kingdom_of_Singapura), a Malay name derived from [Sanskrit](/wiki/Sanskrit) which means \"Lion City\". Legend has it that the name was given by [Sang Nila Utama](/wiki/Sang_Nila_Utama) when he visited the island in 1299 and saw an unknown creature, which he was informed was a [lion](/wiki/Lion). Although Chinese records continued to use the name *Temasek* for some time afterwards (for example in the [Mao Kun map](/wiki/Mao_Kun_map)) and it was also used in The *Malay Annals*, the name *Temasek* had become obsolete and did not appear in European maps and documents from 1500 to 1800. It was revived in colonial and more modern times, and is now used as names for institutions, corporations and national honours of the present-day [Republic of Singapore](/wiki/Republic_of_Singapore). ## History Part of the [Early history of Singapore](/wiki/Early_history_of_Singapore)[Topynymy](/wiki/Names_of_Singapore)[Sabana](/wiki/Golden_Chersonese#Settlements)**Temasek** • [Long Ya Men](/wiki/Long_Ya_Men) • [Ban Zu](/wiki/Ban_Zu)*[Malay Annals](/wiki/Malay_Annals)***[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)** • [Sang Nila Utama](/wiki/Sang_Nila_Utama) • [Parameswara](/wiki/Parameswara_of_Malacca)[Badang](/wiki/Badang)[Hang Nadim](/wiki/Hang_Nadim#In_legend_and_popular_culture)**[Sack of Singapore](/wiki/Sack_of_Singapore)**[Archaeology in Singapore](/wiki/Archaeology_in_Singapore)[Singapore Stone](/wiki/Singapore_Stone)[Fort Canning Hill](/wiki/Fort_Canning_Hill) Singapore portal - v - t - e While the early [history of Singapore](/wiki/History_of_Singapore) is obscured by myth and legend, some conclusions can be drawn from [archaeological](/wiki/Archaeology) evidence and from written references by travellers. Archaeology points to an urbanised settlement on the site by the 14th century. At its height, the city boasted a large earthen [city wall](/wiki/City_wall) and [moat](/wiki/Moat); many of the buildings were built with stone and brick foundations. Remains of old pottery, coins, jewellery and other artefacts have been found, with many of these artefacts believed to be imported from various parts of China, India, [Sri Lanka](/wiki/Sri_Lanka), and [Indonesia](/wiki/Indonesia). These are sometimes seen as evidence of the city's status as a regional trade centre. An aquatic route, part of the larger [Silk route](/wiki/Silk_Road), passed through *Temasek*. From the 7th to the 11th centuries, the island of Singapore was controlled by the [Srivijaya](/wiki/Srivijaya) empire based in [Sumatra](/wiki/Sumatra). Diplomatic relationships between *Temasek* and Vietnam may have begun in the 13th century. *Temasek* was a fortified city and trading centre in the 14th century. It was recorded that during the [Yuan dynasty](/wiki/Yuan_dynasty), envoys were sent to *[Long Ya Men](/wiki/Long_Ya_Men)* (*Dragon's Teeth Gate*, thought to be the entrance of [Keppel Harbour](/wiki/Keppel_Harbour)) in 1320 to obtain tame elephants. The people of *Long Ya Men* then returned in 1325 with a tribute and trade mission to China. In around 1330, the Chinese traveller [Wang Dayuan](/wiki/Wang_Dayuan) visited the island and mentioned two distinct settlements in *Temasek*: *Long Ya Men* and *[Ban Zu](/wiki/Ban_Zu)* (a [transcription](/wiki/Transcription_into_Chinese_characters) of the Malay name *pancur* meaning a \"spring\"). In his work *[Daoyi Zhilüe](/wiki/Daoyi_Zhil%C3%BCe)*, Wang described *Long Ya Men* as the two hills of *Temasek* that looked like \"Dragon's teeth\" between which a strait runs, and wrote: > The fields are barren and there is little [padi](/wiki/Paddy_field) ... In ancient times, when digging in the ground, a chief came upon a jewelled head-dress. The beginning of the year is calculated from the [first] rising of the moon, when the chief put on this head-gear and wore his [ceremonial] dress to receive the congratulations [of the people]. Nowadays this custom is still continued. The natives and Chinese dwell side by side. Most [of the natives] gather their hair into a [chignon](/wiki/Chignon_(hairstyle)), and wear short cotton [bajus](/wiki/Baju_Melayu) girded about with black cotton [sarongs](/wiki/Sarong). — Wang Dayuan, translation by [Paul Wheatley](/wiki/Paul_Wheatley_(geographer)). Wang further mentioned that [lakawood](/wiki/Lakawood) and tin were products there and the natives traded with Chinese from [Quanzhou](/wiki/Quanzhou), but Chinese [junks](/wiki/Junks) on their way back from the Western Oceans (西洋) may be met by pirates there who attacked with two to three hundred [perahus](/wiki/Perahu) (boats). The description of the people may be the first known record of the [Orang Laut](/wiki/Orang_Laut) who inhabited the region. *[Ban Zu](/wiki/Ban_Zu)* was described as being sited on a hill, thought to be today's [Fort Canning Hill](/wiki/Fort_Canning_Hill), located behind *Long Ya Men*. In contrast to those of *Long Ya Men* who were prone to acts of piracy, the inhabitants here were described as honest. They also \"wear their hair short, with turban of gold-brocaded satin\", and red-coloured clothing. Ruins of the settlement on the hill were still visible in the early 19th century and was described by the Resident [John Crawfurd](/wiki/John_Crawfurd). In 1928, several pieces of gold ornaments dating to the mid-14th century were discovered at Fort Canning Hill. Wang also reported that the Siamese attacked the city moat of *Temasek* with around 70 ships a few years before he visited, and the city successfully resisted the attack for a month. By the 14th century, the Srivijaya empire had declined, and the [Majapahit](/wiki/Majapahit) and [Ayutthaya Kingdom](/wiki/Ayutthaya_Kingdom) became dominant in the region and alternatively made claim to *Temasek*. The [Nagarakretagama](/wiki/Nagarakretagama) written in 1365 listed *Tumasik* as a vassal of the Majapahit. Portuguese sources indicate that during the late 14th century, *Temasek* was a Siamese vassal whose ruler was killed by [Parameswara](/wiki/Parameswara_(sultan)) from Palembang. Parameswara was driven from Palembang by the Javanese after Parameswara challenged the Majapahit by setting up a lion throne that symbolised a revival of Palembang's claim over the Srivijaya empire. According to a Portuguese account, Parameswara fled to *Temasek*, and eight days later killed the local chief with the title Sang Aji, named Sangesinga in a later account. It has been proposed that *Temasek* changed its name to *Singapura* in this period rather than in 1299 as suggested by the legend of [Sang Nila Utama](/wiki/Sang_Nila_Utama) given in the *[Malay Annals](/wiki/Malay_Annals)*. Portuguese sources indicate that Parameswara ruled *Singapura* for five years, he was then attacked by either the [Majapahit](/wiki/Majapahit_Empire) or the Siamese, forcing him to move on to [Melaka](/wiki/Melaka) where he founded the [Sultanate of Malacca](/wiki/Sultanate_of_Malacca). *Singapura* came under the influence of the Malacca in the 15th century and, after the fall of Malacca to the Portuguese, the control of the [Malay](/wiki/Malay_states) [Sultanate of Johor](/wiki/Sultanate_of_Johor) in the 16th century. A settlement there was finally burnt to the ground by the Portuguese in 1613 and the island sank into obscurity for two hundred years until the early 19th century with the arrival of [Stamford Raffles](/wiki/Stamford_Raffles), a British [colonial official](/wiki/Colonial_Office). ### Doubts over identification with *Longyamen* The Mao Kun map shows on the position of the [Strait of Singapore](/wiki/Strait_of_Singapore), a navigational route and instructions for sailing from *Longyamen* to [Pedra Branca](/wiki/Pedra_Branca,_Singapore). In addition, it marks the name *Longyamen* on what appears to be [Lingga Island](/wiki/Lingga_Island), off the [Sumatran](/wiki/Sumatra) east coast. Supported by the testimony of Fei Xin, who sailed on four occasions with Zheng He, that *Longyamen* was situated to the north-west of Sanfoqi, a polity believed to be [Palembang](/wiki/Palembang), W.P. Groeneveldt believed *Longyamen* was the Strait of Lingga. J.V.G. Mills, who questioned the association of Keppel Harbour with *Longyamen*, carefully compared the sailing instructions on the Mao Kun Map with corresponding directions given in relevant itineraries found in three Ming era Chinese rutters, namely Shun Feng Xiang Song (順風相送, “Fair Winds for Escort”, dated circa 1430), Bing Qian (兵鈐, Military Manual, dated 1674) and Dong Xi Yang Kao (東西洋考, “A Study of the Eastern and Western Oceans”, dated 1617). Mill’s conclusion was that the Longyamen was the main Singapore Strait, and not [Keppel Harbour](/wiki/Keppel_Harbour). This is precisely as drawn on the Mao Kun Map. Significantly the instructions from Shun Feng Xiang Song and Dong Xi Yang Kao referred to a *Temasek Gate* (淡馬錫門) by which vessels passed no matter if they were sailing in and out of *Longyamen* from [Karimun](/wiki/Great_Karimun) or Pedra Branca. Wang Dayuan's actual words were that \"*Longyamen* is intersected with two mountains belonging to the *Temasek* natives, akin to a dragon teeth-like formation, with a water channel running through the middle\". Teochews settlers who first came to Singapore in 1819 referred to the [Telok Blangah](/wiki/Telok_Blangah) area by Keppel Harbour as Sek-lak-mung (石叻門), meaning the \"Gate of Selat\", or the \"Gate of the Strait\". This shows *Temasek Gate* was Keppel Harbour and supports that *Longyamen* was the main Strait of Singapore. Moreover, Wang Dayuan's writing was clear that the \"dragon teeth\" were mountains/hills, and not rocks. ## Singapore's national honours The Republic's two most important national honours are titled [Bintang Temasek](/wiki/Bintang_Temasek) (*The Star of Temasek* for acts of exceptional courage and skill or exhibiting conspicuous devotion to duty in circumstances of extreme danger) and the [Darjah Utama Temasek](/wiki/Darjah_Utama_Temasek) (*Order of Temasek*, for outstanding and exceptional contributions to the country). Other institutions that bear the name: - [Temasek Holdings](/wiki/Temasek_Holdings) - [Temasek Junior College](/wiki/Temasek_Junior_College) - [Temasek Life Sciences Laboratory](/wiki/Temasek_Life_Sciences_Laboratory) - Temasek Laboratories - [Temasek Polytechnic](/wiki/Temasek_Polytechnic) - [Temasek Primary School](/wiki/Temasek_Primary_School) - [Temasek Secondary School](/wiki/Temasek_Secondary_School) - [Temasek Tower](/wiki/Temasek_Tower) - [Names of Singapore](/wiki/Names_of_Singapore) - [Kingdom of Singapura](/wiki/Kingdom_of_Singapura) Library resources about **Temasek** - Resources in your library - Resources in other libraries - A History of the Lion City – Chapter from an online textbook.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:06:43.543722",
  "title": "Temasek",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Temasek"
}