{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:06:45.270674"
  },
  "content": "Post-secondary academic institution in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Temasek Polytechnic\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2021)* *(Learn how and when to remove this message)*‹ The template *Infobox university* is being considered for merging. › **Temasek Polytechnic** (**TP**) is a post-secondary education institution and [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the purview of the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)), [Singapore](/wiki/Singapore). Established in 1990, TP is renowned for its law and [design](/wiki/Design_studies) programmes. It is also the first and only [polytechnic](/wiki/Polytechnic_(Singapore)) in Singapore to offer a law programme. ## History ### 1989–1995 This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(June 2025)* *(Learn how and when to remove this message)* In June 1989, [Tony Tan](/wiki/Tony_Tan) the [Minister for Education](/wiki/Ministry_of_Education_(Singapore)#Ministers) announced that a third polytechnic is being considered and in April 1990, Temasek Polytechnic was established with an initial enrolment of 735 students. The polytechnic originally set up at Baharuddin Vocational Institute's premises at Stirling Road and the vacated premises of Raffles Institution at Grange Road. Due to increased enrolment and the introduction of new courses, three more campuses at Kim Seng, Bukit Merah and Portsdown Road were acquired to house the polytechnic's student population. ### 1995: Moving to a permanent location In September 1995, the permanent campus for Temasek Polytechnic was completed and it moved to its current location in the town of [Tampines](/wiki/Tampines). ### 2012–present: Logo redesign, construction of foyer Temasek Polytechnic underwent a logo redesign, sporting a fresh new look to reflect the vibrancy of the school. The TP Auditorium Foyer began construction in 2010 and was completed in 2013. McDonald's and Subway are available to both staff and the general public. In 2022, Temasek Polytechnic changed its school motto to *Creating Tomorrow*. ## Academic ### Academic Schools - School of Applied Science - School of Business - School of Design - School of Engineering - School of Humanities & Social Sciences - School of Informatics & IT Temasek Polytechnic offers 36 full-time diploma courses in the areas of applied sciences, business, design, engineering, humanities & social sciences, and informatics & IT. ### Polytechnic Foundation Programme The Polytechnic Foundation Programme (PFP) was introduced in 2011 for students in the Normal (Academic) stream to be offered an opportunity to gain direct entry into Polytechnic diploma programmes with their 'N' Level certifications starting from 2012 onwards. Top students of the cohort each year would be offered the programme to skip their 'O' Level studies and instead enrol into a polytechnic of their choice to complete a foundation year before embarking on their respective diploma programmes. During the foundation year, students would take introductory modules that would expose them to their courses of studies so that they would cope better in their first year. There is no GPA requirement to advance to Year 1, as long as students pass all of their modules during Year 0. Although they would also be graded in Year 0, the GPA will not count towards their cumulative GPA when Year 1 commences. The Centre for Foundation Studies (CFS) in Temasek Polytechnic was established in 2011 for students admitted into their PFP studies (Year 0). ## Campus features Temasek Polytechnic's campus was designed by architect [James Stirling](/wiki/James_Stirling_(architect)). The campus is situated beside Bedok Reservoir and has 61 lecture theatres, a convention centre, canteens, auditoria, an amphitheatre, a chemical pilot plant, laboratories and training facilities, a large library, sporting facilities, and 13 food outlets including three cafés, three F&B outlets and an air-conditioned food court. The Temasek Aviation Academy (TAA) was opened in 2014 in the School of Engineering. In 2016, a 6,000 square metres (65,000 sq ft) facility housing specialised laboratories, and specialised training equipment for related aerospace diploma courses. In 2024, Temasek Polytechnic (TP) launched Singapore’s first industry-standard Chemical Pilot Plant (CPP) housed in an institute of higher learning that can convert waste cooking oil into biodiesel. ## Achievements - In 2018, students designed and built a [Proton Exchange Membrane](/wiki/Proton_Exchange_Membrane)-power unit, successfully powering both an [UAV](/wiki/UAV) and an electric bicycle using the same unit, thought to be a world-first. - The School of Design is a 8-time winner of the Crowbar Awards 'Institution of the Year' from 2017 - 2024. The Crowbar Awards is the only major student competition in the region and sees entries from institutions worldwide. - A team of students from the school of Engineering, Diploma in Aerospace Engineering (AEG) course won the Gold award in the annual Singapore Space Challenge (SSC2018) competition held on 2 February 2018 by the [Singapore Space and Technology Association](/wiki/Singapore_Space_and_Technology_Association). ## Notable alumni ### Entertainment - [Priscelia Chan](/wiki/Priscelia_Chan), Mediacorp actress - [Hong Ling](/wiki/Hong_Ling_(actress)), Mediacorp actress - [Sheryl Ang](/wiki/Sheryl_Ang), Mediacorp actress - [Ferlyn Wong](/wiki/Ferlyn_Wong), singer - [Sylvia Ratonel](/wiki/Sylvia_Ratonel), singer and *[Singapore Idol](/wiki/Singapore_Idol)* finalist - [Glenn Yong](/wiki/Glenn_Yong), actor and singer - [Hady Mirza](/wiki/Hady_Mirza), singer and Singapore Idol winner. ### Politics - [Wan Rizal](/wiki/Wan_Rizal_Wan_Zakariah), [Member of Parliament](/wiki/Parliament_of_Singapore) - [Hany Soh](/wiki/Hany_Soh), [Member of Parliament](/wiki/Parliament_of_Singapore) - [Cai Yinzhou](/wiki/Cai_Yinzhou), [Member of Parliament](/wiki/Parliament_of_Singapore) ### Sports - [Jacob Mahler](/wiki/Jacob_Mahler), national footballer - [Marc Ryan Tan](/wiki/Marc_Ryan_Tan), footballer - [Faris Ramli](/wiki/Faris_Ramli), national footballer - [Ryhan Stewart](/wiki/Ryhan_Stewart), national footballer - [Zharfan Rohaizad](/wiki/Zharfan_Rohaizad), footballer - [Joshua Pereira](/wiki/Joshua_Pereira), footballer - Temasek Polytechnic homepage - Temasek Polytechnic blog\n",
  "language": "en",
  "processed_at": "2026-01-12T12:06:45.270370",
  "title": "Temasek Polytechnic",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Temasek_Polytechnic"
}