{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:06:47.478066"
  },
  "content": "Townhouse in Museum Planning Area, Singapore **Temasek Shophouse** is a building on [Orchard Road](/wiki/Orchard_Road,_Singapore) in the [Museum Planning Area](/wiki/Museum_Planning_Area) of Singapore. Completed as a townhouse in 1928, it presently serves as a \"social impact hub\" owned by Temasek Trust, the philanthropic arm of [Temasek Holdings](/wiki/Temasek_Holdings). ## History The four-storey building was completed for prominent local businessmen Chee Guan Chiang and Ee Kong Guan in 1928 as a townhouse. It was designed by local architects Johannes Bartholomew Westerhout and William Campbell Oman of the architectural firm Westerhout & Oman. The ground floor served as a commercial space while the upper floor housed residential units. The building later served as a furniture shop and an eatery. In the 1980s, it housed a \"popular\" apparel and department store that specialised in selling \"trendy but affordable\" products. The building was acquired by [Temasek Holdings](/wiki/Temasek_Holdings) in 2017, who restored it. The elevators, which had been installed in the building in the 1980s, were removed and replaced by a two-storey atrium. The false ceilings at the building's [five-foot way](/wiki/Five-foot_way) was also removed. The rear court was converted into a garden while the roof was converted into an outdoor terrace. The verandahs were restored and the \"hidden\" cornices were reinstated. A Green Wall, which contained more than 27 different plant varieties, accompanied with a microclimate cooling system, was installed within the building. The building was officially opened in 3 June 2019 as a \"social impact hub\", housing the Temasek Trust, Temasek Foundation and the Stewardship Asia Centre, which are the philanthropic arms of Temasek Holdings. Foreword Coffee, a cafe which provides employment for those with disabilities was opened on the ground floor. The restoration project received the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) Architectural Heritage Awards of that year. In August 2022, it was announced that the shophouse would be closed for renovations as the hub would be extended into the adjacent shophouses. The extension project was scheduled to be completed by 2025. The party Lights Out was held on 2 December 2023, its second last day of operations before the venue closed for the renovations. It reopened in September 2025. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:06:47.477757",
  "title": "Temasek Shophouse",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Temasek_Shophouse"
}