{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:06:49.581252"
  },
  "content": "Old Malay nobility title **Temenggong** or **Tumenggung** ([Jawi](/wiki/Jawi_script): تمڠݢوڠ; *Temenggung*, [Hanacaraka](/wiki/Javanese_script): ꦠꦸꦩꦼꦁ​ꦒꦸꦁ​; *Tumenggung*) is an old [Malay](/wiki/Malay_language) and [Javanese](/wiki/Javanese_language) title of nobility, usually given to the [chief of public security](/wiki/Defence_minister). ## Responsibilities The Temenggong is usually responsible for the safety of the monarch (raja or sultan), as well as overseeing the state police and army. A temenggong may also be assigned by his sovereign as a ruler in frontier regions, acting either as a [regent](/wiki/Regent) or [viceroy](/wiki/Viceroy) with additional development & military responsibility (comparable to European [Marquess](/wiki/Marquess)). However, a Temenggong could usurp power for themselves, as in the case in [Johor](/wiki/Temenggong_of_Johor). ## Johor In the [Sultanate of Johor](/wiki/Sultanate_of_Johor), the [Temenggong of Muar](/wiki/Temenggong_of_Muar) held a fief centered in [Segamat](/wiki/Segamat) for approximately two centuries and the [Temenggong of Johor](/wiki/Temenggong_of_Johor) was the head of the fief (Johor mainland) between 1760 and 1868. The full rendition of the Johor Temenggong was *Temenggung Seri Maharaja*. Although the Temenggong was the head of the fief's administration, the Temenggong held the Johor Sultanate by virtue of his being a [vassal](/wiki/Vassal) of the Sultan. In 1868, Temenggong [Abu Bakar](/wiki/Abu_Bakar_of_Johor) declared himself a [maharaja](/wiki/Maharaja), assumed control over Muar and declared himself an independent ruler. An [Anglophile](/wiki/Anglophile), in 1885, he assumed the title of [Sultan](/wiki/Sultan). This was made with the blessing of the [United Kingdom](/wiki/United_Kingdom), which had hegemonised [Malaya](/wiki/British_Malaya), including Johor, as protectorates. ## Majapahit Negarakretagama cantos 10 describe that the mayor visited the Kepatihan Amangkubhumi (Prime Minister building) led by Gajah Mada in order to report the administrative activities in the area. Majapahit government administration had five authoritative leaders called Sang Panca Ri is capability they were - Patih Amangkubhumi (Prime Minister) / the Prime Minister who supervised Rakryan Tumenggung (commander), Rakryan Rangga (commander assistant), Rakryan Kanuruhan (communicator) and Rakryan Demung (regulator the royal household). He ruled as the regulator of the government implementation in all regions of Majapahit, and therefore Sang Panca Ri Wilwatikta was visited by the State authorities and local subordinates for government affairs. - From the Prime Minister, commands down to wedana (the district officer), the district head. - From wedana down to akuwu, the head of a group of village. - From akuwu down to buyut, village elders. - From buyut down to the villagers ## Mataram Sultanate During the era of [Mataram Sultanate](/wiki/Mataram_Sultanate), temenggongs were directly appointed by sultan and acted as regional leaders in regions not directly administrated by the court (mostly in coastal regions). They were responsible for raising and commanding their own regional army, which could be assigned in a military expedition supervised by the sultan himself. One of the most renowned temenggongs in Mataram was Bahureksa, the regent of [Kendal](/wiki/Kendal_Regency). He was executed by [Sultan Agung](/wiki/Sultan_Agung_of_Mataram) due to his failure while leading the Mataram army during the unsuccessful [Siege of Batavia](/wiki/Siege_of_Batavia) in 1628. - [Laksamana](/wiki/Laksamana) - [Marquess](/wiki/Marquess) - [Syahbandar](/wiki/Syahbandar) - [Defence minister](/wiki/Defence_minister) - [Stadtholder](/wiki/Stadtholder)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:06:49.580966",
  "title": "Temenggong",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Temenggong"
}