{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:06:53.272322"
  },
  "content": "Compilation of Singaporean examination papers \"**Ten Year Series (TYS)**\" is a term used by [Singaporeans](/wiki/Singapore), in particular students, to refer to official compilation books of examination papers in past years for the [General Certificate of Education](/wiki/General_Certificate_of_Education) (GCE) Normal Level (N-level), [Ordinary Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) (O-level) and [Advanced Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) (A-level), approved by the [Singapore Examinations and Assessment Board](/wiki/Singapore_Examinations_and_Assessment_Board) (SEAB) and [University of Cambridge Local Examinations Syndicate](/wiki/UCLES) (UCLES). In Singaporean schools, these books are known to be used extensively by teachers and students in preparation for similar questions that may be asked in upcoming examinations. Most students review these past examination papers in order to seek to reveal applications of concepts as well as encounter the forms of various new concepts which would be covered in examinations but not explicitly in the syllabus. Critics of the education system claim that this phenomenon to be signs of [rote memorization](/wiki/Rote_memorization), which goes against the emphasis for [creative thinking](/wiki/Creative_thinking) as championed by the Singaporean government. Until 2007, the term had not always been truly literal since some of these books have compilations containing papers from more than two decades worth of examinations, which means that students will thus often be doing practice papers that are set even before they were born. [SEAB](/wiki/Singapore_Examinations_and_Assessment_Board) has since implemented a new rule limiting the publication of papers to the past ten years, which resulting in a spike of demand for older ten-year series. Ten-year series should not be confused with assessment books (books containing questions on specific subjects for students to practice), which serve as an additional practice, or as a form of enrichment. The latter are privately authored and sold in bookstores. - [Education in Singapore](/wiki/Education_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:06:53.272012",
  "title": "Ten year series",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ten_year_series"
}