{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:06:58.160965"
  },
  "content": "Prince of the House of Bendahara [Tengku](/wiki/Malay_titles#Malay_royalty) **Alam Shah, Tengku Ali Iskandar Shah** was a prince of the House of Bendahara (Johor), and was the oldest son of [Sultan Ali](/wiki/Sultan_Ali_of_Johor), the 19th [Sultan of Johor](/wiki/Sultan_of_Johor) by his second wife, Daing Siti. Following his father's death in 1877, [Tengku](/wiki/Malay_titles#Malay_royalty) Alam and his supporters made an active pursuit to his claims for the Kesang territory and was publicly proclaimed as the Sultan of Johor and Pahang with the [regnal name](/wiki/Regnal_name) of **Alauddin Alam Shah** during his marriage ceremony in 1879.[*citation needed*] The proclamation briefly alarmed [Maharaja Abu Bakar](/wiki/Sultan_Abu_Bakar_of_Johor), who feared that his political position may be threatened. Within the same year, a brief [civil war erupted in Jementah](/wiki/Jementah_Civil_War), after repeated attempts to get his claims to the Kesang territory being recognised failed. ## Succession dispute Sultan Ali's third son by Cik Sembuk, Tengku Mahmud was groomed for succession. When the Sultan died in 1877, he nominated Tengku Mahmud to inherit the Kesang territory. The Sultan's decision took Tengku Alam and his supporters in Singapore to anger, who felt that Tengku Alam should inherit his father's properties given that he was the eldest son. Furthermore, Cik Serimbuk's commoner background stood out against Daing Siti's, who was the daughter of a [Bugis](/wiki/Bugis_people) nobleman. The British on their part, refused to recognise Sultan Ali's will on his son's (Tengku Mahmud) hereditary claims to the Kesang territory. Meanwhile, the chieftains and village headmen in the Kesang territory held their own elections for a new leader, and voted for the [Maharaja of Johor](/wiki/Abu_Bakar_of_Johor), Abu Bakar to take charge of Muar, which the British accepted the outcome of the poll. The Acting Governor of the Straits Settlement, [Edward Anson](/wiki/Edward_Anson), allowed Abu Bakar to take interim control over the Kesang territory. Tengku Alam and his supporters were extremely unhappy with Maharaja Abu Bakar's intervention over the Kesang territory. A long time of Tengku Alam, [W.H. Read](/wiki/William_Henry_Macleod_Read) helped to lobby in Tengku Alam's cause. Supporters of Tengku Alam had criticised the irregularities in the electoral process, by claiming that the Maharaja had coerced the Muar chiefs into voting for him prior to the election, and called for an election with Tengku Alam's family members as the electors. Tengku Alam's supporters argued that the 1855 secession treaty which Sultan Ali had signed with [Temenggong of Johor](/wiki/Temenggong_of_Johor) guaranteed the hereditary rights of Sultan Ali's family members to the Kesang territory. Tengku Alam's claims were fell on deaf ears, and the British government, with the assistance of Engku Mandak, proceeded with the electoral process into 1878. Meanwhile, the British authorities allowed Tengku Alam to inherit the $500 monthly allowance which Sultan Ali had received from the Temenggong's family, and gave him an additional $68 monthly allowance from the [British East India Company](/wiki/British_East_India_Company). An angry Tengku Alam was declined these allowances from the British, and was said to have used abusive language when they were offered to him. The following January, on 11 January 1879, a few hundred Bugis and Malay supporters proclaimed Tengku Alam with the title of \"Sultan Alauddin 'Alam Shah, Sultan of Johor and Pahang\" during his marriage ceremony. Tengku Alam's proclamation briefly generated serious concern from Maharaja Abu Bakar and the British government, who feared that Abu Bakar's political position could be a sign of a potential threat to his political position, especially after Tengku Alam had made a public declaration to challenge Abu Bakar for his claims to the Kesang territory. In October, a frustrated Tengku Alam and his supporters launched a [civil war in Jementah](/wiki/Jementah_Civil_War) which was quickly subdued by the British authorities. ## Last years and death Tengku Alam returned to Singapore and lived out his remaining years quietly at [Istana Kampong Glam](/wiki/Istana_Kampong_Glam), where he died in 1891. He was recognised as the head of the royal household by his family members, and occasionally handled administrative affairs pertaining to the royal household. Five years after his death, members of the royal family disputed over inheritance rights of Istana Kampong Glam in Court. [The Istana](/wiki/The_Istana) was recognised as state property, but the British government (and later the Singapore government) quietly allowed members of the royal household to live in it until the 1990s. ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T12:06:58.160498",
  "title": "Tengku Alam Shah",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tengku_Alam_Shah"
}