{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:06:57.506558"
  },
  "content": "Planning area and HDB town in West Region, SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Tengah, Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2023)* *(Learn how and when to remove this message)*Planning area and HDB town in West Region, Singapore **Tengah** ([IPA](/wiki/International_Phonetic_Alphabet): /ˈtəŋɑː/ *TUHNG-ah*) is a [planning area](/wiki/Planning_Areas_of_Singapore) and [HDB town](/wiki/New_towns_of_Singapore) located within the [West Region](/wiki/West_Region,_Singapore) of Singapore. It is bounded by [Choa Chu Kang](/wiki/Choa_Chu_Kang) to the northeast, [Jurong East](/wiki/Jurong_East) and [Jurong West](/wiki/Jurong_West) to the south, [Bukit Batok](/wiki/Bukit_Batok) to the east, and the [Western Water Catchment](/wiki/Western_Water_Catchment) to its west and north. Formerly a military restricted area, Tengah is currently reserved for new housing developments since URA Concept Plan 2001, making it Singapore's newest [Housing and Development Board](/wiki/Housing_and_Development_Board) town since the development of [Punggol](/wiki/Punggol) in the late-90s. In September 2016, HDB officially unveiled the official plans for the Tengah new town with an official master plan and blueprint for the town. After the demilitarisation of the military training area at Tengah, the first estate, Plantation Grove, was launched in Tengah in November 2018. Tengah is divided into various districts, namely Plantation, Park, Garden, Market Place, Forest Hill, and Brickland Districts. Tengah lies east of Jurong Innovation District and north of [Jurong Lake District](/wiki/Jurong_Lake_District), two new industrial and business developments. These areas are planned as a new decentralized business district. ## Etymology In the mid-nineteenth century, the area where Tengah now lies was a *chu kang* (厝港, [Peng'im](/wiki/Peng%27im): cu3 gang2), a [Teochew](/wiki/Teochew_Min) word meaning \"back port\", which refers to [gambier](/wiki/Uncaria_gambir) and [pepper](/wiki/Black_pepper) plantations located around a river. The plantation owners were known as [Kangchu](/wiki/Kangchu) (港主, [Peng'im](/wiki/Peng%27im): gang2 zu2) - the word *kang* refers to the riverbank and *chu* means \"owner\" or \"master\", referring to the headman in charge of the plantations in the area. This is similar to how other *chu kangs* such as [Choa Chu Kang](/wiki/Choa_Chu_Kang) and [Yio Chu Kang](/wiki/Yio_Chu_Kang) got their names. In 1853, a man named Teng-Ah Tong became the Kangchu, and earned the rights from the Johor nobility to farm the land around Kranji River. The section of the Kranji River that was under Teng-Ah's control was named the Teng-Ah river, and it was subsequently known simply as Tengah. Coincidentally, *tengah* is a [Malay](/wiki/Malay_language) word meaning \"centre,\" \"central,\" or \"middle\". It is a new town in the middle of the western part of Singapore, surrounded by existing towns in the North (Choa Chu Kang), in the South (Jurong West), in the East (Bukit Batok) and in the West (Jurong West). Technically, Tengah is an extension of the existing towns, but branded as a new town for marketing and adminstration purpose. ## History In the 1980s, under the government's resettlement plan, the residents of Hong Kah Village and Kampong Ulu Jurong were relocated to nearby towns newly built by the government, particularly into the present [Jurong Green](/wiki/Jurong_Green), [Jurong Spring](/wiki/Jurong_Spring), and [Bukit Batok](/wiki/Bukit_Batok) areas. Schools were shifted elsewhere, and one example is [Xingnan Primary School](/wiki/Xingnan_Primary_School), which used to operate at a temple along \"Hong Kah Road\" in the village. The HDB estates of [Jurong Green](/wiki/Jurong_Green) and [Jurong Spring](/wiki/Jurong_Spring) are given the name \"Hong Kah,\" probably meaning that most of the villagers resettled there. When the village was cleared, the [PIE](/wiki/Pan_Island_Expressway) and [KJE](/wiki/Kranji_Expressway) projects started in the area, leading to the creation of \"Jurong West Avenue 2,\" which brought about the rise of both [Jurong West New Town](/wiki/Jurong_West_New_Town) and [Choa Chu Kang New Town](/wiki/Choa_Chu_Kang_New_Town). The western part became inaccessible to the public first in 1996 and was used by the military for training activities (which is west of Jurong Road Track 22), followed by the eastern part of Hong Kah (which is east of Jurong Road Track 22) in 2005. In the past, there were several village roads that used to serve the area. Roads such as Hong Kah Road/Lane/Drive/Circle, Sing Nan Road, Kian Hong Road, Jalan Keladan, Jalan Beka, Jalan Pelawan, Jalan Jelawi, Jalan Sena, Lorong Putek, Jalan Buey, Jalan Mandar, and Jalan Ara. The last few roads, such as Jalan Lam Sam and Jalan Chichau, existed until January 2019. Jurong Road closed on 27 September 2020, and a reservoir will be built in its place in the future. In late 2018, massive construction works for the HDB estates started in Tengah C1 and C2 planning areas, which are estimated to be completed by 2025. Most of the construction work will be headed by China Construction (South Pacific) Pte Ltd, whereas a few other local construction firms will also be in charge of construction work. The HDB flats in Tengah are constructed via precast components. The first flats in Tengah were completed in 2023, and Tengah first opened to the public in September 2023. The neighbourhood centre, Plantation Plaza, opened on 28 June 2024. ## Town design and sustainability According to HDB, residential areas in Tengah will be divided into five districts, each with a unique character. The five districts are Plantation, Garden, Park, Forest Hill, and Brickland. Tengah was also marketed as Singapore's first smart and sustainable town with a centralised cooling system, which is managed by national grid operator [SP Group](/wiki/SP_Group). The cooling system encountered issues with installation and operational issues. It is also the only town in Singapore which has a car-free town centre. Various types of dense vegetation are planted along roads to serve as noise and visual barriers, providing a cleaner, greener living environment. Eco-friendly features in Tengah include bioswales and bioretention basins (or rain gardens), which will collect and cleanse the rainwater before it is stored for reuse within the development or channelled into reservoirs. Such water features also create a conducive habitat for dragonflies and amphibians, which add to the biodiversity of the town and help promote a healthy ecological balance. It is worth mentioning that many firsts in Tengah New Town are start with “P”. For instance: the first shopping malls are “Plantation Plaza” and “Parc Point”, and the first primary school is “Pioneer Primary”. Also, most of the housing projects in Tengah New Town have names that start with “P”, and the first MP for the area is “Pei Ling”. The purpose of using those names are obviously a tribute to the ruling [People's Action Party](/wiki/People%27s_Action_Party). ## Transport Tengah is a designated \"car-lite\" district, placing an emphasis on discouraging the use of private vehicles and prioritising public transportation, walking and cycling. ### Bus Upon the town's opening in 2023, public transportation options were initially limited to a free shuttle bus provided by the HDB. The first few public bus services 992 and 993 serving Tengah were introduced only in September that year. The town features several bus priority features on its streets, such as having bus lanes on most roads. Designated transit priority corridors on Tengah Link, Tengah Park Avenue and Tengah Central only allow buses to use the road. The town's first bus interchange, [Tengah Bus Interchange](/wiki/Tengah_Bus_Interchange), opened along Tengah Boulevard in July 2024. As of 2025, four bus services operate from the interchange. These services connect residents to Jurong East, Bukit Batok West, Bukit Gombak and Beauty World. A permanent bus interchange beside Tengah MRT station is planned as part of the town's integrated transport hub. ### Rail Tengah will be served by the [Jurong Region Line](/wiki/Jurong_Region_Line) upon the completion of [Tengah](/wiki/Tengah_MRT_station) and [Hong Kah](/wiki/Hong_Kah_MRT_station) stations in 2027, and [Tengah Plantation](/wiki/Tengah_Plantation_MRT_station) and [Tengah Park](/wiki/Tengah_Park_MRT_station) stations in 2028. ### Cycling All roads in Tengah will have walking and cycling paths on both sides. ### Road Tengah Boulevard is connected to the eastbound direction of the [Pan Island Expressway](/wiki/Pan_Island_Expressway) via slip roads, with a planned upgrading to a road interchange by 2028. The future Forest Drive will be connected to the [Kranji Expressway](/wiki/Kranji_Expressway) via a road interchange by 2027. ## Retail There are two shopping malls - Plantation Plaza, Parc Point (opening in the first half of 2026). ## Military use The bigger part of the former Hong Kah Village was an SAF military training area until 10 November 2015. The military training around the area was gradually shifted to Ama Keng Road, and training for [Keat Hong Camp](/wiki/Keat_Hong_Camp) was now conducted at Ama Keng. Massive construction and earthworks subsequently began in October 2017.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:06:57.506266",
  "title": "Tengah, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tengah,_Singapore"
}