{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:03.603481"
  },
  "content": "Historic building in Singapore **Teochew Building** is a historic building on Tank Road in Singapore. Completed in 1963, it jointly houses the [Teochew Poit Ip Huay Kuan](/wiki/Teochew_Poit_Ip_Huay_Kuan) and the [Ngee Ann Kongsi](/wiki/Ngee_Ann_Kongsi). ## History The land on which the building stands was previously the Tuan Mong High School. The building's construction, which cost millions, began in June 1961 and was expected to be completed by the middle of the next year. The ground floor of the building would be occupied by offices for the Teochew Poit Ip Huay Kuan and the Ngee Ann Kongsi while a large hall and stage with a maximum capacity of 1,000 people could be found on the second floor. The upper three floors was to house the 45 classrooms of the Tuan Mong High School. A $16,000 master clock, which would control the clocks in the classrooms, was to be installed in the central part of the building. The \"[Peking-style](/wiki/Chinese_architecture)\" building was designed by prominent local architect [Ng Keng Siang](/wiki/Ng_Keng_Siang). On 26 May 1963, the [Ngee Ann College](/wiki/Ngee_Ann_Polytechnic) was officially opened within the building by [Yong Nyuk Lin](/wiki/Yong_Nyuk_Lin), then the [Minister for Education](/wiki/Ministry_of_Education_(Singapore)). [Chief Justice of Singapore](/wiki/Chief_Justice_of_Singapore) [Wee Chong Jin](/wiki/Wee_Chong_Jin), [Speaker of the Federation of Malaya Parliament](/wiki/Malaysian_Parliament) [Mohamed Noah Omar](/wiki/Mohamed_Noah_Omar) and Minister for National Development [Tan Kia Gan](/wiki/Tan_Kia_Gan) attended the ceremony, while [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) later attended a reception. The college moved to a larger premises in [Clementi](/wiki/Clementi,_Singapore) a few years later. In 1995, it was announced that the building was to undergo a $10 million renovation, after which the ground and first floors would be occupied by the Teochew cultural centre. The centre was to be used for various cultural activities, including art exhibitions, displays of Chinese and Teochew artifacts and the staging of Teochew operas. Renovation works had begun by September and were to be completed by 1997. In 1998, the Ngee Ann-Adelaide Education Centre private institution, formed through a partnership between the Ngee Ann Kongsi and the [University of Adelaide](/wiki/University_of_Adelaide), was opened in the building. The centre stopped accepting new students on 18 July 2016 after the university decided to end the partnership. The Ngee Ann Kongsi Heritage Hall was established within the building in March 2003 to \"commemorate the entrepreneurial and sacrificial spirit of the pioneers of Ngee Ann Kongsi.\" The hall displays several artifacts and archives detailing the history of the Ngee Ann Kongsi. In April 2004, the Ngee Ann Kongsi Collections Gallery, an art gallery, was opened in the building. In 2017, the Ngee Ann Kongsi requested the Teochew Poit Ip Huay Kuan to vacate the building to allow for a $40 million redevelopment that was to begin on 1 July 2018. However, the Huay Kuan refused to do so and the ensuing dispute between the two organisations led to the redevelopment being delayed. Both organisations then began filing lawsuits against each other. On 7 December 2023, it was announced that the dispute had come to an end, with both organisations having come to an agreement. As a result, it was decided that the plans for redevelopment, which would involve the building's rear being demolished and replaced by a newer building, would be going forward. 1°17′43″N 103°50′36″E﻿ / ﻿1.2954°N 103.8434°E﻿ / 1.2954; 103.8434\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:03.603180",
  "title": "Teochew Building",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Teochew_Building"
}