{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:09.646785"
  },
  "content": "Teochew dish popular in Malaysia, Singapore and Chaozhou **Teochew porridge** ([Chinese](/wiki/Traditional_Chinese_characters): 潮州糜; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Tiô-chiu-môe / Tiô-chiu-bê*; [Teochew](/wiki/Teochew_dialect) [Peng'im](/wiki/Peng%27im): Diê⁵ziu¹muê⁵ ([Chaouzhou](/wiki/Chaozhou)), Dio⁵ziu¹ muê⁵ ([Swatow](/wiki/Shantou)); [Teochew](/wiki/Teochew_dialect) pronunciation in [Tâi-lô](/wiki/T%C3%A2i-l%C3%B4): *Tiô-tsiu-muê*) is a [Teochew](/wiki/Teochew_cuisine) rice porridge dish often accompanied with various small plates of side dishes. Amongst them, salted vegetable, preserved radish, olive grits (橄欖糝), salted duck egg and salt fish are the must-have side-dish. Teochew porridge is served as a banquet of meats, fish egg, and vegetables that is eaten with plain rice porridge. It may be simply prepared plain (i.e. without toppings), or include sweet potatoes. The rice grains, while softened from cooking, are still whole and not in an overly starchy state. Because the porridge is served plain, it is suitable to accompany salty side dishes. The recipe originated in Chaozhou and was later modified by early immigrants prepared in [Malaysia](/wiki/Malaysia) and [Singapore](/wiki/Singapore) over the generations to suit local tastes. In Singapore, Teochew-style porridge is usually consumed with a selection of [Singaporean Chinese](/wiki/Chinese_Singaporeans) side dishes like *[nasi Padang](/wiki/Nasi_Padang)*. There is no fixed list of side dishes, but in Singapore, accompaniments typically include [lor bak](/wiki/Lor_bak) (braised pork), steamed fish, [stir-fried water spinach](/wiki/Stir-fried_water_spinach) (*kangkong goreng*), [salted egg](/wiki/Salted_duck_egg), [fish cake](/wiki/Fishcake), [tofu](/wiki/Tofu), omelet, minced meat, braised *tau kway*, *hei bee hiang* (fried chili [shrimp paste](/wiki/Shrimp_paste)), and vegetables. Teochew porridge dishes emphasize simplicity and originality, and every dish is cooked with minimum seasoning to retain its original taste. Teochew is famous for steamed fish, which is usually only seasoned with light sauce, [spring onion](/wiki/Spring_onion), slices of ginger and a sprinkle of freshly [crushed red pepper](/wiki/Crushed_red_pepper), so that the freshness and sweetness of the seafood can be fully appreciated. Teochew porridge is considered a comfort food that can be eaten for both breakfast as well as supper. [Singapore Airlines](/wiki/Singapore_Airlines) has since 2016 introduced Teochew cuisine on board its flights, which includes Teochew porridge. ## Side dishes - [Steamed fish](/wiki/Steamed_fish), a fish dish seasoned with [soy sauce](/wiki/Soy_sauce), spring onion, slices of ginger and freshly crushed red pepper - [Salted egg](/wiki/Salted_duck_egg), a Chinese preserved food product made by soaking duck eggs in brine, or packing each egg in damp, salted charcoal - [Fishcake](/wiki/Fishcake), minced fish meat which has been pounded. In Singapore, *ikan parang* or *sai tor her* ([wolf herring](/wiki/Wolf_herring)) are considered suitable for making fishcake. - Omelet, a dish made from beaten eggs quickly cooked with butter or oil in a frying pan - Hei bee hiang, a popular spicy, [savory](/wiki/Umami) condiment in Singapore consisting of shrimp paste stir fried with chopped dried shrimp, shallot and garlic - [Stir-fried water spinach](/wiki/Stir-fried_water_spinach), a vegetable dish, sometimes with anchovy - Lor ark, a Teochew-style braised duck with soy sauce - Braised pig's skin, a pork dish braised with soy sauce - [Congee](/wiki/Congee) - [Teochew cuisine](/wiki/Teochew_cuisine) - Food portal\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:09.646487",
  "title": "Teochew porridge",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Teochew_porridge"
}