{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:08.689124"
  },
  "content": "Clan association in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(July 2021)* *(Learn how and when to remove this message)*This article **is written like a personal reflection, personal essay, or argumentative essay** that states a Wikipedia editor's personal feelings or presents an original argument about a topic. Please help improve it by rewriting it in an encyclopedic style. *(July 2021)* *(Learn how and when to remove this message)*This article **may need to be rewritten** to comply with Wikipedia's quality standards. Relevant discussion may be found on the talk page. You can help. The talk page may contain suggestions. *(September 2025)* *(Learn how and when to remove this message)* **Teochew Poit Ip Huay Kuan** ([Chinese](/wiki/Traditional_Chinese_characters): 潮州八邑會館) is a [Teochew](/wiki/Teochew_people) [clan](/wiki/Chinese_clan) [association](/wiki/Chinese_clan_association) in [Singapore](/wiki/Singapore). *Poit Ip*, which means eight districts in the [Teochew dialect](/wiki/Teochew_dialect), stood for the eight Teochew districts in the province of [Guangdong](/wiki/Guangdong), [China](/wiki/China). *[Huay Kuan](/wiki/Singapore_Hokkien_Huay_Kuan)* means \"clan association\". On 12 December 1928, there was a temporary committee convened a meeting at the Tuan Mong School in preparation of the formation of the Huay Kuan. On 20 March 1929, [British colonial authorities](/wiki/Singapore#British_colonial_rule) exempted the Teochew Poit Ip Huay Kuan from registration, and it was formally established. ## History One of the first few [Teochew](/wiki/Teochew_people) clan associations established in Singapore was the [Ngee Ann Kongsi](/wiki/Ngee_Ann_Kongsi). It was founded in 1845 by [Seah Eu Chin](/wiki/Seah_Eu_Chin) together with 12 clans from [Chenghai](/wiki/Chenghai) and [Haiyang](/wiki/Chaoan). Over time, it appeared that the [Kongsi](/wiki/Kongsi) was dominated by the Seah family and the descendants of the 12 clans. On 28 December 1927, 14 men wrote to Ngee Ann Kongsi's chairman, Seah Eng Tong ([Chinese](/wiki/Chinese_language): 佘應忠; [pinyin](/wiki/Pinyin): *Shé Yīngzhōng*) to voice out discontent with the Kongsi. The 14 men led by [Lim Nee Soon](/wiki/Lim_Nee_Soon) included other prominent Teochew figures such as Ang Kai Pang ([Chinese](/wiki/Chinese_language): 洪開榜; [pinyin](/wiki/Pinyin): *Hóng Kāibǎng*), Chia Soon Kim ([Chinese](/wiki/Chinese_language): 謝順琴; [pinyin](/wiki/Pinyin): *Xiè Shùnqín*), Lim Woo Ngam ([Chinese](/wiki/Chinese_language): 林雨岩; [pinyin](/wiki/Pinyin): *Lín Yǔyán*), Ng Khern Seng ([Chinese](/wiki/Chinese_language): 黃芹生; [pinyin](/wiki/Pinyin): *Huáng Qínshēng*), Teo Keong Meng ([Chinese](/wiki/Chinese_language): 張恭銘; [pinyin](/wiki/Pinyin): *Zhāng Gōngmíng*), Yeo Chan Boon ([Chinese](/wiki/Chinese_language): 楊纘文; [pinyin](/wiki/Pinyin): *Yáng Zuǎnwén*) and Yeo Swee Huang ([Chinese](/wiki/Chinese_language): 楊瑞璜; [pinyin](/wiki/Pinyin): *Yáng Ruìhuáng*). They felt that the Kongsi had strayed from its founding objectives and did not act as a good representative of the Teochew community. In order to be in line with the Kongsi's original aims, they demanded the Kongsi to be handed over to the [Teochew](/wiki/Teochew_people) community. A series of negotiations over the Kongsi carried on for the next eight to nine months but failed to conclude with an acceptable solution for both parties. [Lim Nee Soon](/wiki/Lim_Nee_Soon) saw the need of an organisation that could represent the Teochews, therefore on 9 September 1928, Lim Nee Soon led a group of 40 Teochew community leaders to publish a proposal to form a Teochew Huay Kuan (Huay Kuan means Clan Association). On 15 September 1928, a Teochew community-wide general meeting was held at the [Chinese Chamber of Commerce](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry). The purpose of the meeting was to deliberate over the founding of a Teochew Association. It was agreed that the association would be called the Singapore Teochew Poit Ip Huay Kuan. Poit Ip, which means eight districts in [Teochew dialect](/wiki/Teochew_dialect), stood for the 8 [Teochew districts](/wiki/Chaoshan) in the province of [Guangdong](/wiki/Guangdong), China. The eight districts were [Chaoan](/wiki/Chaoan), [Chenghai](/wiki/Chenghai), [Chaoyang](/wiki/Chaoyang_District,_Shantou), [Jieyang](/wiki/Jieyang), [Raoping](/wiki/Raoping), [Puning](/wiki/Puning), [Huilai](/wiki/Huilai) and [Nanao](/wiki/Nan%27ao_County). A 12-member temporary committee including Lim Nee Soon, [Lee Wee Nam](/wiki/Lim_Nee_Soon), Huang Wei Ting ([Chinese](/wiki/Chinese_language): 黃蔚廷; [pinyin](/wiki/Pinyin): *Huáng Wèitíng*), Lim Woo Ngam and Yeo Chan Boon was formed. It was also established that each district would nominate 2 representatives to serve on the committee. On 12 December 1928 the temporary committee convened a meeting at the Tuan Mong School in preparation of the formation of the Huay Kuan. Eight committee members including Lim Nee Soon and Lee Wee Nam were then tasked to draft the constitution. On 26 January 1929, a Teochew general meeting was held in the Chinese Chamber of Commerce. It was resolved that a properties management committee, called the Teochew (Eight Districts) Public Property Preservation Association, be organised by the Teochew clansmen from the eight districts. This committee would be dissolved upon the establishment of the Teochew Poit Ip Huay Kuan that would manage all the properties. This temporary office was also housed at the Tuan Mong School. The temporary association had 48 members including the following office bearers, President: Lim Nee Soon, Vice-President: Lee Wee Nam and Treasurers: Tan Chew Char and Low Peng Soy. On 20 March 1929, the British colonial authorities exempted the Teochew Poit Ip Huay Kuan from registration and it was formally established. A recruitment drive was launched in April 1929 and it attracted more than 700 members. In August 1929, the very first Management Committee was elected. The Management Committee included the following office bearers, President: Lim Nee Soon, Vice-President: Lee Wee Nam and Yeo Chang Boon, Treasurer: Tan Lip Sek and Secretary: Lim Woo Ngam. Upon the independence of Singapore on 9 August 1965, the Teochew Poit Ip Huay Kuan applied for registration as required by the authorities and its approval was granted on 9 November 1965. On 4 September 1929, the 25 members of the first council were sworn in. Notable member includes [Lim Nee Soon](/wiki/Lim_Nee_Soon).[*citation needed*] Lim Nee Soon, Lee Wee Nam, Yeo Chan Boon and four others were then tasked to negotiate with the Ngee Ann Kong Si regarding the Teochew's public properties. A meeting was convened between Seah Eu Tong and Lim Nee Soon on 12 April 1930 to deliberate over the future of Ngee Ann Kong Si. After the meeting, a new Management Committee of 25 members for the Ngee Ann Kong Si was formed. The Ngee Ann Kong Si was officially incorporated on 25 February 1933 under the Ngee Ann Kongsi (Incorporation). The Ngee Ann Kong Si essentially became a trustee's organisation for the Teochew community. With the completion of the [Teochew Building](/wiki/Teochew_Building) (at no.97 Tank Road) in 1963, Teochew Poit Ip Huay Kuan and the Ngee Ann Kong Si moved their offices into those premises. Today, the Teochew Poit Ip Huay Kuan deals largely with promotion of Teochew cultural values while the Ngee Ann Kong Si acts as a charity organisation and business arm of the Teochew community. Ngee Ann Kong Si contributes a substantial amount of their net annual income towards Teochew Poit Ip Huay Kuan to finance the welfare aid of its needy members and the clan's activities. These two organisations exist in close relation and often engage in joint activities. For instance, when Teochew Poit Ip Huay Kuan organised its annual Teochew Week Exhibition or The Teochew International Convention in 2003, Ngee Ann Kong Si acted as their sponsor. The Teochew Funeral Parlour in Hougang was jointly built and maintained by Ngee Ann Kong Si and Teochew Poit Ip Huay Kuan. ## Membership Teochew Poit Ip Huay Kuan has grown to be one of the largest Chinese clan associations in Singapore. In 1963, it widened its membership base to include female members. As of 2008, its membership strength stood at over 7000 members from a total of 520,000 Teochews in Singapore. Its members are not required to pay annual membership fees; only a one-time registration fee is required. It restricts membership to Teochews only. In 2008, it had six Singapore ministers forming its honorary advisory board. They were [Lim Boon Heng](/wiki/Lim_Boon_Heng) (Minister, Prime Minister Office), [George Yeo Yong Boon](/wiki/George_Yeo_Yong_Boon) (Minister for Foreign Affairs), [Lee Boon Yang](/wiki/Lee_Boon_Yang) (Minister for Information, Communications and the Arts), [Teo Chee Hean](/wiki/Teo_Chee_Hean) (Minister for Defence), [Lim Swee Say](/wiki/Lim_Swee_Say) (Minister, Prime Minister Office) and [Lim Hng Kiang](/wiki/Lim_Hng_Kiang) (Minister for Trade and Industry).[*citation needed*] Numerous well known businesspeople and entrepreneurs have been members or maintained close relationship with the association.[*citation needed*] ## Activities The Teochew Poit Ip Huay Kuan has been involved in various activities over the years. The cultural, welfare and charity activities and providing an economic function are some of its areas it has been engaged in. **Cultural activities** Every [Lunar New Year](/wiki/Chinese_new_year) it holds a mass greeting party. At the [Mid Autumn Festival](/wiki/Mid_Autumn_Festival), a party is held with Teochew [mooncakes](/wiki/Mooncake) and Teochew \"[Kongfu](/wiki/Gongfu_tea)\" [tea](/wiki/Chinese_tea) and [Teochew opera](/wiki/Chinese_opera). Since 1992, Teochew Poit Ip Huay Kuan has held several Teochew Week on themes like Teochew history, folklores and culture, [Teochew food](/wiki/Teochew_cuisine) and songs etc. It also held a series of talks on Chinese folklores, Chinese migration history and introduction to opera performance. It conducted cultural activities such as workshop on [Chinese dance](/wiki/Chinese_dance), [martial arts](/wiki/Martial_arts), [Chinese painting](/wiki/Chinese_painting) and [calligraphy](/wiki/Chinese_calligraphy) competition. These classes are often free or subsidised and open to public. It also takes part in the annual Singapore *Chinggay* parade which involves a parade of dance and mobile floats. It organises an annual Teochew art exhibition and holds performances by the associations' teenage and children's drama groups, young people's drama group and male chorus. In October 2002, it organised a six-month joint exhibition with the [Singapore History Museum](/wiki/Singapore_History_Museum) on Singapore Teochew's history and culture. **Welfare and charity provision** Welfare was also an important function of the Singapore Chinese associations in the 19th and early 20th century. These welfare needs can be met in the form of charity funds and in the past it was not unusual to provide these assistances beyond the shores of Singapore. In 1936, the Teochew Poit Ip Huay Kuan raised a total of $15,413 for the purpose of strengthening a dyke in [Chaozhou](/wiki/Chaozhou). It also set up a Relief Fund Committee of the Teochew Pang (association). By 1940, the Teochew community raised a total of $472,900 for its relief fund. Locally, the Teochew Poit Ip Huay Kuan donated to foundations such as the [Nanyang University](/wiki/Nanyang_Technological_University) Foundation, National Defence Foundation, Cultural Foundation and [Chinese Development Assistance Council](/wiki/Chinese_Development_Assistance_Council) Foundation. The [Ngee Ann Kong Si](/wiki/Ngee_Ann_Kongsi) annually contributes a generous portion of their net income towards the welfare activities of the Teochew Poit Ip Huay Kuan. Currently, it also provides scholarships to both local and Chinese students. **Economic function** Although the economic and business purposes of the Chinese clan associations are never explicitly spelt out, by its nature and existence of a network, it provides opportunities for businessmen to conduct business. Tan Koh Tiang, current administration secretary of the present Teochew Poit Ip Huay Kuan, states that the Teochew International Convention, which is held every two years, not only links up with the other Teochew clans all over the world to share cultural and clan issues, but it also serves to promote economic development and links. In 1993, it conducted a seminar on investment opportunities in Chao-zhou and [Guangdong](/wiki/Guangdong) provinces. It also provided contacts and information service for businessmen who wish to venture into China. It also offered trips to China to seek investment potential. Commenting on the seminar, Dr Phua Kok Khoo of the Teochew Poit Ip Huay Kuan stated that its \"main emphasis is still on promoting Chinese culture, and even if (they) discuss business, it will not be at the expense of cultural activities\". ## Demise of Chinese Clans and present challenges Chinese clan associations faced a period of stagnation and decline which began around the period of [post independence of Singapore](/wiki/History_of_the_Republic_of_Singapore). After Singapore gained independence, community centres were established by the [People's Association](/wiki/People%27s_Association) to promote communal activities for people in Singapore. Successful public housing policies also made the people less inclined to approach the clan associations for assistance on housing issues. Further, educational and health facilities were established to meet the needs of Singapore citizens. Employment issues were greatly reduced by the country's industrialisation projects. These factors led to the decline of Chinese clan associations as pointed out by BG [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) in one of his speeches, since Independence, many of the services the clan used to provide have been taken over by government and other civic organizations…the government took over the running of schools and public services. Chinese clan associations started to lose their appeal and purpose towards the community and thus they experienced a dwindling membership\". With the decline of Chinese clan associations, Teochew Poit Ip Huay Kuan and other clans increasingly faced obstacles in sustaining their survival. It is a common perception among the Singaporean youths that Chinese clan associations are old-fashioned concepts and thus they lack interest in participating in the clan's activities. This worry over the youths' perception is implied by the former Chairman of Chongshan Huay Kuan, Leong Ah Soh, 59 years old, who told the [Straits Times](/wiki/Straits_Times) on 13 February 1998, that \"even though clan leaders want to re-fashion clans to attract the young, there is great resistance from the ground\". The language divide between the Chinese-speaking general population of the Chinese clan associations and the English-speaking younger generation also acts as an obstacle to getting youth to be engaged in activities. In a report by the Straits Times on 13 February 1998, it cited that many people gave the Chinese cultural festival's events the cold shoulder due to their inability to understand or speak Mandarin. The decrease in importance of the Chinese language can be attributed how youths often view Chinese as inferior. According to Professor Chew Cheng Hai, a consultant to [Nanyang Technological University's](/wiki/Nanyang_Technological_University) Centre for Chinese Language and Culture, \"Singaporean society views [Mandarin](/wiki/Mandarin_Chinese) as the language of those who are not successful.\" Unable to effectively reach out to the youth, due to language and generation barriers, Chinese clan associations face an aging membership and a problem of finding successors to clan leadership positions. This is a pertinent problem pointed by Tan Koh Tiang. ## Reaching out and moving ahead In light of the decline and challenges faced by the Chinese clan associations, it is imperative for Chinese clans to adopt steps to ensure their survival.[*citation needed*] The emphasis for change and adaptation are highlighted by top Singapore government officials. BG Lee Hsien Loong said \"whether the clans are able to remain vibrant and relevant to the new generation, rejuvenate themselves and attract younger members will depend to a large extent, on how successfully they adapt their role to changing social conditions.\" In order to strive for change, Tan Koh Tiang admits while the Teochew Poit Ip Huay Kuan had served its traditional purpose in the past, it is looking towards a focus on promoting Teochew culture, tradition and values today. The Teochew Poit Ip Huay Kuan which presently engages actively in a wide range of cultural activities such as workshop on Chinese dance, [Chinese martial arts](/wiki/Chinese_martial_arts), [Chinese painting](/wiki/Chinese_painting), [Chinese calligraphy](/wiki/Chinese_calligraphy) competitions and Chinese essay-writing competition. In 1983, it formed a cultural and education section and set up an education and cultural centre in the Teochew Building and in 1985 the cultural and education section was enlarged to become a cultural committee, responsible for promoting educational, cultural and recreational activities. Teochew Poit Ip Huay Kuan continues to promote links with the Teochew hometown (Chaoshan) in China as a means to promote Teochew tradition and culture. Speaking at the 12th Teochew International Convention, the then-Deputy Prime Minister Lee Hsien Loong concurred with such activities and also suggested that clans could help youths discover their cultural route in order to counter the weakening sense of heritage and tradition among the young. The Teochew Poit Ip Huay Kuan also reflected a sense of adaptability with changing times through its ability to accept and harness on technology. In 1987, it established a computer centre and was the first clan association to conduct computer courses. In 1998 it set up the Teochew Poit Ip Huay Kuan website to reach out to the Internet population. It also keeps in touch and notifies its members through the use of email and the press. These outreach through email, press and websites are largely carried out in Mandarin. By riding on the technological advancement and promoting Teochew culture, Teochew Poit Ip Huay Kuan hopes to reach out to youths to ensure a succession of future leadership. The need for incoming young blood in the Chinese clans is of utmost importance.[*citation needed*] As DPM Lee Hsien Loong mentioned, \"clan associations have to induct fresh blood into their leadership ranks and pass on the reins of leadership to the next generation in a smooth, progressive manner…then the clan association will remain dynamic and vibrant and will not become obsolete in modern Singapore\". The Teochew Poit Ip Huay Kuan provides scholarship to both local Teochews and Teochew students from China. It hopes that these scholarship recipients will promote the Teochew Poit Ip Huay Kuan and encourage more youths to join the clan association. In early 2008, the Teochew Poit Ip Huay Kuan also established the Young Teochew Group and aims to hit a 100 strong membership ; currently as of April 2008, its membership strength stands at 30 people. Tan Koh Tiang said that it was mainly the China Teochew youths who responded to the scholarship provision and joined Young Teochew Group. As the Teochew Poit Ip Huay Kuan moves ahead, they make conscious efforts to collaborate with other local and overseas clan associations. Such collaboration fosters relationships between clans, provides opportunity for clans to learn from each other, tackle common clan issues, and boost survivability. As addressed by then Deputy Prime Minister Lee Hsien Loong at the SFCCA 15th anniversary dinner, \"clan associations should therefore look beyond themselves and work or even merge with one another in order to consolidate leadership and organizational resources\". The Teochew Poit Ip Huay Kuan, participates in previous Teochew International Conventions and also hosted the 4th and 12th convention in 1987 and 2003 respectively. Such conventions allow clans to build ties and link up with each other for future clan developments and activities. The Teochew Poit Ip Huay Kuan also attended anniversary celebrations of its counterparts in various states of [Malaysia](/wiki/Malaysia), as well as the anniversary celebration activities held by the Federated Teochew Association of Malaya. It has received officials, delegations and opera troupes from Chaozhou and [Shantou](/wiki/Shantou) region and the Southeast Asian study tour delegation of the Hong Kong Chinese Chamber of Commerce. It has also organised tours to Malaysia, Hong Kong, Japan and the eight districts in Chaozhou and Shantou region to broaden members' general knowledge about Teochew culture and strengthen clan ties. - Teochew Poit Ip Huay Kuan - Ngee Ann Kong Si\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:08.688865",
  "title": "Teochew Poit Ip Huay Kuan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Teochew_Poit_Ip_Huay_Kuan"
}