{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:11.887534"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Teun Koolhaas\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(February 2021)* *(Learn how and when to remove this message)* **Teun Koolhaas** (7 January 1940 in [Singapore](/wiki/Singapore) – 3 October 2007 in [Amsterdam](/wiki/Amsterdam)) was a Dutch architect and urban planner. ## Early years Teun Koolhaas was born in Singapore, where his father, Rem Koolhaas, worked as a shipbuilding engineer. When Southeast Asia was occupied by Japan, Teun and his mother were imprisoned in [Tjideng](/wiki/Tjideng) camp in [Batavia](/wiki/Jakarta). After the end of the Japanese occupation of Indonesia, the family was reunited, and they moved to Hong Kong. In 1955 Koolhaas returned to the Netherlands to complete his secondary education. He then went on to study engineering at the [Technical University of Delft](/wiki/Technical_University_of_Delft), where he attended lectures by artists including [Gerrit Rietveld](/wiki/Gerrit_Rietveld) and [Cornelis van Eesteren](/wiki/Cornelis_van_Eesteren). After graduating in 1967 Koolhaas continued his studies at [Harvard University](/wiki/Harvard_University) and [MIT](/wiki/MIT) in the United States. At Harvard, he earned a degree in urban planning. ## Work In 1969 Koolhaas returned to the Netherlands, where he went to work for the architectural firm, Environmental Design SA. Among other things he designed the dentistry school building at the [University of Utrecht](/wiki/University_of_Utrecht) in the Uithof complex. Today, the departments of biology and pharmaceutical sciences are located there. The official name is the F.A.F.C. Went Building (after the botanist [Frits Went](/wiki/Frits_Went)). In 1972 Koolhaas began working for the National Office for the IJsselmeer Polders (RIJP). As part of a team of architects, urban planners, sociologists, traffic planners and landscape architects, Koolhaas played an important role in creating the master plan for the new city of [Almere](/wiki/Almere) in the south island of [Flevoland](/wiki/Flevoland), and was responsible for its urban design. In 1981 Koolhaas left the Almere project and moved to the regular organization of the RIJP, where he was involved in the design of [Zeewolde](/wiki/Zeewolde), and made designs for [Markerwaard](/wiki/Markerwaard), a [polder](/wiki/Polder) that was never built. In the mid-eighties Koolhaas started out on his own, and founded Ontwerpbureau Ir. Teun Koolhaas Associates (TKA). TKA's work included the master plan for [Kop van Zuid](/wiki/Kop_van_Zuid) in [Rotterdam](/wiki/Rotterdam). In 2003, suffering from cancer, Koolhaas left TKA but continued working almost until his death in October 2007; he was commissioned by the municipalities of Almere and Amsterdam to design the new town Almere Pampus. ## Family Teun Koolhaas is the father of actress Betje Koolhaas. Author and screenwriter [Anton Koolhaas](/wiki/Anton_Koolhaas) (father of architect [Rem Koolhaas](/wiki/Rem_Koolhaas)) was his paternal uncle. ## Awards - 1967–1969: Harkness Fellowship of the Commonwealth Fund, New York - 1970: Grand Prix International d’Urbanisme et d’Architecture’, Cannes, France - 1984: Second Prize (of 198 participants) in the Oosterdock urban design competition - 1985: Gepremieerd ontwerp voor een experimenteel woonhuis in de ontwerpprijsvraag De Fantasie’, bekend als ‘Polderblik’ te Almere - 1991: First Prize design competition Gross Glienicke near Berlin, urban planning and construction of 105 homes - 1994: First Prize design competition Central Zone Amsterdam Noord - 1999: The Island Neighborhood in [Almere Buiten](/wiki/Almere_Buiten) was named best housing estate by the [Netherlands ministry of housing, planning and environment](/wiki/Ministry_of_Housing,_Spatial_Planning_and_the_Environment_(Netherlands)) - 2000: First Prize design competition Westerdok Amsterdam (school and residential building)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:11.887201",
  "title": "Teun Koolhaas",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Teun_Koolhaas"
}