{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:14.067268"
  },
  "content": "* *Textile Centre** is a office-residential development in [Kallang](/wiki/Kallang), [Singapore](/wiki/Singapore). It is a 25-storey development occupying an area of 75,000 square feet. It houses shops, offices, residential apartments and a carpark. It was built for the purpose of resettling textile merchants affected by urban renewal in the 1970s. ## History ### Background The modern textile industry in Singapore was established in 1963 with its first textile factory built. Singapore became an important redistribution centre for the textile trade in South-East Asia in 1960s. Textile trade in Singapore grown with importance between 1960 and 1977, alongside the trade in machinery and equipment, generators, and ships and boats with a decline in commodities of traditional entrepot trade such as crude rubber, pepper, and rice. Along with the growth of the textile industry in the same period, the number of textile related establishments grew from 33 to 398 and the number of workers in the industry grew from 1,316 to 35,049. In 1972, the textile traders, alongside with other wholesalers located Circular Road were affected by the urban renewal plan. A site was selected at Jalan Sultan to build Textile Centre at a cost of [S$](/wiki/Singapore_dollar)20 million (1972) ([US$](/wiki/USD)7.11 million). Developed by Singapore Plaza Development Pte Ltd, the construction broke ground on 23 January 1972, with 63 traders already reserved space at the new development. The development was completed in December 1974, with more than 150 textile shops occupying the first three floors. Occupying 75,000 square feet of space, it had an emporium on the fourth floor, a 20-lane bowling alley on the seventh, and Plaza cinema from the third to sixth floors. ### Changing times Over the years, the commercial retail mix of the development had changed significantly. Gone were the emporium, bowling alley (closed in 2007), and cinema. They were mostly replaced by karaoke bars and a church. Some of the units were idle as the owners had stop operations there but still owned the now fully paid units. There had been several attempts to put the development on the market for redevelopment, but fail. In 2023, its underutilised carpark was put up for sale, and was bought at [S$](/wiki/Singapore_dollar)26 million (2023) ([US$](/wiki/USD)19.36 million).\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:14.066979",
  "title": "Textile Centre",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Textile_Centre"
}