{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:17.689537"
  },
  "content": "Indian-style meal made up of various dishes which are served on a platter **Thali** ([Hindi](/wiki/Hindi_language): थाली *thālī*, meaning \"plate\" or \"tray\") or **bhojanam** ([Telugu](/wiki/Telugu_language): భోజనం *bhōjanaṁ*, meaning \"full meal\") is a round [platter](/wiki/Platter_(dishware)) used to serve food in [South Asia](/wiki/South_Asia), [Southeast Asia](/wiki/Southeast_Asia) and the [Caribbean](/wiki/Caribbean). Thali is also used to refer to an Indian-style meal made up of a selection of various dishes which are served on a platter. [Thali](/wiki/Puja_thali) is also used in south Asia for ceremonial purposes. ## History ### Early history According to archeologist [Bindeshwari Prasad Sinha](/wiki/Bindeshwari_Prasad_Sinha), dish-on-stand and simple dishes belonging to the [Indus Valley Civilization](/wiki/Indus_Valley_Civilization) may be regarded as the prototype of Indian dishes as thalis but these do not have accompanying bowls commonly seen with thalis. According to Sinha the distinctive thali accompanying bowls instead appears in the [Painted Grey Ware culture](/wiki/Painted_Grey_Ware_culture). Archeologist B.B. Lal similarly suggests food was eaten from the Painted Grey Ware dishes and bowls. B.B Lal notes that \"typical dinner set in the Painted Grey Ware consists of the thali (dish), katora (bowl) and lota (drinking vessel),\" he suggests it highlights the tradition followed today. Earliest textual sources on thali comes from [Ayurveda Samhitas](/wiki/Ayurveda), [Sangam](/wiki/Sangam_literature) and medieval period [Indian cookbooks](/wiki/Indian_cookbooks). A chapter in ancient [Sushruta Samhita](/wiki/Sushruta_Samhita) text is dedicated to dining etiquette, method of serving food and proper placement of each dish before the diner, it is the earliest known textual evidence on thali presentation. > *\"The cook should place the bowls containing preparations of pulse, boiled rice and lambatives on clean, spacious trays, and spread them out in front. All kinds of desserts, confectionary and dry viands should be served on his right, while all soups etc., meat-essences, drinks, cordials, milk, Khada-Yusha, and Peya should be placed on his left. Bowls containing preparations of treacle, Raga-Shadava, and Sattaka should occupy a place midway between the two sets of bowls described above.\"* This dining and serving etiquette from Sushruta Samhita is also adopted in medieval Indian cookbooks with some variations. The [Manasollasa](/wiki/Manasollasa) texts chapter *Annabhoga* describes dining etiquette, method of serving food and the way in which district officers and other nobles should be treated at dinner in the court. > *\"He should sit on a cushioned seat facing east and spread a white cloth on the lap covering from navel to knees. His food should be served in a big plate made of gold. Many small bowls which are first cleaned with water and wiped dry with a white cloth should be placed with the plate.\"* The *Ksemakutuhalam* culinary text advises the cook to serve boiled rice in the middle of the plate. Pulse, meat, vegetables and fish are placed (in that order) on the right, and broths, drinks, water and pickles on the left. In Ayurvedic tradition, six tastes known as *Shadrasa* is used to classify foods according to their qualities for ideal meal. These six tastes include; sweet, salty, sour, pungent, bitter, astringent. Thali presentation often includes all six of these flavors. #### Foreign accounts Greek ambassador [Megasthenes](/wiki/Megasthenes) in his work *[Indica](/wiki/Indica_(Megasthenes))* notes the dining manners of [Mauryan Empire](/wiki/Mauryan_Empire) court: > *\"When the Indians are at supper, a table is placed before each person, this being like a tripod. There is placed upon it golden bowls, into which they first put rice, boiled as one would boil barley, and then they add many dainties prepared according to Indian receipts.\"* Portuguese ambassador [Domingo Paes](/wiki/Domingo_Paes) who visited the court of [Vijayanagar Empire](/wiki/Vijayanagar_Empire) notes: > *\"They prepare the table for him; they place for him a three-footed stool, round, made of gold, and on it put the dishes. These are brought in large vessels of gold, and the smaller dishes in basins of gold, some of which are adorned with precious stones. There is no cloth on the table, but one is brought when the King has finished eating, and he washes his hands and mouth.\"* Portuguese ambassador [Duarte Barbosa](/wiki/Duarte_Barbosa) in coastal trading town of [Kozhikode](/wiki/Kozhikode) in Kerala notes the way local chieftains dined: > *\"He sits on the ground on a very low, round stand. There they bring him a large silver tray, and upon it are many small silver saucers, all empty. And they are set before him on the ground upon another low stand; and the cook brings a copper pot with cooked rice, and with a spoon they take it out, and make a pile of it in the middle of the said large tray; afterwards they bring many other pans of diverse viands, and put portions of them into the small saucers.\"* Meera Mukherjee suggests tripod or three-footed stool may have been similar to *\"Mukkali\"* stool, a type of vernacular furniture more commonly found in southern parts of India. While Chowki, Palagai or Bajot, a four-legged stool are more commonly used with thali today. #### Kansa metal Thalis are traditionally made with Kansa metal, a mixture of [copper](/wiki/Copper) and [tin](/wiki/Tin). Although it is similar to bronze, Kansa has higher tin content than bronze. The fifth chapter of the text *[Rasaratna Samuchaya](/wiki/Rasaratna_Samuchaya)* is dedicated to Kansa with significant information about Kansa kitchenware, diningware and its benefits. ## Thali/Bhojanam meal *Thali* refers to the metal plate that a thali meal may be served on, while *Bhojanam* refers to full meals. Thali is popular method of serving meals in South Asia. The idea behind a thali is to offer different flavours of sweet, salt, bitter, sour, astringent and spicy on one single plate (technically the last two are actually forms of [chemesthesis](/wiki/Chemesthesis) rather than true flavours). According to Indian food custom, a proper meal should be a perfect balance of all these six flavours. Restaurants typically offer a choice of vegetarian or meat-based thalis. Vegetarian bhojanams are common in [Tamil Nadu](/wiki/Tamil_Nadu) canteens. Dishes served in a thali vary from region to region in the Indian subcontinent and are usually served in small bowls, called *katori* in India. These katoris are placed along the edge of the round tray, the actual thali; sometimes a steel tray with multiple compartments is used. Typical dishes include rice, [dal](/wiki/Dal), vegetables, [roti](/wiki/Roti), [papad](/wiki/Papad), [dahi](/wiki/Dahi_(curd)) (yogurt), small amounts of [chutney](/wiki/Chutney) or [pickle](/wiki/South_Asian_pickles), and a sweet dish. Rice or roti is the usual main dish that occupies the central portion of the thali, while side dishes like vegetable curries and other aforementioned delicacies are lined circularly along the round thali. Depending on the restaurant or the region, the thali consists of delicacies native to that region. In general, a thali begins with different types of breads such as [puris](/wiki/Puri_(food)) or chapatis (rotis) and different vegetarian specialities ([curries](/wiki/Curry)). However, in South India and Southeast Asia, rice is the only staple served with bhojanams. Thalis or Bhojanams are sometimes referred to by the regional characteristic of the dishes they contain. For example, one may encounter [Andhra](/wiki/Andhra_cuisine) bhojanam, [Nepalese](/wiki/Nepalese_cuisine) thali, [Rajasthani](/wiki/Rajasthani_cuisine) thali, [Gujarati](/wiki/Gujarati_cuisine) thali, [Maharashtrian](/wiki/Maharashtrian_cuisine) thali, Manipuri [chakluk](/wiki/Chakluk), [Tamil](/wiki/Tamil_cuisine) unavu and [Thai](/wiki/Thai_cuisine) unavu. In many parts of [South Asia](/wiki/South_Asia), [Southeast Asia](/wiki/Southeast_Asia) and the [Caribbean](/wiki/Caribbean), the bread and the rice portions are not served together in the thali. Typically, the bread is offered first with rice being served afterwards, often in a separate bowl or dish. ## Affordability The [Economic Survey of India 2020](/wiki/Economic_Survey_of_India_2020) has a section called *Thalinomics*, the survey found that the vegetarian thalis became 29% more affordable compared to 2006-07, while non-veg thalis became 18% more affordable. - [Banchan](/wiki/Banchan) - [Beyaynetu](/wiki/Beyaynetu) - [Combination plate](/wiki/Combination_plate) - [Honzen-ryōri](/wiki/Honzen-ry%C5%8Dri) - [Indian cuisine](/wiki/Indian_cuisine) - [Kamayan](/wiki/Kamayan) - [Kaiseki](/wiki/Kaiseki) - [Korean table d'hôte](/wiki/Korean_table_d%27h%C3%B4te) - [Meze](/wiki/Meze) - [Nepali cuisine](/wiki/Nepali_cuisine) - [Platter (dinner)](/wiki/Platter_(dinner)) - [Rice and three](/wiki/Rice_and_three) - [Sadya](/wiki/Sadya) - [Tapas](/wiki/Tapas) - [Zakuski](/wiki/Zakuski) - Setalvad, Naini (2 May 2010), \"The scientific Indian thali\", *[Deccan Chronicle](/wiki/Deccan_Chronicle)*, archived from the original on 20 September 2010.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:17.689240",
  "title": "Thali",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Thali"
}