{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:19.945060"
  },
  "content": "President of Singapore since 2023 **Tharman Shanmugaratnam**[a] [PPA(E)](/wiki/Pingat_Pentadbiran_Awam) (born 25 February 1957) is a Singaporean politician and economist who has been the current and ninth [President of Singapore](/wiki/President_of_Singapore) since 2023 after winning the [2023 presidential election](/wiki/2023_Singaporean_presidential_election). Prior to his presidency, Tharman served as [Senior Minister of Singapore](/wiki/Senior_Minister_of_Singapore) between 2019 and 2023, Chairman of the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) between 2011 and 2023, and [Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore) between 2011 and 2019. He also served as [Coordinating Minister for Economic and Social Policies](/wiki/Coordinating_Minister_for_Social_Policies) between 2011 and 2015, [Minister for Finance](/wiki/Ministry_of_Finance_(Singapore)) between 2007 and 2015, [Minister for Education](/wiki/Ministry_of_Education_(Singapore)) between 2003 and 2008 and [Minister for Manpower](/wiki/Ministry_of_Manpower_(Singapore)#Ministers) in 2011 and 2012. A former member of the governing [People's Action Party](/wiki/People%27s_Action_Party) (PAP), he was the Member of Parliament (MP) representing [Jurong Group Representation Constituency](/wiki/Jurong_Group_Representation_Constituency) (GRC) between 2001 and 2023. Tharman made his political debut in the [2001 general election](/wiki/2001_Singaporean_general_election), and had been re-elected to Parliament four times at subsequent general elections in (/wiki/2006_Singaporean_general_election), (/wiki/2011_Singaporean_general_election), (/wiki/2015_Singaporean_general_election) and (/wiki/2020_Singaporean_general_election). In June 2023, Tharman announced his intention to run for the [presidential election](/wiki/2023_Singaporean_presidential_election). On 7 June 2023, Tharman resigned from both the PAP and Parliament as the presidency is a non-partisan office. On 2 September, Tharman was announced as the winner after receiving 70.4% of the vote in a landslide victory and was elected as the ninth president of Singapore. He is the first presidential candidate of non-Chinese descent to win a contested presidential election in Singapore. ## Early life and education Tharman was born in [Singapore during British colonial rule](/wiki/Colony_of_Singapore) in 1957 to a family of [Sri Lankan Tamil](/wiki/Sri_Lankan_Tamils) origin. In his youth, Tharman attended the [Anglo-Chinese School](/wiki/Anglo-Chinese_School) before graduating from the [London School of Economics](/wiki/London_School_of_Economics) (LSE) with a [Bachelor of Science](/wiki/Bachelor_of_Science) degree in economics. He subsequently went on to the [University of Cambridge](/wiki/University_of_Cambridge), where he completed a [Master of Philosophy](/wiki/Master_of_Philosophy) degree in economics. He then became a student at the [Harvard Kennedy School](/wiki/Harvard_Kennedy_School) at [Harvard University](/wiki/Harvard_University), where he completed a [Master in Public Administration](/wiki/Master_in_Public_Administration) (MPA) degree and was a recipient of the [Lucius N. Littauer](/wiki/Lucius_N._Littauer) Fellows Award (given to MPA students who demonstrate academic excellence and leadership). In 2011, LSE awarded him an [Honorary Fellowship](/wiki/Honorary_title_(academic)). Tharman was a [student activist](/wiki/Student_activist) while studying in the United Kingdom during the 1970s. He originally held [socialist](/wiki/Socialism) beliefs, but his views on economics evolved over the course of his working career. ## Early career Tharman started his working career at the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS), where he became its [chief economist](/wiki/Chief_economist). He later joined the Singapore Administrative Service and served in the Ministry of Education as Senior Deputy Secretary for Policy, before returning to the MAS where he eventually became its managing director. He was awarded the [Public Administration Medal](/wiki/Pingat_Pentadbiran_Awam) (Gold) in 1999. He resigned as managing director of the MAS to contest in the [2001 general election](/wiki/2001_Singaporean_general_election) as a candidate for the [People's Action Party](/wiki/People%27s_Action_Party). ### Official Secrets Act case While serving as director of the Economics Department of the MAS in 1992, Tharman was one of five persons charged under the [Official Secrets Act](/wiki/Official_Secrets_Act) (OSA) in a case involving the publication of Singapore's 1992 second-quarter flash GDP growth projections in the [*Business Times*](/wiki/Business_Times_(Singapore)) newspaper. The others included the editor, Patrick Daniel, of the *Business Times*. The OSA case, which lasted over a year, was reported extensively in the Singapore press. Tharman contested, and was eventually acquitted of, the charge of communicating the GDP growth flash projections. The District Court then introduced a lesser charge of negligence, as the prosecution's case had been that the figures were seen on a document that he had with him on a table during his meeting with private sector economists together with one of his colleagues. Tharman also contested this lesser charge of negligence, and defended himself on the witness stand for a few days. The Court nevertheless convicted him and the others in the case. Tharman was fined S$1,500, and the others S$2,000. As there was no finding that he communicated any classified information, the case did not pose any hurdle to his subsequent appointment as the managing director of the MAS, nor to his subsequent larger national responsibilities. ## Political career Tharman made his political debut in the [2001 general election](/wiki/2001_Singaporean_general_election), contesting [Jurong GRC](/wiki/Jurong_GRC) as part of a five-member PAP team and won 79.75% of the vote. Tharman was subsequently appointed [Senior Minister of State for Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) and [Senior Minister of State for Education](/wiki/Ministry_of_Education_(Singapore)). He was appointed to the [Cabinet](/wiki/Cabinet_of_Singapore) as [Minister for Education](/wiki/Ministry_of_Education_(Singapore)#Ministers) in 2003 and served in this role until 2008. Following the [2006 general election](/wiki/2006_Singaporean_general_election), Tharman was appointed [Second Minister for Finance](/wiki/Ministry_of_Finance_(Singapore)) (alongside his role as Minister for Education). On 1 December 2007, he was appointed [Minister for Finance](/wiki/Ministry_of_Finance_(Singapore)#Ministers). Following the [2011 general election](/wiki/2011_Singaporean_general_election), Tharman was appointed [Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore) and Coordinating Minister for Economic and Social Policies, while retaining his portfolio as Minister for Finance. He also served as [Minister for Manpower](/wiki/Ministry_of_Manpower_(Singapore)#Ministers) between 2011 and 2012 concurrently. After the 2015 General Election, he stepped down as Minister for Finance on 30 September 2015, after 9 years. He remained Deputy Prime Minister and was also appointed Coordinating Minister for Social Policies. At the [2015 general election](/wiki/2015_Singaporean_general_election), [Jurong Group Representation Constituency](/wiki/Jurong_Group_Representation_Constituency), which was predominantly anchored by Tharman, won 79.28% of the vote against the five-member [Singaporeans First](/wiki/Singaporeans_First) team. Tharman was elected to the [Central Executive Committee of the People's Action Party](/wiki/Central_Executive_Committee_(PAP)) in December 2002, and was appointed 2nd Assistant Secretary-General in May 2011. On 23 April 2019, it was announced that both Tharman and [Teo Chee Hean](/wiki/Teo_Chee_Hean) were appointed [Senior Ministers](/wiki/Senior_Minister_of_Singapore) effective from 1 May 2019 under a Cabinet reshuffle, relinquishing their Deputy Prime Minister portfolios. Tharman would also be [Coordinating Minister for Social Policies](/wiki/Coordinating_Minister_for_Social_Policies) and advise the prime minister on economic policies. Tharman retained his parliamentary seat in Jurong GRC at the [2020 general election](/wiki/2020_Singaporean_general_election), after winning 74.62% of the vote against the five-member [Red Dot United](/wiki/Red_Dot_United) team. In July 2023, Tharman stepped down from Parliament and all his positions in the government and resigned as a member of the PAP in order to stand as a candidate in the [2023 Singaporean presidential election](/wiki/2023_Singaporean_presidential_election). ## Other roles Tharman served as Chairman of the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS) for 12 years from 1 May 2011 until 7 July 2023, when he was succeeded by his deputy, [Lawrence Wong](/wiki/Lawrence_Wong). In May 2019, Tharman was appointed Deputy Chairman of [GIC](/wiki/GIC_(Singaporean_sovereign_wealth_fund)), Singapore's [sovereign wealth fund](/wiki/Sovereign_wealth_fund), a position he held until 7 July 2023. Tharman also served as Director of GIC between 2004 and 2023, and Chairman of the Investment Strategies Committee (ISC) between 2011 and 2023. On 8 July 2023, Tharman was succeeded by [Lawrence Wong](/wiki/Lawrence_Wong) as Chairman of the Investment Strategies Committee (ISC). Tharman chaired the International Advisory Council (IAC) of the [Economic Development Board](/wiki/Economic_Development_Board) (EDB) between 2014 and 2023, and the International Academic Advisory Panel that advises the [Singapore Government](/wiki/Government_of_Singapore) on strategies regarding the university sector. On 8 July 2023, Tharman was succeeded by [Lawrence Wong](/wiki/Lawrence_Wong) in both positions. ### Non-governmental organisations (NGOs) Tharman chaired the Board of Trustees of the [Singapore Indian Development Association](/wiki/Singapore_Indian_Development_Association) (SINDA), which seeks to uplift educational performance and aspirations in the Indian community in Singapore from 2008 until 2023. He also chaired the Ong Teng Cheong Labour Leadership Institute from 2002 until 2023. He chaired the [National Jobs Council](/wiki/National_Jobs_Council_of_Singapore) aimed at rebuilding skills and jobs for Singaporeans in the wake of the [COVID-19 pandemic](/wiki/COVID-19_pandemic). Tharman led the SkillsFuture programme, launched in 2014 with the aim of developing skills of the future, and opportunities for life-long learning and job upskilling among Singaporeans. He also chaired the tripartite councils from 2011 to 2016 which drove national efforts to transform productivity through innovation and skills, and the implementation of industry-specific transformation programmes. This included the Council for Skills, Innovation and Productivity (CSIP). Tharman co-chaired a few bilateral committees to promote economic and trade relations between Singapore and other countries, including the Singapore-Liaoning Economic and Trade Council from 2004 to 2008, and the High-Level Russia-Singapore Inter-Governmental Commission from 2011 to 2022. ## International appointments In 2011, Tharman was appointed chair of the International Monetary and Financial Committee (IMFC), the policy advisory committee of the [International Monetary Fund](/wiki/International_Monetary_Fund), a position he held until 2014. The IMF cited his experience and expertise in economic and financial policy at global level when announcing the appointment.. In April 2017, Tharman was appointed by the [G20](/wiki/G20) to chair the G20 Eminent Persons Group (EPG) on Global Financial Governance. The Group published proposals in October 2018 concerning global development finance and financial stability. On 1 January 2017, Tharman succeeded [Jean-Claude Trichet](/wiki/Jean-Claude_Trichet) as chair of the [Group of Thirty](/wiki/Group_of_Thirty), an independent body of economic and financial policymakers. He was later succeeded by [Mark Carney](/wiki/Mark_Carney) and was appointed chair of the Group’s Board of Trustees on 1 January 2023. On 22 May 2019, the [United Nations Development Programme](/wiki/United_Nations_Development_Programme) (UNDP) announced that Tharman will be co-chairing the Advisory Board of the [Human Development Report](/wiki/Human_Development_Report) (HDR) 2019 alongside [Thomas Piketty](/wiki/Thomas_Piketty). He was reappointed thrice, to co-chair the Advisory Board, alongside [Michael Spence](/wiki/Michael_Spence) in 2020, [Michele Lamont](/wiki/Michele_Lamont) in 2021/22, and [Joseph Stiglitz](/wiki/Joseph_Stiglitz) in 2023/24, In May 2019, Tharman was appointed a member of the Board of Trustees of the [World Economic Forum](/wiki/World_Economic_Forum) (WEF). In January 2021, Tharman was appointed by the G20 to co-chair the G20 High Level Independent Panel (HLIP) on Financing the Global Commons for Pandemic Preparedness and Response, alongside [Ngozi Okonjo-Iweala](/wiki/Ngozi_Okonjo-Iweala) and [Lawrence Summers](/wiki/Lawrence_Summers). In March 2022, Tharman was appointed a member of the [United Nations Secretary-General](/wiki/Secretary-General_of_the_United_Nations)'s High‑Level Advisory Board on Effective Multilateralism. Tharman co-chaired the Global Commission on the Economics of Water with [Mariana Mazzucato](/wiki/Mariana_Mazzucato), [Ngozi Owonjo-Iweala](/wiki/Ngozi_Okonjo-Iweala), and [Johan Rockström](/wiki/Johan_Rockstr%C3%B6m). Its initial recommendations helped shape the outcomes of the UN Water Conference in March 2023. The GCEW released its final report in October 2024. He is also co-chair of the High-Level Advisory Council on Jobs, established by the [World Bank Group](/wiki/World_Bank_Group) in July 2024. ## Presidency (2023–present) ### 2023 presidential bid On 8 June 2023, Tharman announced his intention to be a candidate in the [2023 presidential election](/wiki/2023_Singaporean_presidential_election). He resigned from all his positions in the government and as a member of the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) on 7 July in order to stand in the election, as the presidency is a [non-partisan](/wiki/Nonpartisanship) office. On 26 July, Tharman launched his presidential campaign with the campaign slogan \"Respect for All\". On 7 August, he submitted his application for the Certificate of Eligibility (COE) to the [Elections Department](/wiki/Elections_Department_Singapore). He was issued the COE on 18 August by the [Presidential Elections Committee](/wiki/Presidential_Elections_Committee) (PEC). On 2 September, Tharman was announced as the winner after receiving 70.41% of the vote, with [Ng Kok Song](/wiki/Ng_Kok_Song) receiving 15.72% and [Tan Kin Lian](/wiki/Tan_Kin_Lian) receiving 13.87%, and was elected as the ninth [president of Singapore](/wiki/President_of_Singapore). He is the first non-Chinese presidential candidate to win in a contested presidential election in Singapore. Tharman also garnered the highest vote count in Singapore's presidential electoral history of 70.41%. He was sworn in on 14 September at a ceremony held at the [Istana](/wiki/The_Istana), succeeding [Halimah Yacob](/wiki/Halimah_Yacob). ### In office as president On 24 January 2024, Tharman made his first state visit to [Brunei](/wiki/Brunei) as president. His predecessor, [Halimah Yacob](/wiki/Halimah_Yacob) also made her first State Visit overseas, to Brunei. He made a State Visit to Philippines in August 2024, and official visits to [Italy](/wiki/Italy) and [Estonia](/wiki/Estonia) in June the same year. In 2025, he made State Visits to [India](/wiki/India), [Belgium](/wiki/Belgium) and [Luxembourg](/wiki/Luxembourg), [Egypt](/wiki/Egypt) and [Mexico](/wiki/Mexico). He has also made working visits to [France](/wiki/France), [Germany](/wiki/Germany), the [United States](/wiki/United_States) and [Switzerland](/wiki/Switzerland). On 15 May 2024, Tharman appointed [Lawrence Wong](/wiki/Lawrence_Wong) as the 4th prime minister of Singapore after [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) resigned as prime minister. On 23 May 2025, he presided over the [swearing-in](/wiki/Swearing-in) of the new [Cabinet](/wiki/Cabinet_of_Singapore). ## Awards ### Domestic honours - In 1999, Tharman was awarded the [Public Administration Medal (Gold)](/wiki/Pingat_Pentadbiran_Awam) (PPA(E)) - In July 2010, Tharman became the fourth recipient of the Honorary Fellowship of the Economic Society of Singapore, after [Goh Keng Swee](/wiki/Goh_Keng_Swee), Lim Chong Yah, and [Goh Chok Tong](/wiki/Goh_Chok_Tong). - In May 2017, the [National Trades Union Congress](/wiki/National_Trades_Union_Congress) (NTUC) conferred its highest award, the Medal of Honour, on Tharman for his varied contributions to the [labour movement](/wiki/Labour_movement_of_Singapore) including \"driving national initiatives to better the lives of workers\" and \"his deep commitment to building an inclusive society\". - In May 2019, Tharman was conferred Honorary Membership of the [Singapore Medical Association](/wiki/Singapore_Medical_Association). ### International honours In October 2019, Tharman received the Institute of International Finance's inaugural Distinguished Leadership and Service Award, together with Bank of England Governor [Mark Carney](/wiki/Mark_Carney), for his role as a leading proponent of global reforms to de-risk and grow development finance and to achieve more resilient capital flows. Tharman was named Finance Minister of the Year 2013 by *[Euromoney](/wiki/Euromoney)*, in recognition of the roles he played in the economic restructuring of Singapore and as statesman of the region on the international stage. Tharman was conferred the [Freedom of the City of London](/wiki/Freedom_of_the_City_of_London) award in June 2019, in recognition of his significant contributions to global finance governance, and his efforts to strengthen ties between Singapore and the city. In 2025, Tharman was awarded the Miriam Pozen Prize by the Massachusetts Institute of Technology Golub Center for Finance and Policy, in recognition of his leadership in international financial policy. He was also conferred an Honorary Fellowship by the London School of Economics in 2011. ## Personal life Tharman is a fourth-generation [Singaporean](/wiki/Singaporeans) of Sri Lankan Tamil ancestry. One of three children, Tharman is the son of Emeritus Professor [K. Shanmugaratnam](/wiki/K._Shanmugaratnam), a medical scientist known as the \"father of pathology in Singapore\", who founded the Singapore Cancer Registry and led a number of international organisations related to cancer research and pathology. Tharman has been married to Jane Yumiko Ittogi, a Singaporean lawyer of Chinese–Japanese descent, since 1990. She founded and chairs Tasek Academy and Social Services, a local NGO, and is actively engaged in its initiatives for social development and sustainability. The couple have one daughter and three sons together. Tharman was an active sportsman in his youth, particularly in [hockey](/wiki/Field_hockey), [athletics](/wiki/Sport_of_athletics), [football](/wiki/Football_in_England), and [cricket](/wiki/Cricket), and has expressed his views on how sports instills lessons for life. He spoke about sports as a form of education in *Game for Life: 25 Journeys*, published by the Singapore Sports Council in 2013, as \"a huge deal for character... Children learn the value of teams. They learn the discipline of repeated practice, and how there is no other way to develop expertise. Plus, the ability to fall or lose in competition and pick oneself up... with humility.\" In Singapore's Chinese-language media, Tharman is often referred to as 尚达曼 ([pinyin](/wiki/Pinyin): *Shàng Dámàn*), an approximate transliteration of Tharman Shanmugaratnam. The name was given to him by a leading Chinese language specialist in 1995. Tharman has practiced [Chinese calligraphy](/wiki/Chinese_calligraphy) since 2002. ## Notes - Tharman Shanmugaratnam on Singapore Prime Minister's Office - Tharman Shanmugaratnam on [Parliament of Singapore](/wiki/Parliament_of_Singapore) - Tharman Shanmugaratnam on Taman Jurong - Appearances on [C-SPAN](/wiki/C-SPAN) Political officesPreceded by[Teo Chee Hean](/wiki/Teo_Chee_Hean) **[Minister for Education](/wiki/Ministry_of_Education_(Singapore))** 2003–2008Succeeded by[Ng Eng Hen](/wiki/Ng_Eng_Hen)Preceded by[Lee Hsien Loong](/wiki/Lee_Hsien_Loong) **[Minister for Finance](/wiki/Minister_for_Finance_(Singapore))** 2007–2015Succeeded by[Heng Swee Keat](/wiki/Heng_Swee_Keat)Preceded by[Wong Kan Seng](/wiki/Wong_Kan_Seng) **[Deputy Prime Minister of Singapore](/wiki/Deputy_Prime_Minister_of_Singapore)** 2011–2019 Served alongside: **[Teo Chee Hean](/wiki/Teo_Chee_Hean)**Preceded by[Gan Kim Yong](/wiki/Gan_Kim_Yong) **[Minister for Manpower](/wiki/Ministry_of_Manpower_(Singapore))** 2011–2012Succeeded by[Tan Chuan-Jin](/wiki/Tan_Chuan-Jin)**New office** **[Coordinating Minister for Social Policies](/wiki/Coordinating_Minister_for_Social_Policies) Coordinating Minister for Economic and Social Policies: 2015–2019** 2015–2023Succeeded by[Ong Ye Kung](/wiki/Ong_Ye_Kung)**Vacant**Title last held by**[S. Jayakumar](/wiki/S._Jayakumar_(Singaporean_politician)) [Goh Chok Tong](/wiki/Goh_Chok_Tong) 2011** **[Senior Minister of Singapore](/wiki/Senior_Minister_of_Singapore)** 2019–2023 Served alongside: **[Teo Chee Hean](/wiki/Teo_Chee_Hean)**Succeeded by[Lee Hsien Loong](/wiki/Lee_Hsien_Loong)Preceded by[Halimah Yacob](/wiki/Halimah_Yacob) **[President of Singapore](/wiki/President_of_Singapore)** 2023–present**Incumbent**Government officesPreceded by[Goh Chok Tong](/wiki/Goh_Chok_Tong) **Chair of the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore)** 2011–2023Succeeded by[Lawrence Wong](/wiki/Lawrence_Wong)[Parliament of Singapore](/wiki/Parliament_of_Singapore)**New constituency** **Member of Parliament for [Jurong GRC](/wiki/Jurong_Group_Representation_Constituency) (Taman Jurong)** 2001–2023Succeeded by[Shawn Huang](/wiki/Shawn_Huang)***as MP for [West Coast–Jurong West GRC](/wiki/West_Coast%E2%80%93Jurong_West_GRC) (Taman Jurong)*** Portals: - Politics - Biography - Economics - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:19.944776",
  "title": "Tharman Shanmugaratnam",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tharman_Shanmugaratnam"
}