{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:43.760131"
  },
  "content": "2024 film by Reena DeenThis article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(August 2024)* ***The Damned Ones*** is an upcoming [Singaporean](/wiki/Singapore) supernatural mystery [feature film](/wiki/Feature_film), written, directed and produced by Reena Deen. The film stars Jade Ow and Amanda Yip, and is Singapore's first low-budget independent horror film with a disabled cast, and explores disability and disability representation. ## Plot When university student Siti Limento (who is partially blind) goes missing, her friend and fellow student Laura Heng (who is hard of hearing) goes to the police with a bizarre tale. Laura claims that Siti is trapped in a haunted abandoned village in a forest. But Laura is a compulsive liar. As the investigation unfolds, Laura's story unravels and her secrets are revealed. Is Laura telling the truth for the first time in her life, or has she killed Siti and concocted this strange cover story? ## Cast - Jade Ow as Laura Heng - Amanda Yip as Siti Limento - Mila Troncoso as Diya - Michael J. Parks as Michael - Elaine Siow as First Investigating Officer - Mustafa Ali Khan as Inspector Arun - Mai Youa Xiong as Inspector Ying - Himanshu as Professor Cambly - Vandana Tikku as TNU’s Dean - Kelly as Laura Heng’s mother ## Production *The Damned Ones* was written, directed and produced by Reena Deen, a former teacher turned filmmaker who lives with [dyslexia](/wiki/Dyslexia) and [Complex post-traumatic stress disorder](/wiki/Complex_post-traumatic_stress_disorder). Deen wanted to tell a story featuring a cast of disabled characters that did not revolve around disability. All the disabled characters in the film were played by disabled actors, and the crew was composed of disabled people and people from other marginalised communities. Deen used the Singaporean film club *Kino Red Dot* to find disabled cast and crew. Jade Ow, an actress with moderate to severe [hearing impairment](/wiki/Hearing_impairment), was the first person to come aboard on the project playing the lead character of Laura, a university student who becomes a suspect in her friend's disappearance. Ow then recommended her friend and fellow actress Amanda Yip, who has [retinitis pigmentosa](/wiki/Retinitis_pigmentosa) (progressive vision loss that affects the retina), who was then cast in the role of Siti, the missing woman. Michael J. Parks, who has disabilities affecting reading and memory, was assistant director and also played the role of Michael. The film started shooting in Singapore in 2023. Filming was disrupted on several occasions due to extreme heat and humidity, and also doe to rain storms. Some of the dialogue was improvised, to help support the cast's access needs. Shooting was completed in 2024, and in August 2024, post-production began with Parachute Pictures. ## Reception A short documentary on the making of *The Damned Ones* featuring footage from the film screened at the 2023 *Iaminvisible* Singapore film festival (held in November 2023), a film festival celebrating disabled filmmaking talent and disability representation within film. This documentary won a Commendation Award from [Nee Soon Group Representation Constituency](/wiki/Nee_Soon_Group_Representation_Constituency) MP [Louis Ng](/wiki/Louis_Ng). A second short documentary chronicling the cast and crew's journey in making the film screened at the 2023 *Pokka Film Festival* in Singapore, where it took third place, and was awarded $5000 by Pokka to offset post-production costs. Stills from the film were also selected to be exhibited in *This Body of Mine. Advocating for Disability Through Art: A Closer Look at Disabled-Bodies*, an international virtual exhibition organized by *The Starving Artist.* The exhibition featured artists who challenge ingrained stereotypes and promoted accessibility in all facets of life, and a book of the exhibition was published in March 2024. - *The Damned Ones* at [IMDb](/wiki/IMDb_(identifier)) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:43.759725",
  "title": "The Damned Ones",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Damned_Ones"
}