{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:52.648338"
  },
  "content": "Mixed-use skyscraper in Singapore **The Golden Mile**, formerly **Golden Mile Complex** ([Chinese](/wiki/Simplified_Chinese_characters): 黄金坊; [pinyin](/wiki/Pinyin): *Huángjīn fāng*), is an upcoming [high-rise](/wiki/High-rise) [commercial](/wiki/Commerce) and [residential](/wiki/Residential) building on [Beach Road](/wiki/Beach_Road,_Singapore) in [Kallang](/wiki/Kallang), Singapore. Within walking distance to [Nicoll Highway MRT station](/wiki/Nicoll_Highway_MRT_station), the building was formerly known as **Woh Hup Complex**. Prior to collective sale, the complex contained 411 shops and 500 parking spaces. The building was largely an [ethnic enclave](/wiki/Ethnic_enclave) for the [Thai population in Singapore](/wiki/Thais_in_Singapore). ## History In 1966, the Urban Renewal Department of the [Housing and Development Board](/wiki/Housing_and_Development_Board) was formed to facilitate greater flexibility and autonomy in comprehensive [redevelopment](/wiki/Redevelopment) of Singapore's [Central Area](/wiki/Central_Area,_Singapore). The Golden Mile Complex development was the result of the department's first Sales of Sites programme in 1967. The \"Golden Mile\" refers to the strip of land between [Nicoll Highway](/wiki/Nicoll_Highway) and Beach Road. It was planned by the [Government](/wiki/Government_of_Singapore) as a high-rise spine fronting [Kallang Basin](/wiki/Kallang_Basin). The area used to be occupied by [squatters](/wiki/Squatter) and small marine industries. Built at a cost of S$18 million and completed in 1973, the 16-storey Golden Mile Complex is one of the early pioneers of integrating multiple operations into a single [mixed-use development](/wiki/Mixed-use_development) in Singapore. Today, the complex's shopping mall houses numerous [Thai](/wiki/Thai_people) clubs, shops and eateries, as well as tourist and ticketing agencies for travellers going to [Malaysia](/wiki/Malaysia) by bus or coach. A minor upgrading was carried out on the Golden Mile Complex building in 1983, when tinted glass was added to the Beach Road façade to achieve the desired overall thermal transfer value rating. In 1986, the whole building was redecorated. In March 2006, the Golden Mile Complex was described as a \"vertical slum\", \"terrible eyesore\" and \"national disgrace\" by Singapore [Nominated Member of Parliament](/wiki/Nominated_Member_of_Parliament) [Ivan Png](/wiki/Ivan_Png): \"Each individual owner acts selfishly, adding extensions, zinc sheets, patched floors, glass, all without any regard for other owners and without any regard for the national welfare.\" The residents have also done over their balconies to create an extra room. Golden Mile Complex, which is located on a 99-year [leasehold](/wiki/Leasehold) site starting from 1969, has been planned to be put up for an *en bloc* sale. On 11 August 2018, 80% of the owners signed an agreement agreeing to sell the complex in an en-block sale. In April 2021, part of the ceiling near an entrance fell off, with no reported injuries. On 22 October 2021, the [Minister for National Development](/wiki/Ministry_of_National_Development_(Singapore)) [Desmond Lee](/wiki/Desmond_Lee_(Singaporean_politician)) announced the gazetting of the Golden Mile Complex as a conserved building. The [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) announced incentives for potential buyers, such as allowing them to build a new tower block next to the conserved building. In May 2022, the complex was sold to a consortium (Perennial Holdings Private Limited, Sino Land and Far East Organization) for S$700 million. On 10 December 2022, the lead developers of the consortium that bought the building renamed the project **The Golden Mile** and unveiled plans to build a new 45-storey residential tower known as **Aurea** to complement the conserved complex. The refurbishment expected to complete in late 2029. ## Architecture The Golden Mile Complex is a commercial and residential development, providing offices, shopping, entertainment services and [apartment](/wiki/Apartment) living within its [podium](/wiki/Podium) and [stepped](/wiki/Step_(footing)) [terrace](/wiki/Terrace_(agriculture)) structure, resulting in a [modern](/wiki/Modernist_architecture) architectural style known as [Brutalism](/wiki/Brutalist_architecture). It housed 360 shops, 200 offices and 72 residential apartments when completed in 1973. The building was designed by Gan Eng Oon, [William Lim](/wiki/William_S.W._Lim) and Tay Kheng Soon of the Singapore [architect](/wiki/Architect) firm Design Partnership, now known as [DP Architects](/wiki/DP_Architects). Sited on 1.3 [hectares](/wiki/Hectare) and built to a height of 89 metres, the Golden Mile Complex is an exemplary type of \"[megastructure](/wiki/Megastructure)\" described by architectural historian, [Reyner Banham](/wiki/Reyner_Banham). It is one of the few that have been actually realised in the world. [Pritzker Architecture Prize](/wiki/Pritzker_Architecture_Prize) laureate [Fumihiko Maki](/wiki/Fumihiko_Maki) had called the Golden Mile Complex a \"collective form\". It successfully propagates high-density usage and diversity under a broad range of ideas advanced by the Japanese [Metabolist Movement](/wiki/Metabolist_Movement) of the 1960s. The complex was designed as a \"vertical city\", which stands in contrast to homogenised cities where functional [zoning](/wiki/Zoning) restrains all signs of the latter's vitality. Conceived as a prototype for a lively environment, the design of the Golden Mile Complex was intended to catalyse [urban development](/wiki/Urban_development) along Beach Road by employing an extruded section that would stretch along the East Coast facing the sea. In terms of [public transport](/wiki/Public_transport) and [accessibility](/wiki/Accessibility), the building is serviced from the rear on Beach Road, instead of its frontage with Nicoll Highway, with a continuous pedestrian spine linking all buildings in the Golden Mile of Beach Road. The design was influenced by the [linear city](/wiki/Linear_settlement) concepts of [Le Corbusier](/wiki/Le_Corbusier) and [Arturo Soria y Mata](/wiki/Arturo_Soria_y_Mata). The step-terraced profile of the Golden Mile Complex offers the occupants of the apartments on the upper floors panoramic view of the sea and sky. Every apartment has its own balcony. The crown houses two-storey [maisonette](/wiki/Apartment#Maisonette) [penthouses](/wiki/Penthouse_apartment). The narrowness of this sloping [slab](/wiki/Concrete_slab) form enhances [natural ventilation](/wiki/Natural_ventilation) and shades a lofty communal [concourse](/wiki/Concourse) above the podium along Beach Road. The step-terraced design also reduces the impact of noise from the road traffic. The Golden Mile Complex preceded by several years [avant-garde](/wiki/Avant-garde) stepped-section buildings which were built in the United Kingdom and [Europe](/wiki/Europe). The lower floors contain offices and a retail [mall](/wiki/Shopping_mall), located within staggered [atria](/wiki/Atrium_(architecture)) to allow [natural light](/wiki/Daylighting_(architecture)) into the heart of the building. - [List of shopping malls in Singapore](/wiki/List_of_shopping_malls_in_Singapore) Media related to Golden Mile Complex at Wikimedia Commons\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:52.648075",
  "title": "The Golden Mile, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Golden_Mile,_Singapore"
}