{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:08:17.762535"
  },
  "content": "2014 Singaporean film ***The Naked DJ*** is a 2014 Singaporean documentary film directed by Kan Lume about musician and political activist [Chris Ho](/wiki/Chris_Ho), also known as X' Ho. Ho travels to China and reflects on Singaporean culture and politics. The film won the [NETPAC Award](/wiki/NETPAC_Award) at the Jogja-NETPAC Asian Film Festival in Indonesia. ## Plot Musician and political activist Chris Ho travels to mainland China to explore his roots and get a new tattoo. Filmmaker Kan Lume accompanies him and records Ho's thoughts on Singaporean culture and politics. ## Production Director Kan Lume said the scenes were not orchestrated, but they were planned to some degree. Kan introduced Ho to specific people, though the encounters were not scripted. The crew consisted primarily of Kan and his wife, who edited the film. Kan was influenced by [Eric Rohmer](/wiki/Eric_Rohmer)'s dialogue-heavy style. ## Release Kan said that for nearly two years he had trouble screening the film. He attributed this to the film's low budget but also described how his previous, gay-themed film, *[Solos](/wiki/Solos_(film))*, had been banned in Singapore despite its positive international reception, leaving him to believe his films are too controversial to screen in his homeland. *The Naked DJ* played at the Jogja-NETPAC Asian Film Festival on December 4, 2014. It played at the [Singapore International Film Festival](/wiki/Singapore_International_Film_Festival) on December 2, 2015. ## Reception Maggie Lee of *[Variety](/wiki/Variety_(magazine))* wrote, \"This portrait of (and extended political rant by) a Singaporean underground musician could be director Kan Lume's best work yet.\" The film won the [NETPAC Award](/wiki/NETPAC_Award) at the 2014 Jogja-NETPAC Asian Film Festival. - *The Naked DJ* at [IMDb](/wiki/IMDb_(identifier)) This article about a political documentary film is a stub. You can help Wikipedia by expanding it. - v - t - e This article related to a Singaporean film is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:08:17.762234",
  "title": "The Naked DJ",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Naked_DJ"
}