{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:08:15.365759"
  },
  "content": "1991 film directed by Arthur Smith ***The Medium*** (also known as ***Medium Rare***) is [Singapore](/wiki/Singapore)'s first full-length [English language](/wiki/English_language) film. It was released in local cinemas in late 1991 and produced by Singaporean Errol Pang. It was initially supposed to be directed by a Singaporean, Tony Yeow, then by an [American](/wiki/United_States), Stan Barret, and finally by Arthur Smith, who was [British](/wiki/United_Kingdom). *The Medium* was initially seen as a revival of the local film industry. Starring [Brenda Bakke](/wiki/Brenda_Bakke), Margaret Chan and Dore Kraus. [Zhu Houren](/wiki/Zhu_Houren) also cameos as a coffeeshop owner whose wife ends up getting cheated by the main antagonist. ## Plot *The Medium* is loosely based on the [Toa Payoh ritual murders](/wiki/Toa_Payoh_ritual_murders) of 1981, and its perpetrator, [Adrian Lim](/wiki/Adrian_Lim), with a supernatural twist to the ending. Lim murdered two children and was sentenced to death in 1988. However, in the movie ending, the main character based on Adrian Lim escaped from the prison and ran into an incoming truck where [Satan](/wiki/Satan) catches him and subjects him to eternal torture. This was said to be added to reassure the audience that crime does not pay. ## Production The film cost S$1.84 million to produce with Pang financing S$1.2 million on his own. ## Reception A *[Straits Times](/wiki/The_Straits_Times)* panel liked the storyline, but found the pace was slow, with a weak script with no scare factor. Local newspaper *[The New Paper](/wiki/The_New_Paper)* found the film clichéd and unconvincing. The film did not break even and only earned S$130,000 in Singapore during its run. - *The Medium* at [IMDb](/wiki/IMDb_(identifier)) This article related to a Singaporean film is a stub. You can help Wikipedia by expanding it. - v - t - e This article about a 1990s thriller film is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:08:15.365457",
  "title": "The Medium (1991 film)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Medium_(1991_film)"
}