{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:25.816996"
  },
  "content": "Singaporean real estate lodging company**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(February 2023)* *(Learn how and when to remove this message)* **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(July 2024)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **The Ascott Limited** is a Singaporean [real estate](/wiki/Real_estate) and lodging company and a subsidiary of [CapitaLand](/wiki/CapitaLand). ## History ### Founding years (1984–2000) On 14 August 1984, Scotts Holdings opened The Ascott Singapore, the first international-class [serviced residence](/wiki/Serviced_apartment) in the Asia Pacific region. The name “Ascott” was coined by Ameerali Jumabhoy to represent [Scotts Road](/wiki/Scotts_Road) in Singapore (where the first property was located at) and a nod to the famed British races at [Ascot](/wiki/Ascot_Racecourse), due to the family's association with equestrian sports. Scotts Holdings eventually merged with Stamford Group, the serviced residence arm of [DBS](/wiki/DBS_Bank) Land, to form The Ascott Limited (hereinafter referred to as “Ascott”), creating a joint portfolio of more than 1,700 units in eight cities. In 1998, Pidemco Land set up its first serviced residence arm, Somerset International, and acquired Liang Court Holdings, then one of Asia's largest serviced residence operators, to form Somerset Holdings. Ascott and Somerset Holdings merged in 2000, leading to a total portfolio of 6,000 serviced residences across 10 countries following the merger of DBS Land and Pidemco Land to form CapitaLand Limited. Ascott would later become a wholly owned subsidiary of the CapitaLand Limited on 28 April 2008. Ascott is presently the wholly owned lodging arm of CapitaLand Investment following a strategic restructuring of CapitaLand Limited and listing of CapitaLand Investment on 20 September 2021. ### Growth and expansion (2000–present) In 2003, Ascott acquired a 50% interest for EUR84.2 million (SGD47.5 million) in Citadines, a pan-European serviced residence chain with properties across [France](/wiki/France), the [UK](/wiki/UK), [Belgium](/wiki/Belgium), [Spain](/wiki/Spain) and [Germany](/wiki/Germany), thereby increasing its overall portfolio to 13,500 serviced units in 37 cities across 16 countries. By 2004, Citadines was acquired fully for an additional EUR74.3 million (SGD154.2 million) by Ascott, which by then owned three brands: Ascott The Residence, Citadines and Somerset. In 2014, Ascott entered a strategic partnership with Quest Apartment Hotels (hereinafter referred to as “Quest”), then the largest serviced apartment provider with 112 properties in [Australia](/wiki/Australia), by acquiring 20% stake in the company for AUD28.8 million (SGD32.3 million). In 2017, Ascott increased its stake in Quest to a majority share of 80% for AUD180 million (SGD191 million), propelling it to become the largest serviced residence provider in Australasia, with 11,000 units in 180 properties located across cities in Australia, [New Zealand](/wiki/New_Zealand) and [Fiji](/wiki/Fiji). In 2016, Ascott launched its new co-living brand, Lyf, which develops upscale communal accommodation for young travellers, in order to accommodate [millennials](/wiki/Millennials) who continue to rapidly enter the work force and are becoming the focal point of economic innovation. Lyf develops [co-living](/wiki/Co-living) spaces that provide upscale communal accommodation for young travellers. New signings for Lyf were acquired for properties in [China](/wiki/China), Australia, [Japan](/wiki/Japan), [Malaysia](/wiki/Malaysia), the [Philippines](/wiki/Philippines) and [France](/wiki/France). To date, Lyf has since debuted in [Australia](/wiki/Australia), [China](/wiki/China), [Japan](/wiki/Japan), [Singapore](/wiki/Singapore) and [Thailand](/wiki/Thailand).[*citation needed*] In 2017, Ascott acquired an 80% majority stake for USD33.7m (SGD46.7m) in Synergy Global Housing, a US-based corporate accommodation company that has a strong foothold in the United States, particularly with corporations and high-tech powerhouses based in Silicon Valley. With this acquisition, Ascott tripled its portfolio in the USA to approximately 3,000 units.[*citation needed*] In 2018, Ascott acquired a 70% majority stake for USD25.9 million (SGD35.4 million) in Indonesia's Green Oak Hotel Management (GOHM), the holding company of TAUZIA Hotels (hereinafter referred to as “TAUZIA”), one of Indonesia's top five hotel operators. At the time of acquisition, TAUZIA operated close to 20,000 units in 122 hotels across [Indonesia](/wiki/Indonesia), Malaysia and [Vietnam](/wiki/Vietnam). The acquisition was a strategic move by Ascott to access the rapidly expanding middle-class business hotel segment, with about 70% of TAUZIA's hotels catering to business and convention travellers and the remainder to leisure travellers. In 2022, Ascott acquired serviced apartment brand, Oakwood, from Mapletree Investments. The purchase consideration was not disclosed, and the transaction added some 81 properties and about 15,000 units to Ascott’s global portfolio. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:25.816700",
  "title": "The Ascott Limited",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Ascott_Limited"
}