{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:08:22.984742"
  },
  "content": "Cinema chain in Singapore **The Projector** was an [independent cinema](/wiki/Independent_movie_theater) in [Singapore](/wiki/Singapore). Founded in 2014, it specializes in [arts-house films](/wiki/Art_film) and also screens mainstream movies and is a venue for live events such as [stand-up comedy](/wiki/Stand-up_comedy) shows. The Projector formerly operated at Golden Mile Tower and [Cineleisure Orchard](/wiki/Cineleisure_Orchard). It previously operated out of other locations in Riverside Point and The Cathay. It closed down on 19 August 2025 due to insolvency. ## History The Projector was founded in 2014 by Karen Tan, Sharon Tan and Blaise Trigg-Smith, under their company Pocket Projects. Sharon Tan was the general manager. The venue was originally founded as Golden Theatre in 1973, the biggest cinema at the time in Singapore and [Malaysia](/wiki/Malaysia), with a single hall that sat up to 1,500 people. In 1990s, the venue was split into 3 halls. Eventually in 2014, Golden Theatre retained the largest 1,000-seats hall, while The Projector took over the smaller halls. In 2019, Sharon Tan left the cinema and Prashant Somosundram took over as general manager. During the [COVID-19 pandemic](/wiki/COVID-19_pandemic), they paused operations from 31 May to 13 June 2021 across all theaters, due to tough business conditions caused by new COVID-19 containment measures in Singapore. In July 2020, they launched *Projector Plus*, an online movies on-demand streaming platform. In 2022, after [Mm2 Entertainment](/wiki/Mm2_Entertainment) stopped the operations of the [Cathay Cineplex](/wiki/Cathay_Cineplex) at The Cathay, the Projector leased its location as a [pop-up cinema](/wiki/Pop-up_retail), Projector X: Picturehouse, from 23 August onwards. Picturehouse consisted of four halls, including the former 590-seater Cathay Grand. The pop up cinema remained open until the end of June 2023. In 2023, it was announced that The Projector and [Golden Village](/wiki/Golden_Village) will collaborate to operate a cinema, Golden Village X The Projector, at [Cineleisure Orchard](/wiki/Cineleisure_Orchard), after Cathay Cineplex stopped its cinema operation at the building at the end of June. The new cinema opened in December 2023. In 2025, The Projector hosted the live screening for the [2025 Singaporean general election](/wiki/2025_Singaporean_general_election) on 3 May, the polling day. On 19 August 2025, The Projector announced its closure and went into voluntary liquidation, after accumulating SGD 1.2 million in debts. ## Locations ### Golden Mile Tower The Golden Mile Tower outlet was launched in April 2014. It began with an appeal on crowdfunding site [Indiegogo](/wiki/Indiegogo), which raised US$55,000. It currently has three screens: *Green Room*, a 230-seat hall, *Redrum*, a 200-seat hall, and *Blue Room*, a 100-seat hall. The later was originally a church, before being converted into a cinema hall. In April 2025, The Projector stopped screenings but used the halls for other events while screenings to be offered at [Cathay Cineleisure Orchard](/wiki/Cathay_Cineleisure_Orchard). In August, after the closure of the halls at Cineleisure, screenings were to be returned to Golden Mile Tower. ### Riverside Point The Riverside Point outlet, known as Projector X, was launched on 30 April 2021. It had one screen with 48 seats. The venue, which was formerly a Chinese nightclub, had the former changing rooms turned into art installation by Marc Nair. Before that, it had been used for Studio City Cinemas, in the 1990s. The outlet was a [pop-up cinema](/wiki/Pop-up_retail) and closed towards the end of 2022. ### The Cathay On 23 August 2022, The Projector took over four halls, including the former 590-seater Cathay Grand, of the Cathay Cineplex at The Cathay as a pop-up cinema, Projector X: Picturehouse. It closed at the end of June 2023. ### Cathay Cineleisure Orchard After the closure of [Cathay Cineplex](/wiki/Cathay_Cineplex) at Cineleisure, The Projector operated a pop-up cafe, a bar and a live event space at Cineleisure from July to December 2023. Also, it collaborated with [Golden Village](/wiki/Golden_Village) to launch Golden Village x The Projector at Cineleisure (GVxTP) to take over the cinema space in the mall. The collaboration will feature three Golden Village-branded halls and three The Projector-branded halls. It began operating in December 2023. On 1 August 2025, The Projector announced that it would leave Cineleisure on 4 August with final screenings on 3 August. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:08:22.984476",
  "title": "The Projector",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Projector"
}