{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:24.038770"
  },
  "content": "Historic building in Singapore **The Arts House** (formerly the **Old Parliament House**, **Parliament House** and the **Assembly House**), is a multi-disciplinary arts venue in the [Civic District](/wiki/Civic_District) of [Singapore](/wiki/Singapore). The venue plays host to [art exhibitions](/wiki/Art_exhibition) and concerts. Built in 1827, the Old Parliament House is the oldest government building and perhaps the oldest surviving building in Singapore. The building was home to the [Parliament of Singapore](/wiki/Parliament_of_Singapore) from 1965 to 1999, when it moved to an [adjacent new building](/wiki/Parliament_House,_Singapore). ## History The building occupies one of the most [historic sites](/wiki/Historic_site) of Singapore. During the refurbishment of the building in 1989, [archaeological](/wiki/Archaeology_in_Singapore) evidence of older habitation in the area was uncovered with [stoneware](/wiki/Stoneware) and [earthenware](/wiki/Earthenware) dating back to the 13th and 14th centuries found. The building's river frontage was also where [Sir Stamford Raffles](/wiki/Stamford_Raffles) was presumed to have landed on 29 January 1819. The area was occupied by [Temenggong Abdul Rahman](/wiki/Temenggong_Abdul_Rahman) and his family and followers. Raffles would later persuade the Temenggong to move to [Telok Blangah](/wiki/Telok_Blangah) in 1823 as he [planned](/wiki/Jackson_Plan) for the land to be used for public and administrative purposes. ### Design and construction The building was designed as a [Neo-Palladian](/wiki/Palladian_architecture) mansion by architect [George Drumgoole Coleman](/wiki/George_Drumgoole_Coleman) for a Scottish merchant, John Argyle Maxwell. It was intended to be his private residence, however, Maxwell never occupied the house due in part to a dispute over the ownership of the land on which the house was built. Raffles had originally allocated the land for government use in his [Town Plan](/wiki/Raffles_Town_Plan), however, Raffles' successor [John Crawfurd](/wiki/John_Crawfurd) issued a permit allowing Maxwell to build a house on the site. The construction of the Old Parliament House began in 1826 and it was completed in 1827. Maxwell applied for a statutory grant to the site in 1827, and the Resident Councillor of Singapore, John Prince objected as the land was intended for government use. A compromise was then struck in June 1827, and Maxwell was granted a 999-year lease, but the house would be leased back to the government for a 500 [rupees](/wiki/Indian_rupee) monthly rent. Later, Maxwell's residence went up for [auction](/wiki/Auction), which the colonial government won with a bid of $15,600 Spanish dollars, and the ownership of the courthouse was transferred to Governor [George Bonham](/wiki/George_Bonham) and the East India Company on 10 October 1842. ### Extension and uses The building was initially used as a [court house](/wiki/Court_house), but other government offices including the Land Office also moved into the building. The first court session was held in the central room on the first floor at the front of the building. In 1839, a new single-storey annex was built on an adjacent plot of land, forming what is now the Former Attorney-General's Chambers building later incorporated into the [Parliament House](/wiki/Parliament_House,_Singapore). The Courts then moved into this new building (later on to [Empress Place Building](/wiki/Empress_Place_Building)), and the vacated building was then used as government offices. The government offices were sited at the building until 1875 when the Supreme Court moved back in after the building was renovated. The building went through several major extension works. The first was carried out between 1873 and 1875 by [John Frederick Adolphus McNair](/wiki/John_Frederick_Adolphus_McNair). In 1901, the building was extended towards the [Singapore River](/wiki/Singapore_River). As a result of the extension works, Coleman's original design was lost. In 1909, two [courtrooms](/wiki/Courtroom) were reconstructed and a residence for the [Attorney General](/wiki/Attorney-General_of_Singapore) was built. The building was the Supreme Court House until the Supreme Court moved into a new [Supreme Court](/wiki/Former_Supreme_Court,_Singapore) opened 1939. The building was then used as offices for the Department of Social Welfare as well as a government storehouse. ### As Parliament House After the [Second World War](/wiki/Second_World_War), the building was reconstructed and became known as The Assembly House when [Sir John Nicoll](/wiki/John_Nicoll_(colonial_administrator)), the [Governor of Singapore](/wiki/Governor_of_Singapore), used it to house the new Legistive Assembly in 1953. In 1965, it became home to the Singaporean parliament when Singapore gained independence, and it was therefore renamed the Parliament House. The arches at the [porch](/wiki/Porch) of the building and Palladian windows of the front façade were part of the original design, although the building currently appeared more Neoclassical in style. The building was gazetted a [national monument](/wiki/National_monuments_of_Singapore) on 14 February 1992. ### The Arts House at The Old Parliament Due to space constraints at the Parliament House, a new [Parliament House](/wiki/Parliament_House,_Singapore) that faces [North Bridge Road](/wiki/North_Bridge_Road) was planned next to it in 1989. On 6 September 1999, the Parliament of Singapore moved into the new Parliament building, after which the vacated Parliament House became known as the Old Parliament House. It was then turned into an arts and entertainment venue called The Arts House at The Old Parliament. The Arts House at The Old Parliament opened on 26 March 2004 as an arts and heritage centre. The parliamentary chamber was converted into a 150-seat concert room called as The Chamber where music performances as well as film screenings and art exhibitions could be held. The Arts House was temporarily reinstated as a legislative venue after two decades when it hosted one of the two sessions for the opening of the [14th Parliament of Singapore](/wiki/14th_Parliament_of_Singapore) on 24 August 2020. Alongside the Parliament House, it was used concurrently for the first time in Singapore's history. This arrangement was implemented as a precautionary measure to facilitate [social distancing](/wiki/Social_distancing) in response to the [COVID-19 pandemic](/wiki/COVID-19_pandemic). The Arts House is currently administered by Arts House Group, which also manages [Victoria Theatre and Victoria Concert Hall](/wiki/Victoria_Theatre_and_Concert_Hall), Drama Centre, Goodman Arts Centre, Aliwal Arts Centre, and [Stamford Arts Centre](/wiki/Stamford_Arts_Centre). - [Parliament House](/wiki/Parliament_House,_Singapore) - [List of concert halls](/wiki/List_of_concert_halls) ## Notes - Tan, Sumiko (2000) *The Singapore Parliament: The House We Built* Times Media, Singapore [ISBN](/wiki/ISBN_(identifier)) 981-232-144-6 - Norman Edwards, Peter Keys (1996), *Singapore – A Guide to Buildings, Streets, Places, Times Books International*, [ISBN](/wiki/ISBN_(identifier)) 981-204-781-6 - The Arts House\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:24.038496",
  "title": "The Arts House",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Arts_House"
}