{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:58.882764"
  },
  "content": "Luxury watch brand **The Hour Glass Limited** ([SGX](/wiki/Singapore_Exchange): AGS ) is a Singapore-based specialty luxury watch retail group. The Hour Glass' has multi-brand and standalone boutiques in [Singapore](/wiki/Singapore), [Kuala Lumpur](/wiki/Kuala_Lumpur), [Bangkok](/wiki/Bangkok), [Phuket](/wiki/Phuket_(city)), [Ho Chi Minh](/wiki/Ho_Chi_Minh_City), [Hanoi](/wiki/Hanoi), [Hong Kong](/wiki/Hong_Kong), [Tokyo](/wiki/Tokyo), [Sydney](/wiki/Sydney), [Melbourne](/wiki/Melbourne) and [Brisbane](/wiki/Brisbane). It works as the official retailer for a number of luxury watch brands. The group also deals in luxury properties and owns high-end retail and commercial properties throughout Asia. A notable example was the purchase of two high-end Australian properties for $37.2 million in 2015. The group also owns Watches of [Switzerland](/wiki/Switzerland), a watch retail chain in Singapore that deals in mid-tier to high-end Swiss timepieces. The group acquired the chain in October 2014 from the Jay Gee Melwani Group for $13.3 million. ## History The Hour Glass (“THG”) was founded in 1979 by Dr. Henry Tay and Dato' Dr. [Jannie Tay](/wiki/Jannie_Chan). The first store was opened at Lucky Plaza in partnership with Metro Holdings and was a one-of-its-kind store during its time. Dr. Jannie Tay was the managing director of the company and led it for the first 25 years. The company was eventually bought out by Metro Holdings in 1987. The company ventured into overseas business expansion, and also bought into other businesses, such as perfume, jewellery and also became involved as a luxury watch distributor throughout the region during Dr. Jannie Tay’s tenure (1979–2004) as Executive Vice Chairman of The Hour Glass Limited. In 2005, Michael Tay, the son of Dr. Henry and Dr. Jannie Tay, took over as Executive Director. - The Hour Glass Limited Official Website - The Hour Glass Instagram - The Hour Glass Facebook Page\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:58.882488",
  "title": "The Hour Glass (company)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Hour_Glass_(company)"
}