{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:08:35.076382"
  },
  "content": "Singaporean non-profit arts company**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"The Teng Company\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2023)* *(Learn how and when to remove this message)* **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(November 2023)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **The TENG Company** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 鼟乐团; [traditional Chinese](/wiki/Traditional_Chinese_characters): 鼟樂團) is a [Singaporean](/wiki/Singapore) non-profit arts company. The company comprises music educators, scholars, and instrumentalists and reinterprets music from Singapore's Chinese heritage. Established in 2004, it became a charity in 2015 and an Institution of a Public Character in 2017. ## Etymology The character 鼟, pronounced as 'tēng,' is one of the Chinese language’s most intricate [characters](/wiki/Chinese_characters). It symbolises the sound of a drum in ancient [Chinese culture](/wiki/Chinese_culture) and represents TENG's aim of 'uniting cultures and empowering future generations of musicians and audiences in Singapore and beyond.' ## History After winning individual championship titles at the biennial National Chinese Music Competition that was organised by the [National Arts Council](/wiki/National_Arts_Council_(Singapore)), Samuel Wong and Yang Ji Wei could no longer compete individually in the competition. They then formed The TENG Chinese Chamber Ensemble with other soloists and competed in the Ensemble category in 2004 and came in first. After the win, some members of the ensemble formed The TENG Company to create and develop projects related to Chinese instrumental music. In 2009, The TENG Company formed its performing arm, The TENG Ensemble. In 2015, the company was registered as a charity, and [Temasek Holdings](/wiki/Temasek_Holdings) became its patron. Between 2015 and 2017, it received [National Arts Council](/wiki/National_Arts_Council_(Singapore))'s Seed Grant. The company was mentioned during the 2015 [Singapore National Day Rally](/wiki/Singapore_National_Day_Rally) by Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) for \"creating a uniquely Singaporean sound by injecting new elements into traditional culture\" during the segment on Singapore's bilingual policy. In 2016, The TENG Ensemble was invited by Sino Land to put on a show in Hong Kong and hosted two sold-out concerts at the [Fringe Club](/wiki/Fringe_Club). The TENG Company staged a concert at the [Esplanade Concert Hall](/wiki/Esplanade_%E2%80%93_Theatres_on_the_Bay) titled \"Stories from an Island City\" and released its second album of the same name. With support from Fullerton Heritage, The TENG Ensemble also began the annual \"Where the River Always Flows\" series in partnership with the Singapore Heritage Festival. Their performance for the [Star Awards](/wiki/Star_Awards), which was organised by [Mediacorp](/wiki/Mediacorp) was televised nationally. In 2017, the Chinese Music Instrumental Grading Examinations was also launched by The TENG Company in collaboration with the [Confucius Institute](/wiki/Confucius_Institute) at [Nanyang Technological University](/wiki/Nanyang_Technological_University). In 2018, the TENG Gives Back series was started to contribute to the community through performances in hospices and homes. TENG also launched an outreach-focused \"Once Upon a\" concert series at [VivoCity](/wiki/VivoCity), aiming to bring music to local residents, with the backing of [Mapletree Investments](/wiki/Mapletree_Investments). The TENG Company was honoured with the CHT International Award. The TENG Company became a recipient of the Major Grant Scheme from the [National Arts Council](/wiki/National_Arts_Council,_Singapore). In 2019, the company published *The TENG Guide To The Chinese Orchestra*, a book that covers the various aspects of 13 sets of Chinese musical instruments and how they work. The book also analysed 18 Chinese orchestral pieces to demonstrate how to combine various instruments in an orchestral piece. It was written by Samuel Wong, Wang Chenwei and Chow Jun Yi. The TENG Company showcased its first major fundraising concert titled \"Mind The Music!\" in collaboration with Caregivers Alliance. Lastly, the \"Heirlooms\" concert, the culmination of the Forefathers' Project, was held at the [Esplanade Concert Hall](/wiki/Esplanade_Concert_Hall). In 2020, The TENG Company worked with an Indian musician, [Shabir](/wiki/Shabir_Sulthan), to release the \"Triptych series\" in response to the COVID-19 situation in Singapore. The \"Teng Goes Digital Campaign\" was initiated, and the Teng Ensemble performed their first-ever digital concert with support from Fullerton Heritage. Held as a fundraising digital concert in 2021, The Gift of Music Gala was hosted for The TENG Company's social outreach initiatives. They also launched the TENG Insider digital series, featuring the Executive and Creative Directors hosting various local arts personalities to talk about their insights and industry stories. The TENG Backstage digital series was also introduced, offering educational content. The \"Where the River Always Flows VI\" digital concert was presented in collaboration with Fullerton Hotels and Resorts. The TENG Company released their first Extended Play Release, \"天地人合 (Tian Di Ren He),\" on major digital Streaming platforms. In 2022, The TENG Company presented its first physical performance since the COVID-19 pandemic, \"Once Upon A Time 2022,\" at VivoCity's amphitheatre. In that year, there was an official name change from \"The TENG Ensemble\" to \"The TENG Company\".[*citation needed*] Positive results from TENG x Singapore Institute of Technology's Health and Social Sciences Department research on Binaural Beats were published. The Team TENG fundraising initiative was launched. The TENG Company hosted a fundraising concert, \"More Than Music!\", which highlighted youth empowerment and artistic innovation. In 2024, as part of their 20th anniversary celebration, TENG launched The Singaporean Composers Series 起承转合 featuring 10 commissioned works from 20 local producers and composers. They also launched TENG x SMRT Train Chimes, a series of chimes played at stations across the [Circle Line](/wiki/Circle_Line_(Singapore)), [North-South Line](/wiki/North%E2%80%93South_Line_(Singapore)), and [East-West Line](/wiki/East%E2%80%93West_Line_(Singapore)) to assist the visually-impaired during their commute. The TENG Company kickstarted their TENG Recital Series with 溯•筝 Transcendence, a [Guzheng](/wiki/Guzheng) recital presented by The TENG Company and [Mapletree Investments](/wiki/Mapletree_Investments). ## The TENG Ensemble The TENG Ensemble is a Singaporean Chinese fusion music group that incorporates influences from the East, West, traditional, and contemporary genres. Since 2009, the Ensemble's performances have received acclaim in the Singapore arts scene, among the public, and in various communities. ## Social impact Since 2018, the company has collaborated with nursing homes, hospices, treatment centres, and specialised schools to connect with the elderly, the ill, as well as at-risk youths or those with special needs. ### TENG Gives Back In an interview with *Robb Report Singapore*, founder Samuel Wong stated that the TENG Gives Back initiative involves collaborations with music therapists to deliver musical performances to vulnerable individuals. ### Music For Mindfulness Music For Mindfulness was an initiative developed over two years in collaboration with the Singapore Institute of Technology's Health and Social Sciences Department, the project incorporates TENG's distinctive East-West sound. It utilises Binaural Beats technology and integrates ancient [Chinese philosophies](/wiki/Chinese_philosophy) of music therapy to create a contemporary and easy-listening experience. ### In-School Programs for Targeted Students In-School Programs for Targeted Students involve TENG collaborating with specialised institutions to create Chinese music programs for individuals with special needs and at-risk youths. The programme focuses on building students' self-confidence and self-esteem, fostering cooperative skills and teamwork, and encouraging them to discover and develop their musical potential. ### TENG x COPE TENG's collaboration with COPE, TENG x COPE, attempts to equip young children in Singapore and worldwide with vital survival skills for natural disasters. This initiative involves adapting COPE's book series into animated content with songs. ### Mapletree–TENG Scholarship The [Mapletree](/wiki/Mapletree_Investments)–TENG Scholarship is a comprehensive program designed to cultivate the talents of individuals aged 21 and below who exhibit a passion for Chinese music. Established in 2018, it represents a collaboration between [Mapletree Investments](/wiki/Mapletree_Investments) and The TENG Company. The scholarship encompasses a training regimen involving continuous assessments, individual lessons conducted by professional instructors from TENG, and opportunities for performances. ### The TENG Guide to the Chinese Orchestra The TENG Guide to the Chinese Orchestra is a resource for [composers](/wiki/Composer), [scholars](/wiki/Scholar), and enthusiasts. ### Chinese Instrumental Music Grading Examinations (CIMGE) In collaboration with the [Confucius Institute](/wiki/Confucius_Institute), [Nanyang Technological University](/wiki/Nanyang_Technological_University) (CI-NTU) since 2017, TENG organises the Chinese Instrumental Music Grading Examinations (CIMGE). This initiative aims to establish a platform for benchmarking Chinese music standards. The examination system involves musician-educators from Singapore and across Asia, with a list of 17 instruments catering to candidates receiving musical training from ensembles in local schools and [Chinese orchestras](/wiki/Chinese_orchestra). ### Chinese Orchestras in Schools TENG provides consultancy and training programs for Chinese orchestras in schools. This is led by award-winning musician and orchestra conductor Yang Ji Wei, along with experienced music instructors. ## Discography ### The Teng Ensemble - *Eight* (2013) - *Stories from an Island City* (2016) - *Evolution of Disney Princesses* (Single, 2017) - *The Evolution of Teresa Teng* (Single, 2017) - *Canon in D* (Single, 2018) - *Heirlooms* (Album 2019) - 8 tracks - *The Evolution of Adele: 2007 - 2015* (Single, 2020) - *The Themes from Harry Potter & Fantastic Beasts* (Single, 2020) - *光辉岁月 Live* (Single, 2020) - *Heaven, Earth, Mankind and Unity* (EP, 2021) - *Genshin Impact: Jade Moon Upon a Sea of Clouds Medley* (Single, 2021) - *Merry Christmas, Mr Lawrence* (Single, 2021) - *Birds and Bees* (Single, 2021) - *Ong ah Ong* (Single, 2021) - *Singai Naadu* (Single, 2022) - *The New Legendary Swordsman* (Single, 2023) ## Publications - Wong, Samuel (2005), *器 QI: An Instrumental Guide to the Chinese Orchestra*. Teng. [ISBN](/wiki/ISBN_(identifier)) 981-05-4012-4 - Wang Chenwei; Chow JunYi; Samuel Wong (2020). *The TENG guide to the Chinese orchestra*. Singapore: World Scientific. [ISBN](/wiki/ISBN_(identifier)) 978-981-323-364-5. [OCLC](/wiki/OCLC_(identifier)) 1008972714. - The Teng Company website - Music portal - Singapore portal\n",
  "language": "en",
  "processed_at": "2026-01-12T12:08:35.076057",
  "title": "The Teng Company",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Teng_Company"
}