{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:27.714693"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **reads like a press release or a news article and may be largely based on routine coverage**. Please help improve it by adding independent secondary sources. *(November 2025)* *(Learn how and when to remove this message)*This article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"The Assembly Place\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2025)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **The Assembly Place** (TAP) is a [co-living](/wiki/Co-living) startup based in [Singapore](/wiki/Singapore), founded by local entrepreneur [Eugene Lim](/wiki/Eugene_Lim) 2019. ## History The Assembly Place was founded in 2019 starting with six rooms, and was the first co-living operator in Singapore to cover a full spectrum of accommodation spaces. In 2021, TAP raised S$5.55 million (US$4.1 million) in a seed [funding round](/wiki/Funding_round) led by Eric Low See Ching, Oxley Holdings' executive director and deputy [CEO](/wiki/Chief_executive_officer). TAP's portfolio comprised 60% management contracts and 40% straight leases. Also, in 2021, The Assembly Place was awarded Best Co-Living Space at the Asia Property Awards. In March 2022, TAP acquired Liberto, the operator of Commontown Singapore's co-living spaces. This acquisition included all of Liberto Commontown's assets, [head leases](/wiki/Head_lease), and [sub-leases](/wiki/Sub-lease), totalling approximately 120 rooms across 10 locations. In September 2022, TAP opened a co-living hotel, The Assembly Place at Mayo, refurbishing the former Mayo Inn.[*citation needed*] In November 2022, TAP launched its first co-living hostel, featuring 31 rooms and 180 beds. In October 2023, TAP launched its largest co-living space, Campus by the Assembly Place. This space, targeted at students, includes 426 beds and has over 100,000 square feet, with more than 20 facilities. TAP has signed [memorandums of understanding](/wiki/Memorandum_of_understanding) (MOUs) with 14 educational institutions, including [James Cook University](/wiki/James_Cook_University) and [Singapore University of Technology and Design](/wiki/Singapore_University_of_Technology_and_Design) (SUTD). In August 2023, TAP won a tender from MOH Holdings in a joint venture with TS Group to retrofit buildings into housing for 1,800 foreign healthcare workers across five sites. The Assembly Place (TAP) raised S$5.33 million in a Pre-Series A funding exercise anchored by Apricot Capital, surpassing its initial S$5 million target. TAP has previously collaborated with Apricot Capital on projects such as their joint venture in premium student housing at 116 Lorong J & 119 Lorong K Telok Kurau, known as Campus by The Assembly Place. In February 2024, TAP was selected as the asset manager for Serene Centre in Bukit Timah (District 21), a property acquired by Apricot Capital. The funds raised will fuel TAP’s growth as it seeks to increase its current 1,800 keys to over 5,000 by the end of 2025 and also to support the development of its projects such as the MOH Holdings Pte Ltd lodging facilities for healthcare professionals at 1A Short Street.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:27.714410",
  "title": "The Assembly Place",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Assembly_Place"
}