{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:08:19.799690"
  },
  "content": "Sociopolitical platform in Singapore **The Online Citizen** is a blogging platform based in [Taiwan](/wiki/Taiwan). Founded in December 2006 by Andrew Loh and Remy Choo Zheng Xi in [Singapore](/wiki/Singapore), it is known for its political activism. It describes itself as a group of [advocacy journalists](/wiki/Advocacy_journalism) who report on topics not generally covered by the mainstream media. ## History In 2011, the Singapore Registry of Political Donations gazetted the platform as a political organization, noting that the editors of the website organized online and offline campaigns to change legislation and government policies. Under the Political Donations Act, political entities cannot receive funds from foreign contributors and anonymous contributions above [SGD](/wiki/Singapore_dollar) 5000. In 2014, the website registered for a class license, which was regulated under the Broadcast Act. It meant that it had to \"undertake not to receive foreign funding for its provision, management and, or, operation as part of the registration\". ### 2018-2022: Defamation cases and closure In February 2018, TOC was de-gazetted as a \"political association\", as it was run by only one person – editor Terry Xu, who has been responsible for the development of content since 2011, when its core team of editors left. #### Criminal defamation over allegations against Singapore Cabinet ministers On 4 September 2018, a letter alleging \"corruption at the highest echelons\" in the [Singapore government](/wiki/Government_of_Singapore) was published on TOC. This led to computers belonging to Xu being seized by the police for investigation on 21 November 2018, forcing the site to go into a temporary hiatus. It was found that the author of the letter had sent it to TOC through a friend's email account who did not intend for the account to be used in such a manner. On 21 November 2021, both Xu and the author was found guilty for defamation with the author being guilty for a charge under the Computer Misuse Act. On 21 April 2021, Xu was sentenced three weeks jail and the author three months and three weeks. Xu would be appealing against the sentence. #### 38 Oxley Road On 1 September 2019, Hsien Loong sent a letter, via the Prime Minister Office, to The Online Citizen's (TOC) editor, Terry Xu over an article that was published on TOC, repeating the claims that he had tried to preserve the house against his father's wishes. In the same letter, he wrote that he would be taking legal actions, unless the article is taken down from TOC website and its [Facebook](/wiki/Facebook) page and Xu makes a full apology. However, Xu did not comply fully. On 5 September 2019, Hsien Loong sued Xu for repeating statements made by Lee's siblings, an action which critics questioned the use of Prime Minister Office resources for personal matters. Xu was found guilty in 2021. Hsien Loong was awarded S$210,000 in total damages, which he donated to charity. #### 2021 suspension and closure On 14 September 2021, the [Infocomm Media Development Authority](/wiki/Infocomm_Media_Development_Authority) (IMDA) suspended TOC's broadcasting class license over a dispute over reports on funding sources and would cancel TOC's licence if the information request was not met by 28 September. TOC was also required not to publish any new articles beyond 16 September 2021, 3pm. Xu instead took the site offline on the morning of 16 September 2021. The license was cancelled on 15 October 2021. On 16 December 2021, TOC's judicial review application, challenging the orders by IMDA, was dismissed by the [High Court](/wiki/Singapore_High_Court). #### Reactivation On 16 September 2022, the website was relaunched, with Xu announcing that operations would be shifted to [Taiwan](/wiki/Taiwan) under a new local company, **Gutzy Asia**. Xu also added that this relaunched website would provide daily news coverage in Asia and beyond Singapore. On 6 April 2023, Xu was fined S$18,000 for [contempt of court](/wiki/Contempt_of_court) by reproducing an open letter by an Australian citizen who questioned the equality of Singapore's justice system. On 31 Aug 2024, Gutzy Asia shifted its operations back to The Online Citizen after it was designated a Declared Online Location for multiple POFMA directives. ## Founders and editors - Andrew Loh (Founder and former editor) - Remy Choo Zheng Xi (Founder and former editor) - Kumaran Pillai (former Chief Editor) - [Ravi Philemon](/wiki/Ravi_Philemon) (former Chief Editor) - Terry Xu (Executive Editor) - The Online Citizen homepage\n",
  "language": "en",
  "processed_at": "2026-01-12T12:08:19.799374",
  "title": "The Online Citizen",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Online_Citizen"
}