{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:08:25.694790"
  },
  "content": "Social movement promoting equal rights for people with disabilities in Singapore **The Purple Parade** is a unifying national platform that promotes awareness and celebrates the abilities of persons with disabilities in Singapore, ensuring they are included in the country's growth and have equal access to education, employment, transport and social networks. Events usually take place in a carnival-like format with many booths from different companies, performers from various [disability organisations in Singapore](/wiki/List_of_disability_organisations_in_Singapore), as well as the marching of contingents. The event has been held each year in Singapore from 2013 to 2015 at [Speakers Corner](/wiki/Speakers_Corner) in [Hong Lim Park](/wiki/Hong_Lim_Park), as well as the [Fountain of Wealth](/wiki/Fountain_of_Wealth) in [Suntec City](/wiki/Suntec_City) from 2016 to 2019 on a Saturday in October or November. The 2020 event was held on 31 October, the first virtual event. ## History The Purple Parade was first conceived as an event for the inclusion of people with special needs back in 2013, with 40 organisations and the [Central Singapore Community Development Council](/wiki/Central_Singapore_Community_Development_Council) coming together to commemorate the [International Day of Persons with Disabilities](/wiki/International_Day_of_Persons_with_Disabilities), which falls on 3 December every year. In previous years, various organisations celebrated that in small groups, rendering the approach ineffective and without impact. In order to promote the event, a social media movement led by [Denise Phua](/wiki/Denise_Phua), along with several [parliamentarians](/wiki/List_of_members_of_the_12th_Parliament_of_Singapore) (including [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) and then Acting [Minister for Culture, Community and Youth](/wiki/Ministry_of_Culture,_Community_and_Youth) [Lawrence Wong](/wiki/Lawrence_Wong)) was started to get support for the event. The first event was eventually held on 30 November 2013. The colour purple symbolises royalty, with the square logo representing a call for equality for those with special needs in all areas of society. ## Events Each event takes place on a Saturday. It was held at Speakers' Corner in Hong Lim Park from 2013 to 2015, and at the Fountain of Wealth in Suntec City from 2016 to 2019. In 2020 a virtual event was held; in 2021 a hybrid event. In 2022 a full physical event was held again at Suntec City. ### The Purple Parade 2013 The Purple Parade 2013 was held on 30 November, the first such parade. Despite rainy weather, the event attracted a turnout of 4,000 people and pledges that formed a large square at Hong Lim Park. A carnival was organised as part of the event to showcase talents of those with special needs, as well as several performances that were held too. The success of this event prompted organisers to make the event a yearly affair, with more initiatives to support the community. ### The Purple Parade 2014 The Purple Parade 2014 was held on 15 November in Hong Lim Park, attracting a total of 5,000 participants. There were 85 organisations participating in the event as compared to 38 the previous year, as well as more carnival booths too. A record was set in the Singapore Book of Records for the largest group of people with purple hair, which numbered to 300 eventually. ### The Purple Parade 2015 The Purple Parade 2015 was held on 31 October in Hong Lim Park, attracting a total of 7,000 participants and 106 organisations. Among them include [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) and [Ho Ching](/wiki/Ho_Ching), who came to support the special needs community. One of the main highlights is to don purple spectacles, which eventually came up to 3,000 participants. This symbolises the act of being open to those with special needs. The event also showcased The Purple Symphony's first public event, an inclusive orchestra made up of musicians with and without special needs. Besides the event, a [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) train on the [North South line](/wiki/North_South_MRT_line) was decorated in purple with seven people who have special needs to bring awareness to commuters. ### The Purple Parade 2016 For the first time, The Purple Parade 2016 was held on 5 November at the [Fountain of Wealth](/wiki/Fountain_of_Wealth) in [Suntec City](/wiki/Suntec_City), attracting a turnout of 10,000 participants. Among them include then [Deputy Prime Minister of Singapore](/wiki/Deputy_Prime_Minister_of_Singapore) [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) (who is now Senior Minister). Several people at the event donned purple top hats made up of cardboard. This time round, there was a sign language interpreter on stage to allow those with hearing impairments to follow the event seamlessly. Towards 7pm, 16 landmarks in Singapore were lit up in purple to support the cause, including the [Esplanade](/wiki/Esplanade_%E2%80%93_Theatres_on_the_Bay), [Marina Bay Sands](/wiki/Marina_Bay_Sands), [Clemenceau Bridge](/wiki/Clemenceau_Bridge) and [Khoo Teck Puat Hospital](/wiki/Khoo_Teck_Puat_Hospital), which started from 29 October. ### The Purple Parade 2017 The Purple Parade 2017 was held on 28 October at the Fountain of Wealth in Suntec City, attracting a turnout of 10,000 participants. Among them include [President of Singapore](/wiki/President_of_Singapore) [Halimah Yacob](/wiki/Halimah_Yacob). In addition, 21 buildings and bridges were lit up from 21 October to 4 November in support of the cause. ### The Purple Parade 2018 The Purple Parade 2018 was held on 27 October at the Fountain of Wealth in Suntec City, attracting 10,000 participants and 200 organisations. Among them include [Minister for Trade and Industry](/wiki/Minister_for_Trade_and_Industry_(Singapore)) [Chan Chun Sing](/wiki/Chan_Chun_Sing). In addition, a record 26 buildings and bridges were lighted up in purple from 15 to 28 October, including places outside the city centre. ### The Purple Parade 2019 The Purple Parade 2019 was held on 2 November at the Fountain of Wealth in Suntec City, attracting 10,000 participants and 200 organisations. Among them include [Deputy Prime Minister of Singapore](/wiki/Deputy_Prime_Minister_of_Singapore) [Heng Swee Keat](/wiki/Heng_Swee_Keat). For the first time, dialogues were organised between members of the special needs community and the general public to share their stories. It is hoped that this initiative will promote inclusion. In addition, about 30 buildings and bridges across Singapore were lighted up from 26 October to 10 November. ### The Purple Parade 2020 Due to the [COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore), the Purple Parade was held virtually on 31 October via [Facebook](/wiki/Facebook) with Minister for [Education](/wiki/Ministry_of_Education_(Singapore)) [Lawrence Wong](/wiki/Lawrence_Wong) and Minister for [Social and Family Development](/wiki/Ministry_of_Social_and_Family_Development) [Masagos Zulkifli](/wiki/Masagos_Zulkifli). This is the first digital event with a concert. ### The Purple Parade 2022 The Purple Parade 2022 was held on 27 October at the Fountain of Wealth in Suntec City, attracting 10,000 participants and 200 organisations. Among them include [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong). ### The Purple Parade 2023 The Purple Parade 2023 was held on 4 November at the Fountain of Wealth in Suntec City, attracting 13,000 participants and 200 organisations. Among them include [Deputy Prime Minister](/wiki/Deputy_Prime_Minister_of_Singapore) [Lawrence Wong](/wiki/Lawrence_Wong). ### The Purple Parade 2024 The Purple Parade 2024 was held on 12 October at the Fountain of Wealth in Suntec City, attracting 15,000 participants and 200 organisations. Among them include [Minister for National Development](/wiki/Ministry_of_National_Development_(Singapore)) and [Minister-in-charge of Social Services Integration](/wiki/Ministry_of_Social_and_Family_Development) [Desmond Lee](/wiki/Desmond_Lee_(Singaporean_politician)). During the parade, [Rachel Ong](/wiki/Rachel_Ong) as a Chairperson of Purple Parade Limited and [Member of Parliament](/wiki/14th_Parliament_of_Singapore) of [West Coast GRC](/wiki/West_Coast_Group_Representation_Constituency) speaks about S$4 million grant from Temasek Foundation to benefit people with disabilities aged 18 and above. ### The Purple Parade 2025 The Purple Parade 2025 was held on 25 October at the Fountain of Wealth in Suntec City, attracting over 15,000 participants. Among them Central Singapore District Mayor Denise Phua, Tanjong Pagar MP Rachel Ong, Prime Minister of Singapore Lawrence Wong, and people from over 280 organizations. ## Impact Since the event's inception in 2013, the turnout of participants has become larger over the years with the largest being 10,000 so far. The increased turnout reflects increased awareness and support for the special needs community in Singapore. However, several advocates have called for more on inclusion to be done, whether in social settings, when teaching children about inclusiveness, making workplaces friendly, among other factors. This comes as several incidents surfaced in the past involving those with special needs being ill-treated by members of the public. This could be due to ignorance, prejudice, non-acceptance or just nastiness, according to [Denise Phua](/wiki/Denise_Phua). Others have also called for more dialogues to understand viewpoints from the special needs community and change biases. - [List of disability organisations in Singapore](/wiki/List_of_disability_organisations_in_Singapore) - [List of social service agencies in Singapore](/wiki/List_of_social_service_agencies_in_Singapore) - The Purple Parade\n",
  "language": "en",
  "processed_at": "2026-01-12T12:08:25.694534",
  "title": "The Purple Parade",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Purple_Parade"
}