{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:45.439925"
  },
  "content": "Street food stall in Singapore **The Fishball Story** is a [street food](/wiki/Street_food) stall along Circuit Road in [Macpherson](/wiki/Macpherson,_Singapore), Singapore. The food stall was awarded the Michelin Bib Gourmand in 2016. However, the stall failed to qualify for the 2017 edition of the Michelin Bib Gourmand. ## History The stall was founded in 2013 by Douglas Ng, and was originally located in the Golden Mile Food Centre. While his stall was still located in the centre, he attempted to increase his prices by 50 cents, but reverted his prices back to the original price, as the increase in the price of his food caused a 30% drop in business. The stall later moved to Timbre+ in [one-north](/wiki/One-north), and then to Block 77 along Circuit Road in [Macpherson](/wiki/Macpherson,_Singapore). The stall serves fishball noodles. Douglas Ng was one of several hawkers to use the Open Stoves event in the [Singapore Food Festival](/wiki/Singapore_Food_Festival) to help raise money for Tan Boon Teck, the hawker of the [Armenian Street Char Kway Teow](/wiki/Armenian_Street_Char_Kway_Teow) outlet on Sin Ming Road, who had late-stage colon-cancer. ## Reception The stall was one of 37 stalls in Singapore to be awarded the Michelin Bib Gourmand Award in 2016. However, the stall failed to maintain its place for the 2017 edition of the Michelin Bob Gourmand. The stall was included in *[The Straits Times'](/wiki/The_Straits_Times)* list of the ten greatest fishball stalls in Singapore. This [Singaporean cuisine](/wiki/Singaporean_cuisine)-related article is a stub. You can help Wikipedia by expanding it. - v - t - e This Asia-based restaurant or restaurant chain article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:45.439603",
  "title": "The Fishball Story",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Fishball_Story"
}