{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:34.556643"
  },
  "content": "Independent, boys-only school in SingaporeThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"The Chinese High School\" Singapore – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2021)* *(Learn how and when to remove this message)* **The Chinese High School** ([Chinese](/wiki/Simplified_Chinese_characters): 南洋华侨中学; [pinyin](/wiki/Pinyin): *Nányáng Huáqiáo Zhōngxué*) was an independent school in [Singapore](/wiki/Singapore) offering [secondary education](/wiki/Secondary_education). Founded on 21 March 1919, The Chinese High School was the first high school in [Southeast Asia](/wiki/Southeast_Asia) to cater to different dialect groups among [overseas Chinese](/wiki/Overseas_Chinese) in the region. After Singapore gained independence in 1965, the school came under the purview of the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) and was accorded the [Special Assistance Plan](/wiki/Special_Assistance_Plan) (SAP) status in 1979. It has the unique distinction of having the Independent School status in 1988, a scheme that the ministry perceived had proven successful and was extended to other top schools in Singapore. The Chinese High School remained as one of the best performing schools in Singapore, both in academic achievements and extracurricular activities. The school merged with [Hwa Chong Junior College](/wiki/Hwa_Chong_Junior_College) on 1 January 2005 to form the integrated [Hwa Chong Institution](/wiki/Hwa_Chong_Institution) (HCI). ## History ### Founding As early as May 1913, [Tan Kah Kee](/wiki/Tan_Kah_Kee), a prominent businessman, proposed setting up a secondary school for Chinese boys in Singapore. Tan's proposal was supported by the Tung Teh Reading Club and a dance troupe, claiming to have raised S$20,000 as funds for building the school. On 21 March 1919, the Singapore Nanyang Overseas Chinese Middle School was formally opened at Niven Road with an enrolment of 78 students. Six years later, with an additional funding of S$600,000, the school moved to its new campus at [Bukit Timah Road](/wiki/Bukit_Timah_Road), covering an area of 79 acres (320,000 m2), and officially renamed The Chinese High School. After its founding, the school offered comprehensive secondary level Chinese education. It continued to be funded and supported by Tan Kah Kee until shortly before [World War II](/wiki/World_War_II). The school was temporarily closed in February 1933 when all the teachers resigned. Later in February 1934, the school was reopened with a new principal and staff. In the same year, [Lee Kong Chian](/wiki/Lee_Kong_Chian), son-in-law of Tan Kah Kee, became the chairperson of the school's management board, and he held the post until 1957. During Lee's tenure, the school almost closed several times due to financial difficulties, but managed to survive due to strong financial support from both Tan and Lee. ### Turbulent years During the [Battle of Singapore](/wiki/Battle_of_Singapore), the school's clock tower, for its height and vantage point, served as a headquarters for the [Allied defenders](/wiki/Allies_of_World_War_II) and later for the [Imperial Japanese Army](/wiki/Imperial_Japanese_Army) during the [Japanese occupation of Singapore](/wiki/Japanese_occupation_of_Singapore). The school also served as a temporary [concentration camp](/wiki/Internment#Concentration_camp) to detain people for examination during the [Sook Ching massacre](/wiki/Sook_Ching_massacre).[*citation needed*] After the war, the school resumed its predominant Chinese education. In the 1950s and 1960s, during periods of civil unrest in Singapore, many students, teachers and alumni participated in or led the [anti-colonial riots](/wiki/History_of_Singapore#Post-war_period_(1945–1955)). A number of students were arrested by police during the riots, and some were expelled by the school. On 13 May 1953, TCHS students made an impromptu march to the Singapore city centre in protest over arrests of their fellow schoolmates. They subsequently barricaded themselves at the TCHS campus, and were soon caught in violent confrontations with the police. The situation was finally defused after the Chairman of the Board of Directors, [Lee Kong Chian](/wiki/Lee_Kong_Chian), flew back from [London](/wiki/London) and mediated a resolution between student leaders and the police. In 1961, another major demonstration occurred when Secondary Four students refused to sit for government examinations, when it was announced Singapore would switch to the \"four-two\" system, where the national examination was moved to be after the completion of four years of secondary education. Singapore schools including TCHS had previously utilised the \"three-three\" system. In 1967, a group of students attacked then-Vice Principal Teh Kim Fatt on the campus, prompting then-Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) to visit him in the hospital. Teh would later become Principal, but resigned in February 1972 over discourse with the student population.[*citation needed*] The national trend in Singapore was that schools began pursuing English as the medium of education. As workplaces switched to English as working language, a Chinese education became greatly devalued. In fact, it was reported that job applicants preferred to show their 'O' Level certificates, rather than present a university degree from Chinese-medium universities such as [Nanyang University](/wiki/Nanyang_University). This contributed to a slide in TCHS' fortunes, and it was reported the school, like many other Chinese-medium schools, had been on the brink of closure.[*citation needed*] According to Tooh Fee San, then a sitting board member on the [Ministry of Education](/wiki/Ministry_of_Education)'s sports board, \"nobody bothered to listen...to the reports from Hwa Zhong\". On 12 December 1978, Tooh became TCHS' new Principal, and he would be in charge for the introduction of the [Special Assistance Plan](/wiki/Special_Assistance_Plan). ### Transformation Upon the appointment of Tooh as Principal in 1978, The Chinese High School became one of the first nine schools to be part of the [Special Assistance Plan](/wiki/Special_Assistance_Plan). The [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) conceived the SAP as a means of providing assistance to struggling Chinese-medium schools. Under the SAP, key subjects such as mathematics and science were to be taught in English, in line with the rest of the nation, while some other subjects such as music and art could still be taught in Chinese.[*citation needed*] Tooh also turned his focus on raising school morale, and chose the poem \"Whole River Red\" (满江红), written by the famed general [Yue Fei](/wiki/Yue_Fei), to be sung by the school population. During Tooh's tenure, TCHS emerged as the dominant force in the school track-and-field scene. In most years, TCHS was able to sweep both the 'B' and 'C' divisions of the track-and-field competition, and was often the only school to send all its students to the National Stadium to support school athletes.[*citation needed*] In 1987, the school was granted the status of an independent school by the [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) and proceeded to implement changes to its curriculum that were unprecedented in other Singapore schools. The changes include the abolition of mid-year examinations in favour of camping trips for the school, as well as the introduction of numerous enrichment programmes in place of lessons.[*citation needed*] In the early 1990s, the school underwent an extensive renovation, which saw the construction of a new hall, named after the school's founder, a gymnasium, a renovated clock tower block and new classrooms. A Drama Centre was also constructed, catering to the school's performing arts groups.[*citation needed*] In the late 1990s, the school embarked on a consortium scheme to improve the quality of education for students. It started with the establishment of the Quest and Aphelion consortiums, followed by ProEd and Radix.[*citation needed*] In 2000, the iSpark consortium was set up for students in the [Gifted Education Programme](/wiki/Gifted_education) (GEP). In 2002, Quest and Radix merged to form the Ortus consortium.[*citation needed*] On 19th March 1999, the school's clock tower was gazetted as a [national monument](/wiki/National_Monuments_of_Singapore) to mark the significance of the institution as the first Chinese medium school to be built in Southeast Asia to cater to the education of overseas Chinese.[*citation needed*] Two days later, on 21st March, the school held a large dinner in front of the Clock Tower in celebration of TCHS' 80th anniversary of founding.[*citation needed*] At the dinner, which was attended by alumnus and then-[President](/wiki/President_of_Singapore) [Ong Teng Cheong](/wiki/Ong_Teng_Cheong), a statue of school founder [Tan Kah Kee](/wiki/Tan_Kah_Kee) was erected. The same year, Tooh retired as the longest-serving Principal in TCHS history, having been Principal for 21 years. He was succeeded by Koh Yong Chiah, who was then succeeded by Hon Chiew Weng in 2002. ### Merger On 1 January 2005, The Chinese High School merged with [Hwa Chong Junior College](/wiki/Hwa_Chong_Junior_College) to form [Hwa Chong Institution](/wiki/Hwa_Chong_Institution). The new institution retains the Chinese name and the logo of The Chinese High School. Along with the merger, a six-year [Integrated Programme](/wiki/Integrated_Programme) is introduced in collaboration with [Nanyang Girls' High School](/wiki/Nanyang_Girls%27_High_School). The new scheme, which integrates four years of high school education and two years of pre-university education, allows students to skip the [Singapore-Cambridge GCE Ordinary Level](/wiki/Singapore-Cambridge_GCE_Ordinary_Level) examination (typically taken by students in secondary four) and proceed to take the [Singapore-Cambridge GCE Advanced Level](/wiki/Singapore-Cambridge_GCE_Advanced_Level) examination at the end of the programme. ### List of Principals English nameChinese nameTermDoo Kai Yu涂開輿1919-？Lam Iu Cheung林耀翔1934-1936Sy Eng Su薛永黍1937-1948Cheng An Lun鄭安侖1948-1968Tay Kim Fatt鄭金發1968-1972Wang Cho Ju (Interim)王卓如1972-1974Kong Look Sen江禄森1974-1976Phua Beng Tee潘明智1976-1978Wu Tsung Kan (Acting)吴从干1978Tooh Fee San杜辉生1978-1999Steven Koh Yong Chiah许永正1999-2002Hon Chiew Weng潘兆荣2002-2004 ## Achievements Each year, the school attracted the best performing 3% of the [Primary School Leaving Examination](/wiki/Primary_School_Leaving_Examination) (PSLE) cohort. The school was also the first one in Singapore to initiate the [Integrated Programme](/wiki/Integrated_Programme). It is the current high-school section in [Hwa Chong Institution](/wiki/Hwa_Chong_Institution). The college section of the institution is the former [Hwa Chong Junior College](/wiki/Hwa_Chong_Junior_College), a co-educational sister school. Other educational institutions that stand on the school's grounds include the former Hwa Chong Junior College and the [Singapore Institute of Management](/wiki/Singapore_Institute_of_Management). - [Hwa Chong Institution](/wiki/Hwa_Chong_Institution) - [Hwa Chong Junior College](/wiki/Hwa_Chong_Junior_College) - [List of Hwa Chong Institution people](/wiki/List_of_Hwa_Chong_Institution_people) - Alumni Website Archived 24 October 2016 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:34.556374",
  "title": "The Chinese High School (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Chinese_High_School_(Singapore)"
}