{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:08:03.104664"
  },
  "content": "International interdisciplinary scholarly organization **The International Academic Forum** (**IAFOR**) is an [NGO](/wiki/NGO) research organization based in Japan. In 2017, IAFOR established a research centre at the Osaka School of International Public Policy (OSIPP), a graduate school of [Osaka University](/wiki/Osaka_University), Japan. IAFOR holds interdisciplinary academic events in partnership with universities and academic societies in different countries around the world. It also holds more policy-oriented events in collaboration with governments, international organisations, foundations and NGOs, and provides [Open Access](/wiki/Open_Access) publications, audiovisual media repositories and an online research archive. It is the publisher of the [Scopus](/wiki/Scopus) indexed journals, the *IAFOR Journal of Education* and the *IAFOR Journal of Literature & Librarianship*. Since the holding of its first conference in October 2009, The Asian Conference on Education (ACE2009), under the theme of \"Global Problems, Local Solutions\", IAFOR has held more than 200 events on three continents. ## Organisation Dr Joseph Haldane is the founder and current chairman and CEO of IAFOR. Since 2023 Professor Jun Arima of the [University of Tokyo](/wiki/University_of_Tokyo) has been the president of IAFOR and chairman of the international academic board. He succeeded Dr Toshiya Hoshino, former Japanese ambassador and deputy permanent representative of Japan to the United Nations. [Professor Stuart D. B. Picken](/wiki/Stuart_D._B._Picken) (1942-2016) served as the first chairman of IAFOR from 2009 until 2016. His successor from 2016-2022 was Professor Steve Cornwell. ### Structure IAFOR comprises three entities: - The IAFOR General Incorporated Association (Japan) - The IAFOR Research Foundation (California) - The IAFOR Research Centre at [Osaka University](/wiki/Osaka_University) ## IAFOR Research Centre The IAFOR Research Centre (IRC) was set up in 2017 at the Osaka School of International Public Policy (OSIPP), at Japan's Osaka University, to facilitate international and interdisciplinary research projects with the involvement of graduate students. The main focus is to nurture and capacity build students and young researchers for careers in think tanks, international organisations and policy-oriented research institutes by encouraging them to take part in international conferences, write proposals for and be part of international research projects. The IAFOR Research Centre is co-directed by Professor Toshiya Hoshino, former Ambassador and Deputy Permanent Representative of Japan to the United Nations, Professor Haruko Satoh, Professor Virgil Hawkins, and Dr Joseph Haldane. Current research projects include those on the IAFOR Silk Road Initiative, the Innovation and Value Initiative, and the “Korea and Japan in the evolving US-China relations” project sponsored by the [Korea Foundation](/wiki/Korea_Foundation). ## IAFOR Research Archive The IAFOR Research Archive is an online Open Access repository containing research presented at IAFOR's conferences. ## Conferences and Events IAFOR holds interdisciplinary academic events over three continents in partnership with universities and academic societies, as well as other more public policy oriented events in collaboration with organisations in both the private and public sector. ### University and Academic Society Collaborations Since 2009, over 30,000 academics have attended an IAFOR conference. As of 2022, IAFOR has hosted conferences in Tokyo, Osaka, Kobe and Kyoto (Japan), London and Brighton (UK), Barcelona (Spain), Paris (France), Porto (Portugal), New York, Virginia, Rhode Island and Hawaii (USA), Hong Kong (Hong Kong SAR), Singapore, and Dubai (UAE). Recent university and academic society collaborations include the “U.S.–Japan–Southeast Asia Partnership in a Dynamic Asia Fellowship” with the [East-West Center](/wiki/East-West_Center) and Osaka University; the “Design for Ageing: East meets West” research project with [The Bartlett](/wiki/The_Bartlett) at [University College London](/wiki/University_College_London); and the 23rd Congress of the [International Association for Cross-Cultural Psychology](/wiki/International_Association_for_Cross-Cultural_Psychology) (IACCP) in Nagoya, Japan, in partnership with [Nagoya University](/wiki/Nagoya_University); and The Asia-Pacific Conference on Security & International Relations 2016 (APSec), \"Fearful Futures: Peace and Security in Asia\" in partnership with the Asian Political and International Studies Association (APISA), and at Osaka University. The APSec2016 Keynote Speaker was Ambassador Yukio Satoh, President of the [Japan Institute of International Affairs](/wiki/Japan_Institute_of_International_Affairs) (JIIA). Since 2018, [Lingnan University](/wiki/Lingnan_University), the Asia Pacific Higher Education Research Partnership (APHERP) and IAFOR have co-hosted The IAFOR Conference for Higher Education Research (CHER) at Lingnan University in Hong Kong, which, from 2019, has been held alongside The Asian Conference on the Liberal Arts (ACLA). In 2020, IAFOR co-hosted the [Association for Asian Studies](/wiki/Association_for_Asian_Studies) annual conference, AAS-in-ASIA 2020 in Kobe, Japan, in partnership with [Kyoto University](/wiki/Kyoto_University), [Osaka University](/wiki/Osaka_University) and [Kobe University](/wiki/Kobe_University). ### Public and Private Sector Collaborations In addition to its international academic conferences, IAFOR has collaborated on a number of projects in both the public and private sector. Recent public sector collaborations include the 2021 IAFOR Symposium on Preventing and Overcoming Infectious Disease Outbreaks on Cruise Ships: International Challenges & Responses (2021), the 2019 Kansai Resilience Forum, The 2018 IAFOR Global Innovation & Value Summit (GIVS) and the 2018 Third Annual Multi-stakeholder Forum on Science, Technology and Innovation for the [Sustainable Development Goals](/wiki/Sustainable_Development_Goals) (STI Forum) at the [United Nations Headquarters](/wiki/United_Nations_Headquarters) in New York. #### Kansai Resilience Forum Held at the [Hyogo Prefectural Museum of Art](/wiki/Hyogo_Prefectural_Museum_of_Art) in Kobe, Japan in February 2019, the Kansai Resilience Forum was organised by IAFOR in collaboration with the [Government of Japan](/wiki/Government_of_Japan), Osaka University, and Kobe University, with *[The Wall Street Journal](/wiki/The_Wall_Street_Journal)* as the official Media Partner. The Keynote Speaker at the event was [Pritzker Prize](/wiki/Pritzker_Prize) winning architect, [Tadao Ando](/wiki/Tadao_Ando). Other speakers included [Richard Lloyd Parry](/wiki/Richard_Lloyd_Parry), Asia Editor of *[The Times](/wiki/The_Times)*, and Yuki Matsuoka, Head of the United Nations International Strategy for Disaster Risk Reduction ([UNISDR](/wiki/UNISDR)) Office in Japan. The Forum received coverage in both the domestic and international press. #### United Nations STI Forum In 2018, IAFOR collaborated with the [United Nations](/wiki/United_Nations) in the hosting of a special session at the Third Annual Multi-stakeholder Forum on Science, Technology and Innovation for the Sustainable Development Goals (STI Forum 2018) at the United Nations Headquarters in New York. The Official Meeting was co-moderated by IAFOR Chairman and CEO, Dr Joseph Haldane, and the chair of the meeting was Japanese Ambassador to the United Nations, Dr Toshiya Hoshino. ## Publications ### Journals IAFOR publishes a number of [peer-reviewed](/wiki/Peer_review) academic journals, all of which are Open Access and available online. Authors are not required to pay submission or publication charges of any kind. DOIs are assigned to each published journal issue and article via [Crossref](/wiki/Crossref). Both the *IAFOR Journal of Education* and the *IAFOR Journal of Literature & Librarianship* are indexed in [Scopus](/wiki/Scopus). ### Conference Proceedings IAFOR Conference Proceedings are published in the IAFOR Research Archive, an online Open Access repository containing research presented at IAFOR's conferences. ### THINK *THINK*, The Academic Platform, is IAFOR's interdisciplinary online magazine. *THINK* publishes articles from notable authors and academics covering a wide range of themes designed to appeal to and provide a platform for the global academic community. ### Other media IAFOR has a video archive that contains recordings of keynote presentations and interviews filmed at IAFOR conferences. It has also produced video projects for several NGOs, including the HOPE International Development Agency, and the Pamulaan Center for Indigenous Peoples Education in the Philippines. “The Greatest Gift” (2016) is a documentary filmed on location in the Philippines, and made as part of a fundraising effort to create scholarships for the Pamulaan Center. The documentary concentrates on the ambitions and challenges of the [Indigenous Peoples](/wiki/Indigenous_peoples_of_the_Philippines) (IP) of the Philippines, and their struggle to achieve equity in education. ## Awards IAFOR runs three arts awards, each aiming to promote and nurture activity in their respective media. ### IAFOR Documentary Photography Award Launched in 2015, the IAFOR Documentary Photography Award is an international photography contest that seeks to support the professional development of emerging documentary photographers and photojournalists through mentorship, equipment and monetary rewards for winners. The Award is judged by a panel of leading professionals in the fields of documentary photography and photojournalism, including its Founding Judge, [Paul Lowe](/wiki/Paul_Lowe_(photographer)). Guest judges have included [Ed Kashi](/wiki/Ed_Kashi), [Simon Roberts](/wiki/Simon_Roberts_(photographer)), [Simon Norfolk](/wiki/Simon_Norfolk), Emma Bowkett, Monica Allende, Jocelyn Bain Hogg, Maria Teresa Salvati, Ziyah Gafić, [Poulomi Basu](/wiki/Poulomi_Basu) and [Jenny Matthews](/wiki/Jenny_Matthews_(photographer)). The Creative Director of the Award is Thaddeus Pope. The IAFOR Documentary Photography Award has been supported by [World Press Photo](/wiki/World_Press_Photo), *[British Journal of Photography](/wiki/British_Journal_of_Photography)*, Metro Imaging, [MediaStorm](/wiki/MediaStorm), Think Tank Photo, [London College of Communication](/wiki/London_College_of_Communication) ([University of the Arts London](/wiki/University_of_the_Arts_London)), [RMIT University](/wiki/RMIT_University), The Centre for Documentary Practice, and the [Medill School of Journalism](/wiki/Medill_School_of_Journalism). ### IAFOR Documentary Film Award Currently on hiatus, the IAFOR Documentary Film Award (IDFA) is an open competition that seeks to inspire activity in the medium and reward both professional and emerging documentary filmmakers. The Founding Judge of the IAFOR Documentary Film Award is award-winning documentary producer, Professor Gary E. Swanson. The 2015 IDFA Honorary Award was won by \"[Saving Mes Aynak](/wiki/Saving_Mes_Aynak)\" directed by [Brent E. Huffman](/wiki/Brent_E._Huffman). ### IAFOR Vladimir Devidé Haiku Award Co-founded in 2010 by [Dr Drago Štambuk](/wiki/Drago_%C5%A0tambuk), then Croatian Ambassador to Japan, the IAFOR Vladimir Devidé Haiku Award is an open competition for [haiku](/wiki/Haiku) written in the English language. Supported by the Haiku International Association and the World Haiku Association, the award aims to grow the international exposure, activity and appeal of the poetry form beyond its roots in Japan. ## Partners IAFOR is associated with and supported by a number of prominent universities and institutions, which help to shape, promote and develop IAFOR's events. Current partners include: ### Asia - [Kobe University](/wiki/Kobe_University), Japan - [Korea TESOL](/wiki/Korea_TESOL), South Korea - [National University of Tainan](/wiki/National_University_of_Tainan), Taiwan - Research Consortium for the Sustainable Promotion of International Education (RECSIE), Japan - [Singapore Management University](/wiki/Singapore_Management_University) (SMU), Singapore - [Sunway University](/wiki/Sunway_University), Malaysia - [Tarumanagara University](/wiki/Tarumanagara_University), Indonesia - [The University of Hong Kong](/wiki/The_University_of_Hong_Kong) (School of Humanities), Hong Kong - [University of Indonesia](/wiki/University_of_Indonesia), Indonesia - [Waseda University](/wiki/Waseda_University), Japan - [Zhengzhou University](/wiki/Zhengzhou_University), China ### Australasia - [Charles Darwin University](/wiki/Charles_Darwin_University), Australia - The Cultural Studies Association of Australasia (CSAA), Australia ### Europe - [Birkbeck, University of London](/wiki/Birkbeck,_University_of_London), UK - Centre Norbert Elias, France - Future Talent Council - [Lomonosov Moscow State University](/wiki/Lomonosov_Moscow_State_University), Russia - The National Association of Applied Linguistics, Russia - The National Association of Teachers of English, Russia - [University of Barcelona](/wiki/University_of_Barcelona), Spain - [University of Belgrade](/wiki/University_of_Belgrade), Serbia - [University of Lincoln](/wiki/University_of_Lincoln), UK - [University of Sussex](/wiki/University_of_Sussex), UK - [University of Zagreb](/wiki/University_of_Zagreb), Croatia - URBAN-INCERC, Romania ### Americas - [Alfred University](/wiki/Alfred_University), USA - [Auburn University](/wiki/Auburn_University), USA - [Lehigh University](/wiki/Lehigh_University), USA - [Michigan State University](/wiki/Michigan_State_University), USA - [Northwestern University](/wiki/Northwestern_University), USA - [University of Hawai'i at Mānoa](/wiki/University_of_Hawaii_at_Manoa), USA - [University of Redlands](/wiki/University_of_Redlands), USA - [Virginia Tech](/wiki/Virginia_Tech), USA ### Event Partners - [National Archive of Computerized Data on Aging](/wiki/National_Archive_of_Computerized_Data_on_Aging), USA - [University College London](/wiki/University_College_London), UK - [University of Tokyo](/wiki/University_of_Tokyo), Japan - Official Website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:08:03.104371",
  "title": "The International Academic Forum",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_International_Academic_Forum"
}