{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:48.932580"
  },
  "content": "Commercial in Singapore, Singapore **The Fullerton Waterboat House**, originally known as the **Water House**, is a historic [water supply](/wiki/Water_supply) house formerly used to supply fresh water to incoming ships in Singapore. The former Water House was gazetted for conservation in 2002 and has since reopened as a restaurant. ## History [Singapore was established](/wiki/Founding_years_of_modern_Singapore) as a trading port in February 1819, [Francis James Bernard](/wiki/Francis_James_Bernard), the son-in-law to Major [William Farquhar](/wiki/William_Farquhar), was appointed as the first Master Attendant with an office at the mouth of the [Singapore River](/wiki/Singapore_River) to control shipping. In April 1820, Captain William Lawrence Flint, the brother-in-law to Sir [Stamford Raffles](/wiki/Stamford_Raffles), was appointed as the second Master Attendant. In 1852, the harbour was moved to [New Harbour](/wiki/New_Harbour,_Singapore) (later Keppel Harbour in 1900) and the office had since been demolished. In 1919, a three-storey Water House was completed on the former site of the Master Attendant's office, the building was an [Art Deco](/wiki/Art_Deco) building designed by [Swan & Maclaren](/wiki/Swan_%26_Maclaren). The Water House also included a basement which was visible from the sea. It was built to supply fresh water to incoming ships in Singapore. The Water House was later taken over in 1960 by the [Port of Singapore Authority](/wiki/Port_of_Singapore_Authority). It continued to supply fresh water to incoming vessels until 1990. ## Restoration The Waterboat House was gazetted on 21 March 2002 for conservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) and opened for tender, which was won by [Sino Group](/wiki/Sino_Group). After which the renovation of the former Water House building would start soon afterwards. Following the renovation in 2003, the Waterboat House, presently known as *The Fullerton Waterboat House*, was later used as a commercial building for restaurants. A souvenir shop was opened on its newly installed glass annexe of the building's basement (1st floor) of the building. Later in September 2003, The French restaurant *Le Saint Julien* by Chef Sir Julien Bompard was opened on the ground (2nd) floor. In 2005, the Waterboat House was awarded the Architectural Heritage Award by the Urban Redevelopment Authority for the restoration works done by MINKTan Architects, which included recovery of the original grey Shanghai Plaster finish and the addition of a new glass annexe. In January 2010, the European restaurant simply named the *Boathouse* with the extension of a rooftop bar *Prelude* were opened on the third floor and rooftop of the building respectively. On 25 January 2013, the *Le Saint Julien* restaurant was closed and since moved to a new premise known as Scotts 27 from September 2013 onwards. The American coffee company [Starbucks](/wiki/Starbucks) soon took over the space of the former French restaurant on the ground floor of the building and opened its 100th Singapore store on 14 February 2014, which hired six clients from the [Autism Resource Centre](/wiki/Autism_Resource_Centre_(Singapore)). In 2015, the Boathouse restaurant and the Prelude rooftop bar were taken over by the new management team and re-branded as *1919 Waterboat House* of the building's same namesake and its built year and the rooftop bar so named as *The Rooftop* respectively, had officially re-opened on 19 November 2015. Later in August 2018, Galeno, the Food & Beverage company of the restaurant and rooftop sought a High Court order to compel the landlord to extend its lease and bar's license for two more years. On 2 February 2020, the Starbucks restaurant was closed due to its end of lease, and clarified that the closure was unrelated to the [COVID-19 pandemic](/wiki/COVID-19_pandemic). The souvenir shop at glass annexe was also closed and vacated. By end August 2020, the *1919 Waterboat House* and *The Rooftop* had closed down upon its extended two years expiry lease. On 28 April 2021 the Spanish restaurant *Basque Kitchen by Aitor* formerly located at the [Amoy Street](/wiki/Amoy_Street,_Singapore), was re-opened on the space of the former Starbucks restaurant. In August 2021, a European restaurant chain *Picotin* opened its fourth restaurant and bar on the spaces of the former *1919 Waterboat House* restaurant and *Prelude* bar. ## Gallery - [Waterboat House Garden](/wiki/Waterboat_House_Garden) - [The Fullerton Hotel Singapore](/wiki/The_Fullerton_Hotel_Singapore) - [The Clifford Pier](/wiki/The_Clifford_Pier)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:48.932265",
  "title": "The Fullerton Waterboat House",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Fullerton_Waterboat_House"
}