{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:29.701758"
  },
  "content": "Financial newspaperThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"The Business Times\" Singapore – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2022)* *(Learn how and when to remove this message)* ***The Business Times*** is a Singaporean financial [newspaper](/wiki/Newspaper) under [SPH Media](/wiki/SPH_Media), a media organisation with businesses in print, digital, radio, and [outdoor media](/wiki/Outdoor_media) in [Singapore](/wiki/Singapore). The paper is published Monday to Saturday, with the Saturday edition called *The Business Times Weekend*. It had a circulation (print and digital) of 39,500.[*citation needed*] ## Ownership It is part of the [SPH Media](/wiki/SPH_Media) group which also publishes *[The Straits Times](/wiki/The_Straits_Times)*, *[Berita Harian](/wiki/Berita_Harian_(Singapore))* and *[The New Paper](/wiki/The_New_Paper)*. ## History It is an [English-language](/wiki/English-language) newspaper published since 1 October 1976. Prior to this, it was a supplement in *The Straits Times*. The paper was launched on 15 July 1976, and the special presentation issue prior to the launch of the paper featured George Magnus. The staff was first headed by Tsai Tan, who became the first female editor of a daily newspaper in Singapore. In 1989, the newspaper won the Media Philanthropic Appeals category of the International Advertising Festival in [New York](/wiki/New_York_City). ## Community programmes ### *The Business Times* Budding Artists Fund *The Business Times* Budding Artists Fund was initiated in 2004 and adopted by *The Business Times* in 2005, with the aim to level the playing field and reach out to children and youths from financially disadvantaged backgrounds, ages six to 19. The Fund provides opportunities and access to the arts, it seeks to enable beneficiaries to learn, discover and nurture their talents so that they may grow in confidence and become resilient in overcoming their personal circumstances. *The Business Times* co-organises ChildAid, an annual youth charity concert with The Straits Times to raise funds for needy children from *The Straits Times* School Pocket Money Fund and *The Business Times* Budding Artists Fund. ### Business Awards *The Business Times* organises the following business awards events on a yearly basis: - The Singapore Business Awards - The Singapore Corporate Awards - The Enterprise 50 (E50) Awards - The Emerging Enterprise Award - Business Times of Singapore This article related to newspapers in Singapore is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:29.701377",
  "title": "The Business Times (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Business_Times_(Singapore)"
}