{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:08:01.014099"
  },
  "content": "History museum in Joo Chiat Terrace, Singapore **The Intan** is a museum based in Singapore's [Katong](/wiki/Katong) neighborhood, which specialises in [Peranakan](/wiki/Peranakan_Chinese) culture and heritage artefacts. The museum is owned by Alvin Yapp, who opened up his collection of artefacts to the public in 2010. The collection consists of more than a thousand different [historical artefacts](/wiki/Artifact_(archaeology)) and objects, all of which showcase Peranakan culture & heritage in different ways. After its' opening, the museum has since received awards and accolades, including winning Best Overall Experience at the 2011 Museum Roundtable Awards; along with Best Tour Experience at the 2016 Singapore Tourism Awards. ## History The owner of the museum, Alvin Yapp, started to have an interest in collecting various Peranakan-related historical artefacts and objects in around the 1980s, when he was eighteen years old. Over time, his collection started to build up into a vast one, to the point where his collection had turned into a personal- and community-focused viewpoint into Perankan culture. In 2003, Alvin started to move himself into a new home into Singapore's [Joo Chiat](/wiki/Joo_Chiat_Road) neighborhood, along with his vast collection of artefacts. Shortly after the moving-in in 2003, the owner founded the organization The Intan; and in 2010, the owner proceeded to open his private collection of artefacts to the public, turning his home into a museum. Ever since the museum's opening in 2010, it has received a number of international awards and accolades, including winning Best Overall Experience at the 2011 Museum Roundtable Awards; and winning Best Tour Experience at the 2016 Singapore Tourism Awards. Furthermore, the museum has also managed to be featured in a variety of popular media, including appearing on [Singapore Airlines](/wiki/Singapore_Airlines)' new [in-flight safety video](/wiki/Pre-flight_safety_demonstration), which was unveiled on 8 August 2017. The museum has also managed to collaborate with [Starbucks](/wiki/Starbucks) to produce a custom collection of [merchandise](/wiki/Merchandise), all of which feature designs that depict the iconic symbols of Peranakan culture; along with appearing on the [jumbotrons](/wiki/Jumbotron) of [Suntec Singapore Convention & Exhibition Centre](/wiki/Suntec_Singapore_Convention_and_Exhibition_Centre). During the [COVID-19 pandemic](/wiki/COVID-19_pandemic), the museum partnered with the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) to arrange and conduct online virtual tours and visits of the museum, which managed to attract a significant number of online international visitors to the museum, including visitors from the United States and Europe. Furthermore, through the museum's partnership with the tourism board, the owner has also had the opportunity to bring the museum to international audiences, which included [exhibitions](/wiki/Exhibition) and cooking demonstrations related to Peranakan culture and cuisine. ## Collection Over five thousand unique historical objects and items depicting Peranakan culture are hosted at the museum, all of which were collected and stored at the owners' private (and later public) collection of Peranakan historical artefacts, dating from over forty years ago. Some of the cultural artefacts that make up the museum's collection come from far-away countries, such as India, China, or even the UK; whereas others come from nearby regions and countries, such as Singapore, [Malacca](/wiki/Malacca), and [Penang](/wiki/Penang). All of the items that make up the museum's collection of Peranakan cultural artefacts were either bought from private sellers; or were personally donated to the museum, with some of the artefacts on display being personal or family [heirlooms](/wiki/Heirloom). Some of the most notable artefacts that are currently being stored at the museum include an exquisite and traditional porcelain piece that was sold by an [Indonesian-Chinese](/wiki/Chinese_Indonesians) woman just before her untimely death; a series of family portraits that was donated by an elderly man to the museum to safeguard, due to the man lacking a family to hand it down to; along with a porcelain storage jar (or *kamcheng*, which was used by the Peranakans to store water, desserts, or soup), which was bought from a wealthy Indonesian collector after several years of persuasion. Furthermore, some of the pieces that make up the museum's collection of artefacts were also made by the owner's relatives as well, including an eighty-year-old pair of [beaded slippers](/wiki/Peranakan_beaded_slippers) (or *kasut manek*) made by the owner's maternal grandmother.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:08:01.013837",
  "title": "The Intan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Intan"
}