{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:07:39.137779"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **may need to be rewritten** to comply with Wikipedia's quality standards. Relevant discussion may be found on the talk page. You can help. The talk page may contain suggestions. *(August 2019)*This article **may be in need of reorganization to comply with Wikipedia's layout guidelines**. Please help by editing the article to make improvements to the overall structure. *(August 2019)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **The Cocoa Trees** is a retail [chain store](/wiki/Chain_store) of chocolate and [confectionery](/wiki/Confectionery) [brands](/wiki/Brand) based in [Asia](/wiki/Asia). It is a brand of Focus Network Agencies (FNA) [Singapore](/wiki/Singapore), a former [subsidiary](/wiki/Subsidiary) of [ABR Holdings](/wiki/ABR_Holdings). The company is the largest [distributor](/wiki/Distribution_(marketing)) and retailer of chocolate and [confectionery](/wiki/Confectionery) products in Asia[*citation needed*], with more than 70 stores in the [Asia-Pacific region](/wiki/Asia-Pacific). It also operates 12 chocolate and [confectionery](/wiki/Confectionery) shops at [Singapore Changi Airport](/wiki/Singapore_Changi_Airport). In 2014, FNA secured tenders to operate the departure lounges of Terminal 1 and 3. FNA also supplies and distributes chocolates to supermarkets in Singapore and overseas. ## History FNA was founded in 1991 when the [Duty Free Store](/wiki/Duty-free_shop) Singapore (DFS) closed down their Chocolates Trading Division. Esther Loo, who was then the head of chocolate division at DFS, took over and started her own [distribution company](/wiki/Distribution_company). The company started out with 5 staff and two agency lines: Hawaiian Host and [Droste](/wiki/Droste). In the same year, FNA posted a turnover of $1 million. From 1991 to 1993, FNA acquired three more chocolate brands and opened of their first retail outlet, FNA Chocolate Boutique. Loo Lip Giam, current Group [chief executive officer](/wiki/Chief_executive_officer) and husband of Esther Loo, joined the company in 1994. FNA Chocolate Boutique was renamed The Cocoa Trees in 2000. In 2003, FNA received an investment sum of $5 million from ABR Holdings, which also owns the [Swensen's](/wiki/Swensen%27s) [ice cream](/wiki/Ice_cream) franchise, and its partners. ABR Holdings sold their shares in 2012. In 2014, FNA received an undisclosed amount of investment from Heliconia Capital Management, an investment arm of [Temasek Holdings](/wiki/Temasek_Holdings). FNA plans to expand the chain abroad. FNA's Regional Distribution (Travel Retail) Division has established a Pan-Asian distribution network. The Cocoa Trees has branches and outlets operating out of [China](/wiki/China), [Hong Kong](/wiki/Hong_Kong), [India](/wiki/India), [Korea](/wiki/Korea), the [Maldives](/wiki/Maldives), [Malaysia](/wiki/Malaysia) and [Taiwan](/wiki/Taiwan). The company also owns Cocoa and Co. and Choc Spot. ## Retail stores Choc Spot and Cocoa & Co. are [retail stores](/wiki/Retail) set up by The Cocoa Trees to target [sub-urban](/wiki/Sub-urban) [malls](/wiki/Shopping_mall) in Singapore. Choc Spot stores are located at [West Mall](/wiki/West_Mall), [Bedok Mall](/wiki/Bedok_Mall), [Nex](/wiki/Nex,_Singapore), [Sembawang Shopping Centre](/wiki/Sembawang_Shopping_Centre), [West Gate](/wiki/Westgate,_Singapore), Compass Point (Grand Final). Cocoa & Co operates five outlets in Singapore Changi Airport, selling candies and chocolates. [M&M's World Stores](/wiki/M%26M%27s_World) are also operated at Singapore Changi Airport terminals, supplying clothing and other goods branded with [M&M's](/wiki/M%26M%27s) mascots and logos. In October 2011, FNA, [Mars](/wiki/Mars,_Incorporated), Incorporated International Travel Retail (ITR) and Changi Airport Group (CAG) opened a 40-square metre M&M's store at Singapore Changi Airport's Terminal 1. In the following year, the group opened its flagship store at Changi Airport's Terminal 2 departure transit lounge. ## Subsidiaries Hydro Style, founded in 2004 is Singapore's largest importer and distributor of designer European kitchen and bathroom supplies. Interiors Affairs, the retail arm of Hydro Style, was launched in 2010. Interiors Affairs sells the products carried by Hydro Style in its [showroom](/wiki/Showroom). Established in 2004, Global Vintage Network Pte. Ltd is a subsidiary company of FNA, and distributes wines in the region. ## Philanthropic work The Cocoa Trees Endowed Bursary was established in 2014. The [bursary](/wiki/Bursary) aims to provide financial aid to undergraduates from the School of Economics at the [Singapore Management University](/wiki/Singapore_Management_University) (SMU). Three bursaries are awarded per year.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:07:39.137479",
  "title": "The Cocoa Trees",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/The_Cocoa_Trees"
}