{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:08:40.512298"
  },
  "content": "Tibetan Buddhist Organization**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **may need to be rewritten** to comply with Wikipedia's quality standards. Relevant discussion may be found on the talk page. You can help. The talk page may contain suggestions. *(May 2021)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Thekchen Choling\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2021)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Thekchen Choling** is a registered charity [Buddhist](/wiki/Buddhist) organisation in the Republic of [Singapore](/wiki/Singapore). The organisation was started in 2001 by [Singha Thekchen Rinpoche](/wiki/Singha_Thekchen_Namdrol_Rinpoche) and a group of his initial disciples. The organisation promotes non-sectarian Buddhism, emphasizing understanding of [Theravada](/wiki/Theravada) and [Mahayana](/wiki/Mahayana) teachings. TCCL is committed to the Rime (non-sectarian) movement within Tibetan Buddhism though it is of the [Gelug](/wiki/Gelug) tradition. The primary practices and teachings of this temple are from [Guru Rinpoche](/wiki/Guru_Rinpoche) lineage and [Lama Tsongkapa](/wiki/Je_Tsongkhapa) lineage. ## History The temple was started in accordance with the instructions of [Geshe Lama Konchog](/wiki/Geshe_Lama_Konchog) of [Kopan Monastery](/wiki/Kopan_Monastery), with whom Singha Rinpoche studied in the late-1980s and early 1990s. Other teachers from this monastery include [Lama Zopa](/wiki/Lama_Zopa) and [Lama Yeshe](/wiki/Lama_Yeshe), who have written many books and founded many Buddhist centers. Singha Rinpoche's other root guru (primary teacher) was [Khensur Rinpoche Lama Lhundrup Rigsel](/wiki/Geshe_Lhundrup_Rigsel), known to his students as Khen Rinpoche. TCCL regularly hosts teachers from Kopan Monastery, Sera Jey Monastery, and several other Tibetan Buddhist teaching centers. ## Teachers ### Spiritual Director Singha Rinpoche (born Felix Lee), was initiated as a Yogi. Rinpoche was advised by his gurus not to take monastic vows, and remain as a lay practitioner. Trained as a chef and owner of a restaurant, Rinpoche was advised by his gurus in 1998 to give up the business and instead focus on spreading the Dharma. [Geshe Lama Konchog](/wiki/Geshe_Lama_Konchog) also entrusted him with the task of setting up a Tibetan temple with the mission to change the existing mindset that one needs to be a monk or nun to practice Buddhism. Rinpoche closed his restaurant, and in 2001 formally registered the temple ‘Thekchen Choling (Singapore)\", a name meaning \"Mahayana Buddhist Temple,\" bestowed by Geshe Lama Konchog. As a lay lama, he offers practical advice to those who seek his counsel for problems they encounter in daily life. Singha Rinpoche is the author of the book Direct Expressions. The Thekchen Choling homepage describes Singha Rinpoche's initial meeting of his teachers in Nepal in this way: In 1989, at the age of fifteen, a Buddhist master appeared in Rinpoche's dreams and instructed him to fulfill the vows of his previous life which was to teach those who did not have teachers. Following the instructions in his dreams, he was brought to Nepal by Venerable Sangye Khandro. Upon his arrival, Singha Rinpoche first met Lumbum Rinpoche and made light offerings at a temple. At the time, Rinpoche told him, \"We have been waiting for you\". It was later revealed that the Buddhist master who had first appeared in Lama's dream was in fact the great Buddhist saint, Guru Rinpoche. ### Lineage Gurus Within Tibetan Buddhism, teachers study closely with more than one senior teacher. Lama Namdrol Tulku's primary teachers include: 1. The 14th [Dalai Lama](/wiki/Dalai_Lama) 2. The Sakya Trizin 3. Gyuto Khenpo the 6th Kyabje Jhado Rinpoche 4. The 5th Kyabje Dagri Dorje Chang (Dagri Rinpoche is the 5th reincarnation of Pagri Dorje Chang, one of the very great Geshes of Lhasa who was the teacher of many high lamas in Tibet.) 5. Kyabje Lama Zopa Rinpoche([Thubten Zopa Rinpoche](/wiki/Thubten_Zopa_Rinpoche)) 6. Sera Jey Khenpo Geshe Lobsang Delek Rinpoche 7. Kyabje Tsikey Chokling Rinpoche 8. Kopan Khenpo Geshe Thubten Chonyi Rinpoche 9. [Geshe Lama Konchog](/wiki/Geshe_Lama_Konchog) (Reincarnated as [Tenzin Phuntsok Rinpoche](/wiki/Tenzin_Phuntsok_Rinpoche)) 10. The late Khensur Rinpoche Geshe Lama Lhundrup Rigsel of [Kopan Monastery](/wiki/Kopan_Monastery) 11. The late Geshe Kechog of Kopan Monastery 12. The late Geshe Pema Wangchen of Sera Jey Monastery ## Temple Located at 2 Beatty Lane in Singapore, the temple was registered in 2001 by Singha Rinpoche, as instructed by his teacher Geshe Lama Konchog and named after the monastery of the 14th Dalai Lama as ‘Thekchen Choling (Singapore)’. The address of Thekchen Choling used to be Ji Gong Temple, a heritage site in Singapore. A statue of [Ji Gong](/wiki/Ji_Gong) from the previous Ji Gong Temple is still being revered at the main hall of the temple for devotees to make offerings. TCCL owns a number of devotional objects. Tibetan Buddhist mindfulness training practice include the devotional treatment of statues of the Buddha (and his various forms); these statues are known as [Buddharūpa](/wiki/Buddhar%C5%ABpa) (literally, 'Form of the Awakened One'), which is the [Sanskrit](/wiki/Sanskrit) and [Pali](/wiki/Pali) term used in [Buddhism](/wiki/Buddhism) for statues or models of the [Buddha](/wiki/Buddha). Devotees treat the statues as if they were the living bodies of fully-realized Buddhas. TCCL contains several examples of Buddharupa in Thai, Chinese, and Nepali styles. ### Giant Mani Wheel A [prayer wheel](/wiki/Prayer_wheel), or mani wheel in Tibetan Buddhism, is a device that spins on an axis containing hundreds, thousands, or even millions of copies of a specific mantra. Instead saying one mantra at a time, a devotee who spins a prayer wheel believes himself to have said the mantra hundreds, thousands, or millions of times, depending on how many copies of the mantra are in the wheel. Commonly, prayer wheels contains Chenresig's mantras which devotees consider the turning of the wheel to be a manifestation of the Chenrezig's holy speech. Chenrezig, of whom the Dalai Lama is considered by Tibetan Buddhists to be an incarnation, is the protector of Tibet and is also known as Avalokitesvara (Guenther). Through this practice, one is believed to develop purity of body, speech, and mind. Buddhist texts teach that spinning the Mani Wheel (or prayer wheel) is equivalent to having recited all the mantras inside the wheel (Ladner). Turning the Mani Wheel is thus considered extremely beneficial. The Giant Mani wheel in Thekchen Choling (Singapore) was commissioned and installed in 2003. It stands 3m high, is 1.38m in diameter, and contains 213 million of Chenresig's mantras. ### Sacred Relics on display 1. Relics of Buddha [Shakyamuni](/wiki/Shakyamuni) 2. Relics of the Buddha's closest disciples [Ananda](/wiki/Ananda), [Upali](/wiki/Upali), [Shariputra](/wiki/Shariputra) and [Mahamaudgalyayana](/wiki/Mahamaudgalyayana) 3. Hair of the [13th Dalai Lama](/wiki/13th_Dalai_Lama) 4. Relics of the 3rd and 16th [Karmapa](/wiki/Karmapa) 5. Relics of the great Tibetan saint [Geshe Lama Konchog](/wiki/Geshe_Lama_Konchog) 6. Relics from numerous other Buddhist masters ### Kangyur and Tengyur Text Under the recommendation of Dagri Rinpoche, the whole collection of the [Kangyur](/wiki/Kangyur) and [Tengyur](/wiki/Tengyur) Text are now kept in TCCL. Also known as the Tibetan Buddhist Canon, this collection consists of loosely defined list of sacred texts recognised by various schools of Tibetan Buddhism. ## Practices and events The Singapore temple has weekly teachings in English and Mandarin, chanting and prayers sessions. It provides prayers and celebrations for Buddhist holy days and festivals such as [Lunar New Year](/wiki/Lunar_New_Year), [Vesak](/wiki/Vesak), [Ullambana](/wiki/Ullambana), and [Qingming Festival](/wiki/Qingming_Festival). The main hall is available to all who seek a place of quiet, for prayers and for meditation from 11am-7pm, Monday to Sunday. The devotees chant sutras in Mandarin wearing the traditional Chinese Hai-Ching and chant prayers in English and Tibetan while wearing the layman robes of white and maroon. This temple is unusual for the youth of its devotees; most are below the age of thirty five. The temple was granted permission by the Office of the 14th Dalai Lama to publish thirteen of his books in simplified Mandarin for free distribution. ### Annual Vesak Celebrations The Annual Vesak Celebrations at Thekchen Choling, a Buddhist temple, are events commemorating the birth, enlightenment, and passing of the Buddha. These celebrations often include various activities such as prayer sessions, meditation, dharma talks, and community events. One of the highlights is the display of a Giant Shakyamuni Buddha Thangka, a large and intricate cloth painting depicting the Buddha, which is typically unfurled during the celebrations. #### Animal Blessing Ceremony The Animal Blessing Ceremony at Thekchen Choling is an event dedicated to the welfare and happiness of animals. This ceremony is an expression of compassion and a reflection of the Buddhist principle of kindness towards all living beings. During the ceremony, animals brought by their owners receive blessings from the monks. The ceremony includes chanting of mantras, sprinkling of holy water, and offering of prayers. ### Community Outreach With the vision of \"Connecting All with Divine Hearts\", Thekchen Choling hopes to complement the spiritual healing of the temple with a focus on giving aid to those in need. **Education Services** The temple grants annual education bursaries to needy students each year regardless of religious backgrounds. **Youth Development Services** The objective of Thekchen Choling Youth Development Services is to groom youths to be courageous, caring and socially responsible adults. Programmes are planned to help in the overall development of youths. These programmes include self-awareness and social skills and community outreach opportunities. **Elderly and Needy Support Services** Given the rising prices of food recently, TCCL hopes to lend a helping hand to the needy by distributing food rations to them. Started in 2007 as Project Maude, this free ration distribution project held 3 times a year during Chinese New Year, Vesak Day, and [Mid Autumn Festival](/wiki/Mid_Autumn_Festival) has grown now to BESAR Project, a collaborative effort with the Jalan Besar Citizens Consultative Committee, supporting more than 1000 needy families and elderly on each occasion. ## International Branches of Thekchen Choling ### Thekchen Choling (Malaysia) Melaka #### The Beginning of Thekchen Choling (Malaysia) For many years, Malaysian students of Rinpoche have persistently requested him to start similar temples in Malaysia so that people in Malaysia can benefit from Dharma as well as community outreach programmes. After numerous location searches of three months since June 2012, we found Melaka to be suitable and ripe for us to start our first overseas centre. Thekchen Choling (Malaysia) was officially approved by the Malaysian Federal Government on 15 October 2012 as a society to operate Buddhist temples. Thus begins the chapter of Thekchen Choling (Malaysia) Melaka Centre, operating on a rented premise at 8 and 8A, Jalan Laksamana Cheng Ho. It started operations from 10 November 2012. ### Thekchen Choling Malaysia (Kota Tinggi) In late 2013, a 2-acre piece of land in Kota Tinggi was offered to Rinpoche. This marks the birth of Thekchen Choling Malaysia (Kota Tinggi) The Palace of 1000-Armed Chenrezig is near completion. Specially commissioned by Namdrol Rinpoche, this magnificent statue of 1000-Armed Chenrezig stands at 36 feet tall and is beautifully adorned with pearls, corals, turquoises and dzi-beads. This statue is the largest representation of Chenresig (or Avalokitesvara) in Tibetan style outside of Tibet and China that has been accurately represented and traditionally filled with tsung under the personal guidance of Kyabje Jhado Rinpoche in the Vajrayana tradition. The Meditation center is open to devotees for retreats and practices purpose. ### Thekchen Choling Syracuse On the auspicious day of the 29th day of the eighth lunar month of the Wooden Horse year (22 October 2014), Thekchen Choling USA (Syracuse) - a new temple for the cultivation and practice of Buddhadarma located at 128 N. Warren Street, Syracuse, New York 13202, USA, was officially established. Thekchen Choling USA (Syracuse) is the latest temple formed under the auspice of the Namdrol Labrang, the latter of which oversees a family of organizations that include Thekchen Choling (Singapore), Thekchen Choling (Malaysia) and Thekchen Choling Malaysia (Kota Tinggi) - [Buddhism in Singapore](/wiki/Buddhism_in_Singapore) - [Tibetan Buddhism](/wiki/Tibetan_Buddhism) - Thekchen Choling (Singapore) website - Singapore portal - Thekchen Choling (Syracuse) website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:08:40.511973",
  "title": "Thekchen Choling",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Thekchen_Choling"
}