{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:08:42.316999"
  },
  "content": "Database of protein targets in drug design **Therapeutic Target Database** (**TTD**) is a pharmaceutical and medical repository constructed by the Innovative Drug Research and Bioinformatics Group (IDRB) at [Zhejiang University, China](/wiki/Zhejiang_University) and the Bioinformatics and [Drug Design](/wiki/Drug_design) Group at the [National University of Singapore](/wiki/National_University_of_Singapore). It provides information about known and explored therapeutic [protein](/wiki/Protein) and [nucleic acid](/wiki/Nucleic_acid) targets, the targeted disease, pathway information and the corresponding drugs directed at each of these targets. Detailed knowledge about target function, sequence, 3D structure, ligand binding properties, [enzyme](/wiki/Enzyme) nomenclature and drug structure, therapeutic class, and clinical development status. TTD is freely accessible without any login requirement at https://idrblab.org/ttd/. ## Statistics This database contains 3,730 therapeutic targets (532 successful, 1,442 [clinical trial](/wiki/Clinical_trial), 239 preclincial/patented and 1,517 research targets) and 39,862 drugs (2,895 approved, 11,796 clinical trial, 5,041 preclincial/patented and 20,130 experimental drugs). The targets and drugs in TTD cover 583 protein biochemical classes and 958 drug therapeutic classes, respectively. The latest version of the International Classification of Diseases (ICD-11) codes released by WHO are incorporated in TTD to facilitate the clear definition of disease/disease class. ## Validation of Primary Therapeutic Target Target validation normally requires the determination that the target is expressed in the disease-relevant cells/tissues, it can be directly modulated by a drug or drug-like molecule with adequate potency in biochemical assay, and that target modulation in cell and/or animal models ameliorates the relevant disease phenotype. Therefore, TTD collects three types of target validation data: - Experimentally determined potency of drugs against their primary target or targets. - Evident potency or effects of drugs against disease models (cell-lines, ex-vivo, in-vivo models) linked to their primary target or targets. - Observed effects of target knockout, knockdown, [RNA interference](/wiki/RNA_interference), transgenetic, antibody or antisense treated in-vivo models. ## Categorization of Therapeutic Targets based on Clinical Status The therapeutic targets in TTD are categorized into successful target, clinical trial target, preclinical target, patented target, and literature-reported target, which are defined by the highest status of their corresponding drugs. - Successful target: targeted by at least one approved drug; - Clinical trial target: not targeted by any approved drug, but targeted by at least one clinical trial drug; - Preclinical target: not targeted by any approved/clinical trial drug, but targeted by at least one preclinical drug; - Patented target: not targeted by any approved/clinical trial/preclinical drug, but targeted by at least one patented drug; - Literature-reported target: targeted by investigative drugs only. ## Classification of Therapeutic Targets based on Molecular Types The molecular types of therapeutic targets in TTD include protein, nucleic acid, and other molecule. - [Protein](/wiki/Protein): the most common type of target in drug development - [Nucleic acid](/wiki/Nucleic_acid): include DNA, mRNA, miRNA, lncRNA targets - Other molecule: such as uric acid, iron, and reactive oxygen species ## Different Types of Drugs Collected in TTD The main drug types in TTD include small molecule, antibody, nucleic acid drug, cell therapy, gene therapy and vaccine. - [Small molecule](/wiki/Small_molecule): the most common medications in the pharmaceutical market - [Antibody](/wiki/Antibody): includes monoclonal antibodies and several alternatives such as antibody-drug conjugates, bispecific antibodies, IgG mixtures, and antibody fusion proteins - Nucleic acid drug: mainly include antisense oligonucleotides, small interfering RNAs, small activating RNA, microRNAs, mRNAs and so on - [Cell therapy](/wiki/Cell_therapy): inject, graft or implant viable cells into a patient in to effectuate a medicinal effect - [Gene therapy](/wiki/Gene_therapy): manipulate gene expression or alter the biological properties of living cells to produce the therapeutic effect - [Vaccine](/wiki/Vaccine): provide active acquired immunity to a particular infectious or malignant disease ## Main Advancement in Different Versions of TTD ### 2024 Update (*Nucleic Acids Res*. 2023, doi: 10.1093/nar/gkad751) **■** Target druggability illustrated by molecular interactions or regulations; **■** Target druggability characterized by different human system features; **■** Target druggability reflected by diverse cell-based expression variations; ### 2022 Update (*Nucleic Acids Res*. 2022, 50: D1398-D1407) **■** Structure-based activity landscape and drug-like property profile of targets; **■** Prodrugs together with their parent drug and target; **■** Co-targets modulated by approved/clinical trial drugs; **■** Poor binders and non-binders of targets; ### 2020 Update (*Nucleic Acids Res*. 2020, 48: D1031-D1041) **■** Target regulators (microRNAs & transcription factors) and target-interacting proteins; **■** Patented agents and their targets (structures and experimental activity values if available); ### 2018 Update (*Nucleic Acids Res*. 2018, 46: D1121-D1127) **■** Differential expression profiles and downloadable data of targets in patients and healthy individuals; **■** Target combination of multitarget drugs and combination therapies; ### 2016 Update (*Nucleic Acids Res*. 2016, 44: D1069-D1074) **■** Cross-links of most TTD target and drug entries to the corresponding pathway entries; **■** Access of the multiple targets and drugs cross-linked to each of these pathway entries; ### 2014 Update (*Nucleic Acids Res*. 2014, 42: D1118-D1123) **■** Biomarkers for disease conditions; **■** Drug scaffolds for drugs/leads; ### 2012 Update (*Nucleic Acids Res*. 2012, 40: D1128-D1136) **■** Target validation information (drug-target-disease); **■** Quantitative structure activity relationship models (QSAR) for compounds; ### 2010 Update (*Nucleic Acids Res*. 2010, 38: D787-D791) **■** Clinical trial drugs and their targets; **■** Similarity target and drug search. - Therapeutic Target Database home page - Article on PubMed - Innovative Drug Research and Bioinformatics Group\n",
  "language": "en",
  "processed_at": "2026-01-12T12:08:42.316617",
  "title": "Therapeutic Targets Database",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Therapeutic_Targets_Database"
}