{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:08:50.055333"
  },
  "content": "Singapore TV series ***Third Rail*** is a Singaporean English-language drama produced by Ochre Pictures and distributed by [Mediacorp](/wiki/Mediacorp). The first two episodes premiered on [MeWATCH](/wiki/MeWATCH) on 17 October 2022, with two new episodes added every Monday. The series began airing on Mediacorp's YouTube drama channel and [Channel 5](/wiki/Channel_5_(Singaporean_TV_channel)) on 25 and 31 October 2022, respectively. ## Cast - [Rebecca Lim](/wiki/Rebecca_Lim) as Geraldine Hyak (Geri) - Vanessa Vanderstraaten as Chia Wen Si - Jason Godfrey as Joseph Mandez - [Andie Chen](/wiki/Andie_Chen) as John Ho - Amanda Ang as Seah Su Jin - Carla Dunareanu as Valerie Keng-North (Val) - [Benjamin Heng](/wiki/Benjamin_Heng) as Choy Boon Wee - Shrey Bhargava as Rajeev Khanna (Raj) - Brian Ng as Ray Huang - Ky Tan Xing Hua as Shawn Kong - Nurul Aini as Jana - Gerald Chew as Prof Lau - David Eung Hao as Jacob Seah - David Matthew as Titus Bhagawan - Cassandra Spykerman as Kartini Puspa - [Keagan Kang](/wiki/Keagan_Kang) as Susilo Bhagawan - Benjamin Eio as Chee ## Production The set of the series was housed inside one of [Changi Exhibition Centre](/wiki/Changi_Exhibition_Centre)'s hall, which featured two decommissioned [Kawasaki Heavy Industries C151](/wiki/Kawasaki_Heavy_Industries_C151) MRT train carriages (Carriage no. 3095 and 1095 of 095/096) and a specially constructed railway tunnel. It was also one of the biggest to be built in Singapore. ## Awards and nominations YearAwardCategoryNominee(s)ResultRef.2023ContentAsia AwardsBest Factual Programme made in Asia for a Single Asia Market*Third Rail – Behind The Scenes Special*Silver This Singaporean television-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:08:50.055048",
  "title": "Third Rail (TV series)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Third_Rail_(TV_series)"
}