{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:08:51.619052"
  },
  "content": "Museum director (born 1962) **Thomas Patrick Campbell** (born 12 July 1962) is the director and CEO of the [Fine Arts Museums of San Francisco](/wiki/Fine_Arts_Museums_of_San_Francisco) (FAMSF), overseeing the [de Young](/wiki/De_Young_Museum) and [Legion of Honor](/wiki/Legion_of_Honor_(museum)) museums. He served as the [director](/wiki/Director_of_the_Metropolitan_Museum_of_Art) and CEO of the [Metropolitan Museum of Art](/wiki/Metropolitan_Museum_of_Art) between 2009 and 2017. On 30 June 2017, Campbell stepped down as director and CEO of the Metropolitan Museum of Art under pressure and accepted the [Getty Foundation](/wiki/Getty_Foundation)'s Rothschild Fellowship for research and study at both the [J. Paul Getty Museum](/wiki/J._Paul_Getty_Museum) in [Los Angeles](/wiki/Los_Angeles) and at [Waddesdon Manor](/wiki/Waddesdon_Manor), in the UK. ## Early life He was born in Singapore and raised in [Cambridge](/wiki/Cambridge), England, where he attended [The Perse School](/wiki/The_Perse_School). He earned a BA degree in English language and literature at [New College](/wiki/New_College,_Oxford), [Oxford](/wiki/University_of_Oxford), in 1984, followed by a Diploma from [Christie's](/wiki/Christie%27s) Fine and Decorative Arts course, London, in 1985. While studying for his master's degree at the [Courtauld Institute of Art](/wiki/Courtauld_Institute_of_Art) (1987), he discovered how much mainstream art history had overlooked the major role of tapestry in [European art](/wiki/European_art) and propaganda. During the following years, he worked to rectify this oversight by creating the [Franses Tapestry Archive](/wiki/Franses_Tapestry_Archive) in London (1987–94), which, with more than 120,000 images, is the largest and most up-to-date information resource on European tapestries and figurative textiles in the world. His early research culminated in several research articles and a PhD from the Courtauld Institute of Art, [University of London](/wiki/University_of_London) (1999) on the art and culture of [King Henry VIII](/wiki/King_Henry_VIII)'s court. ## Career Campbell has served for more than a decade as Director and CEO of two major US art museums—the [Metropolitan Museum of Art](/wiki/Metropolitan_Museum_of_Art) from 2009 to 2017, and the [Fine Arts Museums of San Francisco](/wiki/Fine_Arts_Museums_of_San_Francisco) since 2018. ### Metropolitan Museum of Art Campbell joined the Metropolitan Museum of Art in 1995, where he conceived and organized several acclaimed exhibitions and publications as a curator in the European Sculpture and Decorative Arts department, including *Tapestry in the Renaissance: Art and Magnificence* (2002), named \"Exhibition of the Year\" by *[Apollo Magazine](/wiki/Apollo_Magazine)*, *Tapestry in the Baroque: Threads of Splendor* (New York, 2007; [Palacio Real](/wiki/Palacio_Real), Madrid, spring 2008). \"Then after nearly 14 years of widely admired work as a curator and scholar, Campbell was the unexpected choice to succeed [Philippe de Montebello](/wiki/Philippe_de_Montebello).\" During his tenure as director, Campbell was also at the helm for popular and critically acclaimed exhibitions, including: *Picasso in the Metropolitan Museum of Art*; *Alexander McQueen: Savage Beauty*; *The Drawings of Bronzino*; *The Steins Collect*; *Lost Kingdoms: Hindu-Buddhist Sculpture of Early Southeast Asia, 5th to 8th Century*; *John Baldessari: Pure Beauty*; *Impressionism, Fashion, and Modernity*; *The Pictures Generation, 1974–1984*; *Regarding Warhol: Sixty Artists, Fifty Years*; *The Renaissance Portrait from Donatello to Bellini*; *Kongo: Power and Majesty*; *China: Through the Looking Glass*; *Ink Art: Past as Present in Contemporary China*; *Pergamon and the Hellenistic Kingdoms of the Ancient World*; *Vigée Le Brun: An Artist in Revolutionary France*; *Unfinished: Thoughts Left Visible*; *Jerusalem 1000–1400: Every People Under Heaven*; *Valentin de Boulogne: Beyond Caravaggio*; *Diane Arbus: Revelations*, and *Kerry James Marshall: Mastry*. Campbell led the reconception of the Met's approach to modern and contemporary art, including the hiring of [Sheena Wagstaff](/wiki/Sheena_Wagstaff) to lead a reorganized department, focused on the art of the 20th and 21st century, and launching the Met Breuer in 2016. \"The Met Breuer enabled visitors to engage with the art of the twentieth and twenty-first centuries through the global breadth and historical reach of The Met's unparalleled collection and resources through a range of exhibitions, commissions, performances, and artist residencies.\" In 2013, Campbell secured one of the most significant gifts in the history of the Metropolitan Museum of Art, the philanthropist and cosmetics tycoon Leonard A. Lauder's collection of 78 Cubist paintings, drawings, and sculptures. As *The New York Times* noted in their announcement of the gift, \"scholars say the collection is among the world's greatest, as good as, if not better than, the renowned Cubist paintings, drawings and sculptures in institutions like the Museum of Modern Art in New York, the State Hermitage Museum in St. Petersburg and the Pompidou Center in Paris. Together they tell the story of a movement that revolutionized Modern art and fill a glaring gap in the Met's collection, which has been notably weak in early-20th-century art.\" In 2014, the Metropolitan Museum of Art's Costume Institute reopened to the public following a two-year renovation with the inaugural exhibition *Charles James: Beyond Fashion*. The costume conservation center also underwent a renovation, including its storage and study facility that houses the bulk of the collection, and the costume reference library. The renovated space now allows the Costume Institute to present exhibitions 10 months out of the year. 2014 also saw the launch of a new interactive feature on the Met's website and a new iPad app. The website *One Met. Many Worlds*, \"allows visitors to explore more than 500 highlights from the Museum's encyclopedic collection in English, Arabic, Chinese, French, German, Italian, Japanese, Korean, Portuguese, Russian, and Spanish\". The website presents individual works of art linked to universal themes and concepts and invites visitors to respond by pairing images playfully, poetically, and creatively. The iPad app, 82nd & Fifth, features curators from across the Museum discussing 100 works of art in the Met's collection that change the way they see the world – \"one work, one curator, two minutes at a time\". During Campbell's tenure, the annual Met Iris and B. Gerald Cantor Roof Garden Commission was established. Artists featured included, Huma Bhabha (2017), Adrián Villar Rojas (2016), Cornelia Parker (2016), Pierre Huyghe (2015), and Dan Graham with Günther Vogt (2014). Under Campbell's direction, the Met's attendance rose by more than 50% to a record seven million visitors yearly, \"with audiences that are now more diverse than ever before\". Other accomplishments include the renovation of the American Wing, which took place in phases, with the first phase reopening in 2009 and the second phase, which included a new installation of American art spanning the 18th through 20th centuries, in January 2012, and renovating the greatly enlarged and reconceived Islamic Wing, to highlight both the diversity and the interconnectedness of the numerous cultures represented in the collection. Campbell's ambitious plans to modernize the Met and its operations were met with resistance from some of the staff. ### The Fine Arts Museums of San Francisco In 2018, it was announced that Campbell would lead the Fine Arts Museums in San Francisco. Needing to arrange something quickly, he supported the previously arranged traveling exhibition *Soul of a Nation: Art in the Age of Black Power* for fall 2019 and a show that had originated at the Frida Kahlo Museum in Mexico as *Appearances Can Be Deceiving: The Dresses of Frida Kahlo* for spring 2020. But rather than bring them in 'as is,' Campbell empowered curators to bring out their Bay Area roots. *Soul of a Nation*, in particular, embraced the local community. A preview breakfast included not just press but also Black artists who'd made work in the 1960s and '70s, some of it celebrating fellow Bay Area activists, like [Angela Davis](/wiki/Angela_Davis) and the [Black Panthers](/wiki/Black_Panthers).\" At the opening for *Soul of a Nation*, Campbell announced that \"Free Saturdays\" for San Francisco residents would now extend to all Bay Area residents. This initiative has doubled attendance and brought in a more diverse audience on Saturdays. In March 2020, in response to the pandemic, Campbell announced that the de Young Museum would host an open-call exhibition for \"all Bay Area artists\". *Alta* magazine called it \"an exhibition of immense scale, inherent complexity, and straightforward generosity.\" The response to The de Young Open went well beyond the few hundred submissions curators expected. Instead, some 6,000 artists sent in 11,500 works. 877 works were selected and although the museum did not act as an intermediary, all of the works were available for sale. \"This exhibition was seen as an 'unusual take for the director of a major museum, where blockbuster exhibitions of blue-chip international artists—whether contemporary or of the past—have been the financial lifeblood for decades'.\" In 2023, FAMSF opened a second iteration of the de Young Open. Out of the 7,766 artworks submitted by as many Bay Area artists, the exhibition jury selected 883 works, which were displayed salon style in the de Young's Herbst exhibition galleries in a display that *The New York Times* hailed \"...a dizzying, bursting-at-the-seams extravaganza of an exhibition, designed through an open call process to take the pulse of what local artists are thinking and making.\" In 2022, \"as America marked two years since the [murder of George Floyd](/wiki/Murder_of_George_Floyd), Campbell called on the museum sector to 'confront the colonial narratives we have inherited'\" and pledged to update the museums strategic plans for the next several years by evolving the Fine Arts Museums into an anti-racist institution as their top objective. Campbell has focused on five critical areas of improvement: presentation and development of the collections, exhibitions, programs and community, workplace and hiring practices, and the composition and future growth of their board. To that end, the museum announced the appointment of Abram Jackson as director of interpretation. \"Jackson will spend much of his time working out how to frame art from the museum collection that may have colonialist roots. He will also, he says, explore how the artistic reappropriation of racist insignia can best be communicated in museum settings.\" During Campbell's tenure, the Museums have organized a number of shows, which have been critically well received. **At the Legion of Honor:** - In 2021, the Museum presented *Wangechi Mutu: I Am Speaking, Are You Listening?*. The powerful exhibition was praised for \"providing a model for how art institutions can begin the work of decolonizing and reckoning with systemic racism and sexism\" and was named one of the best public art displays of 2021 by *[Artsy](/wiki/Artsy)*. - In April 2022, the Legion of Honor opened *Guo Pei: Couture Fantasy*, a retrospective of the Chinese fashion designer notably worn by [Rihanna](/wiki/Rihanna) on the red carpet at the 2015 Met Gala. The exhibition mines [Guo Pei](/wiki/Guo_Pei)'s career, characterized by her sculptural silhouettes and painstaking craftsmanship, through more than 80 pieces. In August 2022, the Fine Art Museums of San Francisco announced an extension of the exhibition after attracting a record 130,000 visitors in 18 weeks. - *Botticelli Drawings* opened in November 2023. Organized by curator [Furio Rinaldi](/wiki/Furio_Rinaldi), the exhibition united 27 sheets by the Italian Renaissance master, [Sandro Botticelli](/wiki/Sandro_Botticelli) (a majority of the existing corpus of drawings by the artist), and 12 paintings, along with work by the artist's teacher, Fra Filippo Lippi, and Florentine contemporaries including Verrocchio. *[The Wall Street Journal](/wiki/The_Wall_Street_Journal)* lauded the exhibition, writing: \"The Legion of Honor is the show's only venue, and for lovers of Botticelli it has made itself a destination rivaling Florence.\" The catalogue that accompanied the exhibition was highlighted as one of the \"Best Art Books of 2023\" by *The New York Times*. **At the de Young:** - In 2020, the Museum presented Uncanny Valley, an exhibition conceived by Claudia Schmuckli and initially also supported by previous director [Max Hollein](/wiki/Max_Hollein), called a top 10 exhibition in 2020 by *[Frieze](/wiki/Frieze_(magazine))* magazine, \"comprising work by thirteen individual artists and collectives\" which warned \"against becoming more and more dependent on artificial intelligence technologies we do not fully understand\" and alluded to nearby Silicon Valley. - In 2023, Campbell worked with Ford Foundation president Darren Walker to bring *Kehinde Wiley: An Archaeology of Silence* to the de Young. The exhibition assembled a series of sculptures and paintings--many monumental in scale--that the artist [Kehinde Wiley](/wiki/Kehinde_Wiley) had created during the COVID-19 pandemic. Featuring black subjects in poses of repose drawn from Western art history, *The New York Times* wrote of the exhibition: \"The show, which debuted last year at the Venice Biennale, has a particular resonance opening in a nation reeling from the latest in a string of police killings of Black men…\". As noted by Wallpaper.org, the exhibition received further support from google.org, which enabled the de Young to increase access to the exhibition via \"a free audio guide, public programming such as a talk with the artist, grief workshops, school and youth curriculum, an exhibition film, and an ongoing community engagement speaker series presented in partnership with LiveFree\". The tour of the exhibition was ultimately cancelled due to allegations of sexual misconduct by the artist. - *Lee Mingwei: Rituals of Care* opened at the de Young in 2024. Including several interactive installations centered on acts of healing and care by artist Lee Mingwei, the San Francisco Standard called the exhibition \"...an antidote to spectacularism and a master class in subtlety.\" The exhibition featured a newly commissioned work, titled \"Chaque souffle une danse\" (Each breath a dance), which was exhibited offsite at the Minnesota Street Project Foundation. In March 2024, *[The Art Newspaper](/wiki/The_Art_Newspaper)* published their annual attendance report for calendar year 2023, noting: \"Our exclusive survey reveals that in 2023 many of the world's largest museums recorded very similar numbers to those of 2019, the last full year before the Covid lockdowns began.\" In 2023, combined attendance at the Fine Arts Museums of San Francisco was 1,344,866, which according to *The New York Times*, was \"up from 1,344,431 in 2019\". Speaking of the cultural community's role in overcoming the city's post-pandemic \"doom narrative\", Campbell said to *The New York Times*: \"San Francisco is the 17th-largest city in the country, but we have a symphony, a ballet, an opera and museums that are all in the top tier…\". FAMSF is actively expanding its collection. Over the course of Campbell's tenure, the museums have acquired several significant works of art, including: - A ceramic vessel by artist and poet [David Drake](/wiki/David_Drake_(potter)) - [Marie-Guillemine Benoist](/wiki/Marie-Guillemine_Benoist)'s \"Psyche Bidding her Family Farewell\" - The Museums recently acquired works by 30 Bay Area artists, including Wesaam Al-Badry, [Rupy C. Tut](/wiki/Rupy_C._Tut), Woody D. Othello, and Chelsea Ryoko Wong, with a $1 million grant from the Svane Family Foundation. - [Mary Lovelace O'Neal](/wiki/Mary_Lovelace_O%27Neal)'s \"I Live in a Black Marble Palace with Black Panthers and White Doves #8\" - [Canaletto](/wiki/Canaletto)'s \"Grand Canal looking East with Santa Maria della Salute\" - A family portrait by pioneering Italian Mannerist painter [Lavinia Fontana](/wiki/Lavinia_Fontana) ## Other activities Campbell serves on the board of directors of the [Broad Museum](/wiki/Broad_Museum). He is also on the advisory panel of the Museum of Art and Photography (MAP) in [Bengaluru](/wiki/Bengaluru), India. Over the course his career, Campbell has served as an interlocutor on culture's relevance in society, speaking at the World Economic Forum, writing in *The New York Times* about the importance of the [National Endowment for the Arts](/wiki/National_Endowment_for_the_Arts) (NEA), and providing context on museums' evolving use of technology in the 21st century. ## Select publications - \"The Battle of Pavia Tapestries and the Genius of Bernard Van Orley\", in *Art & War in the Renaissance: The Battle of Pavia Tapestries*, ed. Carmine Romano, exhibition catalogue, 2024 - \"Raphael and Tapestry Design\", in *Raphael*, exhibition catalogue, The National Gallery, London, 2022 - \"Museums and Public Trust\", interview by András Szántó, *The Future of the Museum*, Hatje Cantz Verlag, Berlin, 2020 - *Tapestry in the Baroque: Threads of Splendor* (editor and principal author), exhibition catalogue, The Metropolitan Museum of Art, New York, 2007 - *Henry VIII and the Art of Majesty: Tapestries at the Tudor Court*, Yale University Press, September 2007 - *Tapestry in the Renaissance: Art and Magnificence* (editor and principal author), exhibition catalogue, The Metropolitan Museum of Art, New York, 2002 ## Personal life Campbell is married and lives in [Sonoma](/wiki/Sonoma_County,_California). He and his wife Phoebe have a son and daughter. - Thomas P. Campbell at [TED](/wiki/TED_(conference)) Cultural officesPreceded by[Philippe de Montebello](/wiki/Philippe_de_Montebello) **[Director of the Metropolitan Museum of Art](/wiki/List_of_Directors_of_the_Metropolitan_Museum_of_Art)** 2009-2017Succeeded by[Max Hollein](/wiki/Max_Hollein)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:08:51.618738",
  "title": "Thomas P. Campbell",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Thomas_P._Campbell"
}