{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:08:54.899434"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Thomson, Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2016)* *(Learn how and when to remove this message)*Subzone of Bishan Planning Area in Singapore **Thomson** is a relatively narrow area stretching from [Novena](/wiki/Novena,_Singapore) in the [Central Region of Singapore](/wiki/Central_Region,_Singapore) up north till [Sembawang](/wiki/Sembawang). The area is mainly located within the central catchment area where some of [Singapore's reservoirs](/wiki/Reservoirs_in_Singapore) are located, including [MacRitchie Reservoir](/wiki/MacRitchie_Reservoir), [Upper Peirce Reservoir](/wiki/Upper_Peirce_Reservoir) and [Lower Peirce Reservoir](/wiki/Lower_Peirce_Reservoir). ## Etymology ***Thomson*** was named after its namesake road, [Thomson Road](/wiki/Thomson_Road,_Singapore). Previously known as Seletar Road, this road was subsequently renamed \"Thomson Road\" named after [John Turnbull Thomson](/wiki/John_Turnbull_Thomson), a government [surveyor](/wiki/Surveyor_(surveying)) who also helped to lay this road. ## Housing The convenient location, due as its proximity and the ease of access to the [Central Area](/wiki/Central_Area,_Singapore), popular schools, parks and other parts of Singapore; combined with an [aesthetic](/wiki/Aesthetic) environment that is near forest and [reservoirs](/wiki/Reservoir_(water)) tends to make property prices in the area significantly higher than other parts of Singapore.[*citation needed*] Due to this fact, a large number of condominiums can be found in Thomson as well. These include the likes of Meadows@Peirce, Thomson Grove, Lattice One, Adana@Thomson, Peirce View, Flame Tree Park and Thomson Grand. Private [housing](/wiki/House) makes up the bulk of the housing in Thomson with a modicum of [HDB](/wiki/Housing_and_Development_Board) [flats](/wiki/Apartment) and [shophouses](/wiki/Shophouse). The low rise housing in the area is notable and this stretches from MacRitchie Reservoir to the Peirce Reservoirs, consisting of neighbourhoods like the Thomson Ridge area, the Little Canada area and Venus drive, and goes up to Jalan Rebana and passing through the junction of Ang Mo Kio towards Seraya Crescent, Nemesu Avenue, Casuarina Road and Jalan Leban, arching at the Thomson Hills and Happy Park areas and culminating at the Teacher's Estate which lies along Yio Chu Kang road. ## Infrastructure ### Transportation The area also contains one of the oldest roads in Singapore, which is also one of the longest and tends to be a vital link from the northern part of Singapore to the Central Area and the [Downtown Core](/wiki/Downtown_Core), as well as the rest of the island. The road is split into two lengths, [Thomson Road](/wiki/Thomson_Road,_Singapore), and [Upper Thomson Road](/wiki/Upper_Thomson_Road). Along [Upper Thomson Road](/wiki/Upper_Thomson_Road), there is also the Upper Thomson MRT station that runs along the [Thomson–East Coast Line](/wiki/Thomson%E2%80%93East_Coast_Line). ### Recreation There is a variety of popular food establishments, such as [roti prata](/wiki/Roti_prata) shops, cafes, bars, and eateries, along the main road which runs through the area. - [Thomson Road Grand Prix circuit](/wiki/Thomson_Road_Grand_Prix_circuit) This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:08:54.899149",
  "title": "Thomson, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Thomson,_Singapore"
}