{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:08:58.724278"
  },
  "content": "Nature park in Singapore **Thomson Nature Park** is a [nature park](/wiki/Nature_park) in [Singapore](/wiki/Singapore). Opened on 12 October 2019, it is located adjacent to [Central Catchment Nature Reserve](/wiki/Central_Catchment_Nature_Reserve) near [Old Upper Thomson Road](/wiki/Thomson_Road_Grand_Prix_circuit). ## Background The park is being developed on the site of a former [Hainan](/wiki/Hainan) village which was established in the 1800s and abandoned in 1975. It will be about 50 [hectares](/wiki/Hectare) in size. One purpose of the park is to help conserve the biodiversity in the area. The park is one of five being developed in Singapore during the late 2010s near Central Catchment to increase the buffer between the park and the surrounding urban area and attract visitors who would otherwise visit the country's nature reserves. Fauna living in the forested areas of the park include the [Sunda pangolin](/wiki/Sunda_pangolin), the [Malayan porcupine](/wiki/Malayan_porcupine), the [samba deer](/wiki/Samba_deer), the [leopard cat](/wiki/Leopard_cat), the [straw-headed bulbul](/wiki/Straw-headed_bulbul), [Malayan box turtle](/wiki/Malayan_box_turtle) and the [cinnamon frog](/wiki/Cinnamon_frog). It is also intended to help conserve the [Raffles' banded langur](/wiki/Raffles%27_banded_langur), a type of [leaf monkey](/wiki/Leaf_monkey) which is critically endangered within Singapore and whose small Singapore population often feeds in nearby forest. Trees in the park will include several species of *[Ficus](/wiki/Ficus)*, [angsana](/wiki/Angsana) and [common pulai](/wiki/Common_pulai). Besides enjoying nature, park visitors will be able to see the remains of the Hainan village. Groundbreaking of the project was marked by Singapore's [Second Minister for National Development](/wiki/Ministry_of_National_Development_(Singapore)) planting a *[Radermachera pinnata](/wiki/Radermachera)* tree. According to Lee: \"These buffer parks protect the Central Catchment (Nature Reserve) from fringe effects. If you have roads, development right up to the nature reserve, you will subject it to all the impacts of the urban setting...Having these nature parks near but not within the reserve will allow members of the public to enjoy the outdoors with their families and that takes pressure off our very precious nature reserve.\" ## Opening Thomson Nature Park opened on 12 October 2019. It has five trails spanning 3.8km into previous kampung areas. Now it is Singapore's newest and seventh nature park. ## Kampung routes Besides the site of a **deserted Hainan Village**, the trails in the park also covers extensive forest areas. You may encounter rich wildlife along the trails.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:08:58.723925",
  "title": "Thomson Nature Park",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Thomson_Nature_Park"
}