{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:09:02.837084"
  },
  "content": "Singaporean physician **Thora Oehlers** (2 September 1913 – July 1990) was a Singaporean physician. She was the first woman student in Singapore of mixed European and Asian ancestry to win a [Queen's Scholarship](/wiki/Queen%27s_Scholar_(British_Malaya_and_Singapore)) in 1933, and served in the [Royal Army Medical Corps](/wiki/Royal_Army_Medical_Corps) during World War II. ## Early life Thora Augusta Maude Oehlers was born in [Singapore](/wiki/Singapore), one of the twelve children of contractor George Rae Oehlers and Frances Maude Clarke. Her grandparents came from Germany, Portugal, Britain, and Malaya. Her older brother, Sir [George Oehlers](/wiki/George_Oehlers), was Speaker of the [Legislative Assembly of Singapore](/wiki/Legislative_Assembly_of_Singapore). Her younger sister Mae Noeline Oehlers was principal of the [Raffles Girls' School](/wiki/Raffles_Girls%27_School_(Secondary)). Thora Oehlers was a student at the [Raffles Institution](/wiki/Raffles_Institution), a bright and athletic young woman, when she became \"the first Eurasian girl scholar in Singapore\" to win a Queen's Scholarship in 1933, for study in England. She was the second girl in Singapore to win the honor, after [Maggie Tan](/wiki/Maggie_Lim) in 1930. ## Career Oehlers trained as a physician at the [London School of Medicine for Women](/wiki/London_School_of_Medicine_for_Women), and stayed in London during World War II, serving as a lieutenant in the Royal Army Medical Corps. She went to Belgium with the [British Liberation Army](/wiki/British_Liberation_Army) in March 1945, and served at a military hospital in [Ostend](/wiki/Ostend), and at medical stations in Egypt and Palestine. She returned to Singapore after demobilization, and became a Lady Medical Officer in Singapore in 1947. She resigned as a Lady Medical Officer in 1950. ## Personal life At age 45, Oehlers married British civil engineer William Peter Winston in 1959. Her husband served in the Indian Army during World War II. She died in 1990, in her seventies, in England. Portal: - Biography\n",
  "language": "en",
  "processed_at": "2026-01-12T12:09:02.836801",
  "title": "Thora Oehlers",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Thora_Oehlers"
}