{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:09:17.391656"
  },
  "content": "Defunct low-cost airline of Singapore (2003–2017) **Tiger Airways Singapore Pte Ltd**, operating as **Tigerair**, was a [low-cost airline](/wiki/Low-cost_airline) headquartered in [Singapore](/wiki/Singapore). It operated services to regional destinations in Southeast Asia, Bangladesh, Taiwan, China and India from its main base at [Singapore Changi Airport](/wiki/Singapore_Changi_Airport). It was founded as an independent airline in 2003, and was listed on the Singapore Stock Exchange under the [Tiger Airways Holdings](/wiki/Tiger_Airways_Holdings) name in 2010. In October 2014, parent company Tiger Airways Holdings became a subsidiary of the [SIA Group](/wiki/Singapore_Airlines), who took a 56% ownership stake. On 18 May 2016, [Singapore Airlines](/wiki/Singapore_Airlines) established *[Budget Aviation Holdings](/wiki/Budget_Aviation_Holdings)*, a holding company to own and manage its budget airlines [Scoot](/wiki/Scoot) and *Tiger Airways* following the delisting of Tiger Airways from the Singapore Stock Exchange in response to the complete takeover of Tigerair by Singapore Airlines. Tigerair merged with Scoot on 25 July 2017, retaining its [air operator's certificate](/wiki/Air_operator%27s_certificate) while operating under the Scoot brand. ## History ### Establishment Tiger Airways Singapore was incorporated on 12 December 2003 and began ticket sales on 31 August 2004. It has its head office in the Honeywell Building in Changi, Singapore. Services commenced on 15 September 2004 to Bangkok. Scheduled international services are operated from Singapore Changi Airport. The airline is a subsidiary of Tiger Airways Holdings, a Singapore-based company. In 2006, the airline flew 1.2 million passengers, a growth of 75% from the previous year. The airline was the first to operate from the Budget Terminal at Changi Airport as part of its cost-saving operations structure, similar to [Ryanair](/wiki/Ryanair)'s. Despite regional competition, the airline has reiterated its current intention to remain focused on flying within a five-hour radius from its Singaporean base. As of 25 September 2012, Tigerair Singapore operates from Singapore Changi Airport Terminal 2 due to the demolition of the Budget Terminal to make way for Terminal 4, completed in 2017. ### Route strategy This section **does not cite any sources**. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. *(November 2012)* *(Learn how and when to remove this message)* The airline encountered a period of relative difficulty for the aviation industry with rising oil prices and intense competition from other airlines. The airline held off imposing fuel surcharges as its competitors had done. With [Singapore Airlines](/wiki/Singapore_Airlines) (SIA) having a stake in the airline, the airline occasionally fills in the gap when SIA drops its services from certain destinations. Macau, once served by SIA before being taken up by its subsidiary, SilkAir, in 2002, terminated all flights completely by the end of 2004. Three months later, the route was taken over by Tigerair with flights commencing 25 March 2005. A similar pattern can be observed in Krabi, where SilkAir suspended services in February 2005 in the wake of the effects of the 2004 Indian Ocean earthquake. Tigerair resumed direct services to the location on 7 October 2005. In late July 2005, it was announced that the airline would commence flights from Macau to Manila (Clark) on 30 October 2005, a much-heralded move as it may signal the establishment of a secondary base besides Singapore, allowing the airline to expand and diversify risks. On 21 September 2005, the company produced a report card on its first year of operations, with a total of over 500,000 passengers carried, 5000 scheduled flights flown, and a flight completion rate of 98.7 per cent. 94 per cent of flight departures and 90 per cent of arrivals took place according to schedule. It acquired four aircraft and launched a total of nine routes – of which four are flown exclusively by the airline – during the year. The airline expected to increase its fleet to nine Airbus A320 aircraft by end-2006, and to carry up to three million passengers a year by then. It also hoped to add six more routes during the year, primarily to destinations in China and India, with flights to [Southern China](/wiki/South_China) having commenced in April. The airline also announced its switch from Singapore Airport Terminal Services to Swissport for ground handling once it became the first airline to operate at the newly opened Budget Terminal in Changi Airport on 26 March 2006. Tigerair became the first Singaporean low-cost carrier to receive operating permits from the Chinese aviation authorities to fly to the southern Chinese cities of [Haikou](/wiki/Haikou), [Guangzhou](/wiki/Guangzhou), and [Shenzhen](/wiki/Shenzhen) in an announcement on 21 February 2006. Ticket sales to these destinations commenced on 24 February 2006, with the first flight to Shenzhen taking place on 15 April, to Haikou from 26 April and to Guangzhou from 27 April 2006. The airline has since indicated that the routes were highly popular, with increased flights to Haikou and Guangzhou less than three months since their launch. In June 2006, flights to [Da Nang](/wiki/Da_Nang) were suspended. On 20 July 2006, the media reported on the airline's intentions to increase its routes from 15 to 20 and to establish a second base city by the end of the year. Possible growth regions included China, [Southern India](/wiki/South_India), [Cambodia](/wiki/Cambodia) and [Brunei](/wiki/Brunei). The airline's plan for a possible initial public offering was also revealed. At the same time, it announced that it saw an increase of 81 per cent in passengers carried in the months of April to June since its move to the Budget Terminal in March, compared to the same period in the previous year. Tigerair started services from Singapore to [Perth](/wiki/Perth) on 23 March 2007. On 25 October 2010, Tigerair announced that it would withdraw from [Bangalore](/wiki/Bangalore) effective 14 November 2010, citing no reason. Tigerair resumed its flights between Singapore and Bangalore on 31 October 2011. On 19 August 2015, Tigerair announced it was expanding its network with the addition of Quanzhou and Lucknow as new destinations, commencing services on 28 September and 3 December respectively. ### Merging with Scoot On 4 November 2016, the parent company of Tigerair, [Singapore Airlines](/wiki/Singapore_Airlines) announced a merger of Tigerair and Scoot with Tigerair coming into the Scoot brand. It will allow both airlines to achieve synergies in fare costs and revenue and operate under the same [Air operator's certificate](/wiki/Air_operator%27s_certificate) or AOC. Tigerair officially merged with Scoot and began operating under the Scoot brand on 25 July 2017, while the rebranding will leave the joint-venture Tigerair Australia and Tigerair Taiwan intact as Tigerair Australia 100% owned by Virgin Australia (Virgin Australia retains the Tigerair name and acquire the brand rights for Tigerair to operate to some international destinations from Australia.), while Tigerair Taiwan co-owned by China Airlines (80%) and its subsidiary Mandarin Airlines (10%) (with Tigerair hold 10%), respectively. On July 25, 2017, Scoot changed its IATA code from TZ to TR because Tigerair used TR, and also changed their ICAO code from SCO to TGW. On 13 January 2022, [Tigerair Taiwan](/wiki/Tigerair_Taiwan) bought \"Tigerair\" brand ownership from Tigerair, making the company the sole brand owner. ## Destinations At the time of its integration with [Scoot](/wiki/Scoot), Tigerair flew from Singapore to 38 destinations. For merged network, see [List of Scoot destinations](/wiki/List_of_Scoot_destinations). ### Codeshare agreements Tigerair had a [codeshare agreement](/wiki/Codeshare_agreement) with: - [Golden Myanmar Airlines](/wiki/Golden_Myanmar_Airlines) (suspended from 22 April 2015) On 16 May 2016, Tigerair joined the world's largest low-cost carrier alliance, Value Alliance. The new alliance was started with Philippines' Cebu Pacific, South Korea's Jeju Air, Thailand's Nok Air and NokScoot, Tigerair Singapore, Tigerair Australia and Japan's Vanilla Air. ## Corporate management Tigerair's original founding shareholders were [Singapore Airlines](/wiki/Singapore_Airlines) (49%), [Bill Franke](/wiki/Bill_Franke)'s Indigo Partners (24%); [Tony Ryan](/wiki/Tony_Ryan)'s Irelandia Investments (16%) and [Temasek Holdings](/wiki/Temasek_Holdings) (11%). Tigerair Singapore is wholly owned by [Tiger Airways Holdings](/wiki/Tiger_Airways_Holdings) Limited, a holding company set up in 2007 to manage both Tiger Airways and start-up Australian subsidiary [Tigerair Australia](/wiki/Tigerair_Australia), which has since been disposed to [Virgin Australia](/wiki/Virgin_Australia). Tiger Airways Holdings Limited is listed on [SGX](/wiki/Singapore_Exchange) since 2010. In October 2014, the Singapore Airlines group increased its stake to take a majority ownership in Tiger Airways Holdings, and according to the 2015 Annual Report Singapore Airlines Limited has a 56% ownership of the company: In November 2015, Singapore Airlines announced an offer to acquire the remaining 44.23% stake in Tiger Airways Holdings Limited for $0.41 per share. This represents a $0.10 premium, or 32% more than the price before the takeover was announced. The offer was conditional upon Singapore Airlines owning more than 90% of Tiger Airways, however Singapore Airlines has since extended the offer until 8 January 2016, for it currently only owns 74.5% of Tigerair. ### Business trends The following table shows the business trends of Tigerair Singapore, excluding other Tigerair subsidiaries and associated airlines. Year ending 31 March2009201020112012201320142015Total revenue (S$m)268.0277.9341.8460.9611.0639.0677.4Operating profit (S$m)12.225.053.8−16.057.0−59.0−39.9Passengers booked (thousands)3,9034,3935,0685,140*- passenger change year-on-year*12.6%15.4%1.4%Passenger load factor (%)85.481.084.378.182.1Number of aircraft (at year end)9101418202727*Sources* ## Fleet At the time the airline merged with [Scoot](/wiki/Scoot), the Tigerair fleet consisted of the following all-[Airbus](/wiki/Airbus) aircraft: **Tigerair fleet** AircraftNumberPassengersNotesJYTotal[Airbus A319-100](/wiki/Airbus_A319-100)2—144144Transferred to [Scoot](/wiki/Scoot).[Airbus A320-200](/wiki/Airbus_A320-200)21—180180Total31 On 21 June 2007, Tigerair announced it had signed a [letter of intent](/wiki/Letter_of_intent) to purchase 30 aircraft worth [US$](/wiki/US$)2.2 billion, with another 20 on option. These would be delivered between 2011 and 2014. On 10 October 2007, Tigerair confirmed the letter of intent signed in June. The new aircraft will be deployed in Tigerair's Asia-Pacific network and the domestic operations in Australia. On 18 December 2007, Tigerair announced that it had taken up the options and made further orders to take their fleet of Airbus A320s to 70 in total. On 24 March 2014, Tigerair signed a Memorandum of Understanding (MOU) with Airbus to purchase 37 [Airbus A320neo](/wiki/Airbus_A320neo) aircraft with 13 options. In October 2014, Tigerair announced 12 aircraft would be subleased to IndiGo over three to four years to reduce excess capacity. ## In-flight ### Seating All aircraft offered single-class economy seating of 144 and 180 seats in the Airbus A319 and A320 aircraft, respectively. Each seat measured up to 20.5 in (52.1 cm) in width and had a seat pitch of 28 in (71.1 cm) for standard rows and 34 in (86.4 cm) for exit rows. ### Food and beverage Tigerair offered food and beverages available for purchase as part of a [buy on board](/wiki/Buy_on_board) programme - *Tigerbites*. The menu offered light meals such as instant noodles, sandwiches and salads. Hot and cold beverages as well as liquor were also available for purchase. ### Entertainment A bi-monthly in-flight magazine, *Tiger Tales*, was provided free for all passengers. - Singapore portal - Companies portal - Aviation portal - [Tiger Airways Holdings](/wiki/Tiger_Airways_Holdings) - [Tigerair Mandala](/wiki/Tigerair_Mandala) - [Tigerair Australia](/wiki/Tigerair_Australia) - [Tigerair Taiwan](/wiki/Tigerair_Taiwan) - [Cebgo](/wiki/Cebgo) Media related to Tigerair at Wikimedia Commons - Tigerair (tigerair.com) at the [Wayback Machine](/wiki/Wayback_Machine) (archive index) - Tigerair (www.tigerairways.com) at the [Wayback Machine](/wiki/Wayback_Machine) (archive index)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:09:17.391294",
  "title": "Tigerair",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tigerair"
}