{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:09:11.352047"
  },
  "content": "Singaporean brand of beer **Tiger Beer** is a [Singaporean](/wiki/Singapore) brand of beer first launched in 1932. It is currently produced by [Heineken Asia Pacific](/wiki/Heineken_Asia_Pacific), formerly known as Asia Pacific Breweries. The company is a joint venture between [Heineken N.V.](/wiki/Heineken_N.V.) and Singaporean multinational [food and beverage](/wiki/Food_and_beverage) company [Fraser and Neave](/wiki/Fraser_and_Neave). The Tiger Brewery Tour is a [tourist attraction](/wiki/Tourist_attraction) located in the [Tuas](/wiki/Tuas) district of the country, which offers guided visits as to how the beer is brewed. According to a Brand Finance report, Tiger is among Singapore's 10 most valuable brands. ## Beers Launched in 1932, Tiger beer became Singapore's first locally brewed beer. It is a 5% [abv](/wiki/Alcohol_by_volume) bottled [pale lager](/wiki/Pale_lager). Heineken Asia Pacific's flagship brand, is available in more than 60 countries worldwide. ### Products The brewery currently produces several brands of beer. - Tiger Beer - Tiger Crystal - Tiger White - Tiger Black - Tiger Radler (Lemon, Grapefruit, Mandarin and Honey, Pomelo) - Tiger platinum - Tiger [Soju](/wiki/Soju) (Plum, Green Grape) ## Marketing The \"It's Time for a Tiger\" [slogan](/wiki/Slogan) for Tiger Beer has run for decades since its inception in the 1930s. The writer [Anthony Burgess](/wiki/Anthony_Burgess) named his first novel *[Time for a Tiger](/wiki/Time_for_a_Tiger)* (the first part of the Malayan trilogy *[The Long Day Wanes](/wiki/The_Long_Day_Wanes)*) as the beer was popular in Malaya in the 1950s, where Burgess was working. Burgess reveals in his autobiography that, when his *[Time for a Tiger](/wiki/Time_for_a_Tiger)* was published, he asked the manufacturer, then Fraser and Neave, for a complimentary clock with the Tiger beer slogan. The brewery declined to offer this or any other gift to him. But, fourteen years later, when Burgess was more famous, it relented. In 1970, the company offered Burgess the privilege to consume any of their beers free of charge while in Singapore. However, in his own words, Burgess wrote in response: \"But it was too late, I had become wholly a [gin](/wiki/Gin) man.\" The [Tiger Sky Tower](/wiki/Tiger_Sky_Tower) operated in [Sentosa](/wiki/Sentosa) until 2018. ## Awards Tiger Beer has entered several beer-tasting competitions and has performed well. At the 2011 World Quality Selections, organised by [Monde Selection](/wiki/Monde_Selection), the brand won a Gold [Quality](/wiki/Food_quality) award. ## Tiger in popular culture ### Film The beer was also seen in the 2002 movie *[The Transporter](/wiki/The_Transporter)* with *[Jason Statham](/wiki/Jason_Statham)*. Crates of Tiger appeared in the 2008 film *[Tropic Thunder](/wiki/Tropic_Thunder)*. Also, in the 2001 Hong Kong action thriller *[The Accidental Spy](/wiki/The_Accidental_Spy)* it's the preferred beer of Buck Yuen (played by [Jackie Chan](/wiki/Jackie_Chan)) who orders it by name in a bar and, also, has an empty bottle of Tiger by his bed in the next scene as he wakes up from a dream. In the movie *[The Odd Angry Shot](/wiki/The_Odd_Angry_Shot)* about the Australian Special Air Service during the Vietnam War, Tiger is considered the beer of choice among American and Aussie troops. Tiger is seen as a favourite among British troops during the [Malayan Emergency](/wiki/Malayan_Emergency) in the film *[The Virgin Soldiers](/wiki/The_Virgin_Soldiers_(film))*. ### Music In [Vietnam](/wiki/Vietnam), Tiger Beer regularly organizes music events. The first event took place in 2007 at tigermusic.com.vn. The event takes place every year. - Tiger remix 2017 in Vietnam - Tiger remix 2018 in Vietnam - Tiger remix 2019 in Vietnam - Tiger remix 2020 in Vietnam ### Television In the [Disney+](/wiki/Disney%2B) series, *[The Falcon and the Winter Soldier](/wiki/The_Falcon_and_the_Winter_Soldier)*, [Bucky Barnes / The Winter Soldier](/wiki/Bucky_Barnes_(Marvel_Cinematic_Universe)), played by [Sebastian Stan](/wiki/Sebastian_Stan) can be seen drinking one bottle of Tiger Beer in the premiere episode. - Official website - Tiger Brewery tour - Tiger music event website in Vietnam Archived 5 October 2022 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:09:11.351752",
  "title": "Tiger Beer",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tiger_Beer"
}