{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:09:15.444117"
  },
  "content": "Form of strict parenting **Tiger parenting** is a form of strict parenting, whereby parents are highly invested in ensuring their children's success. Specifically, tiger parents push their children to attain high levels of [academic achievement](/wiki/Academic_achievement) or success in high-status extracurricular activities such as music or sports. The term \"tiger mother\" (\"tiger mom\") was brought to public attention by [Yale Law School](/wiki/Yale_Law_School) professor [Amy Chua](/wiki/Amy_Chua) in her 2011 memoir *[Battle Hymn of the Tiger Mother](/wiki/Battle_Hymn_of_the_Tiger_Mother)*. The rise of Chua's memoir brought the tiger parent phenomenon into the American mainstream during the 2010s. Chua's concept and term \"tiger parent\" spawned numerous caricatures while also becoming the inspiration for the 2014–2015 Singaporean TV show *[Tiger Mum](/wiki/Tiger_Mum)*, the 2015 mainland Chinese drama *[Tiger Mom](/wiki/Tiger_Mom_(TV_series))*, and the 2017 Hong Kong series *[Tiger Mom Blues](/wiki/Tiger_Mom_Blues)*. The stereotype is a Chinese mother who relentlessly drives her child to study hard, without regard for the child's social and emotional development. The notion of a \"tiger parent\" is analogous to other [authoritarian parenting](/wiki/Parenting_styles#Authoritarian) stereotypes, such as the American [stage mother](/wiki/Stage_mother), the [Irish mammy](/wiki/Irish_mammy), the Japanese [kyōiku mama](/wiki/Ky%C5%8Diku_mama), and the \"[Jewish mother](/wiki/Stereotypes_of_Jews#Jewish_mother)\". Other similar or related terms include [helicopter parent](/wiki/Helicopter_parent), [monster parents](/wiki/Monster_parents), and [Hong Kong Kids phenomenon](/wiki/Hong_Kong_Kids_phenomenon). ## History and origin The origin of the concept, term, and [neologism](/wiki/Neologism) traces its roots in ancient Confucian teachings articulated through classical anthologies such as the *[Analects of Confucius](/wiki/Analects_of_Confucius)* written more than two millennia ago. The concept is influenced by [Confucianism](/wiki/Confucianism), an [ancient Chinese philosophy](/wiki/Chinese_philosophy) developed by the philosopher [Confucius](/wiki/Confucius) in the 5th century BC that promoted attributes such as [filial piety](/wiki/Filial_piety), [family values](/wiki/Family_values), hard work, enduring hardship, honesty, and dedicating oneself towards academic excellence through the pursuit of knowledge. As Chinese and East Asian society have been influenced by the thought of the ancient Chinese scholar, his teachings still plays a role in attitudes toward education in East Asia. Many contemporary Chinese families strive to inculcate the value and importance of an education in their child at a young age. Higher education is an overwhelmingly serious issue in Chinese society, where it is viewed as one of the fundamental cornerstones of Chinese culture and life. Education is regarded with a high priority for Chinese families as success in education holds a cultural status as well as a necessity to improve one's socioeconomic position in Chinese society. These values are embedded deeply in Chinese culture, parent-child relations and parents' expectations for their children. For the Chinese, the importance of education was considered a crucial means for channeling one's upward social mobility in ancient and medieval Chinese societies. In contemporary mainland China, national examinations such as the *[Gaokao](/wiki/Gaokao)* remain the primary path for channeling one's upward social mobility. ## Characteristics While the phrase \"tiger mother\" is often used, denoting a concept not widely known until the publication of Chua's book, the broader phrase \"tiger parenting\" recognizes the role that fathers or other parent-figures can play. ### Strict parenting Tiger parents emphasize academic pursuits and highly encourage their children to participate in activities that improve those children's prospects for acceptance at elite universities. Such parents typically put the greatest emphasis on core academic subjects such as math, science, and language arts. ### High expectations Tiger parents emphasize not only academics, but also non-academic pursuits, such as music and sports, that involve opportunities for awards, rankings, and similar forms of recognition. Such striving for recognition may reflect a Confucian cultural value system, which esteems extrinsic rewards. While Western parents may see the emphasis on academic achievement as a source of stress, Chinese parents often see such stress on their children as a sign of good parenting. ### Discipline Compared to hands-off or permissive parenting techniques, Tiger parenting requires more psychological and behavioral control over children, with a heavier emphasis on the promotion of courtesy and obedience and a lower tolerance for behavioral problems. Children raised by tiger parents may be met with [emotional threats and physical punishments](/wiki/Corporal_punishment). Chua's memoir *[Battle Hymn of the Tiger Mother](/wiki/Battle_Hymn_of_the_Tiger_Mother)* mentions an incident in which she yelled at her daughters, calling them \"garbage\" in public, and recounts Chua's refusal to let her daughters watch TV at night or participate in sleepovers with schoolmates. Tiger parents' emphasis on academics has been portrayed as abuse in [Western society](/wiki/Western_world), but is seen as acceptable by many Asian parents. In a series of interviews with fifty Chinese mothers on the differences between Chinese and US parenting styles, mothers said that Chinese parents use \"strict discipline and firm control to ensure that their children act or behave according to their parents' wishes\" and that Chinese parents commonly \"use comparative words [to remind the child that] you are not as good as others, you need to catch up.\" Many have described their traditions as including [physical](/wiki/Human_body) and [emotional](/wiki/Emotional) closeness that ensures a lifelong bond between parent and child, as well as establishing parental authority and child obedience through [discipline](/wiki/Discipline). Use of violence within parenting is common in many Asian cultures, including [China](/wiki/China), [Hong Kong](/wiki/Hong_Kong), [India](/wiki/India), [Indonesia](/wiki/Indonesia), [Japan](/wiki/Japan), [Macau](/wiki/Macau), [Malaysia](/wiki/Malaysia), [Pakistan](/wiki/Pakistan), [Philippines](/wiki/Philippines), [Singapore](/wiki/Singapore), [South Korea](/wiki/South_Korea), [Taiwan](/wiki/Taiwan), [Thailand](/wiki/Thailand) and [Vietnam](/wiki/Vietnam). In the [Western world](/wiki/Western_world), tiger parenting is deemed as alleged [child abuse](/wiki/Child_abuse), but is considered parental devotion within cultures where it is accepted, such as in [Latin America](/wiki/Latin_America), [Africa](/wiki/Africa), and [Eastern Europe](/wiki/Eastern_Europe). Severe forms of violence may include spanking or slapping the child with an open hand or striking with an available household implement such as a belt, slipper, cane, clothes hanger, meter stick, hairbrush, paddle or bamboo feather duster. A 2010 study on Chinese parenting and the predictors of the use of physical violence in parenting found \"significant associations between physical discipline and parent report of child school problems\". ### Commitment to excellence Chua cites her parents' newfound immigration experience in the United States and intense struggle to set their roots in a foreign land as the reason inevitably prompting them to adopt a more utilitarian approach towards raising their children. In her memoir, Chua brings up Confucius to elucidate why Chinese parents feel that their children are indebted to them due to all the sacrifices the previous parental generation made to secure a better life for their children. Tiger parents enforce high expectations regarding their children's academic performance. In some extreme cases, these expectations may be held unrealistically high regardless of the child's ability or passion for studying. Tiger parents may exhibit unrealistic expectations for the child's academic performance where \"B\" and even mid to low end \"A\" grades are not tolerated. Tiger parents put a heavy emphasis on the pursuit of academic success by eschewing the [lax parenting style](/wiki/Parenting_styles#Indulgent_parenting)[*broken anchor*] typically exhibited by many liberal Western parents. Tiger parents may impose choices on their children as to which interests they choose to pursue. Critics of the tiger parenting argue that this approach will restrict their children's ability to discover their individual talents and passions thus denying the child a sense of belonging, self-esteem, and purpose. On the other hand, proponents for tiger parenting argue that their parenting strategy imbues children with self-control, self-regulation and self-discipline and will not produce excellent academic results if they let their child to drift freely to develop their own interests. Chinese Confucian philosophy has traditionally emphasized [self-improvement](/wiki/Self-improvement). As a result, tiger parents often make sure that their children work conscientiously on their schoolwork to help secure better grades and an overall superior academic performance. ### Exam-oriented education Many Asian countries often adopt a strict exam-oriented approach in teaching, which encourages [rote memorization.](/wiki/Rote_learning) Some argue that this approach encourages uniformity while eschewing creativity, questioning, student participation, [self-determination](/wiki/Self-determination), [autonomy](/wiki/Autonomy), [diversity](/wiki/Diversity_(politics)) and [critical](/wiki/Critical_thinking) or independent thinking. Tiger parents often put children in tutorial classes as early as the preschool stage. Typically, throughout the child's academic career, the mother's attempts to help the child obtain outstanding results in exams to secure a seat in prestigious schools, with the end goal of entering a top-notch university in mind. ### Cultural influences In various Asian societies, a higher education level is perceived as a guarantee of promising career prospects and as a tool to climb up the socioeconomic ladder or to lift a family out of poverty. In the *Analects of Confucius*, education is a central theme with philosophical ideas and sayings that placed great value on work ethic and the pursuit of knowledge. The Confucian ideal argued that education is a passport to higher socioeconomic status and wealth. In ancient and medieval East Asian societies, [scholar-officials](/wiki/Scholar-official) had a high social status and intellectuals were held in high esteem, well above than that of wealthy [landowners, businessmen, and merchants](/wiki/Four_occupations#The_shang_(商)). Thus, tiger parents pin high hope on their children, taking much pride in their children's academic achievements and may flaunt them to other parents when comparing their own children with the academic achievements of others. Chinese immigrant parents in the West argue that \"high academic achievement\" reflects \"successful parenting\" while parents who have children that bring home inferior academic records are seen as irresponsible parents who are not doing their job. One historical explanation for the strict examination approach stems from the [Imperial examination](/wiki/Imperial_examination) system of China for civil service government positions. Success in the civil examination administered by the royal court was seen as a sure conduit to improve a family's socioeconomic position. Since such positions were scarce with many applicants applying for few opening positions, competition was fierce and these positions were highly coveted, as only a select few could succeed and attain them. Tiger parents recognize how crucial self-discipline is in gaining success, so they may try to instill the value of an exam-oriented education into their children as early as possible. ### Views on success and achievement Tiger parents perceive a narrow definition of success that is rooted solely in a high level of academic and intellectual achievement. As academic success is often a source of pride for families and within Chinese and Asian society at large, tiger parents typically view \"success\" as graduating from a top university such as [Harvard](/wiki/Harvard), or other [Ivy League](/wiki/Ivy_League) institutions as the ultimate marker of prestige, granting high socioeconomic status, promising marriage prospects, and a highly respectable lucrative white collar career path such as becoming a high-end neurosurgeon for [Mayo Clinic](/wiki/Mayo_Clinic), a high-powered lawyer at a top law [Wall Street](/wiki/Wall_Street) law firm, a software engineer in [Silicon Valley](/wiki/Silicon_Valley), a management consultant for [Boston Consulting Group](/wiki/Boston_Consulting_Group), or as an investment banker working for [Goldman Sachs](/wiki/Goldman_Sachs). Tiger mothers also incorporate classical music training or extracurricular enrichment activities such as joining a sports team, including those with competitive structures and awards systems to bolster their child's university entrance application. This kind of early life training illustrates the tiger parent's zeal for education and the desire for their children to get into a prestigious university as tiger parents see the entrance into a top tier higher educational institution as a ticket that leads to a prestigious, rewarding, and lucrative white collar career filled with socioeconomic success. Tiger parents may look down on careers beneath their expectations – that is, a truck driver may be viewed as less socially respectable than a neurosurgeon. ## Effects This section needs to be **updated**. Please help update this article to reflect recent events or newly available information. *(December 2025)* Advocates suggest a strict approach to parenting produces an exceptionally high proportion of top performers – children who display academic excellence across the board with great musical ability and professional success later in life. In a three-part series on competition in Hong Kong's education system by the *[South China Morning Post](/wiki/South_China_Morning_Post)*, many Hong Kong parents revealed that cultural fears over economic hardship motivated them to begin thinking of their children's futures as professionals soon after birth, striving to find the best playgroups, and encouraging competition among children in academics, sports and music, in the belief that this fosters competitiveness and increases their children's chances of entering a better pre-nursery school and elite kindergarten, and determine their eventual success at primary schools, secondary schools and universities. However, many other Hong Kong parents, psychologists and educators assert that pushing children too hard does not work and can even harm children. Children raised under tiger parent households may experience negative mental health outcomes as a result of the large amount of pressure they are placed under from a young age. A study on the Asian American parenting model found that harsh or inconsistent parental response to the misbehavior of children has been \"strongly correlated to internalization of problems (e.g., [anxiety](/wiki/Anxiety_disorder), [depression](/wiki/Major_depressive_disorder), [somatization](/wiki/Somatic_symptom_disorder))\" in children. These mental health and psychiatric problems may create psychological problems that make these children feel like \"failures\". When parents do not provide coping strategies to their children and guide alongside to manage negative feelings, such loneliness may transition into depression and suicide. Tiger parenting has been blamed for high rates of suicide in East Asia, particularly [South Korea](/wiki/Suicide_in_South_Korea), which has some of the highest [suicide rates](/wiki/List_of_countries_by_suicide_rate) in the developed world. There is a growing trend of children aged five to twelve seeking psychiatric help and even contemplating suicide. In reaction, some parents have relaxed their formerly strict discipline with their children, and some schools have modified their admissions requirements to be less demanding. - [Kyoiku mama](/wiki/Kyoiku_mama), a similar parenting style in Japan - [Helicopter parent](/wiki/Helicopter_parent), a similar parenting style in the United States - [Concerted cultivation](/wiki/Concerted_cultivation) - [Free-range parenting](/wiki/Free-range_parenting) for the opposite approach - [Overqualification](/wiki/Overqualification) - [Credentialism](/wiki/Educational_inflation) - [Population decline](/wiki/Population_decline) - [Evolutionary psychology of parenting](/wiki/Evolutionary_psychology_of_parenting)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:09:15.443849",
  "title": "Tiger parenting",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tiger_parenting"
}