{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:09:06.129304"
  },
  "content": "Species of large cat The **tiger** (***Panthera tigris***) is a large [cat](/wiki/Felidae) and a member of the genus *[Panthera](/wiki/Panthera)* native to [Asia](/wiki/Asia). It has a powerful, muscular body with a large head and paws, a long tail and orange fur with black, mostly vertical stripes. It is traditionally classified into nine [recent](/wiki/Holocene) [subspecies](/wiki/Subspecies), though some recognise only two subspecies, mainland Asian tigers and the island tigers of the [Sunda Islands](/wiki/Sunda_Islands). Throughout the tiger's range, it inhabits mainly [forests](/wiki/Forest), from [coniferous](/wiki/Conifer) and [temperate broadleaf and mixed forests](/wiki/Temperate_broadleaf_and_mixed_forest) in the [Russian Far East](/wiki/Russian_Far_East) and [Northeast China](/wiki/Northeast_China) to [tropical and subtropical moist broadleaf forests](/wiki/Tropical_and_subtropical_moist_broadleaf_forests) on the [Indian subcontinent](/wiki/Indian_subcontinent) and [Southeast Asia](/wiki/Southeast_Asia). The tiger is an [apex predator](/wiki/Apex_predator) and preys mainly on [ungulates](/wiki/Ungulate), which it takes by ambush. It lives a mostly solitary life and occupies [home ranges](/wiki/Home_range), defending these from individuals of the same sex. The range of a male tiger overlaps with that of multiple females with whom he mates. Females give birth to usually two or three cubs that stay with their mother for about two years. When becoming independent, they leave their mother's home range and establish their own. Since the early 20th century, tiger populations have lost at least 93% of their historic range and are [locally extinct](/wiki/Local_extinction) in [West](/wiki/West_Asia) and [Central Asia](/wiki/Central_Asia), in large areas of [China](/wiki/China) and on the islands of [Java](/wiki/Java) and [Bali](/wiki/Bali). Today, the tiger's range is severely fragmented. It is listed as [Endangered](/wiki/Endangered_species_(IUCN_status)) on the [IUCN Red List of Threatened Species](/wiki/IUCN_Red_List_of_Threatened_Species), as its range is thought to have declined by 53% to 68% since the late 1990s. Major threats to tigers are [habitat destruction](/wiki/Habitat_destruction) and [fragmentation](/wiki/Habitat_fragmentation) due to [deforestation](/wiki/Deforestation), [poaching](/wiki/Poaching) for fur and the illegal trade of body parts for medicinal purposes. Tigers are also victims of [human–wildlife conflict](/wiki/Human%E2%80%93wildlife_conflict) as they attack and prey on livestock in areas where natural prey is scarce. The tiger is legally protected in all range countries. National conservation measures consist of action plans, [anti-poaching](/wiki/Anti-poaching) patrols and schemes for monitoring tiger populations. In several range countries, [wildlife corridors](/wiki/Wildlife_corridor) have been established and tiger reintroduction is planned. The tiger is among the most popular of the world's [charismatic megafauna](/wiki/Charismatic_megafauna). It has been kept in captivity since ancient times and has been trained to perform in [circuses](/wiki/Circus) and other entertainment shows. The tiger featured prominently in the ancient [mythology](/wiki/Mythology) and [folklore](/wiki/Folklore) of cultures throughout its historic range and has continued to [appear in culture](/wiki/Cultural_depictions_of_tigers) worldwide. ## Etymology The [Old English](/wiki/Old_English) *tigras* derives from [Old French](/wiki/Old_French) *tigre*, from [Latin](/wiki/Latin) *tigris*, which was a borrowing from *tigris* ([Ancient Greek](/wiki/Ancient_Greek_language): τίγρις). Since ancient times, the word *tigris* has been suggested to originate from the [Armenian](/wiki/Armenian_language) or [Persian](/wiki/Persian_language) word for 'arrow', which may also be the origin of the name for the river [Tigris](/wiki/Tigris). However, today, the names are thought to be [homonyms](/wiki/Homonyms), and the connection between the tiger and the river is doubted. ## Taxonomy In 1758, [Carl Linnaeus](/wiki/Carl_Linnaeus) described the tiger in his work *[Systema Naturae](/wiki/Systema_Naturae)* and gave it the [scientific name](/wiki/Scientific_name) *Felis tigris*, as the genus *Felis* was being used for all cats at the time. His [scientific description](/wiki/Scientific_description) was based on descriptions by earlier naturalists such as [Conrad Gessner](/wiki/Conrad_Gessner) and [Ulisse Aldrovandi](/wiki/Ulisse_Aldrovandi). In 1929, [Reginald Innes Pocock](/wiki/Reginald_Innes_Pocock) placed the species in the genus *[Panthera](/wiki/Panthera)* using the scientific name *Panthera tigris*. ### Subspecies Nine [recent](/wiki/Holocene) tiger [subspecies](/wiki/Subspecies) have been proposed between the early 19th and early 21st centuries, namely the [Bengal](/wiki/Bengal_tiger), [Malayan](/wiki/Malayan_tiger), [Indochinese](/wiki/Indochinese_tiger), [South China](/wiki/South_China_tiger), [Siberian](/wiki/Siberian_tiger), [Caspian](/wiki/Caspian_tiger), [Javan](/wiki/Javan_tiger), [Bali](/wiki/Bali_tiger) and [Sumatran tigers](/wiki/Sumatran_tiger). The [validity](/wiki/Valid_name_(zoology)) of several tiger subspecies was questioned in 1999 as most putative subspecies were distinguished on the basis of fur length and colouration, striping patterns and body size of specimens in [natural history museum](/wiki/Natural_history_museum) collections that are not necessarily representative for the entire population. It was proposed to recognise only two tiger subspecies as valid, namely *P. t. tigris* in mainland Asia and the smaller *P. t. sondaica* in the [Greater Sunda Islands](/wiki/Greater_Sunda_Islands). This two-subspecies proposal was reaffirmed in 2015 through a comprehensive analysis of morphological, ecological and [mitochondrial DNA](/wiki/Mitochondrial_DNA) (mtDNA) traits of all putative tiger subspecies. In 2017, the Cat Classification Task Force of the IUCN Cat Specialist Group revised [felid](/wiki/Felidae) taxonomy in accordance with the 2015 two-subspecies proposal and recognised only *P. t. tigris* and *P. t. sondaica*. Results of a 2018 [whole-genome sequencing](/wiki/Whole-genome_sequencing) study of 32 samples from the six living putative subspecies—the Bengal, Malayan, Indochinese, South China, Siberian and Sumatran tiger—found them to be distinct and separate [clades](/wiki/Clade). These results were corroborated in 2021 and 2023. A 2023 study found validity for all nine recent subspecies. The Cat Specialist Group states that \"Given the varied interpretations of data, the [subspecific] taxonomy of this species is currently under review by the IUCN SSC Cat Specialist Group.\" The following tables are based on the [classification](/wiki/Taxonomy_(biology)) of the tiger as of 2005, and also reflect the classification recognised by the Cat Classification Task Force in 2017. *Panthera tigris tigris* (Linnaeus, 1758) PopulationDescriptionImage[Bengal tiger](/wiki/Bengal_tiger) formerly *P. t. tigris* (Linnaeus, 1758)This population inhabits the [Indian subcontinent](/wiki/Indian_subcontinent). The Bengal tiger has shorter fur than tigers further north, with a light [tawny](/wiki/Tawny_(color)) to orange-red colouration, and relatively long and narrow nostrils.[†](/wiki/Extinction) [Caspian tiger](/wiki/Caspian_tiger) formerly *P. t. virgata* ([Illiger](/wiki/Johann_Karl_Wilhelm_Illiger), 1815)This population occurred from [Turkey](/wiki/Turkey) to around the [Caspian Sea](/wiki/Caspian_Sea). It had bright rusty-red fur with thin and closely spaced brownish stripes, and a broad [occipital bone](/wiki/Occipital_bone). Genetic analysis revealed that it was closely related to the Siberian tiger. It has been extinct since the 1970s.[Siberian tiger](/wiki/Siberian_tiger) formerly *P. t. altaica* ([Temminck](/wiki/Coenraad_Jacob_Temminck), 1844)This population lives in the [Russian Far East](/wiki/Russian_Far_East), [Northeast China](/wiki/Northeast_China) and possibly [North Korea](/wiki/North_Korea). The Siberian tiger has long hair and dense fur. Its ground colour varies widely from [ochre](/wiki/Ochre)-yellow in winter to more reddish and vibrant after moulting. The skull is shorter and broader than the skulls of tigers further south.[South China tiger](/wiki/South_China_tiger) formerly *P. t. amoyensis* ([Hilzheimer](/wiki/Max_Hilzheimer), 1905)This tiger historically lived in south-central China. The skulls of the five [type specimens](/wiki/Type_specimen) had shorter [carnassials](/wiki/Carnassial) and [molars](/wiki/Molar_(tooth)) than tigers from India, a smaller cranium, [orbits](/wiki/Orbit_(anatomy)) set closer together and larger [postorbital processes](/wiki/Orbital_process_of_the_zygomatic_bone); skins were yellowish with [rhombus](/wiki/Rhombus)-like stripes. It has a unique mtDNA [haplotype](/wiki/Haplotype) due to interbreeding with ancient tiger lineages. It is [extinct in the wild](/wiki/Extinct_in_the_wild) as there has not been a confirmed sighting since the 1970s, and survives only in captivity.[Indochinese tiger](/wiki/Indochinese_tiger) formerly *P. t. corbetti* ([Mazák](/wiki/Vratislav_Maz%C3%A1k), 1968)This tiger population occurs on the [Indochinese Peninsula](/wiki/Indochinese_Peninsula). Indochinese tiger specimens have smaller craniums than Bengal tigers and appear to have darker fur with somewhat thin stripes.[Malayan tiger](/wiki/Malayan_tiger) formerly *P. t. jacksoni* (Luo et al., 2004)The Malayan tiger was proposed as a distinct subspecies on the basis of mtDNA and [micro-satellite sequences](/wiki/DNA_sequences) that differ from the Indochinese tiger. It does not differ significantly in fur colour or skull size from Indochinese tigers. There is no clear geographical barrier between tiger populations in northern [Malaysia](/wiki/Malaysia) and southern [Thailand](/wiki/Thailand).*Panthera tigris sondaica* (Temminck, 1844) PopulationDescriptionImage†[Javan tiger](/wiki/Javan_tiger) formerly *P. t. sondaica* (Temminck, 1944)This tiger was described based on an unspecified number of skins with short and smooth hair. Tigers from [Java](/wiki/Java) were small compared to tigers of the Asian mainland, had relatively elongated skulls compared to the Sumatran tiger and longer, thinner and more numerous stripes. The Javan tiger is thought to have gone extinct by the 1980s.†[Bali tiger](/wiki/Bali_tiger) formerly *P. t. balica* ([Schwarz](/wiki/Ernst_Schwarz_(zoologist)), 1912)This tiger occurred on [Bali](/wiki/Bali) and had brighter fur and a smaller skull than the Javan tiger. A typical feature of Bali tiger skulls is the narrow occipital bone, which is similar to the Javan tiger's skull. This population went extinct in the 1940s.[Sumatran tiger](/wiki/Sumatran_tiger) formerly *P. t. sumatrae* ([Pocock](/wiki/Reginald_Innes_Pocock), 1929)The type specimen from [Sumatra](/wiki/Sumatra) had dark fur. The Sumatran tiger has particularly long hair around the face, thick body stripes and a broader and smaller [nasal bone](/wiki/Nasal_bone) than other island tigers. ### Evolution *[Panthera](/wiki/Panthera)* [Snow leopard](/wiki/Snow_leopard) **Tiger** [Jaguar](/wiki/Jaguar) [Leopard](/wiki/Leopard) [Lion](/wiki/Lion) Phylogeny of the genus *Panthera* based on a 2016 [nuclear DNA](/wiki/Nuclear_DNA) study The tiger shares the genus *Panthera* with the [lion](/wiki/Lion), [leopard](/wiki/Leopard), [jaguar](/wiki/Jaguar) and [snow leopard](/wiki/Snow_leopard). Results of genetic analyses indicate that the tiger and snow leopard are [sister species](/wiki/Sister_taxon) whose [lineages](/wiki/Lineage_(evolution)) split from each other between 2.70 and 3.70 million years ago. The tiger's whole genome sequencing shows [repeated sequences](/wiki/Repeated_sequence_(DNA)) that parallel those in other cat genomes. The fossil species *[Panthera palaeosinensis](/wiki/Panthera_palaeosinensis)* of early [Pleistocene](/wiki/Pleistocene) northern China was described as a possible tiger ancestor when it was discovered in 1924, but modern cladistics places it as [basal](/wiki/Basal_(phylogenetics)) to modern *Panthera*. *[Panthera zdanskyi](/wiki/Panthera_zdanskyi)* lived around the same time and place, and was suggested to be a sister species of the modern tiger when it was examined in 2014. However, as of 2023, at least two subsequent studies considered *P. zdanskyi* likely to be a [synonym](/wiki/Synonym_(taxonomy)) of *P. palaeosinensis*, noting that its proposed differences from that species fell within the range of individual variation. The earliest appearance of the modern tiger species in the fossil record are jaw fragments from [Lantian](/wiki/Lantian_County) in China that are dated to the early Pleistocene. Middle- to late-Pleistocene tiger fossils have been found throughout China, Sumatra and Java. Prehistoric subspecies include *[Panthera tigris trinilensis](/wiki/Panthera_tigris_trinilensis)* and *[P. t. soloensis](/wiki/Panthera_tigris_soloensis)* of Java and Sumatra and *[P. t. acutidens](/wiki/Panthera_tigris_acutidens)* of China; late Pleistocene and early [Holocene](/wiki/Holocene) fossils of tigers have also been found in [Borneo](/wiki/Bornean_tiger) and [Palawan](/wiki/Palawan), Philippines. Fossil specimens of tigers have also been reported from the Middle-Late Pleistocene of Japan. Results of a [phylogeographic](/wiki/Phylogeographic) study indicate that all living tigers have a common ancestor that lived between 108,000 and 72,000 years ago. Genetic studies suggest that the tiger population contracted around 115,000 years ago due to glaciation. Modern tiger populations originated from a [refugium](/wiki/Refugium_(population_biology)) in Indochina and spread across Asia after the [Last Glacial Maximum](/wiki/Last_Glacial_Maximum). As they colonised northeastern China, the ancestors of the South China tiger intermixed with a relict tiger population. ### Hybrids Tigers can [interbreed](/wiki/Interbreed) with other *Panthera* cats and have done so in captivity. The [liger](/wiki/Liger) is the offspring of a female tiger and a male lion and the [tigon](/wiki/Tigon) the offspring of a male tiger and a female lion. The lion sire passes on a growth-promoting gene, but the corresponding growth-inhibiting gene from the female tiger is absent, so that ligers grow far larger than either parent species. By contrast, the male tiger does not pass on a growth-promoting gene while the lioness passes on a growth inhibiting gene; hence, tigons are around the same size as their parents. Since they often develop life-threatening birth defects and can easily become obese, breeding these hybrids is regarded as unethical. ## Description The tiger has a typical felid morphology, with a muscular body, shortened legs, strong forelimbs with wide front paws, a large head and a tail that is about half the length of the rest of its body. It has five digits, including a [dewclaw](/wiki/Dewclaw), on the front feet and four on the back, all of which have retractile claws that are compact and curved, and can reach 10 cm (3.9 in) long. The ears are rounded and the eyes have a round pupil. The snout ends in a triangular, pink tip with small black dots, the number of which increase with age. The tiger's skull is robust, with a constricted front region, proportionally small, elliptical [orbits](/wiki/Orbit_(anatomy)), long [nasal bones](/wiki/Nasal_bone) and a lengthened [cranium](/wiki/Cranium) with a large [sagittal crest](/wiki/Sagittal_crest). It resembles a lion's skull, but differs from it in the concave or flattened underside of the lower jaw and in its longer nasals. The tiger has 30 fairly robust teeth and its somewhat curved [canines](/wiki/Canine_tooth) are the longest in the cat family at 6.4–7.6 cm (2.5–3.0 in). The tiger has a head-body length of 1.4–2.8 m (4 ft 7 in – 9 ft 2 in) with a 0.6–1.1 m (2 ft 0 in – 3 ft 7 in) tail and stands 0.8–1.1 m (2 ft 7 in – 3 ft 7 in) at the shoulder. The Siberian and Bengal tigers are the largest. Male Bengal tigers weigh 200–260 kg (440–570 lb), and females weigh 100–160 kg (220–350 lb); island tigers are the smallest, likely due to [insular dwarfism](/wiki/Insular_dwarfism). Male Sumatran tigers weigh 100–140 kg (220–310 lb), and females weigh 75–110 kg (165–243 lb). The tiger is popularly thought to be the largest living felid species; but since tigers of the different subspecies and populations vary greatly in size and weight, the tiger's average size may be less than the lion's, while the largest tigers are bigger than their lion counterparts. ### Coat The tiger's coat usually has short hairs, reaching up to 35 mm (1.4 in), though the hairs of the northern-living Siberian tiger can reach 105 mm (4.1 in). Belly hairs tend to be longer than back hairs. The density of their fur is usually thin, though the Siberian tiger develops a particularly thick winter coat. The tiger has lines of fur around the face and long whiskers, especially in males. It has an orange [colouration](/wiki/Animal_coloration) that varies from yellowish to reddish. White fur covers the underside, from head to tail, along with the inner surface of the legs and parts of the face. On the back of the ears, it has a prominent white spot, which is surrounded by black. The tiger is marked with distinctive black or dark brown stripes, which are uniquely patterned in each individual. The stripes are mostly vertical, but those on the limbs and forehead are horizontal. They are more concentrated towards the backside and those on the trunk may reach under the belly. The tips of stripes are generally sharp and some may split up or split and fuse again. Tail stripes are thick bands and a black tip marks the end. The tiger is one of only a few striped cat species. Stripes are advantageous for [camouflage](/wiki/Camouflage) in vegetation with vertical patterns of light and shade, such as trees, reeds and tall grass. This is supported by a [Fourier analysis](/wiki/Fourier_analysis) study showing that the striping patterns line up with their environment. The orange colour may also aid in concealment, as the tiger's prey is [colour blind](/wiki/Color_blindness) and possibly perceives the tiger as green and blended in with the vegetation. #### Colour variations The three [colour variants](/wiki/Polymorphism_(biology)) of Bengal tigers – nearly stripeless snow-white, white and golden – are now virtually non-existent in the wild due to the reduction of wild tiger populations but continue in captive populations. The [white tiger](/wiki/White_tiger) has a white background colour with [sepia](/wiki/Sepia_(color))-brown stripes. The [golden tiger](/wiki/Golden_tiger) is pale golden with reddish-brown stripes. The snow-white tiger is a morph with extremely faint stripes and a pale sepia-brown ringed tail. White and golden morphs are the result of an [autosomal recessive trait](/wiki/Autosomal_recessive_trait) with a white [locus](/wiki/Locus_(genetics)) and a [wideband](/wiki/Cat_coat_genetics#Wide_band_factors) locus, respectively. The snow-white variation is caused by [polygenes](/wiki/Polygene) with both white and wideband loci. The breeding of white tigers is controversial, as they have no use for conservation. Only 0.001% of wild tigers have the genes for this colour morph and the overrepresentation of white tigers in captivity is the result of [inbreeding](/wiki/Inbreeding). Hence, their continued breeding will risk both [inbreeding depression](/wiki/Inbreeding_depression) and loss of [genetic variability](/wiki/Genetic_variability) in captive tigers. Pseudo-[melanistic](/wiki/Melanistic) tigers with thick, merged stripes have been recorded in [Simlipal National Park](/wiki/Simlipal_National_Park) and three Indian zoos; a [population genetic](/wiki/Population_genetics) analysis of Indian tiger samples revealed that this [phenotype](/wiki/Phenotype) is caused by a [mutation](/wiki/Mutation) of a [transmembrane](/wiki/Transmembrane_protein) [aminopeptidase](/wiki/Aminopeptidase) gene. Around 37% of the Simlipal tiger population has this feature, which has been linked to [genetic isolation](/wiki/Genetic_isolate). ## Distribution and habitat The tiger historically ranged from eastern Turkey, northern Iran and Afghanistan to Central Asia and from northern Pakistan through the [Indian subcontinent](/wiki/Indian_subcontinent) and Indochina to southeastern Siberia, Sumatra, Java and Bali. As of 2022, it inhabits less than 7% of its historical distribution and has a scattered range in the Indian subcontinent, the [Indochinese Peninsula](/wiki/Indochinese_Peninsula), Sumatra, northeastern China and the [Russian Far East](/wiki/Russian_Far_East). As of 2020, India had the largest extent of global tiger habitat with 300,508 km2 (116,027 sq mi), followed by Russia with 195,819 km2 (75,606 sq mi). The tiger mainly lives in forest habitats and is highly adaptable. Records in Central Asia indicate that it primarily inhabited [Tugay](/wiki/Tugay) riverine forests and hilly and lowland forests in the [Caucasus](/wiki/Caucasus). In the [Amur](/wiki/Amur_River)-[Ussuri](/wiki/Ussuri_River) region of Russia and China, it inhabits [Korean pine](/wiki/Korean_pine) and [temperate broadleaf and mixed forests](/wiki/Temperate_broadleaf_and_mixed_forest); [riparian forests](/wiki/Riparian_forest) serve as [dispersal](/wiki/Biological_dispersal) corridors, providing food and water for both tigers and [ungulates](/wiki/Ungulate). On the Indian subcontinent, it inhabits mainly [tropical and subtropical moist broadleaf forests](/wiki/Tropical_and_subtropical_moist_broadleaf_forests), [temperate broadleaf and mixed forests](/wiki/Temperate_broadleaf_and_mixed_forests), [tropical moist evergreen forests](/wiki/Tropical_evergreen_forests_of_India), [tropical dry forests](/wiki/Tropical_dry_forest), [alluvial plains](/wiki/Alluvial_plain) and the [mangrove forests](/wiki/Mangrove_forest) of the [Sundarbans](/wiki/Sundarbans). In the [Eastern Himalayas](/wiki/Eastern_Himalaya), it was documented in [temperate forest](/wiki/Temperate_forest) up to an elevation of 4,200 m (13,800 ft) in Bhutan, of 3,630 m (11,910 ft) in the [Mishmi Hills](/wiki/Mishmi_Hills) and of 3,139 m (10,299 ft) in [Mêdog County](/wiki/M%C3%AAdog_County), southeastern Tibet. In Thailand, it lives in [deciduous](/wiki/Deciduous) and [evergreen](/wiki/Evergreen) forests. In Sumatra, it inhabits lowland [peat swamp forests](/wiki/Peat_swamp_forest) and rugged [montane forests](/wiki/Montane_forest). ### Population density [Camera trapping](/wiki/Camera_trap) during 2010–2015 in the deciduous and subtropical pine forest of [Jim Corbett National Park](/wiki/Jim_Corbett_National_Park), northern India revealed a stable tiger [population density](/wiki/Population_density) of 12–17 individuals per 100 km2 (39 sq mi) in an area of 521 km2 (201 sq mi). In northern Myanmar, the population density in a sampled area of roughly 3,250 km2 (1,250 sq mi) in a mosaic of tropical broadleaf forest and grassland was estimated to be 0.21–0.44 tigers per 100 km2 (39 sq mi) as of 2009. Population density in mixed deciduous and semi-evergreen forests of Thailand's [Huai Kha Khaeng Wildlife Sanctuary](/wiki/Huai_Kha_Khaeng_Wildlife_Sanctuary) was estimated at 2.01 tigers per 100 km2 (39 sq mi); during the 1970s and 1980s, [logging](/wiki/Logging) and poaching had occurred in the adjacent [Mae Wong](/wiki/Mae_Wong_National_Park) and [Khlong Lan National Parks](/wiki/Khlong_Lan_National_Park), where population density was much lower, estimated at only 0.359 tigers per 100 km2 (39 sq mi) as of 2016. Population density in [dipterocarp](/wiki/Dipterocarpaceae) and montane forests in northern Malaysia was estimated at 1.47–2.43 adult tigers per 100 km2 (39 sq mi) in [Royal Belum State Park](/wiki/Royal_Belum_State_Park), but 0.3–0.92 adult tigers per 100 km2 (39 sq mi) in the unprotected [selectively logged](/wiki/Selective_logging) Temengor Forest Reserve. ## Behaviour and ecology Camera trap data show that tigers in [Chitwan National Park](/wiki/Chitwan_National_Park) avoided locations frequented by people and were more active at night than during day. In [Sundarbans National Park](/wiki/Sundarbans_National_Park), six [radio-collared](/wiki/Radio_collar) tigers were most active from dawn to early morning and reached their zenith around 7:00 o'clock in the morning. A three-year-long camera trap survey in [Shuklaphanta National Park](/wiki/Shuklaphanta_National_Park) revealed that tigers were most active from dusk until midnight. In northeastern China, tigers were [crepuscular](/wiki/Crepuscular_animal) and active at night with activity peaking at dawn and dusk; they were largely active at the same time as their prey. The tiger is a powerful swimmer and easily transverses rivers as wide as 8 km (5.0 mi); it immerses in water, particularly on hot days. In general, it is less capable of climbing trees than many other cats due to its size, but cubs under 16 months old may routinely do so. An adult was recorded climbing 10 m (33 ft) up a smooth [pipal tree](/wiki/Ficus_religiosa). ### Social spacing Adult tigers lead largely solitary lives within [home ranges](/wiki/Home_range) or [territories](/wiki/Territory_(animal)), the size of which mainly depends on prey abundance, geographic area and sex of the individual. Males and females defend their home ranges from those of the same sex and the home range of a male encompasses that of multiple females. Two females in the [Sundarbans](/wiki/Sundarbans) had home ranges of 10.6 and 14.1 km2 (4.1 and 5.4 sq mi). In [Panna Tiger Reserve](/wiki/Panna_Tiger_Reserve), the home ranges of five reintroduced females varied from 53–67 km2 (20–26 sq mi) in winter to 55–60 km2 (21–23 sq mi) in summer and to 46–94 km2 (18–36 sq mi) during the [monsoon](/wiki/Monsoon); three males had 84–147 km2 (32–57 sq mi) large home ranges in winter, 82–98 km2 (32–38 sq mi) in summer and 81–118 km2 (31–46 sq mi) during monsoon seasons. In [Sikhote-Alin Biosphere Reserve](/wiki/Sikhote-Alin_Biosphere_Reserve), 14 females had home ranges 248–520 km2 (96–201 sq mi) and five resident males of 847–1,923 km2 (327–742 sq mi) that overlapped with those of up to five females. When tigresses in the same reserve had cubs of up to four months of age, they reduced their home ranges to stay near their young and steadily enlarged them until their offspring were 13–18 months old. The tiger is a long-ranging species and individuals disperse over distances of up to 650 km (400 mi) to reach tiger populations in other areas. Young tigresses establish their first home ranges close to their mothers' while males migrate further than their female counterparts. Four [radio-collared](/wiki/Radio_telemetry) females in Chitwan dispersed between 0 and 43.2 km (0.0 and 26.8 mi) and 10 males between 9.5 and 65.7 km (5.9 and 40.8 mi). A subadult male lives as a transient in another male's home range until he is older and strong enough to challenge the resident male. Tigers mark their home ranges by [spraying urine](/wiki/Urine_spraying) on vegetation and rocks, clawing or [scent rubbing](/wiki/Scent_rubbing) trees and marking trails with [faeces](/wiki/Faeces), [anal gland](/wiki/Anal_gland) secretions and ground scrapings. Scent markings also allow an individual to pick up information on another's identity. Unclaimed home ranges, particularly those that belonged to a deceased individual, can be taken over in days or weeks. Male tigers are generally less tolerant of other males within their home ranges than females are of other females. Disputes are usually solved by intimidation rather than fighting. Once [dominance](/wiki/Dominance_(ethology)) has been established, a male may tolerate a subordinate within his range, as long as they do not come near him. The most serious disputes tend to occur between two males competing for a female in [oestrus](/wiki/Oestrus). Though tigers mostly live alone, relationships between individuals can be complex. Tigers are particularly social at kills and a male tiger will sometimes share a carcass with the females and cubs within this home range and unlike male lions, will allow them to feed on the kill before he is finished with it. However, a female is more tense when encountering another female at a kill. ### Communication During friendly encounters and bonding, tigers [rub against](/wiki/Bunting_(animal_behavior)) each other's bodies. Facial expressions include the \"defence threat\", which involves a wrinkled face, bared teeth, pulled-back ears and widened pupils. Both males and females show a [flehmen response](/wiki/Flehmen_response), a characteristic curled-lip grimace, when smelling urine markings. Males also use the flehmen to detect the markings made by tigresses in oestrus. Tigers will move their ears around to display the white spots, particularly during aggressive encounters and between mothers and cubs. They also use their tails to signal their mood. To show cordiality, the tail sticks up and sways slowly, while an apprehensive tiger lowers its tail or wags it side-to-side. When calm, the tail hangs low. Tigers are normally silent but can produce numerous vocalisations. They [roar](/wiki/Roar) to signal their presence to other individuals over long distances. This vocalisation is forced through an open mouth as it closes and can be heard 3 km (1.9 mi) away. They roar multiple times in a row and others respond in kind. Tigers also roar during mating and a mother will roar to call her cubs to her. When tense, tigers moan, a sound similar to a roar but softer and made when the mouth is at least partially closed. Moaning can be heard 400 m (1,300 ft) away. Aggressive encounters involve [growling](/wiki/Growling), [snarling](/wiki/Snarling) and hissing. An explosive \"coughing roar\" or \"coughing snarl\" is emitted through an open mouth and exposed teeth. In friendlier situations, tigers [prusten](/wiki/Prusten), a soft, low-frequency snorting sound similar to [purring](/wiki/Purring) in smaller cats. Tiger mothers communicate with their cubs by grunting, while cubs call back with [miaows](/wiki/Miaow). When startled, they \"woof\". They produce a deer-like \"pok\" sound for unknown reasons, but most often at kills. ### Hunting and diet The tiger is a [carnivore](/wiki/Carnivore) and an [apex predator](/wiki/Apex_predator). [Abundance](/wiki/Abundance_(ecology)) and body weight of prey species are assumed to be the main criteria for the tiger's prey selection, both inside and outside protected areas. It feeds mainly on large and medium-sized ungulates such as [sambar deer](/wiki/Sambar_deer), [Manchurian wapiti](/wiki/Manchurian_wapiti), [barasingha](/wiki/Barasingha), [gaur](/wiki/Gaur) and [wild boar](/wiki/Wild_boar). It also preys opportunistically on smaller species like [monkeys](/wiki/Monkey), [peafowl](/wiki/Peafowl) and other ground-based birds, [porcupines](/wiki/Porcupine) and fish. Occasional attacks on [Asian elephants](/wiki/Asian_elephant) and [Indian rhinoceroses](/wiki/Indian_rhinoceros) have also been reported. More often, tigers take the more vulnerable calves. They sometimes prey on livestock and dogs in close proximity to settlements. Tigers occasionally consume vegetation, fruit and minerals for [dietary fibre](/wiki/Dietary_fibre) and supplements. Tigers learn to hunt from their mothers, though the ability to hunt may be partially inborn. Depending on the size of the prey, they typically kill weekly though mothers must kill more often. Families hunt together when cubs are old enough. They search for prey using vision and hearing. A tiger will also wait at a watering hole for prey to come by, particularly during hot summer days. It is an ambush predator and when approaching potential prey, it crouches with the head lowered and hides in foliage. It switches between creeping forward and staying still. A tiger may even doze off and can stay in the same spot for as long as a day, waiting for prey and launch an attack when the prey is close enough, usually within 30 m (98 ft). If the prey spots it before then, the cat does not pursue further. A tiger can sprint 56 km/h (35 mph) and leap 10 m (33 ft); it is not a long-distance runner and gives up a chase if prey outpaces it over a certain distance. The tiger attacks from behind or at the sides and tries to knock the target off balance. It latches onto prey with its forelimbs, twisting and turning during the struggle and tries to pull it to the ground. The tiger generally applies a [bite to the throat](/wiki/Throat_clamp) until its victim dies of [strangulation](/wiki/Strangulation). It has an average bite force at the canine tips of 1234.3 [newtons](/wiki/Newton_(unit)). Holding onto the throat puts the cat out of reach of horns, antlers, tusks and hooves. Tigers are adaptable killers and may use other methods, including ripping the throat or breaking the neck. Large prey may be disabled by a bite to the back of the [hock](/wiki/Hock_(anatomy)), severing the tendon. Swipes from the large paws are capable of stunning or breaking the skull of a [water buffalo](/wiki/Water_buffalo). They kill small prey with a bite to the back of the neck or head. Estimates of the [success rate](/wiki/Hunting_success) for hunting tigers range from a low of 5% to a high of 50%. They are sometimes killed or injured by large or dangerous prey like gaur, buffalo and boar. Tigers typically move kills to a private, usually vegetated spot no further than 183 m (600 ft), though they have been recorded dragging them 549 m (1,801 ft). They are strong enough to drag the carcass of a fully grown buffalo for some distance. They rest for a while before eating and can consume as much as 50 kg (110 lb) of meat in one session, but feed on a carcass for several days, leaving little for scavengers. ### Competitors In much of their range, tigers share habitat with leopards and [dholes](/wiki/Dhole). They typically dominate both of them, though with dholes it depends on their pack size. Interactions between the three predators involve chasing, [stealing kills](/wiki/Kleptoparasitism) and direct killing. Large dhole packs may kill tigers. Tigers, leopards and dholes coexist by hunting different sized prey. In [Nagarhole National Park](/wiki/Nagarhole_National_Park), the average weight for tiger kills was found to be 91.5 kg (202 lb), compared to 37.6 kg (83 lb) for leopards and 43.4 kg (96 lb) for dholes. In [Kui Buri National Park](/wiki/Kui_Buri_National_Park), following a reduction in prey numbers, tigers continued to kill favoured prey while leopards and dholes increased their consumption of small prey. Both leopards and dholes can live successfully in tiger habitat when there is abundant food and vegetation cover. Otherwise, they appear to be less common where tigers are numerous. The recovery of the tiger population in [Rajaji National Park](/wiki/Rajaji_National_Park) during the 2000s led to a reduction in leopard population densities. Similarly, at two sites in central India the size of dhole packs was negatively correlated with tiger densities. Leopard and dhole distribution in Kui Buri correlated with both prey access and tiger scarcity. In [Jigme Dorji National Park](/wiki/Jigme_Dorji_National_Park), tigers were found to inhabit the deeper parts of forests while the smaller predators were pushed closer to the fringes. ### Reproduction and life cycle The tiger generally [mates](/wiki/Mating) all year round, particularly between November and April. A tigress is in oestrus for three to six days at a time, separated by three to nine week intervals. A resident male mates with all the females within his home range, who signal their receptiveness by roaring and marking. Younger, transient males are also attracted, leading to a fight in which the more dominant, resident male drives the usurper off. During courtship, the male is cautious with the female until she shows readiness to mate by positioning herself in [lordosis](/wiki/Lordosis_behavior) with her tail to the side. [Copulation](/wiki/Copulation_(zoology)) typically lasts no more than 20 seconds, with the male biting the female by the scruff of her neck. After it is finished, the male quickly pulls away as the female may turn and slap him. Tiger pairs may stay together for up to four days and mate multiple times. [Gestation](/wiki/Gestation) lasts around or over three months. A tigress gives birth in a secluded location, be it in dense vegetation, in a cave or under a rocky shelter. [Litters](/wiki/Litter_(zoology)) consist of as many as seven cubs, but two or three are more typical. Newborn cubs weigh 785–1,610 g (27.7–56.8 oz) and are blind and [altricial](/wiki/Precociality_and_altriciality). The mother licks and cleans her cubs, suckles them and viciously defends them from any potential threat. Cubs open their eyes at the age of three to 14 days and their vision becomes clear after a few more weeks. They can leave the denning site after two months and around the same time they start eating meat. The mother only leaves them alone to hunt and even then she does not travel far. When she suspects an area is no longer safe, she moves her cubs to a new spot, transporting them one by one by grabbing them by the scruff of the neck with her mouth. A tigress in Sikhote-Alin Biosphere Reserve maximised the time spent with her cubs by reducing her home range, killing larger prey and returning to her den more rapidly than without cubs; when the cubs started to eat meat, she took them to kill sites, thereby optimising their protection and access to food. In the same reserve, one of 21 cubs died in over eight years of monitoring and mortality did not differ between male and female juveniles. Tiger monitoring over six years in [Ranthambore Tiger Reserve](/wiki/Ranthambore_Tiger_Reserve) indicated an average annual survival rate of around 85 percent for 74 male and female cubs; survival rate increased to 97 percent for both males and female juveniles of one to two years of age. Causes of cub mortality include predators, floods, fires, death of the mother and fatal injuries. After around two months, the cubs are able to follow their mother. They still hide in vegetation when she goes hunting. Young bond through play fighting and practice stalking. A hierarchy develops in the litter, with the biggest cub, often a male, being the most dominant and the first to eat its fill at a kill. Around the age of six months, cubs are fully weaned and have more freedom to explore their environment. Between eight and ten months, they accompany their mother on hunts. A cub can make a kill as early as 11 months and reach independence as a juvenile of 18 to 24 months of age; males become independent earlier than females. Radio-collared tigers in Chitwan started leaving their natal areas at the age of 19 months. Young females are [sexually mature](/wiki/Sexual_maturity) at three to four years, whereas males are at four to five years. [Generation length](/wiki/Generation_time) of the tiger is about 7–10 years. Wild Bengal tigers live 12–15 years. Data from the International Tiger [Studbook](/wiki/Studbook) 1938–2018 indicate that captive tigers lived up to 19 years. The father does not play a role in raising the young, but he encounters and interacts with them. The resident male appears to visit the female–cub families within his home range. They socialise and even share kills. One male was recorded looking after cubs whose mother had died. By defending his home range, the male protects the females and cubs from other males. When a new male takes over, dependent cubs are at risk of [infanticide](/wiki/Infanticide_(zoology)) as the male attempts to sire his own young with the females. A seven-year long study in Chitwan National Park revealed that 12 of 56 detected cubs and juveniles were killed by new males taking over home ranges. ### Health and diseases Tigers are recorded as hosts for various parasites including tapeworms like *[Diphyllobothrium](/wiki/Diphyllobothrium) erinacei*, *[Taenia pisiformis](/wiki/Taenia_pisiformis)* in India and [nematodes](/wiki/Nematode) like *[Toxocara](/wiki/Toxocara)* species in India and *[Physaloptera](/wiki/Physaloptera) preputialis*, *[Dirofilaria](/wiki/Dirofilaria) ursi* and *Uiteinarta* species in Siberia. [Canine distemper](/wiki/Canine_distemper) is known to occur in Siberian tigers. A [morbillivirus](/wiki/Morbillivirus) infection was the likely cause of death of a tigress in the Russian Far East that was also tested positive for [feline panleukopenia](/wiki/Feline_panleukopenia) and [feline coronavirus](/wiki/Feline_coronavirus). Blood samples from 11 adult tigers in Nepal showed [antibodies](/wiki/Antibody) for [canine parvovirus](/wiki/Canine_parvovirus)-2, [feline herpesvirus](/wiki/Feline_herpesvirus), feline coronavirus, [leptospirosis](/wiki/Leptospirosis) and *[Toxoplasma gondii](/wiki/Toxoplasma_gondii)*. ## Threats The tiger has been listed as [Endangered](/wiki/Endangered) on the [IUCN Red List](/wiki/IUCN_Red_List) since 1986 and the global tiger population is thought to have continuously declined from an estimated population of 5,000–8,262 tigers in the late 1990s to 3,726–5,578 individuals estimated as of 2022. During 2001–2020, landscapes where tigers live declined from 1,025,488 km2 (395,943 sq mi) to 911,901 km2 (352,087 sq mi). [Habitat destruction](/wiki/Habitat_destruction), [habitat fragmentation](/wiki/Habitat_fragmentation) and [poaching](/wiki/Poaching) for fur and body parts are the major threats that contributed to the decrease of tiger populations in all range countries. Protected areas in central India are highly fragmented due to linear infrastructure like roads, railway lines, [transmission lines](/wiki/Transmission_line), [irrigation](/wiki/Irrigation) channels and [mining](/wiki/Mining) activities in their vicinity. In the [Tanintharyi Region](/wiki/Tanintharyi_Region) of southern Myanmar, [deforestation](/wiki/Deforestation) coupled with mining activities and high hunting pressure threatens the tiger population. In Thailand, nine of 15 protected areas hosting tigers are isolated and fragmented, offering a low probability for dispersal between them; four of these have not harboured tigers since about 2013. In Peninsular Malaysia, 8,315.7 km2 (3,210.7 sq mi) of tiger habitat was cleared during 1988–2012, most of it for industrial [plantations](/wiki/Plantation). Large-scale land acquisitions of about 23,000 km2 (8,900 sq mi) for commercial [agriculture](/wiki/Agriculture) and timber extraction in Cambodia contributed to the fragmentation of potential tiger habitat, especially in the Eastern Plains. [Inbreeding depression](/wiki/Inbreeding_depression) coupled with habitat destruction, insufficient prey resources and poaching is a threat to the small and isolated tiger population in the [Changbai Mountains](/wiki/Changbai_Mountains) along the China–Russia border. In China, tigers became the target of large-scale 'anti-pest' campaigns in the early 1950s, where suitable habitats were fragmented following deforestation and resettlement of people to rural areas, who hunted tigers and prey species. Though tiger hunting was prohibited in 1977, the population continued to decline and is considered extinct in [South China](/wiki/South_China) since 2001. Tiger populations in India have been targeted by poachers since the 1990s and were extirpated in two tiger reserves in 2005 and 2009. Between March 2017 and January 2020, 630 activities of hunters using [snares](/wiki/Trapping#Snares), drift nets, hunting platforms and hunting dogs were discovered in a reserve forest of about 1,000 km2 (390 sq mi) in southern Myanmar. [Nam Et-Phou Louey National Park](/wiki/Nam_Et-Phou_Louey_National_Park) was considered the last important site for the tiger in Laos, but it has not been recorded there at least since 2013; this population likely fell victim to indiscriminate snaring. [Anti-poaching](/wiki/Anti-poaching) units in Sumatra's [Kerinci Seblat](/wiki/Kerinci_Seblat_National_Park) landscape removed 362 tiger snare traps and seized 91 tiger skins during 2005–2016; annual poaching rates increased with rising skin prices. Poaching is also the main threat to the tiger population in far eastern Russia, where [logging](/wiki/Logging) roads facilitate access for poachers and people harvesting forest products that are important for prey species to survive in winter. Body parts of 207 tigers were detected during 21 surveys in 1991–2014 in two wildlife markets in Myanmar catering to customers in Thailand and China. During the years 2000–2022, at least 3,377 tigers were [confiscated](/wiki/Confiscation) in 2,205 seizures in 28 countries; seizures encompassed 665 live and 654 dead individuals, 1,313 whole tiger skins, 16,214 body parts like bones, teeth, paws, claws, whiskers and 1.1 t (1.1 long tons; 1.2 short tons) of meat; 759 seizures in India encompassed body parts of 893 tigers; and 403 seizures in Thailand involved mostly captive-bred tigers. Seizures in Nepal between January 2011 and December 2015 obtained 585 pieces of tiger body parts and two whole carcasses in 19 districts. Seizure data from India during 2001–2021 indicate that tiger skins were the most often traded body parts, followed by claws, bones and teeth; trafficking routes mainly passed through the states of Maharashtra, Karnataka, Tamil Nadu and Assam. A total of 292 illegal tiger parts were confiscated at US ports of entry from personal baggage, air cargo and mail between 2003 and 2012. Demand for tiger parts for use in [traditional Chinese medicine](/wiki/Traditional_Chinese_medicine) has also been cited as a major threat to tiger populations. Interviews with local people in the Bangladeshi Sundarbans revealed that they kill tigers for local consumption and trade of skins, bones and meat, in [retaliation](/wiki/Retaliation) for attacks by tigers and for excitement. Tiger body parts like skins, bones, teeth and hair are consumed locally by wealthy Bangladeshis and are illegally trafficked from Bangladesh to 15 countries including India, China, Malaysia, Korea, Vietnam, Cambodia, Japan and the United Kingdom via land borders, airports and seaports. Tiger bone glue is the prevailing tiger product purchased for medicinal purposes in [Hanoi](/wiki/Hanoi) and [Ho Chi Minh City](/wiki/Ho_Chi_Minh_City). \"Tiger farm\" facilities in China and Southeast Asia breed tigers for their parts, but these appear to make the threat to wild populations worse by increasing the demand for tiger products. Local people killing tigers in retaliation for attacking and preying on livestock is a threat in several tiger range countries, as this consequence of [human–wildlife conflict](/wiki/Human%E2%80%93wildlife_conflict) also contributes to the decline of the population. ## Conservation Global wild tiger population CountryYearEstimate [India](/wiki/India)20223,167–3,682 [Russia](/wiki/Russia)2022573–600 [Indonesia](/wiki/Indonesia)2022393 [Nepal](/wiki/Nepal)2022316–355 [Thailand](/wiki/Thailand)2022148–189 [Malaysia](/wiki/Malaysia)2022<150 [Bhutan](/wiki/Bhutan)2022131 [Bangladesh](/wiki/Bangladesh)2022118–122 [China](/wiki/China)2022>60 [Myanmar](/wiki/Myanmar)202228**Total****5,638–5,899** Internationally, the tiger is protected under [CITES Appendix I](/wiki/CITES#Appendix_I), banning trade of live tigers and their body parts. In [Russia](/wiki/Russia), hunting the tiger has been banned since 1952. In [Bhutan](/wiki/Bhutan), it has been protected since 1969 and enlisted as totally protected since 1995. Since 1972, it has been afforded the highest protection level under India's [Wild Life (Protection) Act, 1972](/wiki/Wild_Life_(Protection)_Act,_1972). In [Nepal](/wiki/Nepal) and [Bangladesh](/wiki/Bangladesh), it has been protected since 1973. Since 1976, it has been totally protected under [Malaysia](/wiki/Malaysia)'s Protection of Wild Life Act, and the country's Wildlife Conservation Act enacted in 2010 increased punishments for wildlife-related crimes. In [Indonesia](/wiki/Indonesia), it has been protected since 1990. In [China](/wiki/China), the trade in tiger body parts was banned in 1993. The [Thai](/wiki/Thailand) Wildlife Preservation and Protection Act was enacted in 2019 to combat poaching and trading of body parts. In 1973, the [National Tiger Conservation Authority](/wiki/National_Tiger_Conservation_Authority) and [Project Tiger](/wiki/Project_Tiger) were founded in [India](/wiki/India) to gain public support for tiger conservation. Since then, 53 [tiger reserves](/wiki/Tiger_reserves_of_India) covering an area of 75,796 km2 (29,265 sq mi) have been established in the country up to 2022. These efforts contributed to the recovery of India's tiger population between 2006 and 2018 so that it occurs in an area of about 138,200 km2 (53,400 sq mi). [Myanmar](/wiki/Myanmar)'s national tiger conservation strategy developed in 2003 comprises management tasks such as restoration of degraded habitats, increasing the extent of protected areas and wildlife corridors, protecting tiger prey species, thwarting tiger killing and illegal trade of its body parts and promoting public awareness through wildlife education programmes. Bhutan's first Tiger Action Plan implemented during 2006–2015 revolved around habitat conservation, human–wildlife conflict management, education and awareness; the second Action Plan aimed at increasing the country's tiger population by 20% until 2023 compared to 2015. In 2009, the Bangladesh Tiger Action Plan was initiated to stabilise the country's tiger population, maintain habitat and a sufficient prey base, improve law enforcement and foster cooperation between governmental agencies responsible for tiger conservation. The Thailand Tiger Action Plan [ratified](/wiki/Ratified) in 2010 envisioned increasing the country's tiger populations by 50% in the [Western Forest Complex](/wiki/Western_Forest_Complex) and [Dong Phayayen–Khao Yai Forest Complex](/wiki/Dong_Phayayen%E2%80%93Khao_Yai_Forest_Complex) and reestablish populations in three potential landscapes until 2022. The Indonesian National Tiger Recovery Program ratified in 2010 aimed at increasing the Sumatran tiger population by 2022. The third strategic and action plan for the conservation of the Sumatran tiger for the years 2020–2030 revolves around strengthening management of small tiger population units of less than 20 mature individuals and connectivity between 13 forest patches in [North Sumatra](/wiki/North_Sumatra) and [West Sumatra](/wiki/West_Sumatra) provinces. Increases in anti-poaching patrol efforts in four Russian protected areas during 2011–2014 contributed to reducing poaching, stabilising the tiger population and improving protection of ungulate populations. Poaching and trafficking were declared to be moderate and serious crimes in 2019. Anti-poaching operations were also established in Nepal in 2010, with increased cooperation and intelligence sharing between agencies. These policies have led to many years of \"zero poaching\" and the country's tiger population has doubled in a decade. Anti-poaching patrols in the 1,200 km2 (460 sq mi) large core area of [Taman Negara](/wiki/Taman_Negara) lead to a decrease of poaching frequency from 34 detected incidents in 2015–2016 to 20 incidents during 2018–2019; the arrest of seven poaching teams and removal of snares facilitated the survival of three resident female tigers and at least 11 cubs. Army and police officers are deployed for patrolling together with staff of protected areas in Malaysia. [Wildlife corridors](/wiki/Wildlife_corridor) are important conservation measures as they facilitate tiger populations to connect between protected areas; tigers use at least nine corridors that were established in the [Terai Arc Landscape](/wiki/Terai_Arc_Landscape) and [Sivalik Hills](/wiki/Sivalik_Hills) in both Nepal and India. Corridors in forested areas with low human encroachment are highly suitable. In West Sumatra, 12 wildlife corridors were identified as high priority for mitigating human–wildlife conflicts. In 2019, China and Russia signed a [memorandum of understanding](/wiki/Memorandum_of_understanding) for transboundary cooperation between two protected areas, [Northeast China Tiger and Leopard National Park](/wiki/Northeast_China_Tiger_and_Leopard_National_Park) and [Land of the Leopard National Park](/wiki/Land_of_the_Leopard_National_Park), that includes the creation of wildlife corridors and bilateral monitoring and patrolling along the Sino-Russian border. Rescued and [rehabilitated](/wiki/Wildlife_rehabilitation) problem tigers and [orphaned](/wiki/Orphan) tiger cubs have been released into the wild and monitored in India, Sumatra and Russia. In Kazakhstan, [habitat restoration](/wiki/Ecological_restoration) and [reintroduction](/wiki/Species_reintroduction) of prey species in Ile-Balkash Nature Reserve have progressed and tiger reintroduction is planned for 2025. Reintroduction of tigers is considered possible in eastern Cambodia, once management of protected areas is improved and forest loss stabilized. South China tigers are kept and bred in Chinese zoos, with plans to reintroduce their offspring into remote protected areas. Coordinated [breeding programs](/wiki/Breeding_program) among [zoos](/wiki/Zoo) have led to enough genetic diversity in tigers to act as \"insurance against extinction in the wild\". ## Relationship with humans ### Hunting Tigers have been hunted by humans for millennia, as indicated by a painting on the [Bhimbetka rock shelters](/wiki/Bhimbetka_rock_shelters) in India that is dated to 5,000–6,000 years ago. They were hunted throughout their range in Asia, chased on horseback, elephant-back or even with sled dogs and killed with spears and later firearms. Such hunts were conducted both by Asian governments and empires like the [Mughal Empire](/wiki/Mughal_Empire), as well as European colonists. Tigers were often hunted as [trophies](/wiki/Trophy_hunting) and because of their perceived danger. An estimated 80,000 tigers were killed between 1875 and 1925. ### Attacks In most areas, tigers avoid humans, but attacks are a risk wherever people coexist with them. Dangerous encounters are more likely to occur in [edge](/wiki/Edge_effects) habitats between wild and agricultural areas. Most attacks on humans are defensive, including protection of young; however, tigers do sometimes see people as prey. [Man-eating](/wiki/Man-eating_animal#Tigers) tigers tend to be old and disabled. Tigers driven from their home ranges are also at risk of turning to man-eating. At the beginning of the 20th century, the [Champawat Tiger](/wiki/Champawat_Tiger) was responsible for over 430 human deaths in Nepal and India before she was shot by [Jim Corbett](/wiki/Jim_Corbett). This tigress suffered from broken teeth and was unable to kill normal prey. Modern authors speculate that sustaining on meagre human flesh forced the cat to kill more and more. Tiger attacks were particularly high in Singapore during the mid-19th century, when plantations expanded into the tiger's habitat. In the 1840s, the number of deaths in the area ranged from 200 to 300 annually. [Tiger attacks in the Sundarbans](/wiki/Tiger_attacks_in_the_Sundarbans) caused 1,396 human deaths in the period 1935–2006 according to official records of the [Bangladesh Forest Department](/wiki/Forest_Department_(Bangladesh)). Victims of these attacks are local villagers who enter the tiger's domain to collect resources like wood and honey. Fishermen have been particularly common targets. Methods to counter tiger attacks have included face masks worn backwards, protective clothes, sticks and carefully stationed electric dummies. ### Captivity Tigers have been kept in captivity since ancient times. In [ancient Rome](/wiki/Ancient_Rome), tigers were displayed in [amphitheatres](/wiki/Amphitheatre); they were slaughtered in [venatio](/wiki/Venatio) hunts and used to [kill criminals](/wiki/Damnatio_ad_bestias). The Mongol ruler [Kublai Khan](/wiki/Kublai_Khan) is reported to have kept tigers in the 13th century. Starting in the [Middle Ages](/wiki/Middle_Ages), tigers were being kept in European [menageries](/wiki/Menagerie). Tigers and other exotic animals were mainly used for the entertainment of elites but from the 19th century onward, they were exhibited more to the public. Tigers were particularly big attractions and their captive population soared. In 2020, there were over 8,000 captive tigers in Asia, over 5,000 in the US and no less than 850 in Europe. There are more tigers in captivity than in the wild. Captive tigers may display [stereotypical behaviours](/wiki/Stereotypy_(non-human)) such as pacing or inactivity. Modern zoos are able to reduce such behaviours with exhibits designed so the animals can move between separate but connected enclosures. Enrichment items are also important for the cat's welfare and the stimulation of its natural behaviours. Tigers have played prominent roles in [circuses](/wiki/Circus) and other live performances. [Ringling Bros](/wiki/Ringling_Bros._and_Barnum_%26_Bailey_Circus) included many tiger tamers in the 20th century including [Mabel Stark](/wiki/Mabel_Stark), who became a big draw and had a long career. She was well known for being able to control the tigers despite being a small woman; using \"manly\" tools like whips and guns. Another trainer was [Clyde Beatty](/wiki/Clyde_Beatty), who used chairs, whips and guns to provoke tigers and other beasts into acting fierce and allowed him to appear courageous. He would perform with as many as 40 tigers and lions in one act. From the 1960s onward, trainers like [Gunther Gebel-Williams](/wiki/Gunther_Gebel-Williams) would use gentler methods to control their animals. [Sara Houcke](/wiki/Sara_Houcke) was dubbed \"the Tiger Whisperer\" as she trained the cats to obey her by whispering to them. [Siegfried & Roy](/wiki/Siegfried_%26_Roy) became famous for performing with white tigers in [Las Vegas](/wiki/Las_Vegas). The act ended in 2003 when a tiger attacked Roy during a performance. In 2009, tigers were the most traded circus animals. The use of tigers and other animals in shows eventually declined in many countries due to pressure from [animal rights](/wiki/Animal_rights) groups and greater desires from the public to see them in more natural settings. Several countries restrict or ban such acts. Tigers have become popular in the [exotic pet](/wiki/Exotic_pet) trade, particularly in the United States where only 6% of the captive tiger population in 2020 were being housed in zoos and other facilities approved by the [Association of Zoos and Aquariums](/wiki/Association_of_Zoos_and_Aquariums). Private collectors are thought to be ill-equipped to provide proper care for tigers, which compromises their welfare. They can also threaten public safety by allowing people to interact with them. The keeping of tigers and other big cats by private people was banned in the US in 2022. Most countries in the European Union have banned breeding and keeping tigers outside of licensed zoos and rescue centres, but some still allow private holdings. ### Cultural significance\n",
  "language": "en",
  "processed_at": "2026-01-12T12:09:06.128977",
  "title": "Tiger",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tiger"
}