{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:09:09.340846"
  },
  "content": "Heat rub used for pain relief **Tiger Balm** ([Chinese](/wiki/Traditional_Chinese_characters): 虎標萬金油; [pinyin](/wiki/Pinyin): *Hǔbiao Wànjīnyóu*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Hó͘-phiau Bān-kim-iû*) is an [analgesic](/wiki/Analgesic) [heat rub](/wiki/Heat_rub) manufactured and distributed by [Singaporean](/wiki/Singapore) company [Haw Par Healthcare](/wiki/Haw_Par_Corporation). It is used for external pain relief. ## History A precursor to Tiger Balm called Ban Kin Yu ([Chinese](/wiki/Traditional_Chinese_characters): 萬金油; lit. 'Ten Thousand Golden Oil') was developed in the 1870s in [Rangoon](/wiki/Rangoon), [Burma](/wiki/Province_of_Burma), during the [British colonial era](/wiki/British_Raj) by the practising Chinese herbalist [Aw Chu Kin](/wiki/Aw_Chu_Kin), son of Aw Leng Fan, a Chinese [Hakka](/wiki/Hakka_people) herbalist in Zhongchuan, [Fujian Province](/wiki/Fujian_Province), [China](/wiki/Republic_of_China_(1912%E2%80%931949)). His father had sent him to Rangoon in the 1860s to help in his uncle's herbal shop. Eventually, Aw Chu Kin himself set up a family business named Eng Aun Tong 永安堂 (\"Hall of Everlasting Peace\"). On his deathbed in 1908, he asked his sons [Aw Boon Haw](/wiki/Aw_Boon_Haw) and [Aw Boon Par](/wiki/Aw_Boon_Par) to perfect the product. In 1918, the product was renamed \"Tiger Balm\" in order to gain broader appeal. By 1918, the Aw family had become one of the wealthiest families in Rangoon. By the 1920s, the brothers had turned Eng Aun Tong into a very successful business empire that produced and marketed pharmaceutical products, including the Tiger Balm medicinal ointment. Tiger Balm sold well in Burma, and was exported to China, Japan, and Southeast Asia. The brothers moved to Singapore in the 1920s due to problems with the [colonial British government](/wiki/British_Indian_Empire). They set up a branch first at [Amoy Street](/wiki/Amoy_Street,_Singapore), then moved to Cecil Street and finally to [89 Neil Road](/wiki/Eng_Aun_Tong_Building) between 1924 and 1926, at the junction of Neil and Craig Road. The Aw family founded the [Tiger Balm Gardens](/wiki/Tiger_Balm_Garden) in Hong Kong in 1935, Singapore in 1937 and Fujian Province in 1946 to promote the product. Boon Haw also established newspapers in China and Singapore; his daughter said that he spent so much money on advertising that \"he thought it would be cheaper to just open a few newspapers\". In 2013, a lawsuit filed by Haw Par against the Indian company Rangoon Chemical Works, asserting that the latter's \"Flying Tiger\" balm with similar branding infringed on the Tiger Balm trademark, reached the [Supreme Court of India](/wiki/Supreme_Court_of_India). As a result, Rangoon Chemical Works made changes in the branding of its product and redesigned packaging. In 2018, there were 10 products being sold under the Tiger Balm brand, in over 100 countries. Tiger Balm generated [S$](/wiki/Singapore_dollar)152 million ([US$](/wiki/USD)110.56 million) in revenues in 2015. Haw Par's revenues from Tiger Balm sales in India were ₹85 crore (US$12.43 million) in 2018. The product sold in India is manufactured in [Hyderabad](/wiki/Hyderabad) by Makson and marketed by [Alkem Laboratories](/wiki/Alkem_Laboratories). Between 1993 and 2011, it had been manufactured and marketed by [Elder Pharmaceuticals](/wiki/Elder_Pharmaceuticals). In 2024, Tiger Balm became an official regional partner of [FC Bayern Munich](/wiki/FC_Bayern_Munich) for China, Malaysia, Singapore, Thailand, and Vietnam for four years. ## Composition IngredientRedWhiteUltra[*citation needed*][Menthol](/wiki/Menthol)10%8%11% [Camphor](/wiki/Camphor)11% or 25%11% or 25%11% [Dementholised](/wiki/Menthol) [mint](/wiki/Mentha) [oil](/wiki/Essential_oil)[*citation needed*]6%16%6%[Cajuput oil](/wiki/Cajuput_oil)7%13%13%[Clove bud oil](/wiki/Oil_of_clove)5%1.5%2% The base comprises [petroleum jelly](/wiki/Petroleum_jelly) and [paraffin wax](/wiki/Paraffin_wax). The packaging label states that the active ingredients are menthol and camphor. The camphor concentration varies by country of sale; as of November 2023, Tiger Balm Red and Tiger Balm White both contain 25% camphor in Singapore and Cambodia, but only 11% in Australia as an example. This is likely due to different regulatory requirements.[*citation needed*] A new[*when?*] product named **Tiger Balm White HR** uses eucalyptus oil instead of cajuput oil.[*citation needed*] - [Axe Brand Universal Oil](/wiki/Axe_Brand_Universal_Oil) - [Amrutanjan (balm)](/wiki/Amrutanjan_(balm)) - [Ben-Gay](/wiki/Ben-Gay) - [Liniment](/wiki/Liniment) - [IcyHot](/wiki/IcyHot) - [Mentholatum](/wiki/Mentholatum) - [Siddhalepa](/wiki/Siddhalepa) - [Vicks VapoRub](/wiki/Vicks_VapoRub) - [Ya mong](/wiki/Ya_mong) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:09:09.340555",
  "title": "Tiger Balm",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tiger_Balm"
}