{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:09:14.549907"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Tiger Sky Tower\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2010)* *(Learn how and when to remove this message)* The **Tiger Sky Tower**, previously known as **Carlsberg Sky Tower**, was the highest [observation tower](/wiki/Observation_tower) in [Singapore](/wiki/Singapore). It is located in the [Imbiah Lookout](/wiki/Imbiah_Lookout) zone in the centre of [Sentosa Island](/wiki/Sentosa). It was opened on 7 February 2004 and closed on 28 December 2018. The tower has a height of 110 metres (360 ft) above ground level, or about 36 floors tall – and an elevation of 131 metres (430 ft) above sea level. The tower was completed in 2004, and is owned by C. Melchers [GmbH](/wiki/GmbH) & Co. ## Views At ground level, visitors enter a large disc-shaped air-conditioned cabin fitted with glass windows all round. The cabin revolves slowly for views as it ascends the tower. From the top one can view the entire length of Singapore's skyline and a panoramic view of the island. On a clear day, one may even be able to see at part of [Johor Bahru](/wiki/Johor_Bahru) and [Indonesia](/wiki/Indonesia)'s skyline. ## Structure - **Tower height**: 110 metres (360 ft) - **Viewing height**: 91 metres (299 ft) - **Tower column diameter**: 2.5 metres (8.2 feet) - **Foundation diameter**: 15 metres (50 feet) - **Cabin capacity**: 72 persons - **Weight of Tower**: 200 metric tonnes (197 tonnes) ### Construction The Sky Tower was manufactured by [HUSS Park Attractions](/wiki/HUSS_Park_Attractions) of [Bremen](/wiki/Bremen_(city)), Germany. The Sky Tower was fabricated within 6 months at HUSS's factory in Europe. ## History Sky Tower Pte Ltd is a project conceived by Melchers Project Management Pte Ltd. Melchers Project Management, being the managing shareholder of Sky Tower Pte Ltd, runs the daily operations of the Carlsberg Sky Tower in close co-operation with Sentosa Leisure Group (SLG). SLG is Sky Tower's Operations, Marketing, Sales and Ticketing agent. [Carlsberg](/wiki/Carlsberg_Group) was the name sponsor of the Sky Tower and the tower was formally known as **Carlsberg Sky Tower**. The tower opened to public on 7 February 2004. In 2008, the name sponsor was changed to [Tiger Beer](/wiki/Tiger_Beer) and was known as **Tiger Sky Tower**. On 11 June 2010, the tower was closed following a mechanical fault. It was reopened on 8 July after about more than 100 test rides. On 23 July 2010, the tower stopped, leaving 11 people stranded. They were rescued after staff reached them through a central stairwell. The fault was caused by an uneven curvature on the track which affected the balance of the cabin. The ride was re-opened on 30 July 2010. On 12 August 2017, the tower stopped due to a mechanical fault, leaving 39 people stranded more than 4 hours. They were rescued after the Sky Tower's engineers were assisted with the manual winching to lower the gondola. The Tiger Sky Tower resumed operations after conducting numerous test rides on 25 November 2017. As of 23 October 2018, Tiger Sky Tower has been announced to be closed from 28 December onwards. The tower will be shifted to another country and moving works began in January 2019. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:09:14.549597",
  "title": "Tiger Sky Tower",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tiger_Sky_Tower"
}