{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:09:07.349008"
  },
  "content": "Defunct airline holding company of Singapore (2007–2016) **Tiger Airways Holdings Limited** ([SGX](/wiki/Singapore_Exchange): J7X ) was a [Singapore](/wiki/Singapore)-based [airline](/wiki/Airline) [holding company](/wiki/Holding_company) for a group of [low-cost carriers](/wiki/Low-cost_carrier) operating in the Asia-Pacific region. It was formed in 2007 to allow for easier management of the airline subsidiaries, as well as any future expansion, without having to focus on operational issues, leaving those to the airlines themselves. In 2016, [Singapore Airlines](/wiki/Singapore_Airlines) purchased the company and it was delisted from the [Singapore Exchange](/wiki/Singapore_Exchange). ## Group companies ### Tigerair (Tiger Airways Singapore) Tigerair was incorporated on 12 December 2003 and began ticket sales on 31 August 2004. Services commenced on 15 September 2004 to [Bangkok](/wiki/Suvarnabhumi_Airport). It operates scheduled international services from [Singapore Changi Airport](/wiki/Singapore_Changi_Airport) and is a wholly owned subsidiary of Tiger Airways Holdings. In 2006, the airline flew 1.2 million passengers, a growth of 75% from the previous year. The airline was the first to operate from the Budget Terminal in Changi Airport in order to achieve operating-cost savings and its cost structure is modeled after [Ryanair](/wiki/Ryanair). Despite regional competition, the airline has reiterated its current intention to remain focused on flying within a five-hour radius from its Singaporean base. Following the acquisition of Tiger Airways Holdings by [Singapore Airlines](/wiki/Singapore_Airlines), the Tigerair brand was retired with operations merged into [Scoot](/wiki/Scoot), its sister budget airline. ## Shareholders Tigerair was listed on the [Singapore Exchange](/wiki/Singapore_Exchange) in February 2010. As at 18 June 2014, [Singapore Airlines](/wiki/Singapore_Airlines), holding 40% of the issued shares, is the only substantial shareholder (i.e. holding at least 5% of the issued shares) of Tiger Airways Holdings. ## Financial performance The following table shows the financial performance of Tiger Airways Holdings. Tiger Airways Holdings Financial Highlights Year endedRevenue (S$m)Expenditure (S$m)Operating profit (S$m)Profit before taxation (S$m)Profit attributable to equity holders (S$m)[EPS](/wiki/Earnings_per_share) after tax – diluted (cents)31 March 200675NA−37.4NANANA31 March 2007171.2NA−14.3NANANA31 March 2008231NA37.8NANANA31 March 2009378.0425.5−47.5−47.6−50.8−1431 March 2010486.2460.226.019.928.26.631 March 2011622.3575.047.257.039.96.931 March 2012618.2701.6−83.4−100.7−104.3−14.931 March 2013866.0859.07.0−35.0−45.4−5.531 March 2014734.0786.1−52.0−231.6−223.0−22.6**Note: Tiger Aviation Holdings Limited was listed on 22 January 2010. Full financial information may not be publicised prior to that date.** ### Operating performance Tiger Airways Holdings Operating Highlights Year endedPassengers booked (thousand)[RPK](/wiki/Revenue_Passenger_Kilometer) (million)[ASK](/wiki/Available_seat_kilometre) (million)Load factor (%)Seat capacity (thousands)31 March 20093,1675,2456,45979.43,98931 March 20104,8726,7687,84785.15,72331 March 20115,9688,2099,58385.86,95831 March 20125,4658,49410,44781.3NA31 March 20136,84810,82712,90783.9NA31 March 20147,12712,23915,77977.6NA ## Regional Partners Due to the reorganization of Tiger Air into [Budget Aviation Holdings](/wiki/Budget_Aviation_Holdings), the following partners have either taken full ownership of the Tiger Air branding or cancelled operations. ### Regional affiliate partnership ventures #### Tigerair Australia Tiger Airways Australia was formed as the Australian affiliate of Tiger Airways. In February 2007, Tiger announced that it hoped to become [Australia](/wiki/Australia)'s third full-scale domestic airline, competing directly with [Virgin Blue](/wiki/Virgin_Australia) and [Qantas](/wiki/Qantas)/[Jetstar](/wiki/Jetstar). Tigerair Australia planned to use its Australian domestic network to support an expanded international presence through the gateway of [Perth](/wiki/Perth_Airport), expanded to include [Melbourne](/wiki/Melbourne_Airport). On 16 March 2007 the airline received approval from the [Foreign Investment Review Board](/wiki/Foreign_Investment_Review_Board) to establish the new subsidiary/ Tiger Airways Australia began operations on 23 November 2007. In July 2008 Tiger announced that it would suspend its flights from [Darwin](/wiki/Darwin_International_Airport) on 25 October, citing Darwin International Airport operating and fuel costs, making it the most expensive airport on the Tigerair Australia network but did not rule out returning in the future if costs were to decrease. Tigerair Australia resumed services to Darwin on Friday 18 June 2010. On 5 August 2008 the airline announced [Adelaide](/wiki/Adelaide_Airport) as its second operational base and began services on 10 January 2010. Tiger resumed flights on 2 August 2011, after it was grounded for safety issues, on a restricted schedule maintaining its hub in Melbourne. Tiger Airways Australia re-opened its second base at [Sydney](/wiki/Sydney_Airport) with three aircraft in July 2012. In October 2012, [Virgin Australia Holdings](/wiki/Virgin_Australia_Holdings) (parent company of competitor Virgin Australia) announced its intention to purchase 60% of Tiger Airways Australia. The deal was completed in July 2013, after the airline had changed its name to Tigerair Australia. In October 2014, Virgin Australia Holdings announced plans to acquire the remaining 40% stake in Tigerair Australia for [$](/wiki/Australian_dollar)1. Virgin retained the Tigerair name and acquired the brand rights for Tigerair to operate to some international destinations from Australia. It ceased in March 2020. #### Tigerair Taiwan Tigerair Taiwan is a Taiwanese affiliate and was set up as a [joint venture](/wiki/Joint_venture) between [China Airlines](/wiki/China_Airlines) and Tiger Airways Holdings. China Airlines holds a 90% stake in the new carrier, while Tiger Airways Holdings holds the remaining 10%. The carrier is based at [Taiwan Taoyuan International Airport](/wiki/Taiwan_Taoyuan_International_Airport) and currently has 6 aircraft. It was the first Taiwan-based LCC to start operations and the only LCC in the country that are still flying (The other being [V Air](/wiki/V_Air) of [Transasia Airways](/wiki/Transasia_Airways), which folded in 2016). In 2017, as Tigerair Singapore merged into Scoot, CAPA reports that China Airlines will buy another 10% from Budget Aviation Holdings, leaving China Airlines Group (China Airlines and Mandarin Airlines) the owner of the airline, despite allowed to retain the brand. #### Tigerair Philippines Tigerair Philippines was the Philippines affiliate of Tigerair. The joint venture was announced in November 2010 between Tiger Airways Holdings and [SEAir](/wiki/Cebgo), which saw Tigerair leasing its two Airbus A319 aircraft to SEAir to open up new international routes out of SEAir's base at [Clark International Airport](/wiki/Clark_International_Airport). The DG-coded flights were operated by SEAir's pilots and cabin crew using the leased aircraft which were repainted into SEAir's livery. Seats on these flights were marketed by Tiger in addition to SEAir's own website. In February 2011, Tiger Airways Holdings increased its share in the venture to 40%, however in March 2014, Tigerair disposed of its 40% stake in the airline to [Cebu Pacific](/wiki/Cebu_Pacific), though flights were still temporarily branded as Tigerair Philippines. #### Tigerair Mandala Tigerair Mandala was the Indonesian affiliate of Tigerair. The airline was a joint venture between Tiger Airways Holdings and Saratoga Investama Sedaya. It was technically the oldest airline in the group since it had been operating since 1969. Tigerair ventured into the Indonesian market by buying the troubled [Mandala Airlines](/wiki/Mandala_Airlines), with the Saratoga Group holding a majority 51.3% and the remaining 15.7% by previous shareholders and creditors of Mandala. Tigerair Mandala sported a hybrid livery with the name 'mandala' on the fuselage accompanied by Tigerair's stripes on the tail and wingtips. Tigerair Mandala started operations on 5 April 2012, with one domestic route between its home base [Jakarta](/wiki/Jakarta) and [Medan](/wiki/Medan), the capital of North [Sumatra](/wiki/Sumatra). This was followed by its first international destination when it launched the Medan-Singapore route on 20 April 2012, adding a second Indonesian destination to Tigerair Singapore network after Jakarta. In May 2012, Tigerair Mandala flew to [Malaysia](/wiki/Malaysia)'s capital [Kuala Lumpur](/wiki/Kuala_Lumpur) from Jakarta. Before it ceased its operations, Tigerair had 35.8% Shares. Tigerair Mandala ceased all operations on 1 July 2014 as it was not able to sustain its operations and the airline's key shareholders decided to cease funding the carrier. ### Abandoned regional affiliate projects #### Incheon Tiger On 5 November 2007, Tiger Airways announced that it would be starting a [Korean](/wiki/Korea)-based budget airline. Incheon Tiger was to have been a joint venture between Tiger Aviation Holdings and Incheon Metropolitan City, flying to destinations in [Japan](/wiki/Japan), [China](/wiki/China), [Mongolia](/wiki/Mongolia) and the [Russian Far East](/wiki/Russian_Far_East). The airline was to be based in [South Korea](/wiki/South_Korea)'s [Incheon Airport](/wiki/Incheon_Airport) and planned to begin services by 2009; however, the project was abandoned in December 2008. #### Thai Tiger Tiger Airways and [Thai Airways International](/wiki/Thai_Airways_International) proposed forming an airline based in [Thailand](/wiki/Thailand), where Thai Airways and Tiger Airways would own 51% and 39% respectively of the newly formed airline, while RyanThai would hold the remaining 10%. Operations were expected to begin in the 1st quarter of 2011. Tiger Airways subsequently dropped its plan to form a Bangkok-based low-cost joint venture with Thai Airways after failing to get the necessary investment approvals from the Thai government. As a result, in December 2011 [Thai Airways International](/wiki/Thai_Airways_International), Tiger Airways and RyanThai decided not to proceed with the incorporation of Thai Tiger.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:09:07.348710",
  "title": "Tiger Airways Holdings",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tiger_Airways_Holdings"
}