{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:09:21.720808"
  },
  "content": "British-born bassist living in Singapore (born 1960) **Tim Nolan** (born 1960) is a [British](/wiki/British_people)-born bassist living in Singapore. ## Early life Nolan was born in [Oldham](/wiki/Oldham), Lancashire, United Kingdom in 1960. In the early 1980s he played with Nottingham-based jazz band Pinski Zoo, recording the album *Introduce me to the Doctor*, which garnered the review from [NME](/wiki/NME) of \"Pinski Zoo have put the animal back into music,\" and which included the track \"Stutter Strut\".[*failed verification*] Other albums featuring Nolan included *The Dizzy Dance Record* and *The City Can't Have It Back*. During this time the band gained popularity, with features in music papers such as the NME and [Melody Maker](/wiki/Melody_Maker), and by playing and touring with such bands as The [Eurythmics](/wiki/Eurythmics), [Pigbag](/wiki/Pigbag), and [Alexis Korner](/wiki/Alexis_Korner). After leaving Pinski Zoo, Nolan played with The Howdy Boys, also based in Nottingham. ## Popland From 1998 to 2006, he was in the Singapore band **Popland** with [Kevin Mathews](/wiki/Kevin_Mathews), where they produced 3 CDs, the first being *Pop*, released in 1997 under the name The Crowd (which they later changed to avoid confusion with a U.S. band of the same name). They followed this with 1998's *Groovy*, featuring well-known Singaporean musician Ray Aziz on drums. Aziz appeared live with the band, delivering inventive and powerful rhythms to complement the power-pop of Mathews's and Nolan's songs. He also played drums on their 2002 release *Action*, released on Zip Records. Since then they have been profiled by Singapore's national newspaper, *[The Straits Times](/wiki/The_Straits_Times)*, have played on several Singapore TV shows, been heard worldwide on various radio stations and their music was used in the [The WB](/wiki/The_WB) TV show *[High School Reunion](/wiki/High_School_Reunion_(TV_series))*. The band split in 2006. This Singaporean biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:09:21.720444",
  "title": "Tim Nolan (musician)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tim_Nolan_(musician)"
}