{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:09:30.794924"
  },
  "content": "Sequence of major events in COVID-19 pandemic in Singapore The following is a timeline of the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore) in 2020. ## Timeline ### January DayTotal suspected casesNew cases [note 1][note 2]Total casesRef.1---2---3---41--51--61--71--81--91--102--112--122--132--142--152--163--175--186--196--207--217--2210--2328112444232564-326921427124152817027292043103022631331249316Notes: - **2 January:** The [Ministry of Health](/wiki/Ministry_of_Health_(Singapore)) (MOH) issued a health advisory and implemented temperature checks for passengers arriving in [Changi Airport](/wiki/Changi_Airport) from Wuhan the following day. - **20 January:** Temperature screening at Changi Airport was extended to all travellers coming from China. In addition, individuals with pneumonia who had travelled to Wuhan within 14 days before the onset of symptoms were isolated in hospital. - **22 January:** Quarantine measures were extended to travellers who arrived from China and displayed symptoms. After three more suspected cases were detected, a multi-ministry taskforce was convened to tackle the issues caused by the pandemic. The MOH advised against non-essential trips to Wuhan and expanded the travel advisory the following day to all of Hubei. [MINDEF](/wiki/Ministry_of_Defence_(Singapore)) issued two medical advisories to service personnel. - **23 January:** Schools have asked parents to declare their travel plans and monitor their children's health. - **Between 23 and 26 January:** [Scoot](/wiki/Scoot) cancelled flights to Wuhan over the pandemic, after a [lockdown](/wiki/COVID-19_pandemic_lockdown_in_Hubei) was imposed. The suspension was later extended to 29 March. - **24 January:** - With the first confirmed case, border control measures were enhanced and extended to land and sea checkpoints with the [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority) and [Maritime and Port Authority of Singapore](/wiki/Maritime_and_Port_Authority_of_Singapore) starting temperature checks from noon of that day. - Holiday chalets were being prepared as quarantine centres. Some of these chalets had served as quarantine centres in previous outbreaks, such as the [2003 SARS outbreak](/wiki/Severe_acute_respiratory_syndrome) and [2009 flu pandemic](/wiki/2009_flu_pandemic). Measures such as temperature screening and quarantine facilities were put in place at foreign worker dormitories. Transportation companies like [ComfortDelGro](/wiki/ComfortDelGro), [SMRT](/wiki/SMRT_Corporation) and private hire operators have since taken more precautions against the virus with hand sanitisers, disinfectants and masks provided. Advisories were also distributed. - On the same day, a Scoot flight was delayed in Hangzhou for six hours after one passenger was sent for further testing, causing passengers and crew to be quarantined. The flight returned with Singaporeans three days later. - **25 January:** MOH imposed a visitor limit of two per patient in hospitals to slow the spread of the virus. Some hospitals have discouraged children from visiting. - **27 January:** - Singaporeans were advised to avoid non-essential travel to China. Temperature screening at Changi Airport was also expanded to all incoming flights from 29 January, with extra scrutiny on flights from China and passengers from Hubei. In addition, people returning from China were asked to fill health and travel declarations and monitor their health with regular temperature checks for two weeks. A 14-day leave of absence (LOA) was imposed on students and teachers as well as workers who work with vulnerable populations, such as pre-schoolers, the elderly and the sick, returning from mainland China. Students were asked to do home-based learning instead. In addition to the chalets, university hostels at [National University of Singapore](/wiki/National_University_of_Singapore), [Nanyang Technological University](/wiki/Nanyang_Technological_University), and [Singapore Management University](/wiki/Singapore_Management_University) were prepared as quarantine facilities. Other measures include expanded communication channels, cleaning protocols and disinfection of premises after incidents. - Taxi companies like [ComfortDelGro](/wiki/ComfortDelGro), [SMRT](/wiki/SMRT_Corporation), Premier Taxi and Trans-Cab announced a waiver of cab rental fees should any driver get quarantined. - The government clamped down on false statements and rumours, with the first being a [HardwareZone](/wiki/HardwareZone) forum receiving a [Protection from Online Falsehoods and Manipulation Act](/wiki/Protection_from_Online_Falsehoods_and_Manipulation_Act) (POFMA) notice on a false claim that one man had died due to the virus. The post is deleted a day before the notice is issued. - **28 January:** - Enhanced quarantine measures were announced for those returning from Hubei and those of a higher risk, coming after the detection of seven cases at that point. In addition, travellers from Hubei were denied entry from noon of 29 January. All forms of visas for Hubei travellers were suspended immediately. A $100 allowance per day will be provided to those self-employed under quarantine orders, with home quarantine options available. Hospital bills will be paid by MOH for all suspected and confirmed cases of the virus as the illness is caused by an emerging disease. With the restrictions in place, the [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)) started rejecting new applications for workers from Hubei, with existing applications unaffected. In a joint media statement by the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) (MINDEF) and the [Ministry of Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)) (MHA), National Service (NS) pre-enlistees who had travelled to China and been due for enlistment were given a mandatory leave of absence of up to 14 days. - [Facebook](/wiki/Facebook) is issued a correction notice over a post falsely claiming the closure of [Woodlands station](/wiki/Woodlands_MRT_station) due to the virus. - **29 January:** - [Singapore Airlines](/wiki/Singapore_Airlines) announced a suspension of layovers from 30 January for cabin crew and pilots to Beijing and Shanghai, in a move to protect the safety of all crew. [Jetstar Asia](/wiki/Jetstar_Asia) will suspend flights to Hefei, Guiyang and Xuzhou in China from 30 January until 31 March, after which the suspension will be reviewed. - The [National Environment Agency](/wiki/National_Environment_Agency) released temporary guidelines on disinfecting homes with coronavirus patients to prevent infections even when infected patients are isolated elsewhere. - [Enterprise Singapore](/wiki/Enterprise_Singapore) advised companies to defer trips to China and avoid Hubei province, along with travel and health checks on their staff. They are also advised to make continuity plans in view of the outbreak. It will also work with [Singapore Business Federation](/wiki/Singapore_Business_Federation) on a continuity plan guide for companies. - [Outward Bound Singapore](/wiki/Outward_Bound_Singapore) camps in Pulau Ubin have been designated quarantine facilities. - **30 January:** - The [Ministry of Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)) (MTI) has asked Deen Express to explain their mask prices, and ask [Lazada](/wiki/Lazada_Group), [Carousell](/wiki/Carousell_(company)) and [Qoo10](/wiki/Qoo10) to reveal profiteers of masks. - Public transport operators [SBS Transit](/wiki/SBS_Transit) and [SMRT](/wiki/SMRT_Corporation) stepped up cleaning efforts, including cleaning surfaces of commonly touched areas, as well as disinfecting vehicles. - **31 January:** - The [Ministry of Communications and Information](/wiki/Ministry_of_Communications_and_Information) (MCI) no longer exempts social media platforms, search engines and Internet intermediaries from complying with the Protection from Online Falsehoods and Manipulation Act (POFMA) due to the coronavirus, with these platforms required to comply with general correction directions issued. The exemptions initially applied when the law took effect in October 2019. - Singapore Airlines and [SilkAir](/wiki/SilkAir) will reduce flights to China for the month of February, with Scoot reducing flights to eight cities in China and suspending flights to 11 other cities, later announcing a suspension of all China flights from 8 February due to the worsening situation there. - Two correction notices are issued to AB-TC City News and States Times Review, for falsely claiming that five Singaporeans had been infected without visiting China and that Singapore was running out of masks, respectively. - All new visitors with recent travel history to mainland China within the last 14 days were denied entry from 1 February at 11.59pm. Holders of China passports may be allowed entry into Singapore if they prove that they did not visit China recently, with checks on passports too. All forms of visas for China travellers were suspended immediately. Those returning from China will be put on a 14-day leave of absence. With the restrictions in place, the Ministry of Manpower started rejecting new applications for workers from China, with existing applications unaffected, as well as mandating a 14-day leave of absence for work pass holders returning from China. ### February DayTotal suspected casesNew cases[note 1]New recoveriesActive casesIn ICUTotal recoveredTotal casesRef.Locally transmittedImportedTotal1274-22-18--182301----18--183312----18--184333426-24--245385314-28--2864872-2-301-3073-3-332-3386597-7238424096573-34376643106651121387745116982-22387947128133-363581550138518-8-4371558149229-925061767159915-515461872161,0653-315651975171,11711255342477184-455242981193-355043484201-134843785211-1103954786222132405498923---23855189241-123775390251-153375891262-243176293273-343086696282-232976998294-4330772102Notes: - **1 February:** - The government distributed four surgical masks to each household, first announced on 30 January. These masks are used during this situation voluntarily, before the government makes mask mandatory for all on 14 April. Certain areas such as service lifts and some shops requires people to wear masks. The distribution came after a scramble for surgical and [N95 masks](/wiki/N95_masks), hand sanitisers, and thermometers, which led to shortages and [price gouging](/wiki/Price_gouging). - A tripartite care package is put up for quarantined taxi and private-hire drivers with an additional $100 from companies and another $200 if they are union members. There will also be rental waivers too. - More flights to China are suspended by Singapore Airlines and SilkAir, being 10 additional flights. The cancellations also apply to flights on earlier dates. Jetstar Asia follows suit with suspending flights to Shantou and Haikou from 7 February to 31 March, the remaining services which have not been affected yet. - **2 February:** The [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) announced measures to help the tourism industry. They include funding 50 percent of hotels' third-party professional cleaning fees of up to $10,000 and $20,000 for suspected and confirmed cases respectively starting from 23 January; when the first case was discovered in Singapore. Licence fees for hotels will be waived by the Hotel Licensing Board for the rest of 2020, with travel agents and tour guides not required to pay should they be due for renewal in 2020. - **3 February:** - Several measures are announced to help curb the novel coronavirus, including an assistance package for affected areas in China, as well as health strategies (testing, isolation, quarantines and border measures) and the various scenarios that could play out in the outbreak. They include situations when the virus will strengthen or weaken, and risks of further spread in China or other countries, as well as further local spread and subsequent measures to reduce human to human interactions. In addition, 240 suspect cases are negative with 43 pending, as well as 524 under quarantine (222 in Government facilities and 302 at home). Practices like shunning those on leave of absences and spreading of fake news are condemned, and calls to ensure judicious use of masks are emphasised. More aid for businesses and individuals is planned to cushion the impact of the virus, with the latest measures revealed in the Budget. - The Government announced actions against errant landlords who evict based on nationality and placed either on quarantine or leave of absences, with possible restrictions and permanent bans on renting to foreign work pass holders. - **4 February:** Individuals who had recent close contact with people with travel history to mainland China were contacted in tracing as well. In cases where detection of infected patients happened cross border, authorities would begin epidemiological investigations and identify individuals who had close contact of the case patient upon receiving notification, as seen in the case of a Malaysian who tested positive in Malaysia and likely to have acquired the virus after a meeting with colleagues from China, including one from Wuhan, in Singapore. - **7 February:** Authorities raised the nation's Disease Outbreak Response System Condition (DORSCON) level from Yellow to Orange after more cases with unclear origins surfaced. - **8 February:** [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), the [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore), expressed his worry about some cases with no known chain of transmission of the infection directly from Wuhan or indirectly via cases traced in Singapore. He suggested that it might become \"futile to try to trace every contact\". - **9 February**: All Work Pass holders with travel history to mainland China within the last 14 days were required to obtain Ministry of Manpower's prior approval before attempting to enter Singapore. - **14 February:** - The Ministry of Health reactivated Public Health Preparedness Clinics (PHPCs) and advised doctors to give five days of medical leave for patients with respiratory symptoms. - [Grab](/wiki/Grab_(company)) started GrabCare for healthcare workers. This comes after reports of discrimination due to COVID-19, making it difficult for healthcare workers to get rides. - **16 February:** The [National Environment Agency](/wiki/National_Environment_Agency) launches the \"SG Clean\" campaign to improve hygiene standards. As part of the initiative, a \"SG Clean\" quality mark will be progressively rolled out to sectors with high human traffic starting with hawker centres first, followed by public transport facilities like train stations and bus interchanges. The certification will also cover places like preschools, schools, government buildings, hotels, conference venues, attractions, cruise and ferry terminals, airport terminals, integrated resorts, shopping malls and F&B outlets. In addition, checklists, as well as audits by third-party assessors and agencies shall be used to ensure continued cleanliness. - **17 February:** Stay-Home Notices (SHN) were announced for all Singapore residents and long-term pass holders returning from China, taking effect from 18 February. They were not allowed to leave home within 14 days of arrival, with penalties for breaches. - **23 February:** MOH expanded its health advisory to Daegu and Cheongdo in [South Korea](/wiki/COVID-19_outbreak_in_South_Korea) after the number of cases there spiked quickly. The definition of suspect cases was also expanded to include travellers arriving from these two cities. - **25 February:** Singapore announced a ban on visitors arriving from Cheongdo and Daegu in South Korea from 26 February, following a large increase in the number of confirmed cases there. Singapore citizens, permanent residents and long-term pass holders returning from Cheongdo and Daegu within the last 14 days were issued a SHN lasting 14 days. - **26 February:** ICA announced that a Chinese national with permanent residence in Singapore who breached his SHN, had his PR status revoked and had also been barred from re-entry into Singapore. - **28 February:** Singapore biotech company Veredus launched a COVID-19 test kit for in-vitro diagnosis. It can be used by hospitals and laboratories to confirm clinical diagnoses with 99% accuracy in just two hours. ### March DayNew casesNew recoveriesNew deathsActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Locally transmittedImportedTotalDorm residentsOther14-42-327-7410622-24-306-7810832-2--327-7811042-21-337-7911254152-367-811176112131-489-8213076288-488-90138811112--609-90150973103-6710-93160106-6--7312-931661112-123-829-9617812459--919-961871349131-10311-972001439128-10714-105212155914--12113-10522616611174-13413-1092431761723—5-15214-114266181433473-19615-11731319824325-22115-124345201228407-25416-13138521839479229014214043222518234-30914214445523648548-355152152509241732493-401172155558253538735-46917216063126123285212-50918217268327126224911-54717218373228128417015-6021921988022921624421416291932128443052193516-64819322887931625164712-683223240926 - **3 March:** Singapore will ban visitors arriving from South Korea, Iran and northern Italy from 4 March, with Singapore citizens, permanent residents and long-term pass holders returning from these places to be issued Stay-Home Notices (SHN) lasting 14 days. In addition, all travellers entering Singapore with fever or signs of respiratory illness will be required to undergo swab tests, with penalties for refusal. The travel advisory was expanded to include Iran, northern Italy, Japan and South Korea. - **7 March:** The [People's Association](/wiki/People%27s_Association) suspends activities and classes and activities attended by confirmed cases for 14 days, as well as all singing classes at affected Community Centres and Residents' Committees. This comes after several people from the SAFRA Jurong cluster attended these lessons. - **10 March:** - MOH announced that government agencies will suspend activities for seniors from 11 March for 14 days. This comes after many people went out while unwell. In addition, social distancing will be implemented for other activities. Senior care services will continue running with additional precautions. - Singapore allowed 600 passengers to disembark from the Italian cruise ship *[Costa Fortuna](/wiki/Costa_Fortuna)*, after being denied by Malaysia and Thailand ports with all passengers found to be well. The majority of them left for the airport immediately. The director-general of the [World Health Organization](/wiki/World_Health_Organization), [Tedros Adhanom](/wiki/Tedros_Adhanom), has praised the government's approach to containment. - **12 March:** [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) delivered his second address to the nation on the outbreak. He mentioned that the DORSCON level will remain Orange. He also stated that Singapore will not isolate from the rest of the world, taking temporary control measures instead. - **13 March:** Singapore announced a ban on visitors arriving from Italy, France, Spain and Germany from 15 March at 11.59pm, with Singapore citizens, permanent residents and long-term pass holders returning from these places to be issued Stay-Home Notices (SHN) lasting 14 days. Singapore citizens are also advised to defer all non-essential travel to Italy, France, Spain and Germany, review travel plans and exercise caution while travelling. Singapore also ceased port calls for all cruise vessels with immediate effect. Any traveller showing symptoms at checkpoints will serve SHNs lasting 14 days, even with negative results for COVID-19. All new ticketed cultural, sports and entertainment events with 250 people or more must be deferred or cancelled. If tickets are already sold, event organisers must take measures to ensure safety of participants before being allowed to proceed. Organisers of gatherings are advised to reduce crowds and contact between people, as well as public venues. Employers were also encouraged to allow [remote work](/wiki/Remote_work) and [flextime](/wiki/Flextime). - **15 March:** Singapore announced all people who enter Singapore with recent travel history to [ASEAN](/wiki/ASEAN) countries, Japan, Switzerland and the United Kingdom will be issued with a 14-day Stay-Home Notice. In addition, all short-term visitors who are nationals of any ASEAN country will have to submit requisite information on their health to the Singapore Overseas Mission in the country before their intended date of travel. Short-term visitors are required to get MOH's approval before entering Singapore. Separate arrangements are being worked out for travellers arriving from Malaysia by land and sea checkpoints in view of the close proximity between the two countries. Travellers are also advised to defer all non-essential travel for the next 30 days. - **16 March:** Incoming FDWs would be required to serve a 14-day Stay-Home Notice. If they were new FDWs they would have to stay at another accommodation such as dormitories, hostels or hotels before they could start working. For those returning, they could stay at the employer's residential address for the stay at home notice, or an alternative accommodation at the employer's expense. - **18 March:** Singapore announced all travellers entering Singapore from 20 March, 11.59pm will be issued a 14-day Stay-Home Notice. In addition, more social distancing measures could be proposed. Singaporeans are advised to defer all travel abroad in a bid to reduce imported cases. - **20 March:** The [Government Technology Agency](/wiki/Government_Technology_Agency) launched a smartphone app [TraceTogether](/wiki/TraceTogether) to boost contact tracing efforts, the first such app in the world. In addition; more social distancing measures were announced, including the suspension of all events and gatherings with 250 people or more with immediate effect until 30 June, ensuring 1 metre separation in public venues, and suspending all activities for seniors for another 14 days until 7 April. A guide on safe distancing measures has also been drawn up by [Enterprise Singapore](/wiki/Enterprise_Singapore) and [Singapore Tourism Board](/wiki/Singapore_Tourism_Board). - **21 March:** The [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)) revoked 89 work passes for breaching entry approval and Stay-Home Notice (SHN) requirements. - **22 March:** Singapore announced a ban on all short-term visitors arriving or transiting through Singapore starting from 23 March, 11.59pm. This comes after a spike in imported cases of COVID-19. Only people working in essential services like healthcare services and transport will be allowed into Singapore during this time. In addition, the Singapore-Malaysia Special Working Committee have agreed to have Malaysians with work permits to continue working in Singapore. Discussions are ongoing. - **23 March:** The [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority) announced that from 27 March, 9:00am, all travellers arriving in Singapore, including Singapore citizens and permanent residents, must submit a health declaration online prior to proceeding with immigration clearance. Those who do not submit their health declaration prior to arriving in Singapore will be required to do so upon arrival at the checkpoint. In addition, all hardcopy immigration forms will no longer be issued from 27 March. On the same day, the Ministry of Health also mentioned that COVID-19 patients who are well and stable are being transferred to selected hospitals. 20 patients were sent to [Concord International Hospital](/wiki/Concord_International_Hospital) and 29 patients were sent to [Mount Elizabeth Hospital](/wiki/Mount_Elizabeth_Hospital). This is to free up space in public hospitals. - **24 March:** It was announced that from 26 March, any resident returning from the US or the UK would be required to serve their SHN in dedicated hotels. Returnees would be charged full hospital rates if they left Singapore from 27 March and were admitted for treatment of COVID-19 within 14 days of their return. All entertainment outlets, nightclubs, bars, places of worship, attractions and tuition centres were closed from 26 March, and all mass events were cancelled regardless of size. Groups other than for work and school purposes will be limited to 10 people at any time, as well as for groups for diners and private worship. The remaining public places such as transit stations and shopping centres were required to reduce crowd density to one person per 16 square metres of space, failing which they will be asked to close. These measures will last and the review will be conducted. These measures took effect from 27 March with 1 metre (3.3 ft) of social distancing enforced. - **26 March:** New regulations were created to enforce breaches in legislation, such as Stay-Home Notices being violated. Punishments included jail terms of up to six months, fines of up to S$10,000 or both. - **27 March:** [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) announced that schools (Primary, Secondary & Centralized Institutes) will implement one day of Home Based Learning (HBL). - **28 March**: The government issued advice via WhatsApp that people should stay at home and should avoid malls with the exception of buying essentials such as food and groceries. - **29 March**: - According to the [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority), [Ministry of Education](/wiki/Ministry_of_Education_(Singapore)) and [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)), all long term pass holders (i.e. long-term visit pass holders, student pass holders or those with an in-principle approval for a long term pass) are required to get approval for entry before they arrive in Singapore. The penalty for not having an approval letter would result in refused admission, turned around and pay for their flight out of Singapore within 48 hours. Non-compliance will result in having their pass or in-principle approval cancelled. - The [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority) cancelled the passport of a Singaporean as he did not abide by his Stay-Home Notice. He was not allowed to leave the country even though he is a Singaporean citizen. ### April DayNew casesNew recoveriesNew deathsActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsNon-dorm work permit holdersCommunityImportedTotal1133391974517522432451,000284298492117792342661,0493225299651618272552821,1144279327751518862662971,1895581543412023-9832563201,30963472416624-1,0252563441,375757838310633-1,0982963771,481874858214229-1,2112964061,62392281145328754-1,4432964611,910101411641-1983011,6093274922,108111521227-1913611,7633185282,299121881926-23332-1,9643185602,532133341438-3862612,3232995862,918142751940-3342512,63128106113,25215406437-44740-3,03626106533,699166762626-72831-3,73423106834,42717562342616232314,33622117035,050188932722-94234-5,24423117375,992195481830-59626-5,81422117636,588201,3713025-1,42624-7,21623117878,014211,0503328-1,11138-8,28927118259,125229673217-1,0165719,247251288210,141239823025-1,03716-10,248261291811,178248531925-89738-11,107241295612,07525597129-61846-11,67924121,00212,693268862117293158-12,55222121,06013,62427764818-79935213,31420141,09514,42328511410-52833-13,80921141,12814,951296601611-69060-14,43922141,18815,64130488229-52864114,91021151,24416,169 - **3 April:** With evidence of growing spread within the community and the risk of asymptomatic spread, [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) announced a much stricter set of measures that would be implemented from 7 April to at least 4 May, collectively called a \"[circuit breaker](/wiki/2020_Singapore_circuit_breaker_measures)\". - All non-essential workplaces, including [Singapore Pools](/wiki/Singapore_Pools), will be closed or converted to [remote work](/wiki/Remote_work) during this period. - Dining-in is prohibited as it is a dangerous activity. - Government authorities will distribute reusable masks to every household from 5 April to 12 April. - Schools and universities will move to home-based learning, and preschools will close except to provide services for parents without alternative care arrangements, from 8 April to 4 May. - Advertisements on shopping malls that are non-essential should not be shown or advertised, only essential service offers and safe management measures (social distancing and mask wearing) are allowed. - Graduation ceremonies in both ITE and polytechnics will not be held during this time. - The [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF) also announced that they would defer all in-camp training and individual physical proficiency tests for operationally-ready NSmen until 4 May, while those in administrative roles will work from home wherever possible, and announces its suspension of Basic Military Training (BMT) from 7 April to 4 May due to the minimal impact it will have on operations as active units would be able to provide cover. The [Singapore Police Force](/wiki/Singapore_Police_Force) and [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) followed suit. - Marina Bay Sands also announced that it would suspending all services during this period. This would include all the attractions such as the [ArtScience Museum](/wiki/ArtScience_Museum), The Shoppes, as well as food and beverage outlets. The casino was also to close for the aforementioned time. All reservations during those nights would be cancelled. - The [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority) (ICA) announced that it will be restricting counter services at its Kallang building and people should use the electronic services. Only those with pre-approved appointments will be allowed entry. - Changi Airport will gradually be suspending terminals 2 and 4 from 1 May 2020. - **4 April:** Expanding on the measures announced on 24 March, the government announced that the 14-day SHN at dedicated hotels for US and UK returnees, would also include returning residents from ASEAN countries, France, India and Switzerland. - **5 April:** - S11 Dormitory @ Punggol and Westlite Toh Guan are declared isolation areas under the Infectious Diseases Act by MOH to control COVID-19 cases there, the first two dormitories to do so. This results in 13,000 and 6,800 workers being quarantined respectively. - Two were arrested for leaking a draft statement on school closures on WhatsApp before the official announcement at 4.30 pm, breaching the Official Secrets Act. - **6 April:** - The [Singapore Prison Service](/wiki/Singapore_Prison_Service) will suspend family visits from 7 April to 4 May due to COVID-19. - Toh Guan Dormitory is declared an isolation area under the Infectious Diseases Act by MOH, the third dormitory to do so. - **7 April**: A new Bill was passed that allows the Minister to issue regulations to control the spread of COVID-19 - called *COVID-19 (Temporary Measures) Act*. Gatherings of up to 5 persons were allowed until 4 May, and was further reduced to 2 persons up to 1 June. The law will also allow the Minister to close premises to minimize risks of infection, and acquire land and property for patient isolation purposes. The law lasted as a contract signed. - **8 April:** Following on the rules announced on 24 March and 4 April, it was announced that all returning Singapore residents would serve out their 14-day SHN at hotels from 9 April. - **9 April:** - Sungei Tengah Lodge is declared an isolation area under the Infectious Diseases Act by MOH, the fourth dormitory to do so. - MOH announced that all hospitals would restrict visitors except in exceptional circumstances. - In spite of the several requests for gatherings to be reduced and limited made by the COVID-19 Multi-Ministry Task Force, many would still gather in groups in public areas. Hence, the Task Force announced that stadiums will be closed, and that further measures will be tightened if the people do not adhere to the regulations. In addition, parents will not be allowed to drop their children at their grandparents' place on a daily basis, to protect seniors from infections. - In order to deal with the COVID-19 outbreak in foreign worker dormitories, it was announced that several measures were being put in place to help reduce transmission: workers would no longer prepare their own meals, these would be provided for them; disinfection and rubbish clearance would be increased. At the same time, it was announced that those foreign workers who were well and worked in critical services would be housed in alternative accommodation such as HDB blocks which had been purchased as part of the [Selective En bloc Redevelopment Scheme](/wiki/Selective_En_bloc_Redevelopment_Scheme), military camps such as Bedok Camp II and Jurong Camp II, [Changi Exhibition Centre](/wiki/Changi_Exhibition_Centre) and offshore hotels. - Following several security breaches involving obscene content, the [Ministry of Education](/wiki/Ministry_of_Education) suspended the use of [Zoom](/wiki/Zoom_(software)) and will be investigating the matter. - Parkway Pantai Group Hospitals, [Mount Alvernia Hospital](/wiki/Mount_Alvernia_Hospital) and [Farrer Park Hospital](/wiki/Farrer_Park_Hospital) have reserved beds to receive COVID-19 patients to free up load at Public Hospitals. - **10 April:** - Tampines Dormitory is declared as an Isolation Area under the Infectious Disease Act, the fifth dormitory to do so. - MOM and the [Land Transport Authority](/wiki/Land_Transport_Authority) announced new distancing guidelines for those transporting essential workers on lorries. - With the increase in the number of cases of foreign workers being infected, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) appeared on television to address the ways in which they were working to support these workers. At the same time, he stressed the need of people to not visit each other and to conform to social distancing. - The [National Environment Agency](/wiki/National_Environment_Agency) (NEA) requires anyone entering markets to wear face masks from 12 April. - **11 April:** - Following on from the announcement on 9 April that involved moving healthy key foreign workers to other places to live on a temporary basis, it was announced foreign workers would also be housed, albeit temporarily, in a variety of different locations including void decks and car parks of HDBs which were still under construction and possibly in floating facilities run by a variety of private companies. - Transport Minister [Khaw Boon Wan](/wiki/Khaw_Boon_Wan) said that even after the circuit breaker is lifted, people using public transport will be required to wear masks as safe distancing would not be possible. The [Singapore Food Agency](/wiki/Singapore_Food_Agency) said that masks would be required for anyone who sells or prepares food. Failure to comply could result in a fine or stoppage of operations. Anyone who went to supermarkets, convenience stores, pharmacies or shopping malls would need to wear a masks or they would be refused entry according to [Enterprise Singapore](/wiki/Enterprise_Singapore) and the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board). - National Development Minister [Lawrence Wong](/wiki/Lawrence_Wong) announced that all beaches in Singapore are closed to the public. - MOM released a statement encouraging Foreign Domestic Workers (FDWs) to remain at home on their designated rest days. - From 12 April, offenders who breach the circuit breaker measures will be fined immediately. Originally, the first offence would result in written warnings, the second resulting in a fine and prosecution from the third offence. This comes after many people did not take safe distancing measures seriously. Selected parts of park and nature reserves were closed off. - **12 April:** - Two more dormitories are declared as isolation areas, which are Acacia Lodge and Cochrane Lodge 1. This is after new clusters were formed there. Another dormitory, Cochrane Lodge II, was declared as an isolation area hours later. - All playfields managed by [Singapore Land Authority](/wiki/Singapore_Land_Authority) (SLA) are closed with immediate effect due to people not abiding by safe distancing rules. - For failing to abide by the circuit breaker, a work pass holder had his work pass revoked and banned from working in Singapore ever again. - **13 April:** - MOM announced that it had revoked the work passes of 24 people for failing to observe the social distancing measures set out by the circuit breaker. These former work pass holders would also be banned from working in Singapore. - After banning the use of Zoom on 9 April for Home-Based Learning, MOE announced that schools can resume its use after implementing new safety measures. - **14 April**: Minister for National Development Lawrence Wong announced that wearing a mask was compulsory when not at home, with fines and ultimately prosecution for offenders. Plans are also underway to tighten the list of essential services to ensure distancing. - **15 April:** Due to the high number of interactions that delivery drivers have with various members of society, delivery drivers were warned that they could be suspended, on top of already existing penalties. - **16 April:** Mandai Lodge 1 is declared as an isolation area due to the new cluster being formed. - **17 April:** Three dormitories, Shaw Lodge Dormitory, North Coast Lodge and Tuas View Dormitory are declared as isolation areas after a rise in infections there, bringing the total to 12. - **18 April:** Kranji Lodge 1 is declared an isolation area, bringing the total to 13. - **19 April:** [McDonald's Singapore](/wiki/McDonald%27s_Singapore) suspended operations until 4 May as advised by the Ministry of Health. This was due to new clusters being formed at restaurants. - **20 April:** Five dormitories, Avery Lodge, Cassia @ Penjuru, Westlite Mandai Dormitory, PPT Lodge 1A, and Jurong Penjuru Dormitory 1 are declared isolation areas, bringing the total to 18. - **21 April:** - A factory-converted dormitory is declared an isolation area, bringing the total to 19. - Prime Minister Lee Hsien Loong announced that the circuit breaker would be extended to 1 June, partly due to a sustained number of unlinked cases in the community. Existing measures would also be tightened until 4 May, including tightening the list of essential services, and restricting entry to certain hotspots such as wet markets. In addition, all workers residing in dormitories will not be allowed to work until 4 May, and measures announced as part of the Solitary Budget will be extended to May, costing an additional S$3.8 billion. - Crowd control will be implemented at four wet markets, with the last digit of NRICs to determine entry (even for even days, odd for odd days). - The list of essential services are tightened, with standalone food and beverage shops and barber shops not allowed to operate from 11.59pm. Eateries and vending machines in parks will also be shut. Optician shops will not allow walk-ins from 22 April, while pet and laundry shops can only operate online with physical shops closed. Other restrictions include staff cuts in shops, recording workers' entry and exit, a ban on cross-deployment, as well as temperature taking and particulars for contact tracing before entering supermarkets and malls. - The June school holidays will be moved forward to 5 May in view of the extended circuit breaker, with lessons resuming on 2 June. Exams will also be rescheduled, and Term 3 will be longer with a short break from 20 to 26 July. Common last topics usually tested in national examinations will not be covered to account for lost curriculum time. These topics will still be taught. - **23 April:** - Two dormitories, Homestay Lodge and Changi Lodge 2 are declared isolation areas, bringing the total to 21. - A civil servant was arrested for leaking out COVID-19 case numbers on 16 April and will be charged for the breach of Official Secrets Act. - It was reported that a new 15,000 bedder facility would be opened to house either COVID-19 patients or foreign workers at the Tanjong Pagar Terminal. - **24 April:** Four more dormitories, Tuas South Dormitory, Jurong Penjuru Dormitory 2, CDPL Tuas Dormitory and 21B Senoko Loop are declared isolation areas, bringing the total to 25. - **26 April:** A 60-year-old [British](/wiki/British_people) man was deported and barred from re-entering Singapore after providing false information regarding his travel history. He had entered the [Family Justice Courts](/wiki/Family_Justice_Courts_of_Singapore) and declared that he had not been away from Singapore for 14 days when he had in fact returned from Hong Kong within a 14-day period before entering the FJC. ### May DayNew casesNew recoveriesNew deathsActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsNon-dorm work permit holders[note 1]CommunityImportedTotal192048-93224115,81723161,26817,101243845-44779116,18424171,34717,5483639711-65761116,77922181,40818,205456534-57249-17,30325181,45718,778561849-63162-17,87324181,51919,41067641212-788115218,54423201,63420,198772086-73478-19,20719201,71220,9398729310-742328-19,64722202,04021,7079743191753256-20,14423202,29622,4601086483-876425-20,59522202,72123,3361148312-486504120,54124213,22523,7871288013-884626-20,79920213,85124,6711367014-675958-20,51619214,80925,34614750-2-7521,164-20,10420215,97326,0981579111-7931,275-19,62218217,24826,8911645735-4651,094118,99216228,34227,3561767345-682998-18,67616229,34028,03818303-2-305495-18,48612229,83528,34319450-1-451530-18,407102210,36528,794205628-570842-18,135112211,20729,3642143513-448910117,672102312,11729,812226104-614838-17,44882312,95530,4262363111-642927-17,16382313,88231,068245444-548994-16,71782314,87631,616253386-344862-16,19982315,73831,960263812-383706-15,87682316,44432,343275294-533832-15,57772317,27632,876283712-3731,018-14,93272318,29433,249296029-6111,337-14,20682319,63133,860305015-5061,096-13,61672320,72734,366315162-518972-13,16282321,69934,884Notes: - **1 May:** SHN for those holding construction work permits and S Passes is extended to 18 May. - **2 May:** Some Circuit Breaker measures will be eased in preparation for the lifting on 1 June, with [Traditional Chinese medicine](/wiki/Traditional_Chinese_medicine) (TCM) shops and essential condo activities allowed from 5 May, and businesses like home-based bakeries, some food shops, barbers, manufacturing of confectionery, and laundry allowed from 12 May. Schools will be allowed to resume face-to-face lessons for smaller groups in graduating cohorts and those requiring urgent assistance from 19 May. MOH also announced that use of the SafeEntry contact tracing system would become mandatory at all places with the exception of homes. - **6 May**: Mustafa Centre re-opened after a month's closure from 29 March. - **8 May:** Amid growing concerns over the possible spread of infections to senior citizens, the government announced that it would test, over the coming weeks, the 16,000 or so residents across roughly 80 nursing homes. After a number of staff working at community care and recovery facilities tested positive to COVID-19, the government said that it would be reviewing measures and processes to ensure that they were adequately protected. In addition, all TCM shops will be allowed to sell retail products again from 12 May, coming after feedback from seniors on travelling to TCM medical halls, which are too far for them. - **11 May:** After suspending operations on 19 April, McDonald's reopened most of their restaurants for deliveries, drive-through services and takeaways. In addition, a 64-year old Singaporean man faced four charges under the Infectious Diseases Act after he failed to observe his SHN until 3 April, following his arrival from Indonesia on 20 March. - **12 May:** [Changi Airport](/wiki/Changi_Airport) Terminal 4 will be suspended indefinitely from 16 May, reopening only when demand resumes. - **19 May**: After the end of the circuit breaker period on 1 June, Singapore will reopen in three stages. The economy is planned to resume from 2 June 2020, and schools will also reopen in two stages. From 2 June 2020, kindergartens will also reopen. A 47-year-old Indian national but citizen of the Dominican Republic, Kiri Manish Pravinchandra, was charged for falsely declaring that he had not been abroad for 14 days and was thus allowed to enter the Supreme Court, when he had in fact returned from the United States within the 14 day notice period. - **28 May:** The Multi-Ministry Taskforce announced that, taking into account recent scientific evidence, any COVID-19 patient who made it through to Day 21 of the illness but is considered \"clinically well\" can be discharged as they are no longer infectious after this time. This step would not include immuno compromised cases who would still require two negative PCR tests before they would be allowed to be discharged. - **31 May:** The Health Ministry (MOH) announced that all nursing home staff members and residents had been tested, which included some 13,200 residents and 9,000 staff. From this round of surveillance, only five had tested positive. ### June DayNew casesNew recoveriesNew deathsActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsCommunityImportedTotal1408--408767112,80272422,46635,29225404-544709-12,63762423,17535,83635627-569407-12,79952423,58236,405450215-517322-12,99452423,90436,922525011-271305-12,95042424,20937,18363377-344350112,94342524,55937,527736914-383327-12,99932524,88637,91083842-386482-12,90342525,36838,29692126-218509-12,61232525,87738,514104447-451655-12,40832526,53238,965114166-422754-12,07622527,28639,3871244518-463754-11,78522528,04039,850133425-347768111,36312628,80840,1971439791407781-10,98922629,58940,604152113-212777-10,42622630,36640,818161492-151797-9,78022631,16340,969172425-247775-9,25222631,93841,216182534-257774-8,73522632,71241,473191411-142747-8,13022633,45941,615202162-218765-7,58312634,22441,8332125210-262718-7,12712634,94242,095222171-218648-6,69712635,59042,313231154-119405-6,41112635,99542,432241847-191304-6,29812636,29942,623251085-113305-6,10612636,60442,736262136-219221-6,10412636,82542,9552728011-291338-6,05712637,16343,2462820112-213345-5,92512637,50843,459291957-202477-5,65012637,98543,6613024051246515-5,38112638,50043,907 - **1 June:** - This day was the final day of the eight week circuit breaker. - Masks that closely fit and cover the nose and mouth completely will be the basic requirement. Some exemptions would be allowed in the form of face shields, like for children under 12 years, teaching in schools and medical conditions. - **2 June:** - This day was the first day of Phase 1 of reopening. Gatherings of up to 5 persons are allowed, home visitors are allowed up to 5 persons. - Grab announced a series of measures as a result of COVID-19. These include no longer allowing passengers to sit in the front seat and passengers would need to complete health and hygiene declarations before each trip. - Seven people who gathered in Robertson Quay on 16 May were charged for breaching rules designed to curb the spread of COVID-19. 4 were British citizens: Neil Gordon Buchan, 30; Perry Scott Blair, 37; James Titus Beatt, 33; and Joseph William Poynter, 35; 2 were Americans: Bao Nguyen Brown, 40; Jeffrey George Brown, 52; and 1 was Austrian: Michael Czerny, 45. Neil Buchan was a broker with [Clarksons](/wiki/Clarkson_plc) focusing on subsea and renewables for his entire career since graduating from the [University of Glasgow](/wiki/University_of_Glasgow) in 2012. Joe Poynter was Managing Director for Asia at Genero, a marketing company, after graduating from [University of Reading](/wiki/University_of_Reading) in 2006. Jeff Brown was president at FGE and led its oil and gas consulting teams. - **3 June:** - The [Health Promotion Board](/wiki/Health_Promotion_Board) (HPB) announced that a drive-through test centre for \"priority groups\" located at One Farrer Hotel had been opened, though it was not clear which groups precisely were being targeted for this service. - The Ministry of Foreign Affairs and Ministry of Trade and Industry announced measures to open \"Fast Lanes\" for travellers between Singapore and six Chinese locations (Chongqing, Guangdong, Jiangsu, Shanghai, Tianjin and Zhejiang). This includes requiring company or government sponsorship; taking and receiving (at own cost) a negative PCR test before departing, as well as upon arrival; staying in pre-designated location (at own cost). They will be required to pay for their own treatment if they test positive for COVID-19. - **4 June:** According to Health Minister Gan Kim Yong, more than 408,000 COVID-19 tests have been conducted in Singapore as of 1 June 2020. - **9 June:** It was announced that if Singapore residents kept to their terms of the China fast lane agreement, they would not need to pay coronavirus-related medical bills at Singapore public hospitals. - **10 June:** A 35-year-old female Singapore Citizen was charged after failing to abide by her Stay-Home Notice (SHN) requirements. She arrived from Johor Bahru on 30 April 2020, but left her hotel in Novena on 4 May, visiting several locations before returning to the hotel on 12 May. - **11 June:** Singapore Airlines announced that it would allow passengers on Singapore Airlines and SilkAir flying from certain Australian and New Zealand cities in would be allowed to transit through Changi Airport with immediate effect, subject to certain conditions. The cities were Adelaide, Brisbane, Melbourne, Perth (via Scoot) and Sydney in Australia, while Auckland and Christchurch for New Zealand. Transfers would only be allowed between airlines within the SIA Group and that transit and non-transit passengers will be kept apart at Changi Airport. - **15 June:** - It was announced that Phase 2 of reopening would start from 19 June for economic reasons. - Seven workplaces were ordered to stop operations over lapses in safe management measures as of 15 June, after the end of the \"circuit breaker\" according to the Ministry of Manpower. MOM also said that it had issued 52 fines. - Trade and Industry Minister Chan Chun Sing said that those travellers who would be using the \"fast lane\" arrangement would be allowed to appeal to have swab tests instead the 14-day stay-home notice. - **16 June:** - It was announced that Singapore scientists from Singapore's Duke-NUS Medical School testing a COVID-19 vaccine from Arcturus Therapeutics would start human trials in August. - The [National Environment Agency](/wiki/National_Environment_Agency) said that it would allow the opening of Choa Chu Kang Cemetery and all government-managed columbaria from the start of Phase 2 on 19 June 2020. - Two British citizens, who are also Singapore permanent residents, were charged in relation to the gathering at Robertson Quay on 16 May for breaching rules designed to curb the spread of COVID-19: Alfred Jon Veloso Waring, 34, and Olagunju Daniel Olalekan Olasunkanmi, 30. They could be jailed for up to six months, fined up to S$10,000, or both. While the result of their case was not published, Waring was still posting photos on Instagram from Singapore after the case was completed, suggesting he had not been ejected or banned from Singapore. - According to Transport Minister Khaw Boon Wan, the Changi Airport Terminal 5 project could be delayed by at least two years due to the pandemic. - The Ministry of Manpower announced that all foreign workers who were residing in dormitories would have to both download and activate the tracing app TraceTogether by the start of Phase 2. - **17 June:** - The Ministry of Manpower announced that foreign domestic workers, who had previously been advised to stay at home during their rest days in Phase 1, were being told not to gather in large groups on their rest days and that employers should try to allow them to take their rest days during the week instead. - The Ministry of Health announced that nursing home residents would be allowed to have one visitor daily. Though the visiting time would be limited to 30 minutes. - Two people, Nur Muhammad Danish Safhuda Bin Safar Rudin, 19, and Izzati Nadirah Ibrahim, 25, were charged for gathering more than the prescribed limit (2 persons) on 25 April 2020 to ride personal mobility devices with others. - The Ministry of Education said that all students will return to school every day from 29 June 2020, while university, polytechnic and other institute of higher learning students will progressively return. - Dining in is allowed to resume in group sizes of up to 2 persons due to high risk activity, and masks can only be taken out when eating or drinking. Hence, barring another superspreader, group sizes will then increase to 5 persons from 16 July 2020. - Newspaper vendor, Palanivelu Ramasamy, 48, was jailed for two weeks for breaching his stay-home notice to deliver newspapers at [Goldhill Plaza](/wiki/Goldhill_Plaza). - **18 June:** - The Ministry of Health announced that it would expand its testing strategy which previously involved groups such as seniors 65 years old and above, healthcare workers, staff members of educational institutions, as well as students aged 13 and above. Under the new strategy starting in the week beginning 22 June, they would test anyone for COVID-19 who are aged 45 and above and are diagnosed with acute respiratory infection (ARI) with the ultimate aim of testing everyone who are diagnosed with ARI. - The Ministry of Culture, Community, and Youth provided new advisories for the gradual resumption of activities in places of religious worship. Some events would allow up to 20 attendees, and worship services would allow 50 person, adhering with safe distancing measures. - **20 June:** - Several enforcement actions were taken after overcrowding in the expat enclave of [Holland Village](/wiki/Holland_Village,_Singapore) on 19 June. - The Urban Redevelopment Authority (URA) ordered a restaurant, British Indian Curry Hut, to close immediately. It would only be allowed to provide takeaway service for a week, and then would be allowed to reopen for dining in 29 June. - Five people were fined for violating safe distancing rules, with investigations still ongoing for other possible breaches. - URA also announced that Lorong Mambong, where most of the restaurants were located would reopen to traffic to prevent people gathering on the streets. - **25 June:** - Health Minister [Gan Kim Yong](/wiki/Gan_Kim_Yong) announced that from 1 July everyone age 13 and above would be tested for COVID-19 if they present symptoms of acute respiratory infection. - Minister for National Development Lawrence Wong declared that by the end of July up to 80 per cent of migrant workers in dorms would be cleared of having COVID-19, and that around 120,000 had either recovered from or tested negative for COVID-19 up to this point. - The seven people who gathered in Robertson Quay on 16 May were fined between S$8,000 and S$9,000 for breaching rules designed to curb the spread of COVID-19. Concurrently, six of those people who were on work passes had their passes revoked and were permanently banned from working in Singapore. - **28 June:** - The government announced that from today, the first batch of [TraceTogether](/wiki/TraceTogether) Tokens ([contact tracing](/wiki/Contact_tracing)) will be distributed to the seniors who were not digitally connected and were at a higher risk from COVID-19. The TraceTogether token would only communicate with other tracing apps and tokens, it has no GPS nor any connectivity to the internet or cellular service. - Chico Loco and Moonstone bars, two F&B businesses along Amoy Street, were fined S$1,000 each and were ordered to cease operations immediately after they allowed customers to consume alcohol on premises after 10.30 pm. - **30 June:** - ICA announced that five Singaporeans had been charged for breaching requirements of their stay at home notice, 3 arrived from Malaysia and 2 from Indonesia. - The MOM said that a further 78 migrant workers dormitories have been cleared of COVID-19, bringing the total number of cleared workers to 87,000 as of 28 June. ### July DayNew casesNew recoveriesNew deathsActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsCommunityImportedTotal1201104215511-5,08512639,01144,1222177101188418-4,85512639,42944,3103155113169340-4,68412639,76944,479417591185348-4,52122640,11744,6645111187136324-4,33322640,44144,8006157233183276-4,24022640,71744,9837134193156285-4,11212641,00245,140814693158321-3,94812641,32345,2979103211125322-3,75112641,64545,42210174151190135-3,80612641,78045,61211145241170246-3,73012642,02645,7821217611178259-3,64912642,28545,96013406115322256-3,71512642,54146,282143387234719613,865-2742,73746,62915229155249251-3,863-2742,98846,87816233114248268-3,843-2743,25647,1261731593327321-3,849-2743,57747,4531818778202256-3,795-2743,83347,6551924485257253-3,799-2744,08647,91220110112123285-3,637-2744,37148,0352138793399213-3,823-2744,58448,4342229686310211-3,922-2744,79548,7442334185354220-4,056-2745,01549,0982427232277157-4,176-2745,17249,3752550526513180-4,509-2745,35249,8882647254481269-4,821-2745,52150,36927452215469171-5,119-2745,69250,8382835522359201-5,277-2745,89351,1972932734334105-5,406-2746,09851,5313027044278210-5,474-2746,30851,8093139033396183-5,687-2746,49152,205 - **1 July:** At Marina Bay Sands, the ArtScience Museum, the Casino and Sands SkyPark Observation Deck joined the other venues in MBS in resuming operations, albeit progressively. Again, access was restricted to SRC members only, and in the case of the casino those SRC members holding Gold status or higher and who were below 70 years of age or existing Annual Levy Holders. The casino at Resorts World Sentosa, Universal Studios Singapore and Singapore Zoo, will also be allowed to open again. - **2 July:** MOH announced that they picked up a cluster at Block 111 Tampines Street 11. As a precautionary measure, MOH has placed the 58 households residing within the same section of the block as the confirmed cases under active phone surveillance and is facilitating COVID-19 testing for them and their visitors. - **13 July:** 12 people (nine men and three women) were deported and barred from re-entering Singapore due to flouting social distancing measures during the circuit breaker period. - **14 July:** 193 more migrant worker dormitories have been cleared of COVID-19 today, bringing the total to 818. MOM further announced that 215,000 have recovered or tested negative. - **15 July:** The dormitory at 11 Tuas Avenue 10 has been cleared, now housing only recovered cases and cases who have been tested negative; the cluster has thus been closed. - **21 July:** 28 people who flouted safe distancing regulations will be charged in court. In the first of the two cases, 18 people, comprising 17 Singaporeans and one permanent resident aged 19 to 37, held a party at a home during the circuit breaker when social gatherings were not allowed. In the second case, 10 people met at a public fitness corner and drank alcohol during phase two after the circuit breaker was lifted. - **24 July:** Minister for National Development Lawrence Wong declared that testing for all dormitories housing foreign workers would be cleared by the first week of August, with the exception of 17 blocks that are to serve as quarantine facilities. - **27 July**: 4 bus drivers who were driving bus services 176, 184 and 976 were infected with COVID-19. - **29 July:** The Ministry of Manpower said that 95 more foreign worker dormitories have been cleared of COVID-19. This took the total number of cleared dormitories to 975. As of 28 July, about 262,000 workers have either recovered from COVID-19 or were tested to be free from the disease. ### August DayNew casesNew recoveriesActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsCommunityImportedTotal1301153072495,745-2746,74052,5122307153131865,872-2746,92652,8253216192262535,84512747,17953,0514286272952755,86512747,45453,3465903149083146,45912747,76854,2546293443012636,497-2748,03154,5557235162422836,458-2748,31254,7978125161322716,319-2748,58354,9299171131753326,162-2748,91555,104101751121886945,656-2749,60955,292115623615195,198-2750,12855,3531230111423924,848-2750,52055,3951391561022164,734-2750,73655,4971479-4833134,504-2751,04955,5801562316814724,113-2751,52155,661167826864323,767-2751,95355,7471785-6913973,461-2752,35055,8381897121001833,378-2752,53355,938198526932773,194-2752,81056,0312066-2683092,953-2753,11956,09921976131165322,538-2753,65156,216224325502692,319-2753,92056,2662373113872442,162-2754,16456.353244317514231,790-2754,58756,4042530-1312291,592-2754,81656,4352647310601551,497-2754,97156,495277025771681,406-2755,13956,5722880410941981,302-2755,33756,666294713511101,243-2755,44756,717303887531391,158-2755,58656,77131313741721,127-2755,65856,812 - **3 August:** The Immigration and Checkpoints Authority (ICA), Ministry of Manpower (MOM) and Ministry of Education (MOE) said that from 11 August travellers entering Singapore who are not serving their stay-home notice in dedicated facilities will have to wear an electronic tag throughout the 14 days quarantine period. - **7 August:** - Two citizens and one permanent resident have been charged for breaching their Stay-Home Notices. - MOH announced that the Inter-agency task force has completed testing for all workers in dormitories. - **21 August:** - From 29 August, entry into shopping malls Lucky Plaza and Peninsula Plaza on weekends will only be allowed based on the last digit of a visitor's identity card or foreign identification card, as part of measures to limit crowds. - Researchers in Singapore have discovered a new variant of COVID-19 that causes less severe infections, according to a new study in the prestigious medical journal *[The Lancet](/wiki/The_Lancet)*. This is the first study to show a clinical difference based on the genetic differences between strains. - **22 August:** Stay-home notices will be shortened by 1 week for selected countries and visitors are allowed to enter Singapore from Brunei and New Zealand, but they must get tested upon arrival, at the testing centre for imported cases. This will start with business travellers in all companies and followed by personal travellers. - **25 August:** Visitors from New Zealand and Brunei who successfully apply to come to Singapore will be required to use the TraceTogether app at all times while in the Republic. They must also retain the app in their phone for 14 consecutive days after leaving Singapore. - **26 August:** Cassie Ong Shi Hong was fined S$4,000 for breaking a COVID-19 regulation for co-hosting with her fiancé a party involving 18 people at his Sengkang flat during the \"circuit breaker\" on 8 May. ### September DayNew casesNew recoveriesActive casesTotal deathsTotal recoveredTotal cases [note 1][note 2][note 3]Ref.Dorm ResidentsCommunityImportedTotal1321740911,0762755,74956,85224333491429422755,89156,86034125481378532756,02856,908437-3401567472756,17456,9485293133936882756,26756,98162341340666622756,33357,0217181322756092756,40857,043846-147536032756,46157,09096011475316472756,49257,16510552663666442756,55857,2281173-1386496812756,60757,314122841042926312756,69957,35613401849656152756,76457,4051443-548386252756,80257,4531528-634825772756,88457,48716232227715322756,95557,51417151218844662757,03957,532189-110324442757,07157,5421991515713882757,14257,55720131418393672757,18157,5752122-931603382757,24157,6062220-121213382757,26257,6272371412293212757,29157,6392410-515422942757,33357,654259-21172982757,34057,66526141520192992757,35957,6852710-51583062757,36757,7002872615262952757,39357,71529171927732492757,46657,74230163423222502757,48857,765Notes: - **2 September:** It was announced that a fast lane between Singapore and South Korea for essential business or official trips between both countries would open on 4 September 2020. - **3 September:** MINDEF announced that National Service In-Camp Training (ICT) and Individual Physical Proficiency Tests (IPPT) will progressively resume from October, with safety measures and protocols in place. - **7 September:** The Singapore Tourism Board (STB) will allow events in the MICE industry of up to 250 people from 1 October, going downwards from Tier 3 to Tier 2, depending on the organisers' abilities to implement safe management measures. - **9 September:** Given the rise of infections in India, the Singapore government announced that all travellers that had been to India in the prior 14 days would be required to take a PCR test within 72 hours before departure to Singapore. - **10 September:** A Taiwanese woman who was in Singapore on a long-term pass and purposely sneezed at a security guard after she was denied entry into Ion Orchard shopping mall amid the COVID-19 outbreak in April, was sentenced to 11 weeks' imprisonment. - **11 September:** - Leong Chee Mun was fined S$5,000 for breaking a COVID-19 regulation for co-hosting a party with his fiancée involving 18 people at his Sengkang flat during the \"circuit breaker\" on 8 May. - It was announced that Singapore and Japan will launch a \"reciprocal green lane\" to facilitate essential business and official travel between the two countries on 18 September. - **16 September:** Rameswari Devi Jairaj Singh was sentenced to 12 weeks' jail for breaching her stay-home notice, after arriving in Singapore on 30 April, to meet her friends by pretending she was visiting a doctor for a rash. In total, she spent more than a week in breach of her SHN. - **18 September:** The United Kingdom government announced that from 19 September, visitors from Singapore and Thailand would no longer be required to self-isolate for two weeks upon arrival in England and Scotland, provided that they have not been in, or transited through, any non-exempt countries in the past 14 days. - **22 September:** Two British citizens on work passes (who had previously been incorrectly identified as permanent residents), Alfred Jon Veloso Waring and Olagunju Daniel Olalekan Olasunkanmi, both of whom had flouted safe distancing rules during the \"circuit breaker\" by gathering with others in Robertson Quay on 16 May, were fined S$8,000 and S$8,500 respectively. It was subsequently revealed that the MOM had revoked both their work passes and permanently banned them from working in Singapore. - **23 September:** - Due to the increase of fake test results from India, it was announced by the Ministry of Health that COVID-19 pre-departure results for travelers from India would require certification by a recognised lab. The data from the recent week pointed to 61 per cent of imported cases having visited India. - It was announced that more people would be allowed to return to office from 28 September. - Tan Shiaw Wee, a Singaporean, was sentenced to five weeks' imprisonment for coughing at a supermarket crowd controller after removing his mask. - **29 September:** 32 diners were fined S$300 each for flouting COVID-19 rules at food and beverage outlets. 8 new F&B outlets were ordered to close and 14 outlets were also fined. - **30 September:** - It was announced that Singapore would open its borders to Vietnam and Australia (excluding Victoria state) from 8 October for travelers who had spent the last 14 days in those respective countries, along with New Zealand and Brunei (who were allowed to enter Singapore from 8 September). Those entering Singapore would have to take a COVID-19 test upon arrival; should they receive a negative result, they can go about their activities as long as they use the TraceTogether app for the duration of their stay. - Two young offenders were each fined S$2,000 for attending an unlawful gathering during the \"circuit breaker\" period, while a third teenager was sentenced to nine months' probation. ### October DayNew casesNew recoveriesNew deathsActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsCommunityImportedTotal131151924-245-2757,51257,78424151022-233-2757,53457,7943114628-211-2757,56257,80044261213-210-2757,57557,8125511722-195-2757,59757,81965241115-19112757,61257,83074-61012-18912757,62457,84084-5944-15412757,66857,84991-9107-15712757,67557,85910115723-14112757,69857,866113-7107-14412757,70557,876121124231124-2857,72857,88013--4412-116-2857,74057,88414-23512-109-2857,75257,889151-2312-100-2857,76457,892161-8920-89-2857,78457,90117111314-78-2857,79857,9041811579-76-2857,80757,91119--4412-68-2857,81957,915202-46--74-2857,81957,92121--12122-84-2857,82157,933221-788-84-2857,82957,94123--10103-91-2857,83257,9512412111412-93-2857,84457,965252-3514-84-2857,85857,970261-2321-66-2857,87957,97327-1674-69-2857,88357,98028--777-69-2857,89057,98729--779-67-2857,89957,99430117910-66-2857,90958,00331--12124-74-2857,91358,015 - **1 October:** - Fabian Amos Gilbert, a flight attendant working for Singapore Airlines who tested positive for COVID-19, was charged for breaching his quarantine by leaving an isolation facility in April. - Citing the failure to adhere to safe living measures at Space@Tuas dormitory, MOM moved 342 workers to a government quarantine facility after a new COVID-19 case was detected in the dorm. - **2 October:** 12 people were charged for flouting safe distancing measures by gathering with others at Lazarus Island on 8 August. They were identified as 10 Britons: Paul Jonathon Gold, 32; Helen Ann Sullivan, 30 (a senior account manager at Spurwing Communications); Zoe Louise Cronk, 30; Jeff Richard Alexander, 31; Joshua Adam Roth, 31; Lowri Mair Jeffs, 31; James Riby Oram Trimming, 31; Richard Henri Lagesse, 31 (married to Cronk); William Edwin Dunford, 32, and Edward John Joseph Lee-Bull, 32; one Singapore permanent resident: Luong Thi Thu Ha, 31; and one Singaporean citizen: Natalie Joanna Sarkies, 29. - **6 October:** Two restaurants were ordered to close and 13 F&B outlets were fined for breaching COVID-19 safety measures. - **8 October:** Genting Cruise Lines and Royal Caribbean International were authorised to offer \"cruises to nowhere\" from Singapore starting in November as part of a \"safe cruise\" pilot that will cater only to Singapore residents. - **12 October:** - It was announced that a \"reciprocal green lane\" between Singapore and Indonesia for essential business and official travel would be established on 26 October. - It was announced that travelers from Sabah, Malaysia would be required to serve a 14-day Stay-Home Notice at dedicated quarantine facilities upon arriving in Singapore. Those who have recently traveled to Indonesia or the Philippines, and who are not Singaporean citizens or permanent residents, would be required to present a valid negative COVID-19 test in order to enter. In addition, the Stay-Home Notice duration for travelers from Hong Kong would be reduced to 7 days at their place of residence. - **14 October:** - Tuan Siti Aishah Tuan Ab Rahman was fined S$4,000 for repeatedly breaching safety distancing rules during the \"circuit breaker\" by gathering with others, and failing to pay the out-of-court fines. - Paul Jonathon Gold, a 32-year-old Briton, was fined S$3,000 for breaching safe distancing measures and participating in the unlawful gathering on Lazarus Island on 8 August. He was also fired from his job at Jones Lang Lasalle in Singapore as a result of his illegal activity and his employment pass was cancelled on 21 September. - **15 October:** - The Ministry of Transport (MOT) announced plans to establish an air travel bubble between Singapore and Hong Kong, which would allow people to travel between the cities without a quarantine, subject to conditions. - Starting today in Ang Mo Kio GRC, the National Environment Agency, Singapore Food Agency and Enterprise Singapore started implementing a plan to offer a one-off COVID-19 test to more than 45,000 working at various hawker centres, markets and coffee shops, as well as food delivery personnel operating around these eating venues. - **20 October:** - Researchers at the National University of Singapore (NUS) have developed a breath test that can detect COVID-19 in less than a minute. - It was announced that the use of [SafeEntry](/wiki/SafeEntry) QR/SingPass Mobile and SafeEntry NRIC will cease by the end of the year, and will be merged into TraceTogether for better contact tracing. - **23 October:** The foreign ministries of Singapore and Germany announced plans to establish a \"reciprocal green lane\" between the two countries. - **27 October:** The Ministry of Health announced that from 4 November, travelers from Estonia, Fiji, Finland, Japan, Norway, South Korea, Sri Lanka, Thailand and Turkey would be allowed to serve their stay-home notices at their own place of residence instead of a dedicated facility when they arrive in Singapore. - **28 October:** The Ministry of Health announced that from 1 January 2021, the government will not pay for the costs for Singaporeans and permanent residents who last left Singapore before 27 March 2020 to stay at dedicated stay-home notice facilities. - **29 October:** The Civil Aviation Authority of Singapore (CAAS) announced that border restrictions for all visitors from mainland China and Victoria State, Australia would be lifted on 6 November. ### November DayNew casesNew recoveriesNew deathsActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsCommunityImportedTotal1--4411-67-2857,92458,0192--11--68-2857,92458,02032-7913-64-2857,93758,02942-571-70-2857,93858,0365-16711-66-2857,94958,0436--4410-60-2857,95958,0477--779-58-2857,96858,0548--227-53-2857,97558,0569--886-55-2857,98158,0641011794-60-2857,98558,07311--18185-73-2857,99058,09112--111112-72-2858,00258,10213--12126-78-2858,00858,11414--2211-69-2858,01958,11615--3310-62-2858,02958,11916--554-63-2858,03358,12417--666-63-2858,03958,13018--557-61-2858,04658,13519--446-5912858,05258,13920--446-5712858,05858,14321--556-5612858,06458,14822--12123-6512858,06758,16023--554-6612858,07158,16524--18188-7612858,07958,18325--7712-7112858,09158,19026-14513-6312858,10458,19527--447-6012858,11158,19928-1568157-2958,11958,20529-1785-60-2958,12458,21330-14510-55-2958,13458,218 - **5 November:** Leow Keng Chun was fined S$12,000 for opening and operating an unlicensed KTV outlet during Phase 1 of reopening. - **6 November:** Following a recent surge of COVID-19 cases in both countries, travelers from Estonia and Norway are now required to serve their 14-day Stay-Home Notices (SHN) at dedicated facilities from 8 November. - **9 November:** The Ministry of Trade and Industry (MTI) and Ministry of Home Affairs (MHA) announced that a limited number of nightlife establishments would be allowed to reopen as part of a 2 to 3-month long \"pilot programme\", with COVID-19 safety measures in place. - **10 November:** - 10 people were charged for leaving their homes for non-permitted reasons and conducting business and social gatherings at a club during the \"circuit breaker\" period. - MOH announced that all travelers from high-risk countries who are not Singaporean citizens or permanent residents will be required to take a Polymerase Chain Reaction (PCR) Test 72 hours before their departure. - **19 November:** 8 travelers (four Singaporean citizens, two permanent residents and two long-term pass holders) were put under investigation for making false declarations in their applications to opt out of serving their Stay-Home Notices (SHN) at dedicated facilities. - **20 November:** Following a resurgence of COVID-19 cases in both countries, travelers from Malaysia and Japan are now required to serve their 14-day Stay-Home Notices (SHN) at dedicated facilities from 22 November. - **21 November:** Following a recent surge of COVID-19 cases in Hong Kong, Singapore's Minister of Transport Ong Ye Kung announced that the planned air travel bubble between the two cities would be deferred for two weeks. - **25 November:** MOH announced that they would be conducting COVID-19 testing near Little India MRT station and around Tekka Centre for stallholders on 26 November, as part of the progressive roll-out of community surveillance testing. - **26 November:** - Following a recent increase in COVID-19 cases in both countries, travelers from Finland and Turkey are now required to serve their 14-day Stay-Home Notices (SHN) at dedicated facilities from 29 November. - The Seoul Garden outlet at Tampines Mall is currently under investigation, following reports that the sole community case on that day (a 32-year old Singaporean) had dinner at the restaurant with 12 family members on 21 November. ### December DayNew casesNew recoveriesActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsCommunityImportedTotal111810560-2958,13958,2282--22557-2958,14458,23031-89165-2958,14558,2394--33761-2958,15258,2425-11213668-2958,15858,2556--55271-2958,16058,2607--1313876-2958,16858,2738--1212880-2958,17658,2859--66680-2958,18258,29110--66680-2958,18858,297111-78484-2958,19258,30512--88587-2958,19758,31313--771183-2958,20858,32014--55286-2958,21058,325151-15162379-2958,23358,34116--1212586-2958,23858,35317--24241496-2958,25258,37718--991392-2958,26558,38619--17179100-2958,27458,40320--19195114-2958,27958,42221-19108116-2958,28758,43222--292917128-2958,30458,46123--212118131-2958,32258,48224--131310134-2958,33258,49525--141420128-2958,35258,50926--101010128-2958,36258,51927--558125-2958,37058,52428-14516114-2958,38658,52929--131314113-2958,40058,54230-1262711129-2958,41158,56931-525303812112958,44958,599 - **1 December:** CAAS announced that the planned air travel bubble between Hong Kong and Singapore would be further deferred to 2021. - **4 December:** Gemma Steakhouse at the National Gallery has been ordered to cease operations for 20 days for failing to comply with COVID-19 safety measures during a private Halloween dinner attended by 75 people. - **5 December:** - The Foot Locker outlet at Orchard Gateway @ Emerald has been ordered to cease operations for 10 days for failing to comply with COVID-19 safety measures, following reports of large crowds gathering outside the outlet for a product launch on 4 December. - The Seoul Garden restaurant at Tampines Mall has been ordered to cease operations for 10 days for failing to comply with COVID-19 safety measures. - **8 December:** - Soh Poh Tiong was sentenced to 12 weeks' imprisonment for repeatedly flouting his quarantine order by traveling around Singapore for eight consecutive days, after his colleague had contracted COVID-19. - MTI and MHA announced that 3 bars and pubs (Bar Kiharu at Orchard Plaza, Bell Bar at Cuppage Plaza and Skinny's Lounge at Boat Quay) would be allowed to reopen and operate for two months under the COVID-19 pilot programme for the nightlife industry. - **9 December:** An 83-year old passenger (a Singaporean citizen) on board a Royal Caribbean ship tested positive for COVID-19 during a cruise to nowhere, prompting the ship to return to Singapore one day ahead of schedule; subsequent tests for the passenger came back negative, with the National Public Health Laboratory (NPHL) confirming that he was not infected. - **11 December:** - Biotechnology firm Tychan announced that a potential COVID-19 antibody drug, TY027, would be tested on 1,305 local and foreign infected patients as part of its Phase 3 clinical trials. - CAAS announced that it would lift border restrictions for travelers from Taiwan from 18 December; those with a negative PCR test result will not be required to serve a stay-home notice upon entering Singapore. - MOH announced that from 13 December, all travelers from Hong Kong within the past 14 days are required to serve a 14-day stay-home notice at dedicated facilities upon arrival. They (except for Singaporean citizens and permanent residents) are also required from 18 December to present a valid negative PCR test, which must be taken 72 hours before departure. However, they will still be allowed to opt out of dedicated facilities and serve their SHN at their place of residence, provided that they have not visited anywhere else in the past 14 days before entering Singapore. - **14 December:** - It was announced that Phase 3 of reopening would start from 28 December for social and economic reasons. Gatherings of up to 8 people will be allowed in all public places, while live performances and up to 250 people will be allowed at congregational and worship services. - MOM and MOH announced plans to launch a pilot programme allowing migrant workers from select dormitories access to the community once a month in the first quarter of 2021, as part of Singapore's transition to Phase 3. - It was announced that the Health Sciences Authority (HSA) had approved of the [Pfizer–BioNTech COVID-19 vaccine](/wiki/Pfizer%E2%80%93BioNTech_COVID-19_vaccine) for use in Singapore, with the first shipment due to arrive by the end of the month. - **15 December:** MTI announced plans to launch the Connect@Singapore initiative, a new segregated travel lane for business travelers from all countries on short-term stays in Singapore. Applications for the travel lane are expected to open in mid-January 2021. In addition, Connect@Changi, a short-stay facility for business travelers is set to open in February. - **19 December:** 13 COVID-19 cases who served their SHN at Mandarin Orchard Singapore Hotel were put under investigation after they were found to have \"high genetic similarity\" between them despite being from different countries. - **21 December:** The first shipment of the Pfizer–BioNTech COVID-19 vaccine arrives in Singapore. - **22 December:** - Following reports of the discovery of [a new highly-infectious strain of COVID-19](/wiki/Variant_of_Concern_202012/01) in the United Kingdom, MOH announced that all long-term pass holders and short-term visitors who have recently traveled to the UK will be barred from entering Singapore. In addition, short-term travelers who have been to [New South Wales](/wiki/New_South_Wales), Australia in the last 14 days will also be barred, due to the recent resurgence of cases there. - Beach Villas and Equarius Hotel in [Sentosa](/wiki/Sentosa) have been ordered to stop taking new bookings for a month for failing to adhere to COVID-19 safety measures. - 5 F&B outlets were ordered to temporarily cease operations for flouting COVID-19 safety measures; 16 other outlets and 36 customers were also fined. - **23 December:** The first confirmed case of the Variant of Concern 202012/01 strain of COVID-19 in Singapore is reported. - **24 December:** MOH announced that travelers from South Korea in the past 14 days (including those under the Reciprocal Green Lane) will be required to serve their SHN in dedicated facilities from 27 December, due to a surge in COVID-19 cases there. - **27 December:** MOH announced that healthcare and frontline workers will be vaccinated first starting from 30 December, followed by the elderly aged 70 and above from February 2021 and other Singaporean citizens and permanent residents thereafter, as per the approved recommendations of the Expert Committee on COVID-19 vaccination. - **31 December:** The Singapore Tourism Board (STB) is investigating an alleged breach of COVID-19 safety measures on a Royal Caribbean cruise, after photos of a group of more than 10 people on the ship – who were not wearing masks and were standing/sitting close to one another – were posted online. Portals: - COVID-19 - Singapore - Medicine - Viruses\n",
  "language": "en",
  "processed_at": "2026-01-12T12:09:30.794607",
  "title": "Timeline of the COVID-19 pandemic in Singapore (2020)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Timeline_of_the_COVID-19_pandemic_in_Singapore_(2020)"
}