{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:09:35.222491"
  },
  "content": "The following is a timeline of the [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore) in 2021. ## *Timeline* ### January DayNew casesNew recoveriesActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsCommunityImportedTotal1-327301014112958,45958,6292--33331715712958,47658,6623--35351118112958,48758,6974--24241019512958,49758,7215-226282020312958,51758,7496-229312421012958,54158,7807-231332122212958,56258,8138-221231822712958,58058,8369--29293122512958,61158,86510--42422524212958,63658,90711--22223223212958,66858,92912--17172622312958,69458,946131-37382823312958,72258,98414-1444535243-2958,75759,02915-1293014259-2958,77159,0591614192413270-2958,78459,08317-2283062238-2958,84659,11318-2121422230-2958,86859,12719-4263026234-2958,89459,15720-436403224212958,92659,19721-434383324712958,95959,23522-114152423812958,98359,25023--101032216-2959,01559,26024--484826238-2959,04159,30825--444425257-2959,06659,35226--141420251-2959,08659,36627--252518258-2959,10459,39128--343444248-2959,14859,42529--242433239-2959,18159,44930-3555815282-2959,19659,50731--292932279-2959,22859,536 - **1 January:** Following reports of [a more contagious strain of](/wiki/501.V2_variant) [COVID-19 circulating in South Africa](/wiki/COVID-19_pandemic_in_South_Africa), MOH announced that long-term pass holders and short-term visitors from [South Africa](/wiki/South_Africa), as well as those who have traveled there in the last 14 days (except for Singaporean citizens and permanent residents) would be barred from entering or transiting through Singapore from 4 January. - **2 January:** - Two employees in the marine sector who tested positive for COVID-19 in November and December 2020 were put under investigation for suspected breaching of safety measures, with one company, Master Systems Marine, being suspended from sending its personnel to work on board ships. Another company, Lloyd's Register Singapore, has suspended all shipboard survey and audit activities. - 44 people were put under investigation for suspected breaching of COVID-19 safety measures by gathering at an industrial building along Boon Lay Way on New Year's Day. - **6 January:** The Maritime and Port Authority (MPA) announced that the tanker *NewOcean 6* would temporarily cease operations, following reports of 9 COVID-19 cases linked to it. - **7 January:** MOH announced that the Crowne Plaza Changi Airport Hotel would be closed until 21 January for investigation, following reports that the 2 unlinked community cases on that day were workers at the hotel. - **8 January:** Oh Bee Hiok, a COVID-19 case who was part of the SAFRA Jurong cluster in March 2020, was sentenced to five months' imprisonment for deliberately obstructing MOH workers and withholding information. - **16 January:** In the wake of the emergence of new COVID-19 variants and reports of the deteriorating global situation, MOH announced that all travelers from foreign countries – including Singaporean citizens and permanent residents – would be required from 24 January to take a PCR test upon arrival in Singapore. In addition, those who have traveled from the UK and South Africa will be required from 18 January to serve an extra 7-day self-isolation at their place of residence, after their 14-day SHN at dedicated facilities. - **20 January:** Following the recent increase of COVID-19 cases in the community, MHA and MTI announced that the planned pilot programme for reopening nightclubs and KTV lounges would be deferred until further notice. - **21 January:** - MINDEF announced the start of COVID-19 vaccinations for Singapore Armed Forces personnel, with plans to vaccinate the bulk of the active forces by mid-2021. - MTI announced that from 22 January, cargo drivers from Malaysia entering Singapore through the Tuas and Woodlands checkpoints will be required to take a COVID-19 test; only those with a negative result will be allowed entry. - **22 January:** - Nurul Afiqah Binte Mohammed was sentenced to 7 weeks' imprisonment for repeatedly leaving her home during her 14-day SHN. - MOH announced the tightening of COVID-19 safety measures ahead of the Chinese New Year period; from 26 January, households will be allowed only a maximum of 8 visitors per day, and that people – if possible – should not visit more than 2 households per day. In addition, conducting of the traditional \"lohei\" in restaurants should be done so without verbalisation of the auspicious phrases. - **30 January:** MFA announced that the reciprocal green lanes between Singapore and Malaysia, Germany and South Korea would be suspended for three months from 1 February, due to the resurgence of new COVID-19 cases in those countries. However, travelers who have already been approved under the green lane are still allowed to enter Singapore. - **31 January:** A 72-year old aviation officer who was among the 3 community cases on 30 January was put under investigation for meeting with 12 other people for tennis after developing COVID-19 symptoms. ### February DayNew casesNew recoveriesActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsCommunityImportedTotal1--292943265-2959,27159,5652--191930254-2959,30159,5843--181819253-2959,32059,6024--222228247-2959,34859,62451123252524712959,37359,6496--26263224112959,40559,6757-123242823712959,43359,6998-220225120812959,48459,7219--11112219712959,50659,732101-14152019212959,52659,74711-39123217212959,55859,75912-216181117912959,56959,77713--993515312959,60459,78614--14141715012959,62159,80015--992013912959,64159,80916--112012012959,66159,81017-110111511612959,67659,82118--1111312412959,67959,83219--14141812012959,69759,84620--12122211012959,71959,85821--11111210912959,73159,86922-19101510412959,74659,879231-34710112959,75359,88324-167810012959,76159,89025-2810248612959,78559,90026--1313188112959,80359,91327--1212138012959,81659,925281-101178412959,82359,936 - **1 February:** Senior Minister of State for Health [Janil Puthucheary](/wiki/Janil_Puthucheary) announced that all polyclinics nationwide would begin offering COVID-19 vaccinations. - **3 February:** - MOM announced that from 5 February, foreign domestic workers and confinement nannies arriving in Singapore would be required to take a COVID-19 serology test. In addition, newly arrived work permit and S-pass holders who work in the construction, marine and process sectors would be required to go through an extra 7-day testing regime after their 14-day SHN. - HSA announced that the [Moderna COVID-19 vaccine](/wiki/MRNA-1273) had been approved for use in Singapore, with the first shipment expected to arrive in March. - **5 February:** 10 people (9 British nationals and 1 Singaporean permanent resident) were charged in court for breaching COVID-19 safety measures by hosting a party on a yacht on 26 December 2020, during Phase 2 of reopening. In addition, MPA announced the suspension of the yacht for 30 days due to the incident. - **6 February:** The first case of COVID-19 re-infection in Singapore is reported, a Bangladeshi dorm resident who had first tested positive on 12 April 2020. - **9 February:** Following reports of the improving situation in New South Wales, Australia and the rising number of COVID-19 cases in Vietnam, MOH announced that travelers from New South Wales (from 11 February for Singaporean citizens, permanent residents and long-term pass holders, and 16 February for short-term visitors) would only be required to take a PCR test upon arrival instead of a serving a SHN. Meanwhile, travelers from Vietnam would be required from 13 February to serve a 14-day SHN upon arrival, with short-term visitors who have traveled to Vietnam in the past 14 days barred from entering. Travelers on the BTP Scheme would also be required to take additional COVID-19 tests upon their return to Singapore. - **17 February:** The first shipment of the Moderna COVID-19 vaccine arrives in Singapore. - **23 February:** The first shipment of China's [CoronaVac COVID-19 vaccine](/wiki/CoronaVac) arrives in Singapore, with HSA's authorisation for use pending. ### March DayNew casesNew recoveriesNew deathsActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.CommunityImportedTotal1-12127-8912959,83059,9482-8812-8512959,84259,9563221237-10112959,84959,9794118198-11212959,85759,9985-9913-10812959,87060,0076-13139-11212959,87960,0207-131315-11012959,89460,0338-13136-11712959,90060,0469-665-11812959,90560,05210-10106-12212959,91160,0621117828-10212959,93960,07012-101011-10112959,95060,08013-8811197-3059,96160,08814-17177-107-3059,96860,10515-12126-113-3059,97460,11716-111110-114-3059,98460,12817-9917-106-3060,00160,13718-151513-108-3060,01460,15219-15155-118-3060,01960,16720-17173-132-3060,02260,18421-121216-128-3060,03860,19622-121213-127-3060,05160,20823-131312-128-3060,06360,22124-151515-128-3060,07860,23625-17178-137-3060,08660,25326-121217-13213060,10360,26527-232310-14513060,11360,28828-12129-14813060,12260,30029-21219-16013060,13160,32130-26267-17913060,13860,34731-343411-20213060,14960,381 - **8 March:** - MOH announced that COVID-19 vaccinations for people aged 60 to 69 would be brought forward from its initial planned date of end-March, due to an increase in vaccine stocks arriving in Singapore. - MOH announced that Singapore would offer COVID-19 vaccinations to cargo drivers from Malaysia, who will be selected based on their frequency of travel between the two countries. - **11 March:** Director of the International Air Transport Association (IATA) Alexandre de Juniac announced that overseas travel for personal and leisure purposes would resume from the second half of 2021. - **15 March:** MFA announced that Singapore was in discussions with Australia of a possible air travel bubble between the two countries. - **18 March:** MTI announced that cargo drivers and accompanying personnel from Malaysia would receive an immunization certificate upon completing their vaccination regimen, and would also be exempt from daily on-arrival tests. - **24 March:** MOH announced that from 5 April 2021, more people can return to work, as it will boost the central business district (CBD) and industrial park sector to 80%. Separately, pre-event testing will be carried out for any event larger than the original threshold, to the new threshold which was introduced in April. Guidelines were updated during the Phase 2 (Heightened Alert), Phase 3 (Heightened Alert) and now; Preparatory Stage of Transition to Endemic COVID-19. ### April DayNew casesNew recoveriesActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsCommunityImportedTotal1--26261221613060,16160,4072--43431524413060,17660,4503--1818925313060,18560,4684--10101724613060,20260,4785--17171225113060,21460,4956--24242525013060,23960,5197-134352126413060,26060,5548--21212426113060,28460,5759--26262026713060,30460,60110--32321828113060,32260,633111-19201328813060,33560,65312--25252229113060,35760,67813--14141728813060,37460,69214-126271829723060,39260,71915--16162528823060,41760,73516-133342929323060,44660,76917-435391731523060,46360,80818-122232231623060,48560,83119-119201831813060,50360,851201-13143729513060,54060,86521--15153627413060,57660,880221122242727113060,60360,904231-38391030013060,61360,94324-518231630713060,62960,96625--40403331413060,66261,0062611434520339-3060,68261,05127-1111222329-3060,70461,06328-2212314338-3060,71861,086*Start of [Delta variant](/wiki/SARS-CoV-2_Delta_variant)*29-16193520353-3060,73861,12130-8162413364-3060,75161,145 - **12 April:** The Singapore Tourism Board (STB) announced that from 14 April, the 8-hour time limit for local tours would be removed, with the maximum number of participants increased from 20 to 50. - **20 April:** MOH announced that from 23 April, all travelers from India (except for Singaporean citizens and permanent residents) would be required to serve an additional 7-day SHN at their place of residence, after their 14-day SHN at dedicated facilities. Meanwhile, the SHN period for travelers from Hong Kong would be reduced from 14 days to 7, with the option of serving it at their place of residence. In addition, long-term pass holders and short-term visitors from the UK and South Africa would be reallowed entry into or transit through Singapore. - **22 April:** - MOH announced that from 1 June, only the TraceTogether app or token would be accepted for [SafeEntry](/wiki/SafeEntry) checking-in at all high-risk avenues (such as malls, workplaces, schools, and places of worship). - MOH announced that travelers from India who have not completed their 14-day SHN would now be required to serve their extra 7 days at dedicated facilities, instead of their place of residence. In addition, from 24 April, all long-term pass holders and short-term visitors with recent travel history to India in the past 14 days (including those who had gained prior approval for entry into Singapore) would be barred from entering or transiting through Singapore. - **26 April:** Singapore and Hong Kong announced that the air travel bubble between the two cities would officially re-launch on 26 May, with COVID-19 safety measures in place; daily flights are expected to begin in June. - **29 April:** Tan Tock Seng Hospital announced that no visitors would be allowed until further notice, after it was reported that a community case on that day was a fully-vaccinated nurse working at the hospital. - **30 April:** MOH announced that from 2 May, all long-term pass holders and short-term visitors with recent travel history to Bangladesh, Nepal, Pakistan and Sri Lanka in the past 14 days (including those who had gained prior approval for entry into Singapore) would be barred from entering or transiting through Singapore. Travelers from those countries who have yet to complete their 14-day SHN by 3 May would now be required to serve their extra 7 days at dedicated facilities. In addition, all travelers from Thailand would be required from 3 May onwards to serve their 14-day SHN at dedicated facilities. ### May DayNew casesNew recoveriesNew deathsActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsCommunityImportedTotal1272534141383-3160,76561,1792-13263921-401-3160,78661,2183-1071720-398-3160,80661,2354-5121717-39823160,82361,2525-1151621-39323160,84461,2686-2161829-38213160,87361,2867-4212533-37423160,90661,3118-713206-38823160,91261,3319-10182821-39523160,93361,35910-3161920-39433160,95361,37811-13122522-39733160,97561,40312-1061631-38233161,00661,41913-24103423-39333161,02961,45314-24285218-42733161,04761,50515-19123115-44333161,06261,536*Start of Phase 2 (Heightened Alert)*16-38114942-45023161,10461,58517-2172819-45933161,12361,61318-27113811-48653161,13461,65119-3443849-47553161,18361,68920-27144146146943261,22961,73021-30104013-49643261,24261,77022-2272935-49053261,27761,7992312132517-49833261,29461,82424-24123622-51233261,31661,8602531893013-52923261,32961,8902612322631-52423261,36061,9162711492412-53623261,37261,94028-15153035-53133261,40761,97029-23103316-54833261,42362,00330-1962511156133361,43462,02831-1672325-55923361,45962,051 - **4 May:** - It was announced that travelers from all countries (except Australia, Brunei, China, New Zealand, Taiwan, Hong Kong and Macau) in the past consecutive 21 days would be required from 8 May onwards to serve a 21-day SHN at dedicated facilities upon arrival, though they will be allowed to serve the last 7 days at their place of residence. - MOH announced that Singapore would temporarily revert to Phase 2 from 8 to 30 May due to multiple virulent strains worldwide, with the possibility of enhanced penalties for not following the new rules, in order to prevent the need for a second \"circuit breaker\" or a full-blown lockdown. - MOH announced that the mandatory TraceTogether-only [SafeEntry](/wiki/SafeEntry) measures at higher-risk avenues would be brought forward from 1 June to 17 May. - **7 May:** MOM announced that effective immediately, Singapore would not accept entry applications for work pass holders from higher-risk countries and regions (including those who have received approval to enter Singapore before 5 July). - **13 May:** MOH announced that effective immediately, travelers from Vietnam in the past 21 days would be required to fully serve their 21-day SHN at dedicated facilities. - **14 May:** Following the recent surge of cases in the community, MOH announced that Singapore would enter Phase 2 (Heightened Alert) from 16 May to 13 June 2021. - **16 May:** MOH announced that all Singaporean citizens, permanent residents and long-term pass holders with recent travel history to Taiwan would be required from 17 May onwards to serve a 21-day SHN (14 days at dedicated facilities, followed by 7 days at their place of residence) upon arrival. In addition, all short-term visitors would be barred from entering or transiting through Singapore. - **17 May:** - MOT announced that the Singapore-Hong Kong air travel bubble would once again be deferred, with a new launch date to be reviewed around 13 June. - Tan Tock Seng Hospital announced that it would progressively resume admissions from 18 May. - **18 May:** MOH announced the authorization of the [Pfizer-BioNTech COVID-19 vaccine](/wiki/Pfizer-BioNTech_COVID-19_vaccine) for use on those aged 12 to 15, as well as the extension of the interval between doses from 3–4 weeks to 6–8 weeks. - **20 May:** Brunei announced that its \"reciprocal green lane\" arrangement with Singapore would be suspended until further notice. - **24 May:** HSA announced the provisional authorization of NUS's BreFrence Go COVID-19 breath test. - **26 May:** MOH announced that all travelers entering or transiting through Singapore (including Singaporean citizens and permanent residents) would be required from 30 May onwards to present a valid negative COVID-19 PCR test before their departure for and upon their arrival in Singapore; those with travel history to lower-risk countries in the past 21 days would be exempt. - **27 May:** MOH announced that all travelers from Victoria State, Australia (including Singaporean citizens, permanent residents, and long-term pass holders) would be required from 30 May onwards to serve a 7-day SHN at their place of residence, while short-term travelers would be barred from entering or transiting through Singapore. - **31 May:** It was announced that the mass vaccination exercise would begin on 1 June for all Singaporeans and permanent residents aged 12 and above, with ITE Colleges being opened for students to get vaccinated. In addition, [remote work](/wiki/Remote_work) and home-based learning guidance would fully cease when herd immunity is achieved, while border restrictions and contact tracing would be retained to prevent dangerous variants from entering. ### June DayNew casesNew recoveriesNew deathsActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsCommunityImportedTotal1-1531822-55523361,48162,0692-2473142-54423361,52362,1003-35104534-55523361,55762,1454-761323-54523361,58062,1585-1261833-53023361,61362,1766-6142022-52823361,63562,1967-591425-51723361,66062,2108135942148323461,70262,2199-22438-44913461,74062,22310-491325-43713461,76562,23611-36934-41213461,79962,24512-991839-39113461,83862,263*Move from Phase 2 (Heightened Alert) to Phase 3 (Heightened Alert)*13-1031331-37313461,86962,2761411862525-37323461,89462,30115-14-1417-37023461,91162,31516-1952420-37413461,93162,33917-2072729-37213461,96062,36618-1421627-36113461,98762,38219-1472136-34613462,02362,40320-921119-33813462,04262,41421-13316281325-3562,07062,43022-1531828-31523562,09862,44823-1392215-32253562,11362,47024-1492327-31843562,14062,49325-1552021-31743562,16162,51326-1341720131343662,18162,53027-1221414-31343662,19562,54428-45917-30533662,21262,55329-55107-30833662,21962,56330-511169-31543662,22862,579 - **2 June:** MOH announced that China's [CoronaVac](/wiki/CoronaVac) COVID-19 vaccine would be approved for use in Singapore under the special access route, though it will not be covered under the Vaccine Injury Financial Assistance Programme. - **4 June:** - MOH announced that all travelers from Guangdong, China (including Singaporean citizens, permanent residents, and long-term pass holders) would be required from 5 June onwards to serve a 7-day SHN at their place of residence, while short-term travelers would be barred from entering or transiting through Singapore. - MOH announced that visits to all elderly care centers would be suspended from 5 to 20 June. - **10 June:** MOH announced that Singapore would move back to Phase 3 (Heightened Alert) in two steps on 14 June; the limit for social gatherings and distinct visitors allowed per household would be increased to 5, with the possibility of more restrictions being lifted (such as the resumption of dining-in) on 21 June. - **14 June:** MOH announced that effective immediately, all travelers from Fiji would be required to fully serve their 21-day SHN at dedicated facilities, while all travelers from Israel would be required from 16 June onwards to serve a 14-day SHN at dedicated facilities, followed by an additional 7 days at their place of residence. - **18 June:** MOH announced that dining-in and mask-off indoor fitness activities would resume on 21 June in groups of up to 2 people, with the possibility of the limit increasing to 5 in mid-July. - **23 June:** MOH announced that the duration of SHN at dedicated facilities for all new travelers from higher-risk countries and regions would be reduced from 21 days to 14 days from 24 June onwards, due to the lack of evidence proving that the emerging Variants of Concern possess longer incubation periods. - **24 June:** - Health Minister Ong Ye Kung announced that MOH had signed advanced purchase agreements with [Novavax](/wiki/Novavax) to procure its [non-mRNA COVID-19 vaccine](/wiki/Novavax_COVID-19_vaccine), with the possibility of the first shipment arriving before the end of the year. - MOH announced that from 27 June, Singaporean citizens, permanent residents and long-term pass holders traveling from New South Wales, Australia would be required to serve a 7-day SHN at their place of residence, with short-term pass holders barred from entering or transiting through Singapore. Meanwhile, all travelers from Victoria State would no longer be required to serve an SHN upon arrival. - **29 June:** It was announced that the interval between COVID-19 vaccination doses would be reduced from 6–8 weeks to 4 weeks. - **30 June:** MOH announced that from 3 July, all Singaporean citizens, permanent residents and long-term pass holders traveling from Australia would be required to serve a 7-day SHN at their place of residence, with short-term pass holders barred from entering or transiting through Singapore. Meanwhile, all travelers from Guangdong, China would no longer be required to serve an SHN upon arrival. ### July DayNew casesNew recoveriesNew deathsActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsCommunityImportedTotal1-46106-31933662,23462,5892-371016-31323662,25062,5993-43715-30523662,26562,6064-1101121-29523662,28662,6175-671313-29533662,29962,63061181014-29133662,31362,6407-571228-27533662,34162,6528-3131622-26923662,36362,6689-191011-26823662,37462,67810--6623-25123662,39762,68411-17817-24223662,41462,69212-8182618-25023662,43262,71813-1972621-25523662,45362,74414-5646014-30113662,46762,80415-4264814-33513662,48162,85216-5386117-37913662,49862,91317-6086814-43313662,51262,9811818749214-51113662,52663,07319-16391726-67713662,53263,24520-1821319511-86113662,54363,44021-179218117-1,02513662,56063,621*Move from Phase 3 (Heightened Alert) to Phase 2 (Heightened Alert) till 9 August*222160817016-1,17913662,57663,79123-130313311-1,30123662,58763,9242411263130811,42213762,59564,054251116812510-1,53723762,60564,179261128613512-1,66023762,61764,314278128313920-1,77923762,63764,453283127613626-1,88923762,66364,589293126413316-2,00633762,67964,722304127813954-2,09173762,73364,8613111163120130-2,08173762,86364,981 - **7 July:** It was announced that from 12 July, dining-in and social gatherings at the workplace in groups of up to 5 would resume, though [remote work](/wiki/Remote_work) remains the default. - **9 July:** MOH announced that the interval between doses of the Pfizer-BioNTech COVID-19 vaccine would be further shortened to 3 weeks, as per the recommendation of the manufacturers. - **10 July:** MOH announced that from 13 July onwards, all travelers with travel history to [Indonesia](/wiki/COVID-19_pandemic_in_Indonesia) in the past 21 days (except Singaporean citizens and permanent residents) would be barred from transiting through Singapore. In addition, those entering Singapore would be required to present a negative PCR test taken 48 hours before departure. - **14 July:** - MOH announced that from 16 July onwards, all long-term pass holders and short-term visitors with travel history to [Myanmar](/wiki/COVID-19_pandemic_in_Myanmar) in the past 21 days would be barred from entering or transiting through Singapore. - MOH announced that all Singaporean citizens, permanent residents and long-term pass holders who have been inoculated against COVID-19 overseas (with vaccines either approved by the HSA or on WHO's Emergency Use Listing) would be able to update their vaccination records in the National Immunisation Registry upon their return to Singapore. - HSA announced that it would complete its evaluation of the CoronaVac COVID-19 Vaccine within 4 to 6 weeks, after having received additional data from Sinovac. - **16 July:** Following reports of the rising number of cases in the recent KTV cluster, MOH announced that all nightlife establishments that have pivoted to F&B establishments would be suspended from 16 to 30 July. In addition, the group limit for dining-in and mask-off activities would revert to 2 from 19 July to 8 August, though fully-vaccinated people may continue with the 5-people limit. - **17 July:** MOH announced that all fishmongers islandwide were to undergo testing for COVID-19, following reports of infected cases at Jurong Fishery Port on 16 July. - **20 July:** MOH announced that Singapore would revert to Phase 2 Heightened Alert from 22 July to 18 August. - **28 July:** It was announced that HSA had given the approval for the [Sinopharm BIBP vaccine](/wiki/Sinopharm_BIBP_COVID-19_vaccine) to be imported to and distributed in Singapore under the Special Access Route. - **31 July:** MOH announced that from 3 August, all travelers with travel history to Australia in the past 21 days would be required to serve a 14-day SHN at dedicated facilities, with the option to serve it at their place of residence; meanwhile, all travelers from Jiangsu Province, China, would be required to serve a 7-day SHN at their place of residence. ### August DayNew casesNew recoveriesNew deathsActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsCommunityImportedTotal14109812194-2,10883762,95765,1022410251117612,14273863,03365,21336924102219-2,02573863,25265,315468639510512,01473963,35765,410559129810012,01184063,45765,508618754977912,02874163,53665,6057195668112211,98644263,65865,6868469578200-1,86484263,85865,76491257372204-1,732104264,06265,836*Move from Phase 2 (Heightened Alert) to Preparatory Stage. For health and safety, several places are allowed to gather up to 5 pax and selected areas/unvaccinated are allowed to gather up to 2 pax*1064715490-1,696114264,15265,8901185326314111,61784364,29365,95312455-5987-1,58994364,38066,0121324344915711,480104464,53766,06114453158132-1,40694464,66966,11915446353123-1,33684464,79266,172161434553110-1,27974464,91166,22517143845616011,17464565,06266,281182474539011,13664665,15266,33419-2933290-1,07884665,24266,36620234440160195774765,40266,40621-32537126-86874765,52866,4432232663573282874965,60166,47823603449899182675065,70066,576242388511672-87075065,77266,692252692212053293575265,82566,812261399411684-96775265,90966,92827711321225931,02765565,96867,050281499812154-1,09465566,02267,1712915109913370-1,15765566,09267,3043024123815540-1,27255566,13267,4593120136516142-1,39155566,17467,620 - **2 August:** Senior Minister of State for Health Janil Puthucheary announced that those who have suffered allergic reactions after the first dose of an mRNA vaccine would be allowed to take the CoronaVac vaccine; they would also be considered fully-vaccinated. - **4 August:** MOH announced that barring several exceptions, all visits to hospital wards would be suspended from 5 to 18 August. - **5 August:** MOH announced that from 8 August, travellers from Taiwan would no longer be required to serve an SHN upon arrival. - **6 August**: MOH announced that from 10 August, the limit on social gatherings and visitors to households, as well as the resumption of dining-in at restaurants, would increase to 5 persons for fully-vaccinated people (while the limit remains 2 for non-vaccinated people and dining-in at hawker centres); from 19 August, limited number of employees currently working remotely would be allowed to return to the workplace due to rising number of cases; temperature screenings at public places would also no longer be required. - **27 August:** MOH announced that all households would each receive 6 DIY antigen rapid test (ART) kits from 28 August, with pre-school staff and students each receiving 3 kits from 13 September. - **28 August:** MOH announced that from 31 August, all travellers (including Singaporean citizens, permanent residents and long-term pass holders) with travel history to New Zealand in the past 21 days would be required to serve a 7-day SHN at their place of residence, with short term-travellers barred from entering or transiting through Singapore. Meanwhile, all travellers from Jiangsu Province, China, would no longer be required to serve an SHN upon arrival. ### September DayNew casesNew recoveriesNew deathsActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsCommunityImportedTotal111166318048-1,52355566,22267,800211177319190-1,62455566,31267,99136210321956-1,78755566,36868,210472466259144-1,90255566,51268,469511175519188-2,00555566,60068,6606202156241119-2,12765566,71968,9017283004332148-2,31165566,86769,233*From 8 September 2021, MOH will no longer report daily unlinked cases.*818329234934512,31465667,21269,582931419745722112,54975767,43370,03910108460557333412,78765867,76770,61211644865555221-3,12175867,98871,16712634543520200-3,44175868,18871,687136353410607247-3,80185868,43572,29414777564837165-4,47395868,60073,13115347703807277-5,00395868,87773,93816103803491037415,538125969,25174,84817968381935363-6,110145969,61475,783187892741,00951016,608186070,12476,792199092021,012476-7,144216070,60077,8042078832791748727,572186271,08778,721211351,03941,17854137,572176571,62879,899221761,27741,45746239,198196872,09081,356232731,219121,504321210,379237072,41182,860242771,36941,650984311,042237373,39584,510253711,053191,443740311,742277674,13585,953263981,53741,939517213,162307874,65287,892273621,28051,647524214,283278075,17689,539285151,71382,2361,045515,469308576,22191,775294481,81192,2581,086816,643349377,30794,043304522,02332,478867218,252349578,17496,521 - **9 September**: MOM announced that from 13 September, all foreign workers who have been confined to dormitories for the past 18 months would gradually be allowed to visit the community, albeit under a strictly-controlled itinerary. - **10 September:** MOH announced that from 14 September, the quarantine period for those who have been exposed to COVID-19 (except for dormitory residents and travellers entering Singapore) would be reduced from 14 days to 10 days. - **22 September:** MOH announced that all visits to hospital wards would be suspended from 24 September to 23 October, though patient groups such as those requiring additional care support and birthing/post-partum mothers would be allowed one pre-designated visitor and one visit per day. Patients in critical condition would be allowed 5 visitors with a maximum of 2 at their bedside. - **24 September:** MOH announced that from 27 September, in-person gathering sizes would be cut back from 5 to 2 amid a rise in infections. ### October DayNew casesNew recoveriesNew deathsActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsCommunityImportedTotal18192,078122,909950820,2033410379,12499,43024121,93862,3561,603420,9523110780,727101,78633731,67682,0571,199621,8043511381,926103,84346011,859152,4752,540821,7313512184,466106,31857132,76763,4861,745923,4633413086,211109,80466302,932153,5772,899324,1383713389,110113,38176922,78383,4833,445324,1734013692,555116,86487652,825-3,5902,454625,3034114295,009120,45498322,86833,7033,0191125,9764015398,028124,157106312,17622,8092,469926,30741162100,497126,966113061,94982,2632,2491026,31142172102,746129,229122512,72142,9762,1101127,16642183104,856132,205134982,68663,1903,215927,13246192108,071135,395145172,41232,9323,4271526,62246207111,498138,327156202,82323,4453,284826,77548215114,782141,772166562,68843,3483,429926,68562224118,211145,120176012,45433,0583,754925,98066233121,965148,178185442,00812,5533,071625,45667239125,036150,731195013,480133,9942,535726,90871246127,571154,725206303,221113,8622,7151828,03767264130,286158,587215002,93723,4392,6061628,85461280132,892162,026225923,03963,6372,8251429,65257294135,717165,663237902,80443,5983,512629,73258300139,229169,261246672,70883,3833,3691529,73158315142,598172,644253222,84393,1742,9541429,93764329145,552175,818262882,98453,2772,8561030,34867339148,408179,095276614,651125,3243,1721032,49066349151,580184,419282523,17193,4324,3481531,55961364155,928187,851295363,71024,2483,0111632,78059380158,939192,099305002,60843,1123,9121431,96660394162,851195,211314142,74543,1633,7591331,35761407166,610198,374 - **9 October:** MOH announced that from 13 October, non-vaccinated persons (except for those with a negative pre-event test result, recovered individuals, and children aged 12 and below) would be barred from entering shopping malls and dining-in at hawker centres/coffee shops. - **20 October:** MOH announced that restrictions on social gathering sizes to 2 people would be extended to 21 November 2021. - **21 October:** MOH announced that restrictions on visitors to hospitals and residential care homes would be extended to 21 November 2021. - **23 October:** - MOH announced that from 1 January 2022, in a bid to open up the economy, all non-vaccinated individuals would be barred from returning to the workplace, unless they have tested negative; those who are medically-ineligible for the vaccines would be exempt. As such, workplace restrictions can be eased only from 1 January 2022. - It was announced that Sinovac's Coronavac vaccine would be included in Singapore's national vaccination programme as a 3-dose regime, for those medically-ineligible for the mRNA-type vaccines. - MOH announced that from 27 October, individuals with travel history to Bangladesh, India, Myanmar, Nepal, Pakistan and Sri Lanka in the past 14 days would be allowed to enter or transit through Singapore. ### November DayNew casesNew recoveriesNew deathsActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsCommunityImportedTotal12782,18932,4703,5521430,26162421170,162200,84421413,35233,4963,006930,74264430173,168204,34034093,22333,6353,3401231,02569442176,508207,97542202,78033,0035,0871728,92472459181,595210,97851201,63981,7673,657927,02570468185,252212,74561022,92853,0353,8711226,17774480189,123215,78072052,34352,5532,9261725,78764497192,049218,33381562,30772,4703,2161425,02767511195,265220,80391693,22263,3972,8341225,57872523198,099224,200102293,24483,4812,4951726,54775540200,594227,681111362,243172,3964,410824,52570548205,004230,077121282,96563,0992,9791424,63175562207,983233,176131202,17952,3042,5391424,38272576210,522235,48014661,65161,7232,2021023,89369586212,724237,203151011,96442,0693,270822,68472594215,994239,27216432,02152,0692,3611822,37468612218,355241,341171443,320103,4742,555723,28664619220,910244,81518671,96472,0383,772621,54660625224,682246,85319971,63341,7342,8741620,39064641227,556248,58720581,86671,9312,5331319,77560654230,089250,51821801,577131,6702,640818,79760662232,729252,18822401,41381,4612,127518,12662667234,856253,64923211,75381,7821,778518,12564672236,634255,43124402,03092,0792,275617,92359678238,909257,51025311,228161,2753,223315,97255681242,132258,78526221,06351,0902,233314,82652684244,365259,87527631,68991,7611,897614,68458690246,262261,636282571937472,0611113,35955701248,323262,38329251,07081,1031,812912,64162710250,135263,48630241,193221,2391,398812,47465718251,533264,725 - **8 November:** MOH announced that from 8 December 2021, those who are eligible for vaccination but choose not to do so would have to pay their own medical bills, should they be hospitalized or admitted to COVID-19 treatment facilities. - **26 November:** Following reports of a [new, potentially more contagious COVID-19 strain](/wiki/SARS-CoV-2_Omicron_variant) circulating in Botswana, Eswatini, Lesotho, Mozambique, Namibia, South Africa, and Zimbabwe, MOH announced that from 28 November, all long-term pass holders and short-term visitors who have travelled to those countries in the last 14 days would be barred from entering or transiting through Singapore; returning citizens and permanent residents would be required to serve a 10-day SHN at dedicated facilities upon arrival. As COVID-19 Omicron variant becomes widespread, travellers from European Union, United Kingdom and United States will be required to serve 10-day SHN upon arrival. - **28 November:** MTI announced that from 29 November, travellers from Malaysia entering Singapore via the newly-launched land VTL would be required to take an on-arrival ART test. - **30 November:** - In view of the global presence of the Omicron variant, MOH announced that it would halt relaxations on social measures until February 2022. - MOH announced that from 3 December, all travellers entering or transiting through Singapore would be required to take PCR tests upon arrival, as well as undergo additional supervised ATR tests. ### December DayNew casesNew recoveriesNew deathsActive casesIn ICUTotal deathsTotal recoveredTotal casesRef.Dorm ResidentsCommunityImportedTotal1451,266131,3241,535812,25561726253,068266,0492411,05191,1012,056911,29160735255,124267,150311738177661,393910,65550744256,517267,916424707127431,52129,87554746258,038268,659514523155521,518138,89652759259,556269,211613638116621,19848,35647763260,754269,873*From 7 December 2021, MOH will no longer issue daily COVID-19 reports, though statistics will still be updated on the website.*757001071588488,17943771261,638270,588820679107091,11337,77240774262,751271,297916649176821,47456,97540779264,225271,979104436144541,01746,40840783265,242272,4331165302355995666,00532789266,198272,9921243551137083055,54030794267,028273,3621363161733966945,20630798267,697273,7011484003444260365,03931804268,300274,14315104412347463634,87428807268,936274,6171693143235584714,38130808269,783274,9421763693741257014,22233809270,353275,3841862204527150113,99130810270,854275,6551961806925550333,74029813271,357275,9102051414919539623,53729815271,753276,1052152215428042823,38726817272,181276,38522142437833549413,22723818272,675276,7202372259032241723,13020820273,092277,04224917878265388-3,00719820273,480277,3072551766724837912,87519821273,859277,55526410510020934512,73818822274,204277,76427514013528031932,69617825274,523278,044281191173365285-2,77617825274,808278,40929618315234127612,84016826275,084278,75030419211531127312,87716827275,357279,06131716517234435212,86816828275,709279,405 - **10 December:** MOH announced the authorization of the Pfizer-BioNTech COVID-19 vaccine for use on those aged 5 to 11, as well as the extension of boosters to those aged 18 to 29. The Pfizer-BioNTech COVID-19 vaccine is also approved for full registration. - **11 December:** It was announced that Singapore had concluded a purchase agreement with [AstraZeneca](/wiki/AstraZeneca) for its [Evusheld](/wiki/Tixagevimab/cilgavimab) [COVID-19 treatment drug](/wiki/COVID-19_drug_development), with the first shipment to arrive at the end of 2021. - **14 December:** MOH announced that Singapore will ease work-from-home requirements, where all must be fully vaccinated from 1 January 2022, and priority will be given to those who took the third booster jab to return to office fully. Those who did not do so will return to office partially up to 80%. In addition, Vaccinated Measures will be extended to all places and events from 1 January 2022. - **26 December:** - MOH announced that those infected with the Omicron variant would be allowed to recover at home or community facilities, and would no longer be isolated in dedicated facilities by default. - MOH announced that unvaccinated workers, even those with a negative pre-event test result, would be barred from returning to the workplace from 15 January 2022. Those who are partially-vaccinated will still be allowed to return with a negative test result, though they have until 31 January to complete their regimen. - It was announced that Singapore would lift its travel ban on Botswana, Eswatini, Ghana, Lesotho, Malawi, Mozambique, Namibia, Nigeria, South Africa and Zimbabwe from 27 December. - **31 December:** MOH announced that from 8 January 2022, non-VTL travellers to Singapore would no longer be required to be tested on arrival, while the 7-day testing regime for VTL travellers would be extended by 4 weeks to 30 January 2022. Portals: - COVID-19 - Singapore - Medicine - Viruses\n",
  "language": "en",
  "processed_at": "2026-01-12T12:09:35.222238",
  "title": "Timeline of the COVID-19 pandemic in Singapore (2021)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Timeline_of_the_COVID-19_pandemic_in_Singapore_(2021)"
}