{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:09:53.146784"
  },
  "content": "Bakery in Singapore **Tiong Bahru Galicier Pastry** was a family-run traditional bakery selling various types of [kueh](/wiki/Kueh) in [Tiong Bahru](/wiki/Tiong_Bahru), Singapore. ## History In 1983, Tan Yong Siang, his wife Jenny Soh and several business partners setup the bakery, **Galicier**, in Serangoon. In 2000, after several business disagreements with the business partners, Tan and Soh set up a new bakery, **Tiong Bahru Galicier Pastry**, in Tiong Bahru around 2002. Nine people ran the store, four of whom are family members, including Tan, Soh and their son. Tan announced on 11 April 2022 that the bakery would be closed sometime in June or July, stating that due to their old age and rising utility costs, they wanted to close the store and retire. Following the announcement, queues at the bakery heavily increased, and due to the fact that only a limited quantity could be produced daily, customers could only purchase a maximum of two boxes of [Kueh Dadar](/wiki/Dadar_gulung), Putu Ayu and [Ondeh Ondeh](/wiki/Klepon). The bakery was closed on 30 June 2022. ## Reception Jasmine Tay of *[Lifestyle Asia](/wiki/Lifestyle_Asia)* included the bakery in her list of the 9 best places to get the best traditional kueh in Singapore in 2021. Fabian Loo of *[Tatler Asia](/wiki/Tatler)* included the bakery in his list of the 6 best traditional confectionaries and bakeries in Singapore in April 2022. In 2016, the bakery was awarded the Heritage Heroes Award for preserving local culinary traditions. This [Singaporean cuisine](/wiki/Singaporean_cuisine)-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:09:53.146479",
  "title": "Tiong Bahru Galicier Pastry",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tiong_Bahru_Galicier_Pastry"
}