{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:09:45.884719"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Tiong Bahru\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(September 2014)* *(Learn how and when to remove this message)*Subzone of Bukit Merah Planning Area & Housing Estate in Singapore **Tiong Bahru** is a housing estate and subzone region located within [Bukit Merah](/wiki/Bukit_Merah) planning area, in the [Central Region](/wiki/Central_Region,_Singapore) of [Singapore](/wiki/Singapore). Tiong Bahru was constructed in the 1920s by the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust), the predecessor to the [Housing Development Board](/wiki/Housing_Development_Board) (HDB) and an entity of the British colonial authority providing mass public housing in Singapore and is the oldest housing estate in Singapore. According to [URA](/wiki/Urban_Redevelopment_Authority)'s definition, the area known as 'Tiong Bahru' is represented by three contiguous subzones of Bukit Merah, namely Tiong Bahru, Tiong Bahru Station and [Kampong Tiong Bahru](/wiki/Kampong_Tiong_Bahru). The namesake subzone refers to the main estate which consists of 54 Walk-up flats with over 900 housing units built by SIT, as well as modern HDB flats and private condominiums along Boon Tiong Road, Kim Tian Road and Chay Yan Street. Tiong Bahru Station subzone refers to the locality that encompasses [Tiong Bahru MRT station](/wiki/Tiong_Bahru_MRT_station), [Tiong Bahru Plaza](/wiki/Tiong_Bahru_Plaza) and housing developments along Jalan Membina while Kampong Tiong Bahru which refers to the locality around [Jalan Bukit Merah](/wiki/Jalan_Bukit_Merah,_Singapore) and Silat Road. Since the mid-2000s, Tiong Bahru has undergone rapid gentrification and the neighbourhood has become synonymous with trendy cafes and indie boutiques amid pre-war architecture. ## Etymology The name *Tiong Bahru* means \"new cemetery\" (*thióng*, 塚 (Traditional) / 冢 (Simplified) – [Hokkien](/wiki/Hokkien) for \"cemetery\", *bahru* – [Malay](/wiki/Malay_language) for \"new\"), which was a reference to a cemetery beside the Heng San Teng Burial Ground or the Old Chinese Burial Ground, located at the present site of the [Singapore General Hospital](/wiki/Singapore_General_Hospital). ## History In 1927, 70 acres of land were acquired by [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) (SIT) as a test case for a public housing estate. This land was Tiong Bahru, a term translated from the Hokkien and Malay tongues as \"tomb\" and \"new\" respectively. The land was hilly and swampy, with 'squatters of the pig-breeding and [coolie](/wiki/Coolie) types'. To build the first-ever public housing estate in Singapore, the SIT had to remove cemeteries and displace some nearly 2000 [squatters](/wiki/Squatting), while leveling the hilly terrain by cutting the hills nearly. The first block of SIT flats, block 55, was ready in December 1936. Its 20 flat units of the total 28 flat units were occupied by 11 families then. It had adopted a similar [typology](/wiki/Typology_(urban_planning_and_architecture)) to the shophouse where the ground floor consisted of shops with residential flats above. According to Tan Mok Lee, one of the first residents in the estate, the area was peaceful and had quite many empty flats, due to the costly monthly rent of $25 at that time. All of the streets in the estate are named after Chinese pioneers of the 19th and early 20th centuries. Chay Yan Street is named after the rubber plantation merchant and philanthropist, [Tan Chay Yan](/wiki/Tan_Chay_Yan). Peng Nguan Street is named after Lim Peng Nguan, an early settler and the father of the community leader [Lim Nee Soon](/wiki/Lim_Nee_Soon). Tiong Bahru was surrounded by the Sit Wah Road and Outram Road. Beyond were [mangrove swamp](/wiki/Mangrove_swamp) and hillocks. Tiong Bahru was then also known as 美人窝 (\"den of beauties\") as it was where wealthy men would keep their mistresses. Due to close proximity to the [Great World Amusement Park](/wiki/Great_World_Amusement_Park), there was a predominance of 'pipa girls' within the SIT estate, which is a more polite term for prostitutes. It was speculated that the pipa girls use the staircase access at the back of the flats to entertain the men, and flee whenever the men's wives return. In 1939, Great Britain declared war on Nazi Germany. In 1940, a series of construction plans were drawn to convert the motor garages at the back of the flats in Seng Poh Road into bomb shelters. By 1941, there were 784 flats, 54 tenements and 33 shops, which housed over 6000 residents. Since then, no new flats were built until the 1950s after the war. As the war drew near, the flats were painted in camouflage colours. Residents had also recalled at least two bombs landing on the estate during the Japanese occupation. The war had also brought widespread destruction of dwellings and overall overcrowding of slums with deterioration of hygiene conditions. The bomb shelters built around 1940 were effective in providing refuge for many residents during the Japanese occupation. Then, Japanese soldiers who used British prisoners-of-war to perform duties and labour on site occupied many flats, which were also used as brothels and gambling dens. The SIT's pre-war housing output of 2112 units was insufficient to meet the housing shortage as it only provided about 100 units per year. As a result, the committee planned a three-year immediate housing programme to alleviate the problem. As a result, a total of 1258 flats were added in Tiong Bahru. They were built in differently from the pre-war flats and had a communal dwelling concept, with open courtyard spaces. These flats were housed by approximately 17,000 people in the 1950s. In 2003, as a result of many years of discussion over the estate's heritage status as a pioneering experiment in modern urban housing and in its entrenched familiarity in Singaporeans' sense of place, twenty blocks of the pre-WWII flats were gazetted by the Urban Redevelopment Authority for conservation. Included in the Tiong Bahru Conservation Area are 36 units of shop houses on Outram Road. The junction of Seng Poh Road and Tiong Bahru Road housed a \"bird corner\" dating back to the early 1980s. The owners of song birds such as [Prinias](/wiki/Prinia), [Robins](/wiki/Petroicidae), and [Shrikes](/wiki/Shrikes) would gather at the corner to meet and chat over tea and coffee. The corner was disrupted by the building of the Link Hotel in 2003. In 2008 the owners of the hotel decided to reopen the structure for hanging birdcages. In 2010, the estate and its residents were the subject of the tenth of the Civic Life films by the Irish filmmakers, Joe Lawlor and Christine Molloy. 150 volunteers from the estate and from across Singapore were involved. The film premiered at the National Museum of Singapore in October 2010. Tiong Bahru is now seen as a hotspot for millennials who enjoy the old nostalgic vibes of the area. It attracts a good number of high-income residential population due to its close proximity to the CBD, while retaining a traditional Singapore charm. There is a thriving art community in the district, with murals and art-centric shops in the area. ## Design of the SIT Flats The architect for the pre-war flats was Alfred G. Church, a Briton appointed by the colonial government. Block 55, the first block of 20 blocks was done by 1936. Built in the late [Art Deco](/wiki/Art_Deco) movement, the flats featured a style known as the Streamline Moderne. This style incorporated curved horizontal lines that embodied the machine age of automobiles. As a result, many settlers regarded the buildings as 'fei ji lou', or aeroplane flats in Chinese. Other architectural features include the use of masonry from the Alexandra Brickworks Company. Built between 1948 and 1954, the design of the post-war flats was done by the SIT senior architect and the first locally appointed assistant architect. This featured an [International Style](/wiki/International_Style_(architecture)) with boxier, cleaner lines and modern materials such as steel, glass and concrete. In addition, the design was the first time the climate was taken into consideration as it include tropical elements such as higher ceilings, large windows, and balconies. ## Facilities The estate has one shopping centre, the [Tiong Bahru Plaza](/wiki/Tiong_Bahru_Plaza). Other facilities include a community centre opened in 1948; the 3.3 hectare [Tiong Bahru Park](/wiki/Tiong_Bahru_Park); and Zhangde primary school. Alexandra Primary School and Singapore General Hospital are nearby. A number of cafes, restaurants and boutique shops cater to western Ex-Pats and Singaporean hipsters. These complement the traditional Kopitiams and Hainanese restaurants. The Qi Tian Gong Temple at Eng Hoon Street is dedicated to the Monkey God. The temple will organised grand [Birthday Celebrations](/wiki/Birthday_of_the_Monkey_God) on the 16th day of the 1st and 8th Lunar Months, which include lion, dragon dances, and performances of Chinese street opera. There is another Chinese temple that located along Kim Tian Road, Kim Lan Beo Temple (金兰庙) was founded in 1830 at Tanjong Pagar and was relocated to Kim Tian Road in 1988. ### Tiong Bahru Market In 1945, two house shops were sacrificed to build a wet market on the Tiong Poh Road. The market was named after the [Hokkien](/wiki/Min_nan_people) merchant and shipping magnate, Khoo Tiong Poh (1830 – 1892). However, the space in the market was too small to accommodate all the hawkers who desired a space. In 1955, the Tiong Bahru Market (Seng Poh Market) was constructed under the auspices of the National Environment Agency after some hawkers moved to an open area on Seng Poh Road. The market was constructed of stalls with a simple wooden frame and zinc-pitched roofs. Meats were hung without refrigeration. The Tiong Bahru market catered to the residents of the Tiong Bahru, Bukit Merah and Henderson estates. Heritage street foods such as lor mee, chwee kueh, Hokkien mee, pao, porridge, and roast pork were available in the market as well as a diverse number of goods for sale from textiles to flowers and many besides. Bartering for the best price was common. In 1993 and 2004, improvements were made to the market including a watertight roof, brighter lights, a broader walkway and garden lights. In 2004, the market was closed for two years for rebuilding. Stall holders were relocated to a temporary site on Kim Pong Road during this time. In 2006, the new market opened. It was a concrete two storey structure with a wet market and retail stalls on the ground floor and upstairs, an area for hawkers. It remains a place of community heritage. There are tours of the market, surrounding blocks of flats and the nearby [World War II](/wiki/World_War_II) air raid shelters. In 2012, the National Heritage Board created an exhibition near the Tiong Bahru market to commemorate the battle for Singapore. ## Transportation Tiong Bahru is served by two [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) stations, the namesake [Tiong Bahru MRT station](/wiki/Tiong_Bahru_MRT_station) of the [East West line](/wiki/East_West_MRT_line) and [Havelock MRT station](/wiki/Havelock_MRT_station) of the [Thomson-East Coast line](/wiki/Thomson%E2%80%93East_Coast_Line), which is more accessible from some parts of Tiong Bahru. Nearby bus stations include [Bukit Merah Bus Interchange](/wiki/Bukit_Merah_Bus_Interchange) and [Kampong Bahru Bus Terminal](/wiki/Kampong_Bahru_Bus_Terminal), which is connected to by various bus services that ply Tiong Bahru Road and [Jalan Bukit Merah](/wiki/Jalan_Bukit_Merah,_Singapore). ## Notable places - [Tiong Bahru Air Raid Shelter](/wiki/Tiong_Bahru_Air_Raid_Shelter), a former air raid shelter and museum. - [78 Moh Guan Terrace](/wiki/78_Moh_Guan_Terrace), conserved [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) building. ## In popular culture - *(/wiki/118_(TV_series)), [118 II](/wiki/118_II)* and *118 Reunion,* a series of Singaporean television dramas set in the backdrop of a traditional [kopitiam](/wiki/Kopitiam) located in the area. - *[Tiong Bahru Social Club](/wiki/Tiong_Bahru_Social_Club)*\n",
  "language": "en",
  "processed_at": "2026-01-12T12:09:45.884461",
  "title": "Tiong Bahru",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tiong_Bahru"
}