{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:09:56.638054"
  },
  "content": "Planning Area and HDB Town in Central Region, Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article includes a list of general references, but **it lacks sufficient corresponding inline citations**. Please help to improve this article by introducing more precise citations. *(April 2015)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Toa Payoh\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(December 2025)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)*Planning Area and Town in Central Region, Singapore **Toa Payoh** ([IPA](/wiki/International_Phonetic_Alphabet): /ˌt(w)ɔː ˈpɑːjoʊ, ˌtoʊ -/ *taw PAH-yoh* or *toh-*, [Chinese](/wiki/Chinese_language): 大巴窑 / 大巴窯, [Tamil](/wiki/Tamil_language): தோ பாயோ) is a [planning area](/wiki/Planning_areas_of_Singapore) and [residential town](/wiki/New_towns_of_Singapore) located in the northern part of the [Central Region](/wiki/Central_Region,_Singapore) of [Singapore](/wiki/Singapore). Toa Payoh planning area borders [Bishan](/wiki/Bishan,_Singapore) and [Serangoon](/wiki/Serangoon) to the north, the [Central Water Catchment](/wiki/Central_Water_Catchment) to the northwest, [Kallang](/wiki/Kallang) to the south, [Geylang](/wiki/Geylang) to the southeast, [Novena](/wiki/Novena,_Singapore) to the west and [Hougang](/wiki/Hougang) to the east. Toa Payoh New Town is situated in the western portion of the Toa Payoh planning area. The latter occupies a much larger area, encompassing estates such as [Potong Pasir](/wiki/Potong_Pasir) and [Bidadari](/wiki/Bidadari,_Singapore). Toa Payoh planning area consists of 12 subzones: [Bidadari](/wiki/Bidadari,_Singapore), Boon Teck, Braddell, Joo Seng, Kim Keat, Lorong 8 Toa Payoh, Pei Chun, [Potong Pasir](/wiki/Potong_Pasir), Sennett, Toa Payoh Central, Toa Payoh West and Woodleigh. ## Etymology **Toa Payoh**, in [Hokkien](/wiki/Hokkien), translates as \"big swamp\" (with *toa* meaning \"big\" and *payoh* meaning \"swamp\"). The [Malay](/wiki/Malay_language) word for swamp is *paya*. It is the Chinese equivalent of [Paya Lebar](/wiki/Paya_Lebar), which translates to \"big swamp land\". Toa Payoh's old Chinese name, was known as *Ang Chiang San* (alternatively *An Xiang Shan*) or \"burial hill\". The area was called as such because of the presence of an old cemetery located in the area. [John Turnbull Thomson](/wiki/John_Turnbull_Thomson), a government [surveyor](/wiki/Surveying), refers to Toa Payoh in his 1849 agricultural report as *Toah Pyoh Lye* and *Toah Pyoh*. Unique to housing estates in Singapore, roads in Toa Payoh are given Malay-language [street prefixes](/wiki/Street_suffix), (e.g. *\"Jalan Toa Payoh\", \"Lorong Satu Toa Payoh\"*) as when the town was conceived, [Singapore was a state of Malaysia](/wiki/Singapore_in_Malaysia). ## History Toa Payoh was once an extensive and notorious [squatter](/wiki/Squatting) district. Most squatters were engaged in farming and rearing pigs. The others were [hawkers](/wiki/Hawker_(trade)), factory workers, mechanics or [domestic helpers](/wiki/Domestic_worker). The squatters started moving out in 1962 as a result of increased compensation rates and other practical inducements offered by the Government. Clearance work was able to commence and the redevelopment started in early 1964. Toa Payoh New Town is Singapore's second oldest satellite town and the first to be built by the [Housing and Development Board](/wiki/Housing_and_Development_Board) after the development of [Queenstown](/wiki/Queenstown,_Singapore) by the [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) in the late 1950s. Before its time as a residential town, Toa Payoh was a squatter district, with a prominent agricultural heritage in the area. Throughout the 1960s up till the beginning of the 1980s, the town, much like [Geylang](/wiki/Geylang) today, was infamous for its vice, being home to some of Singapore's largest crime syndicates and gangs. Notable cases such as the [Toa Payoh ritual murders](/wiki/Toa_Payoh_ritual_murders) of 1981, in which people were murdered and stuffed into barrels, brought the town widespread attention. As such, Toa Payoh has also been coined by the media as the \"Chicago of the East\" and the \"Chicago of Singapore\". [Queen Elizabeth II](/wiki/Elizabeth_II) visited Toa Payoh in 1972 (Block [53 Lorong 5 Toa Payoh](/wiki/53_Lorong_5_Toa_Payoh)) and 2006 (Block 7, Toa Payoh). ## Infrastructure The layout of the new town follows [urban planning](/wiki/Urban_planning) principles of the time. The housing estate is self-contained and has a town centre acting as a focal point for the shopping and entertainment needs of the residents. Industrial developments were also built within the town to provide residents with job opportunities close to home while schools were built within the neighbourhoods. ### Toa Payoh Central The town centre was the first prototype in Singapore. It is surrounded by separated neighbourhoods, each with its own shopping amenities and community centres, well served by a network of vehicular roads and generous open space separating them. The result, as in the English [new towns](/wiki/New_towns_in_the_United_Kingdom) of the 1950s, is that residents tend less to travel to the main town centre but rather to shop within their neighbourhood; if they travel, they would go to the city via the [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) system, at the [Toa Payoh](/wiki/Toa_Payoh_MRT_station) and [Braddell](/wiki/Braddell_MRT_station) MRT stations, or public bus services at [Toa Payoh Bus Interchange](/wiki/Toa_Payoh_Bus_Interchange). Nevertheless, with time, the Toa Payoh Town Centre has become increasingly popular. It has a busy atmosphere because, as with many shopping malls of the time, all commercial activities are concentrated along a single mall with high point blocks on either side and major department stores at each end. The shopping mall is actually L-shaped and there are two plazas, one with a branch library and cinema, the other with an area office and a post office. Each plaza has a department store at either end. The commercial development, [HDB Hub](/wiki/HDB_Hub), located at the Toa Payoh Town Centre was completed in 2002. The [Housing and Development Board](/wiki/Housing_and_Development_Board) relocated its headquarters from its premises at [Bukit Merah](/wiki/Bukit_Merah) to the HDB Hub on 10 June 2002. The HDB Hub comprises two wings, an atrium, four commercial building blocks, a leisure and learning centre and a three-storey basement parking lot. The building also accommodates Singapore's first fully air-conditioned [Toa Payoh Bus Interchange](/wiki/Toa_Payoh_Bus_Interchange) and integrates it with the existing [Toa Payoh MRT station](/wiki/Toa_Payoh_MRT_station). Another landmark of Toa Payoh is the facility of Royal Philips Electronics (the Dutch multinational making medical and electronics equipment). Philips established an extensive facility, parts of which are now owned by Jabil and NXP. The facility has been used by Philips for developing, amongst others, televisions and DVD players for years. An interesting landmark in Toa Payoh Central is a small tree shrine known as Ci Ern Ge Temple. This shrine goes back to the kampong days before the town was set up. It is currently managed by Toa Payoh Central Merchants’ Association (TPCMA). ### Toa Payoh Town Park The Housing and Development Board decided to allocate a large area of Toa Payoh for a garden-landscaped park, the Toa Payoh Town Garden, despite the pressure on land here for housing. The town garden used to be popular with visitors who came from near and far to enjoy the display of willows, bamboos and the brilliant reds and yellows of the *[Delonix regia](/wiki/Delonix_regia)* trees. At the heart of the garden is a 0.8 ha carp pond which contains a waterfall and a cluster of islands linked by bridges. The islands are arranged to provide a sequence of delightful walking experiences not only by day but also by night when the garden is lit. The garden is buffered from the noise and night-time glare of passing traffic along Jalan Toa Payoh by an elevated slope planted with thick rows of [Angsanas](/wiki/Pterocarpus_indicus). There are also a children's playground, seating areas and outdoor chessboard, a tea kiosk and a 27-metre high viewing tower. Toa Payoh Town Park was partially closed in 1999 to make way for a temporary bus interchange. After the new [Toa Payoh Bus Interchange](/wiki/Toa_Payoh_Bus_Interchange) at the HDB Hub was completed in June 2002, the temporary bus interchange was converted to a landscaped park. Toa Payoh Town Garden was subsequently renamed as Toa Payoh Town Park. ### Toa Payoh Sensory Park Located along Lorong 5 Toa Payoh, the Toa Payoh Sensory Park covers an area of 1.1 ha (2.7 acres). Designed to engage visitors' senses, the park is divided into five zones based on the five senses. Designed by Surbana International and Yoshisuke Miyake, and inspired by similar parks in Japan, the park was first announced in December 2007, and was completed in October 2009 at a cost of S$3.5 million. ## Sports and recreation The sporting facilities are based in the southern central part of Toa Payoh, which is located near the town centre. It includes the 3,500-seat [Toa Payoh Stadium](/wiki/Toa_Payoh_Stadium), where [Singapore Premier League](/wiki/Singapore_Premier_League) club [Balestier Khalsa FC](/wiki/Balestier_Khalsa_FC) plays its home games. [Toa Payoh Sports Hall](/wiki/Toa_Payoh_Sports_Hall) is located besides the stadium, as well as the Singapore Table Tennis Association Academy. Meanwhile, there is also [Toa Payoh Swimming Complex](/wiki/Toa_Payoh_Swimming_Complex), where national swimming athletes train. Besides these facilities located in the centre of the town, there are also [street football](/wiki/Street_football_(association_football)) courts, gym facilities and basketball courts available at various neighbourhoods of Toa Payoh. Meanwhile, [SAFRA](/wiki/SAFRA_National_Service_Association) clubhouse is located besides Toa Payoh Stadium. ## Politics Toa Payoh is entirely located within the [Bishan-Toa Payoh Group Representation Constituency](/wiki/Bishan-Toa_Payoh_Group_Representation_Constituency), while a portion of Lorong 8 Toa Payoh was in the [Potong Pasir Single Member Constituency](/wiki/Potong_Pasir_Single_Member_Constituency) prior to 2020. The section which is part of Bishan-Toa Payoh GRC is divided into three divisions — Toa Payoh Central, Toa Payoh East and Toa Payoh West-Thomson. The members of parliament are [Defence Minister](/wiki/Minister_for_Defence_(Singapore)) [Ng Eng Hen](/wiki/Ng_Eng_Hen), [Saktiandi Supaat](/wiki/Saktiandi_Supaat) and [Chee Hong Tat](/wiki/Chee_Hong_Tat) of the [People's Action Party](/wiki/People%27s_Action_Party), the [ruling party](/wiki/Ruling_party) of Singapore. ## Education ### Primary education - Cedar Primary School - CHIJ Primary (Toa Payoh) - Pei Chun Public School - Kheng Cheng School - First Toa Payoh Primary School - Maris Stella High School (Primary) - Marymount Convent School - [Saint Andrew's Junior School](/wiki/Saint_Andrew%27s_Junior_School) ### Secondary education - [Beatty Secondary School](/wiki/Beatty_Secondary_School) - [CHIJ Secondary](/wiki/CHIJ_Secondary_(Toa_Payoh)) (Toa Payoh) - [Maris Stella High School](/wiki/Maris_Stella_High_School) (Secondary) - [Bartley Secondary School](/wiki/Bartley_Secondary_School) - [Cedar Girls' Secondary School](/wiki/Cedar_Girls%27_Secondary_School) - [Saint Andrew's Secondary School](/wiki/Saint_Andrew%27s_Secondary_School) - [Saint Andrew's Junior College](/wiki/Saint_Andrew%27s_Junior_College) ### Tertiary education - [Stamford American International School](/wiki/Stamford_American_International_School) (University) ### Former schools - Bartley Primary School - Cedar Boys Primary School - Cedar Girls Primary School - Elling Primary School Bartley Primary School and Elling Primary School were closed and demolished, Cedar Boys with Cedar Girls Primary School were merged to Cedar Primary School. When MacPherson Primary School also closed and demolished, MacPherson Primary School and students will joined Cedar Primary School in 2019. Cedar Primary School will simply began to build new annex block B, New annex block B completed construction in 2019. ## Transport ### Road network Toa Payoh Central has a circular road layout, designed to reduce direct routes through neighbourhoods. Toa Payoh planning area is bordered by Braddell Road to the northwest, [Bartley Road](/wiki/Bartley_Road) to the northeast, Upper Paya Lebar Road to the east, the [Pan Island Expressway](/wiki/Pan_Island_Expressway) (PIE) to the south, and [Thomson Road](/wiki/Thomson_Road,_Singapore) to the west. The [Central Expressway](/wiki/Central_Expressway,_Singapore) (CTE) also runs through the median of the planning area, separating the central neighbourhood from [Potong Pasir](/wiki/Potong_Pasir). ### Mass Rapid Transit There are seven [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) stations that serve Toa Payoh planning area across four lines–[North–South Line](/wiki/North%E2%80%93South_Line_(Singapore)), [North East Line](/wiki/North_East_Line), [Circle Line](/wiki/Circle_Line_(Singapore)), and [Thomson–East Coast Line](/wiki/Thomson%E2%80%93East_Coast_Line). They are: - **NS18** [Braddell](/wiki/Braddell_MRT_station) - **NS19** [Toa Payoh](/wiki/Toa_Payoh_MRT_station) - **NE10** [Potong Pasir](/wiki/Potong_Pasir_MRT_station) - **NE11** [Woodleigh](/wiki/Woodleigh_MRT_station) - **CC11** [Tai Seng](/wiki/Tai_Seng_MRT_station) - **CC12** [Bartley](/wiki/Bartley_MRT_station) - **CC17** **TE9** [Caldecott](/wiki/Caldecott_MRT_station) The under-planning [Seletar Line](/wiki/Seletar_Line) will also run through the planning area. Details on station(s) alignment are yet to be finalised. ### Bus The current [Toa Payoh Bus Interchange](/wiki/Toa_Payoh_Bus_Interchange) opened in May 2002 as the first air-conditioned bus interchange and Integrated Transport Hub (ITH) in the country. [Woodleigh Bus Interchange](/wiki/Woodleigh_Bus_Interchange) and ITH opened in April 2025. ### Cycling Toa Payoh New Town has around 10.8 km (6.7 mi) of cycling paths, completed in October 2025. This is in addition to the existing [park connector](/wiki/Park_Connector_Network) (PC) running along [Kallang River](/wiki/Kallang_River) towards [Bishan](/wiki/Bishan,_Singapore) to the north and [Marina Bay](/wiki/Marina_Bay,_Singapore) to the south. Another 7.7 km (4.8 mi) of cycling paths are being built in phases since 2024 in the eastern subzones of Woodleigh Forest, [Potong Pasir](/wiki/Potong_Pasir), [Bidadari](/wiki/Bidadari,_Singapore), Sennett and [Joo Seng](/wiki/Joo_Seng), which will be completed by 2030. The first phase, involving 2.7 km (1.7 mi) of cycling paths, will be completed by end-2025. A planned PC running along the southern edge of Toa Payoh New Town towards [Caldecott MRT station](/wiki/Caldecott_MRT_station) will connect the town to [MacRitchie Reservoir](/wiki/MacRitchie_Reservoir). ## Notable locations - [53 Lorong 5 Toa Payoh](/wiki/53_Lorong_5_Toa_Payoh), also known as VIP block, a notable HDB flat ## Popular culture **TV shows** - *[Home in Toa Payoh](/wiki/Home_in_Toa_Payoh)* on [MediaCorp Channel 8](/wiki/MediaCorp_TV_Channel_8) ## Bibliography - *Toa Payoh: Our Kind Of Neighbourhood* by [Koh, Buck Song](/wiki/Koh,_Buck_Song), a coffeetable corporate history of the Housing and Development Board and of 40 years of public housing, told through the stories of five families in Toa Payoh. Times Editions, Singapore, 2000. [ISBN](/wiki/ISBN_(identifier)) 981-232-124-1. - \"A Brief History of Toa Payoh\" by [Koh, Buck Song](/wiki/Koh,_Buck_Song), published in the verse anthology \"A Brief History of Toa Payoh And Other Poems\", Imperial Publishing House, Singapore, 1992, and on the website of Bishan-Toa Payoh Town Council at https://www.btptc.org.sg/AboutUs/OurHistory - \"Toa Payoh Reborn\" by [Koh, Buck Song](/wiki/Koh,_Buck_Song), in the Cultural Medallion project coffee table book *Heartlands: Home And Nation In The Art Of Ong Kim Seng*, Singapore 2008. - Victor R Savage, Brenda S A Yeoh (2003), *Toponymics – A Study of Singapore Street Names*, Eastern Universities Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-205-1 - Norman Edwards, Peter Keys (1996), *Singapore – A Guide to Buildings, Streets, Places*, Times Books International, [ISBN](/wiki/ISBN_(identifier)) 9971-65-231-5 - Toa Payoh Free Online Community Forums (Toa Payoh.NET)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:09:56.637772",
  "title": "Toa Payoh",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Toa_Payoh"
}