{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:10:00.328313"
  },
  "content": "Playground in Toa Payoh, Singapore The **Toa Payoh Dragon Playground** is a playground located along Lorong 6 Toa Payoh in [Toa Payoh](/wiki/Toa_Payoh), Singapore. The playground is a dragon playground, a type of playground that was initially popular in Toa Payoh and [Ang Mo Kio](/wiki/Ang_Mo_Kio), and is one of two remaining dragon playgrounds in Singapore. ## History The Toa Payoh Dragon Playground was constructed in 1979, in front of 28 Lorong 6 Toa Payoh. The playground was designed by former [Housing & Development Board](/wiki/Housing_%26_Development_Board) (HDB) interior designer [Khor Ean Ghee](/wiki/Khor_Ean_Ghee), as part of a series of animal-themed playgrounds built in HDB public housing estates around Singapore. Its design was based on an experimental dragon-shaped playground in [Toa Payoh Town Park](/wiki/Toa_Payoh_Town_Park), with several modifications from its predecessor to make it easier to build. The playground stands on top of a sand pit, and consists of multicoloured steel rings along the dragon's body for children to climb through, with a slide inside its head. It is one of the oldest playgrounds in Singapore. Other similar playgrounds were demolished in the late 1990s owing to \"safety concerns\", but the Toa Payoh playground in particular remained untouched. The playground has since become a cultural icon of Singapore. The playground is included in the Toa Payoh heritage trail, along with fifteen other locations in Toa Payoh, such as the [Toa Payoh Town Park](/wiki/Toa_Payoh_Town_Park), the [Lian Shan Shuang Lin Monastery](/wiki/Lian_Shan_Shuang_Lin_Monastery), and the United Five Temples of Toa Payoh. In 2014, it was announced that while the buildings surrounding the playground, blocks 28, 30, 32 and 33 along Lorong 6 Toa Payoh, would be demolished, the playground would remain. An event was held at the playground to celebrate the fiftieth anniversary of Singaporean independence in 2015. In 2017, the Housing & Development Board announced plans to build several facilities around the playground, such as a newer playground and a fitness corner. 1°19′55″N 103°51′08″E﻿ / ﻿1.3319°N 103.8521°E﻿ / 1.3319; 103.8521 This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:10:00.327998",
  "title": "Toa Payoh Dragon Playground",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Toa_Payoh_Dragon_Playground"
}