{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:10:11.205286"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Toh Ah Boon\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2022)* *(Learn how and when to remove this message)* [Dato'](/wiki/Order_of_the_Crown_of_Johor) **Toh Ah Boon** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 卓亚文; [traditional Chinese](/wiki/Traditional_Chinese_characters): 卓亞文; [pinyin](/wiki/Pinyin): *Zhuō Yà Wén*; 1860 – 1 April 1932) was a Chinese community leader, and one of the biggest landlords in [Johor Bahru](/wiki/Johor_Bahru) of his time. He was honored by Late Johor Sultan the SPMJ Dato and DPMJ Dato. ## Early life Toh was the son of Toh Kim Swee, who died when he was still a child. He lived with his uncle who had a provision shop on [Arab Street](/wiki/Arab_Street), [Singapore](/wiki/Singapore). When he was 15 years old, he accompanied his uncle to [Johor Bahru](/wiki/Johor_Bahru) as his uncle started his business as a contractor. ## Career After his uncle died, he took over the business. Toh was successful in his business as he invested in the landed property and also purchased a granite quarry at Pulau Nanas to supply granite to the Johor Government and the contractors of the public works in Singapore and Johor, which included the Mole in Singapore Harbour. He was also involved in tapioca and rubber planting at Gunung Pulai and Jalan [Skudai](/wiki/Skudai) area. He retired in 1915 and his business was taken over and managed by his sons Toh Gim Seng and Toh Ah Moh. ## Philanthropy Toh contributed much in Johor Affairs especially in education. He donated $20,000 and founded the Toh Ah Boon Scholarship Fund to enable students born in Johor to continue their study at the College of Medicine or Raffles College. When the [Johor Military Force](/wiki/Royal_Johor_Military_Force) proposed to expand their rifle range and buy over the adjacent land which belonged to Toh, he donated the land and also $20,000 to build a pavilion at the rifle range. He also donated $10,000 to the Raffles College for the election in 1919. He also contributed much in the sport sector and donated a cup which bears his name to the Royal Johor Polo Cup. He was honoured by the Sultan the DPMJ in 1925 and the SPMJ Dato in 1929. He was a member of the State Council and the Anti- Malaria Board for many years. He was also once Chairman of the Johor Bahru Chinese Chamber of Commerce. He also served on the Town Board. Jalan Dato' Toh Ah Boon near to [Tampoi](/wiki/Tampoi,_Johor), [Johor Bahru](/wiki/Johor_Bahru) is a road named after him. ## Personal life Toh's ancestry traced back to Nan'an, Fujian, China. His ancestors are from the Hoon Tau villages (南安 雲峰卓氏 雲頭系), and he belongs to the 17th generation, with the generational name (克). Toh had seven sons and three daughters. Toh's sons include Gim Seng, Toh Ah Moh, G.H. Toh, Toh Gim Bah, Toh Gim Soo, Toh Gim Phee, and Toh Gim Cheng. Toh's daughters include Toh Boo Neo, Toh Chee Neo, and Toh Beng Neo. On 1 April 1932, Toh died in his Johor Bahru's residence in Malaysia. Toh's tomb is located in Johor Bahru Chinese Cemetery in Malaysia. - https://eresources.nlb.gov.sg/newspapers/Digitised/Article/singfreepressb19320404-1.2.36.aspx - http://libapps2.nus.edu.sg/sea_chinese/documents/nan_yang_ming_ren_ji_zhuan_2b.pdf – 南洋名人集传：卓亚文君 – 222 page - https://web.archive.org/web/20160304025224/http://www.nanyang.com/node/475916 – 观文论史：卓亚文奖学金•张礼铭 - http://www.lib.nus.edu.sg/chz/chineseoverseas/nan_yang_ming_ren_ji_zhuan.pdf – 南洋名人集传\n",
  "language": "en",
  "processed_at": "2026-01-12T12:10:11.204999",
  "title": "Toh Ah Boon",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Toh_Ah_Boon"
}