{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:10:14.443190"
  },
  "content": "Holding company based in Singapore **Tolaram Group** is a holding company headquartered in [Singapore](/wiki/Singapore) with diversified business interests in consumer goods, fintech, infrastructure and industrials. It has a presence across Asia, Africa, Europe and South America. ## History Tolaram Group origins can be traced to the textile trade of Khanchand Vaswani, a [Sindhi](/wiki/Sindhis) businessman, who established a shop in [Malang](/wiki/Malang), Indonesia in 1948. The business subsequently expanded into textile manufacturing and distributing consumer goods. Tolaram relocated its headquarters to Singapore in 1975 and began exporting to Africa in the late 70s. ### Consumer goods In 1988, Tolaram Group began exporting to Nigeria [instant noodles](/wiki/Instant_noodle) manufactured by Indofoods of the Salim Group of Indonesia and Maggi of the Nestlé brought by Indofood as well as its joint venture in Indonesia. The product was new to Nigeria and Tolaram's management desire was to market the brand, obtain significant following and attain market leadership. Further investments were made in the country when the group absorbed the haulage business of Blackwood Hodge integrating it with its Indomie enterprise to deliver supplies to wholesalers. Indomie instant noodles gradually thrived in the Nigerian market, significant growth was achieved after the return of democracy in 1999 and the brand soon came to dominate the market. In 1995, concern shifted towards local manufacturing of its key brand and a noodles plant was constructed which began operations in 1996. To support the plant and ensure performance, it integrated many parts of its operations with additional investments in energy supply, and expansion of its logistic and distribution network. Multipro Limited was also established in 1997 to distribute various products including the company's brands. Tolaram Group entered into a venture between its Multipro brand and Kellogg's Corporation in 2015 to produce and market Kellogg's food products in Nigeria. Another joint venture with Arla Group was established to market and distribute Dano products in Nigeria. Tolaram's MCPL has also partnered with Cadbury Nigeria Plc. to jointly co-promote of Bournvita & Indomie products in a short term promo. In 2019–2020, Tolaram Group made a joint venture again with Colgate Palmolive as Colgate Palmolive Tolaram to produce and distribute Colgate toothpaste and also to distribute Kimberly-Clark products, Huggies and Kotex products. In 2024, Tolaram acquired a 58% stake in [Guinness](/wiki/Guinness)' Nigeria business from [Diageo](/wiki/Diageo). ### Fintech Tolaram Group holds significant equity in Amar Bank, Indonesia's first digital bank. The institution encourages digital transactions through its microloans platform, Tunaiku, and cloud-based mobile-only digital banking app, Senyumku. Tolaram has also invested in Click Cash, a digital-lending platform in Brazil and Income, a [P2P loans](/wiki/Peer-to-peer_lending) platform in Estonia. ### Infrastructure In 2019, it was announced Tolaram Group is developing Nigeria's first privately owned free trade zone with an integrated deep-sea port in the Lekki area of Lagos. Lekki Port is Nigeria's single largest private infrastructure investment. The port is expected to have an aggregate impact of approximately US$361b on the Nigerian economy over the 45-year concession period. ### Industrials Tolaram Group acquired in 1995 from the government of Estonia a paper mill that was bankrupt at the time of purchase. It was renamed Horizon Pulp and Paper Mill and is the only producer of sack kraft paper in the Baltics. In 2018, Horizon inaugurated a new combined heat and power plant (CHP) that cover the mill's energy needs and is part of an environment-centric investment program. Horizon exports to Europe, Asia, Africa and the Middle East. ## Businesses Trade NameBusiness activity/main locationBrandsDUFIL Prima Foods PlcConsumer goods joint venture with [Salim Group](/wiki/Salim_Group)/West AfricaIndomie instant noodle, Minimie Noodles & Chin Chin, Power Pasta, Pure FlourMultipro Consumer Products LimitedDistribution/West AfricaPower Oil, Emperor Oil, Kimberly-Clark, Huggies, KotexColgate Pamolive TolaramConsumer goods joint venture with [Colgate Palmolive](/wiki/Colgate_Palmolive)/West AfricaHypo, ColgateLagos Free Trade Zone CompanyFTZ/LagosLekki Port LFTZ EnterprisePort services/LagosTG ArlaConsumer goods joint venture with [Arla](/wiki/Arla_Foods)/West AfricaDano milkTolaram Nutri Beverages LtdConsumer goods/West AfricaGoodlife Magik juicesKellogg Tolaram Nigeria PlcConsumer goods joint venture with [Kellogg's](/wiki/Kellogg%27s)/West AfricaCorn Flakes, Munch It, Go Grains, Coco Pops, PringlesHorizon Pulp & Paper, Kehra Harju countyconsumer goods/EstoniaHorizon productsAmar BankFinanceDigital bankLucky Fibres PlcTextile, Fibre, Interior, BeautyNobel Carpets & Rugs/ Lush HairAddmie Nutrition LtdCondiments, SeasoningAddmie Noodlemate\n",
  "language": "en",
  "processed_at": "2026-01-12T12:10:14.442917",
  "title": "Tolaram Group",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tolaram_Group"
}