{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:10:18.125351"
  },
  "content": "Building in Chinatown, SingaporeThis article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)* **Tong Ah Building** is a building at the junction of [Keong Saik Road](/wiki/Keong_Saik_Road) and [Teck Lim Road](/wiki/Teck_Lim_Road) in [Chinatown, Singapore](/wiki/Chinatown,_Singapore). Formerly occupied by Tong Ah Eating House, it is now managed by PTT Group, an Indonesian company. ## History The Tong Ah Eating House was established in the triangular three-storey building by Tang Chew Fue in 1939. The building is known for its \"distinctive red-and-white facade and shape\" and is a local landmark. In July 2013, the building, which was then owned by a relative of the eating house's current owner, the great-grandson of Tang, was sold to a foreign investor. The eating house then moved into nearby 35 Keong Saik Road as a result of the sale. Its last day of operations within the building was on 14 July. In May 2014, Three Buns @ Potato Head Folk, a burger joint and PTT Family's first venture outside of Indonesia, opened in the building. The decoration of the building's interior was directed by artist [David Bromley](/wiki/David_Bromley_(artist)). The third floor is occupied by the Studio 1939 bar, which features a drinks list created by mixologist Dre Masso, PTT Group's in-house consultant. The bar's interior was inspired by Bromley's studio in [Melbourne](/wiki/Melbourne). The Rooftop, a bar, can be found on the roof. Annette Tan of *[today](/wiki/Today_(website))* gave the restaurant a rating of 3.5/5 at its opening, writing: \"For a pleasant, well-rounded dining experience such as this, a meal at Three Buns is totally worth it.\" In 2016, the bar underwent renovation works that increased its seating capacity from 30 to 40. Mingli Seet of *[Time Out](/wiki/Time_Out_(magazine))* gave both the restaurant and the Studio 1939 bar a \"recommended\" review in May 2024, describing the latter as \"the highlight of this lovingly restored shophouse.\" In October 2024, Potato Head announced its departure from the building, with the space subsequently rebranding under \"1939\" by the same management, but that concept also announced its closure with the last day of operations on 31 May 2025. Tong Ah Building has since been taken over by the Opus Group and a new dining concept has reopened on this location in mid November 2025. The restaurant & bar now boast of 3 dining concepts: selection of local dishes consisting of nasi lemak, mee siam, satay and prawn crackers at the first level Mestin club, Michellin-star inspired Mediterranean cuisine at Nova Terra at second level and restaurant/bar at 3rd and 4th level offering the roof top view of Chinatown and the lights of Central Business District. 1°16′50″N 103°50′30″E﻿ / ﻿1.28045°N 103.84171°E﻿ / 1.28045; 103.84171\n",
  "language": "en",
  "processed_at": "2026-01-12T12:10:18.125041",
  "title": "Tong Ah Building",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tong_Ah_Building"
}