{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:10:20.406172"
  },
  "content": "President of Singapore from 2011 to 2017 **Tony Tan Keng Yam** ([Chinese](/wiki/Chinese_language): 陈庆炎; [pinyin](/wiki/Pinyin): *Chén Qìngyán*; born 7 February 1940) is a Singaporean banker and politician who served as the seventh [president of Singapore](/wiki/President_of_Singapore) between 2011 and 2017 after winning the [2011 presidential election](/wiki/2011_Singaporean_presidential_election). Prior to entering politics, Tan was a general manager at [OCBC Bank](/wiki/OCBC_Bank). He made his political debut in the 1979 by-elections as a [People's Action Party](/wiki/People%27s_Action_Party) (PAP) candidate contesting in [Sembawang Group Representation Constituency](/wiki/Sembawang_Group_Representation_Constituency) and won. He later served as [Deputy Prime Minister of Singapore](/wiki/Deputy_Prime_Minister_of_Singapore) from 1995 to 2005. After resigning from the cabinet in 2005, Tan was appointed deputy chairman and executive director of [GIC](/wiki/GIC_(sovereign_wealth_fund)), chairman of the National Research Foundation, and chairman of [Singapore Press Holdings](/wiki/Singapore_Press_Holdings) (SPH). He stepped down from all his positions in 2010 before contesting the [2011 presidential election](/wiki/2011_Singaporean_presidential_election) as an independent candidate. Tan won the 2011 presidential election in a four-way fight and served as the president of Singapore until 2017. He did not seek re-election in the 2017 presidential election, which was reserved for [Malay](/wiki/Malay_Singaporeans) candidates following a constitutional amendment. He officially retired on 1 September 2017 at the end of his presidential term. He was succeeded by [Halimah Yacob](/wiki/Halimah_Yacob) on 14 September 2017. ## Early life and education Tan was born on 7 February 1940 in Singapore, to Tan Seng Hwee and Jessie Lim Neo Swee. He received his early education at [St Patrick's School](/wiki/Saint_Patrick%27s_School,_Singapore) from 1947 to 1956 and continued at [St Joseph's Institution](/wiki/Saint_Joseph%27s_Institution,_Singapore) (SJI) from 1957 to 1958. In 1962, he graduated with a [Bachelor of Science](/wiki/Bachelor_of_Science) with first class honours in physics from the University of Singapore, now known as the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS), under a scholarship awarded by the Singapore government. He later completed a [Master of Science](/wiki/Master_of_Science) in operations research at the [Massachusetts Institute of Technology](/wiki/Massachusetts_Institute_of_Technology) (MIT), supported by the Asia Foundation Scholarship. Tan returned to Singapore for a year to teach in the physics department at NUS before pursuing a [Doctor of Philosophy](/wiki/Doctor_of_Philosophy) in applied mathematics at the [University of Adelaide](/wiki/University_of_Adelaide), supported by a research scholarship. He completed his doctoral degree in 1967 with the dissertation title, 'Mathematical Modelling for Commuter Traffic in Cities.' ## Early political career Returning to Singapore, Tan began his career as a lecturer in the Department of Mathematics at NUS. In 1969, he left academia to work in OCBC Bank as a sub-manager and rose to become a general manager. He quit the bank in 1979 to enter politics. Tan was elected as Member of Parliament (MP) for [Sembawang](/wiki/Sembawang_Constituency) following his victory in the [1979 by-elections](/wiki/1979_Singaporean_by-elections). Later in 1979, he was appointed [Senior Minister of State for Education](/wiki/Ministry_of_Education_(Singapore)). On 1 June 1980, as part of the transition to Singapore's second generation of leaders in a [cabinet reshuffle](/wiki/Sixth_Lee_Kuan_Yew_Cabinet), Tan was appointed [Minister for Education](/wiki/Ministry_of_Education_(Singapore)). Unlike typical political announcements, the reshuffle was carried out quietly, without farewells or media fanfare. When asked, [S. Rajaratnam](/wiki/S._Rajaratnam) made it explicit that Tan and [S. Dhanabalan](/wiki/S._Dhanabalan)'s appointments were all part of a broad plan to nurture and experiment with the next generation leaders. Tan was also the Vice-Chancellor of NUS from 1980 to 1981. Following this, Tan held some key ministerial roles as [Minister for Trade and Industry](/wiki/Ministry_of_Trade_and_Industry_(Singapore)#Ministers) between 1981 and 1986, [Minister for Finance](/wiki/Minister_for_Finance_(Singapore)#Ministers) between 1983 and 1985, and [Minister for Health](/wiki/Ministry_of_Health_(Singapore)#Ministers) between 1985 and 1986. At this time, he lobbied for a reduction in the [Central Provident Fund](/wiki/Central_Provident_Fund) (CPF) contributions, a move Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) had previously indicated would only be undertaken if there were an [economic crisis](/wiki/Economic_crisis). In his role as Minister for Trade and Industry, Tan was most concerned with how foreign investors would react to a deterioration in labour relations, which would have a negative effect on [foreign direct investment](/wiki/Foreign_direct_investment). In 1981, he was also against the proposed timing of the [Mass Rapid Transit](/wiki/Mass_Rapid_Transit_(Singapore)) (MRT) project, which was mooted by [Ong Teng Cheong](/wiki/Ong_Teng_Cheong). Tan argued that the local construction sector was already overheated and believed that [public housing development](/wiki/Public_housing_in_Singapore) should take precedence. Responding to public discontent, Tan later scrapped a [controversial policy](/wiki/Eugenics_in_Singapore) that gave priority in primary school admission to children of better-educated mothers. This move was widely believed to have contributed to the PAP's poor showing in the [1984 general election](/wiki/1984_Singaporean_general_election). As minister for education from January 1985, Tan led major reforms to modernise Singapore's [education system](/wiki/Education_in_Singapore). He promoted English proficiency, bilingualism, and values education, while introducing flexible student placement, greater school autonomy, and expanded access to higher education. His key achievements included the Gifted Education Programme, the shift to English as the main instructional language, single-session schooling, and efforts to address teacher shortages through better pay and training. On 9 March 1985, Tan officially opened the Singapore Petrochemical Complex at [Pulau Ayer Merbau](/wiki/Jurong_Island). Later that month, Tan cancelled the Graduate Mothers' Priority Scheme, a source of controversy, stating that it was not very likely to be able to achieve its hoped-for effect of encouraging additional births for graduate mothers but had instead created public resentment in large numbers. Tan also launched the independent schools scheme, a few already existing schools were granted greater independence in matters of staff recruitment, finance, management, and curriculum. Tan introduced the independent school scheme to raise educational standards by allowing top schools greater autonomy to attract top talent and serve as models for others. Launched in 1988, the initiative expanded school choice, promoted innovation, and aligned with meritocratic principles, while also reducing public spending by shifting more education costs to families. Tan was also known to have opposed the shipping industry strike in January 1986, the first for about a decade in Singapore, which was sanctioned by fellow Cabinet minister, Ong, who is also Secretary-General of the [National Trades Union Congress](/wiki/National_Trades_Union_Congress) (NTUC), felt the strike was necessary. He was reportedly angered by the 1986 strike led by then NTUC secretary-general Ong. Although the government had strict controls over union activity and discouraged confrontation, Ong believed that existing mechanisms did not adequately protect workers from management exploitation. His decision to support the strike drew criticism from Tan and other officials, who were concerned about the impact on Singapore's international reputation. Tan and his officers were reportedly alarmed by the reaction from foreign investors, including calls from the United States asking what had occurred. Despite the backlash, the strike lasted only two days, with all issues resolved swiftly. Ong cited this outcome as evidence that management had been acting unfairly. Tan resigned from [Goh Chok Tong](/wiki/Goh_Chok_Tong)'s [cabinet](/wiki/Second_Goh_Chok_Tong_Cabinet) in December 1991 to resume [private sector](/wiki/Private_sector) work, and rejoined OCBC Bank as chairman and chief executive officer from 1992 to 1995, remaining an MP for Sembawang GRC. After Ong's cancer diagnosis in 1992 and [Lee Hsien Loong](/wiki/Lee_Hsien_Loong)'s in 1993, Tan was recalled to cabinet in August 1995 as Deputy Prime Minister and [Minister for Defence](/wiki/Ministry_of_Defence_(Singapore)). Tan explained [ASEAN](/wiki/ASEAN) regional security policy as consisting of each nation building up its own defence and national resilience, as well as strengthening bilateral defence ties with other [member states](/wiki/Member_states_of_ASEAN). He declined a proposed make-up pay, intended to offset ministers' pay lost upon leaving the private sector. Tan said that \"the interests of Singapore must take precedence over that of a bank and my own personal considerations.\" Tan resigned as Defence Minister in August 2003 and became [Coordinating Minister for Security and Defence](/wiki/Coordinating_Minister_for_Security_and_Defence), but still served as Deputy Prime Minister. As Sembawang MP, he managed to persuade [Minister for National Development](/wiki/Minister_for_National_Development_(Singapore)) [Mah Bow Tan](/wiki/Mah_Bow_Tan) to abandon plans to tear down the [historic mosque](/wiki/Sembawang_Malay_Settlement_Mosque) in his constituency. Now dubbed the \"Last Kampung Mosque in Singapore,\" the site was later accorded heritage site status. Tan also opposed the opening of [integrated resorts](/wiki/Integrated_resorts_in_Singapore) (IRs) with casinos, joining a few colleagues in voicing concern. Responding to a government survey that estimated 55,000 potential problem gamblers, Tan expressed strong disapproval at how the figure was downplayed, stating: \"I don't think it's insignificant. Every Singaporean is important. Every Singaporean that gets into trouble means one family that is destroyed. It cannot be a matter of small concern to the Government.\" Prime Minister Lee had considered Tan his heir apparent, but Tan rejected him. Lee praised Tan for his shrewd mind and firm decision-making and went on to say, \"He would say 'yes or no' and he would stick to it.\" In his capacity as deputy prime minister, Tan contributed to developing Singapore's higher education landscape, most notably by bringing about the creation of [Singapore Management University](/wiki/Singapore_Management_University) (SMU). Tan was insistent in 1997, however, when the government proposed a third university, that it had to differentiate from NUS and the [Nanyang Technological University](/wiki/Nanyang_Technological_University). He envisioned SMU as an institution focused on management, business, and economics, modelled on American universities. To realise this vision, Tan travelled to the United States to explore academic models and potential collaborations. He also engaged [Ho Kwon Ping](/wiki/Ho_Kwon_Ping) to lead the project. Tan, who had taken charge of university education reforms in the 1990s, was the key driving force behind SMU's establishment as Singapore's first publicly funded autonomous university in 2000. Tan lead Singapore's \"Homefront Security\" doctrine after the [September 11 attacks](/wiki/September_11_attacks), calling for a coordinated, multi-agency approach to address evolving threats and integrate internal and external security efforts. On 19 May 2003, he described the [SARS outbreak](/wiki/2002%E2%80%932004_SARS_outbreak) as \"Singapore's 9/11\", underscoring the severity of the crisis and its impact on national security. Tan stepped down as Deputy Prime Minister and Coordinating Minister for Security and Defence on 1 September 2005. Following his second retirement from the [cabinet](/wiki/First_Lee_Hsien_Loong_Cabinet), he was appointed Deputy Chairman and Executive Director of GIC, Singapore's sovereign wealth fund. At the same time, he took on several other prominent roles, including Chairman of the National Research Foundation, Deputy Chairman of the Research, Innovation and Enterprise Council, and Chairman of SPH. During his tenure at GIC, the fund began taking steps towards greater transparency in response to growing global scrutiny, particularly after its high-profile investments in [UBS](/wiki/UBS) and [Citigroup](/wiki/Citigroup) raised concerns about the influence of sovereign wealth funds. ## 2011 presidential election On 22 December 2010, Tan announced his decision to step down from his positions at GIC and SPH to contest the [2011 presidential election](/wiki/2011_Singaporean_presidential_election). His campaign emphasised his independence and willingness to voice differing views from the [PAP government](/wiki/Second_Lee_Hsien_Loong_Cabinet) on certain issues. He cited, for example, a 2005 remark by [Tan Soo Khoon](/wiki/Tan_Soo_Khoon), who noted that it was \"probably the first time\" he had heard cabinet ministers, beginning with Tan, openly express divergent views on the IRs proposal. Despite this, Tan's independence was questioned by fellow presidential candidates and former PAP members [Tan Kin Lian](/wiki/Tan_Kin_Lian) and [Tan Cheng Bock](/wiki/Tan_Cheng_Bock). On 7 July 2011, Tan submitted his eligibility forms and formally entered the race. In the election, he secured 35.20% of the vote, emerging as the winning candidate. On 29 July 2011, Tan addressed online allegations that his son, Patrick Tan, had received preferential treatment during his [national service](/wiki/National_service_in_Singapore) (NS). He firmly stated, \"My sons all completed their national service obligations fully and I have never intervened in their postings.\" Tan also highlighted that he served as Minister for Defence from 1995 to 2003, whereas Patrick's NS disruption had occurred in 1988, several years before his ministerial tenure. Patrick explained that he was granted permission by the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore)) (MINDEF) in 1988 to disrupt his NS for pre-medical studies at [Harvard University](/wiki/Harvard_University), where he earned a Bachelor of Science in biology and chemistry, before pursuing an [MD–PhD](/wiki/MD%E2%80%93PhD) at [Stanford University](/wiki/Stanford_University) under both the [President's Scholarship](/wiki/President%27s_Scholarship) and the [Loke Cheng Kim](/wiki/Loke_Cheng_Kim) Scholarship. MINDEF clarified that prior to 1992, it was standard policy to allow NS disruptions for overseas medical studies, and that longer disruption periods were granted for U.S. universities, where medical studies are offered as a postgraduate programme. In a parliamentary response on 20 October 2011, Defence Minister [Ng Eng Hen](/wiki/Ng_Eng_Hen) confirmed that Patrick had not received any special treatment. ### Campaign Describing himself as \"Tested, Trusted, True\", Tan emphasised that his extensive experience would enable him to guide Singapore through looming financial uncertainty. On 7 August 2011, his presidential bid received a boost when it was endorsed by the 10,000 strong Federation of Tan Clan Associations. On 11 August, Tan secured the endorsement of the [Singapore Malay Chamber of Commerce and Industry](/wiki/Singapore_Malay_Chamber_of_Commerce_and_Industry) (SMCCI), emphasised his long record of service to the [Malay-Muslim](/wiki/Malay_Singaporeans) community, particularly in education, and promised to put social harmony and community bonding at the top of his agenda if he were elected president. By 13 August, the leaders of 19 NTUC affiliated unions representing 128,000 members had endorsed his candidacy. The following day, the leadership of the [Singapore Federation of Chinese Clan Associations](/wiki/Singapore_Federation_of_Chinese_Clan_Associations) and the [Singapore Chinese Chamber of Commerce and Industry](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry) also expressed their support. On 16 August, four unions from the construction and real estate sector representing more than 50,000 members joined in endorsing Tan. Support also came from nine [Teochew](/wiki/Teochew_people) clan associations. On 17 August, leaders from three more sectors, namely transport and logistics, marine and machinery engineering, and info-comm and media, representing another 112,000 workers, declared their support. That same day, during Nomination Day, Tan unveiled his campaign symbol, a pair of black glasses reflecting the iconic spectacles he consistently wore. The symbol was featured on campaign items such as caps, postcards, and fridge magnets, with about 9,400 posters and 200 banners printed. On the following day, SMCCI became the first Malay organisation to officially endorse Tan's candidacy. On 22 August, Tan received public endorsements from 46 NTUC affiliated trade unions, representing over 75 percent of the labour movement, who cited his broad experience in finance, economics, and media as reasons for their support. Tan expressed gratitude for the backing and pledged to serve all Singaporeans through future challenges. ### Election Tan was elected President of Singapore on 27 August 2011 following a vote recount between him and the other front-runner, Tan Cheng Bock. He triumphed by a narrow margin of 7,269 votes out of over two million valid votes in the four-way contest. Hailed as the PAP government's candidate of choice, Tan's win was perceived as a setback for Prime Minister Lee, who had supported him. The vote was the first presidential election in 18 years and the presidency remains a ceremonial, non-partisan role. \"I plan to work tirelessly for all Singaporeans, regardless of their political affiliations. The president stands above politics,\" Tan said after the results were announced. ### Reactions On 17 August 2011, crowds booed at Tan and his son as he delivered his two-minute Nomination Day speech. According to *[The Straits Times](/wiki/The_Straits_Times)*, the jeers came from a vocal group of people who mostly supported another presidential candidate [Tan Jee Say](/wiki/Tan_Jee_Say). At a press conference later that day, Tan said that while different points of view were to be expected in a campaign, it was disappointing to have people who would not even listen, and hoped that Singaporeans would listen to the views of all the candidates. He said, \"I don't think that jeering or heckling is the right way to go about the campaign, particularly in a campaign for the president, which has to be conducted with decorum and dignity.\" During the first presidential candidate broadcast on 18 August 2011, while other candidates made promises, Tan chose not to make any commitments and instead focused on explaining the role of the president. Speaking in English, Chinese, and Malay, he said, \"Some people argue that the president must take a public stand on current issues. I hear and share the concerns of Singaporeans. But policies are debated in parliament and implemented by the government. Others have said that the president must oppose the government. That is the role of the opposition. Those interested in such roles should stand for election in parliament at the next general election.\" ## Presidency (2011–2017) Tan was elected the seventh President of Singapore on 27 August 2011, succeeding [S. R. Nathan](/wiki/S._R._Nathan).[a] In his first president's address to the opening of the [12th Parliament](/wiki/12th_Parliament_of_Singapore), Tan stressed that Singapore's success would not only be due to material advancement but also due to shared ideals and values, pointing out that there is a need for a more compassionate and caring society. In his time, in 2012, during his presidency, the [President's Challenge](/wiki/President%27s_Challenge) was expanded beyond fund-raising to include promotion of volunteerism and social entrepreneurship. On 26 July 2013, during [Prime Minister](/wiki/Prime_Minister_of_Japan) [Shinzo Abe](/wiki/Shinzo_Abe)'s official visit to Singapore, Tan received him for a courtesy call, received the Japan–Singapore Summit Meeting, and participated in a luncheon hosted by Prime Minister Lee. In November, Tan sought to differentiate his presidency through an initiative of a more active civil society, stating that Singapore needs to build its \"[social reserves](/wiki/Social_reserves)\" as part of complementing its massive financial reserves. He cited the President's Challenge's growth as an example of this initiative, referencing its new focus on civic engagement and social innovation. On 4 April 2014, Tan, patron of the [Singapore Red Cross](/wiki/Singapore_Red_Cross), handed over [S$](/wiki/S$)7.5 million worth of donations to facilitate recovery and reconstruction efforts in [Typhoon Haiyan](/wiki/Typhoon_Haiyan)-damaged areas in the Philippines, hoping that Singapore's action would be of help to the most in need and wishing to express solidarity for the Filipino people. On 8 May, he made an official visit to Switzerland, meeting [Swiss President](/wiki/Swiss_President) [Didier Burkhalter](/wiki/Didier_Burkhalter) to reaffirm their mutual commitment towards further strengthening bilateral relations between Singapore and Switzerland. On 24 October, during a four-day state visit to the United Kingdom, Tan visited [Lloyd's of London](/wiki/Lloyd%27s_of_London) in the [City of London](/wiki/City_of_London) with [John Nelson](/wiki/John_Nelson_(businessman)), and also attended a state banquet hosted by [Queen Elizabeth II](/wiki/Queen_Elizabeth_II), meeting members of the [British royal family](/wiki/British_royal_family) such as the [Duke](/wiki/William,_Prince_of_Wales) and [Duchess of Cambridge](/wiki/Catherine,_Princess_of_Wales). On 18 April 2015, Tan officially opened the [Lee Kong Chian Natural History Museum](/wiki/Lee_Kong_Chian_Natural_History_Museum), Singapore's first and only natural history museum. During his state visit to China on 3 July, he met with [Premier](/wiki/Premier_of_China) [Li Keqiang](/wiki/Li_Keqiang) to strengthen bilateral ties. On 15 July, he also officiated the opening of the [Sisters' Islands](/wiki/Sisters%27_Islands) Marine Park Public Gallery, showcasing Singapore's marine biodiversity. In August, he exchanged congratulatory messages with [President](/wiki/President_of_South_Korea) [Park Geun-hye](/wiki/Park_Geun-hye) to commemorate the 40th anniversary of diplomatic relations between Singapore and South Korea. On 6 November, Tan met with [Chinese President](/wiki/President_of_China) [Xi Jinping](/wiki/Xi_Jinping) at the [Istana](/wiki/The_Istana), where both leaders agreed to upgrade the bilateral free trade agreement and deepen cooperation. On 26 May 2016, Tan officially opened the Singapore Pavilion at the [Architecture Biennale](/wiki/Venice_Biennale_of_Architecture) in [Venice](/wiki/Venice). During a state visit to [Tokyo](/wiki/Tokyo) on 30 November, he highlighted the enduring friendship between Singapore and Japan in a toast to [Emperor Akihito](/wiki/Emperor_Akihito) and [Empress Michiko](/wiki/Empress_Michiko), recalling their planting of [King Sago palms](/wiki/Cycas_revoluta) in Singapore's [Japanese Garden](/wiki/Japanese_Garden,_Singapore). On 8 November, Tan announced that he would not contest the [2017 presidential election](/wiki/2017_Singaporean_presidential_election), which was reserved for Malay candidates following a constitutional amendment passed the next day. He completed his six-year term and left office on 31 August 2017. That evening, a farewell reception and ceremony were held for him at the Istana. He was succeeded by [Halimah Yacob](/wiki/Halimah_Yacob), who became president after a walkover in the presidential election, as no other candidates were deemed eligible. ## Later life After stepping down as Singapore’s seventh president in 2017, Tan continued to serve in key national roles and remained engaged in public life. He was appointed Director and Special Advisor at GIC from 1 January 2018 to 31 December 2023. In a *[Tatler](/wiki/Tatler)* interview on 23 November 2017, he reflected on the growing importance of social media in public engagement. While not naturally technologically savvy, Tan embraced them in the office to interact with Singaporeans, sometimes signing off messages on a personal note with his initials \"TT.\" Tan was attuned to public feedback, at times even reacting to comments, and cited the [2013 Little India riot](/wiki/2013_Little_India_riot) as an incident where he recognised the imperative of instant communication on the net abroad. Even outside the office, Tan adhered to the habit of keeping abreast of the times and participating in Singapore's civic life. On 12 March 2024, Tony Tan launched his book *Tony Tan Keng Yam: My Political Journey* in SMU. Co-authored with veteran journalist Leslie Koh and published by Straits Times Press, the book tells the story of Tan's life and public service career. Prime Minister Lee delivered a speech during the launch of the book, reminiscing on Tan's career and service. ## Personal life Tan's paternal grandfather, Tan Cheng Siong, was the then-general manager of Overseas Chinese Bank, which subsequently merged into one of the three banks that consolidated to become OCBC Bank. Tan's uncle, [Tan Chin Tuan](/wiki/Tan_Chin_Tuan), served as chairman of OCBC Bank. Maternally, Tan is also a direct lineage descendant of benefactor [Tan Kim Seng](/wiki/Tan_Kim_Seng) through his grandmother Annie Tan Sun Neo as the great-great-great-grandson. In 1959, when he was a first-year physics student at the University of Malaya, subsequently later NUS and then stationed at the [Bukit Timah](/wiki/Bukit_Timah) campus, Tan had met an arts undergraduate whom he fell in love with. Five years later, in 1964, Tan married Mary Chee Bee Kiang. The couple have five children: Peter Tan Boon Huan, Sharon Tan Shu Lin, Patricia Tan Shu Ming, Patrick Tan Boon Ooi, and Philip Tan Boon Yew. Tan's son-in-law, [Simon Chesterman](/wiki/Simon_Chesterman), serves as vice provost and dean at NUS. ## Awards and honours ### Awards Tan received the NUS Eminent Alumni Award in 2005 for his work as a visionary architect of Singapore's university community. He received the first Distinguished Australian Alumnus Award at the Australian Alumni Singapore 55th anniversary dinner in 2010 for his distinguished career and service to society and the Australian alumni network. Tan received a medal from the [Foreign Policy Association](/wiki/Foreign_Policy_Association) in 2011 for service and leadership. He was awarded the King Charles II Medal of the [Royal Society](/wiki/Royal_Society) on 22 October 2014 for his exceptional contributions towards advancing scientific research and science education in Singapore. This included his pioneering in the establishment of top universities, promoting research and development as the chairman of the National Research Foundation, and nurturing young scientists with initiatives such as the Global Young Scientists Summit. Tan was awarded the \"Key to the City\" by the city of [Prague](/wiki/Prague), [Czech Republic](/wiki/Czech_Republic), in 2017 when he visited state. ### Honours Tan has received various awards for his contributions to Singapore and the world. On 17 June 2014, his alma mater, the University of Adelaide, conferred on him an honorary doctorate to acknowledge his outstanding performance as a government and business leader. On 16 May 2015, he was conferred the [Singapore Medical Association](/wiki/Singapore_Medical_Association)'s highest honour, honorary membership, to recognize his contribution to medicine, particularly primary care and geriatric medicine. On 24 July 2018, NTU conferred on him the honorary [Doctor of Letters](/wiki/Doctor_of_Letters) degree. On 26 July 2022, SMU conferred on him an honorary [Doctor of Laws](/wiki/Doctor_of_Laws) degree to honour his visionary role in forging the university and developing Singapore's higher education landscape. **National** - [Singapore](/wiki/Singapore) - [Order of Temasek](/wiki/Darjah_Utama_Temasek) with High Distinction (28 October 2018) **Foreign** - [United Kingdom](/wiki/United_Kingdom) - Knight Grand Cross of the [Order of the Bath](/wiki/Order_of_the_Bath) (GCB; 2014) – *Sir* ## Notes Library resources about **Tony Tan** - Resources in your library - Resources in other libraries **By Tony Tan** - Resources in your library - Resources in other libraries - Media related to Tony Tan Keng Yam at Wikimedia Commons [Parliament of Singapore](/wiki/Parliament_of_Singapore)Preceded byTeong Eng Siong **Member of Parliament for [Sembawang SMC](/wiki/Sembawang_Single_Member_Constituency)** 1979–1988**Constituency abolished** **New constituency** **Member of Parliament for [Sembawang GRC](/wiki/Sembawang_Group_Representation_Constituency)** 1988–2006Succeeded by[Khaw Boon Wan](/wiki/Khaw_Boon_Wan)Academic officesPreceded by[Toh Chin Chye](/wiki/Toh_Chin_Chye) **Vice Chancellor of the [National University of Singapore](/wiki/National_University_of_Singapore)** 1980–1981Succeeded by[Lim Pin](/wiki/Lim_Pin)Political officesPreceded by[Hon Sui Sen](/wiki/Hon_Sui_Sen) **[Minister for Finance](/wiki/Minister_for_Finance_(Singapore))** 1983–1985Succeeded by[Richard Hu](/wiki/Richard_Hu)Preceded by[Goh Keng Swee](/wiki/Goh_Keng_Swee) **[Minister for Education](/wiki/Ministry_of_Education_(Singapore))** 1985–1991Succeeded by[Lee Yock Suan](/wiki/Lee_Yock_Suan)Preceded by[Ong Teng Cheong](/wiki/Ong_Teng_Cheong) **[Deputy Prime Minister of Singapore](/wiki/Deputy_Prime_Minister_of_Singapore)** 1995–2005Succeeded by[Wong Kan Seng](/wiki/Wong_Kan_Seng)Preceded by[Lee Boon Yang](/wiki/Lee_Boon_Yang) **[Minister for Defence](/wiki/Ministry_of_Defence_(Singapore))** 1995–2003Succeeded by[Teo Chee Hean](/wiki/Teo_Chee_Hean)**New office** **[Coordinating Minister for Security and Defence](/wiki/Co-ordinating_Minister_for_National_Security)** 2003–2005Succeeded by[Shunmugam Jayakumar](/wiki/S._Jayakumar_(Singaporean_politician))***as Coordinating Minister for National Security*** Preceded by[S. R. Nathan](/wiki/S._R._Nathan) **[President of Singapore](/wiki/President_of_Singapore)** 2011–2017Succeeded by[Halimah Yacob](/wiki/Halimah_Yacob)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:10:20.405902",
  "title": "Tony Tan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tony_Tan"
}