{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:10:22.250177"
  },
  "content": "Total Defence strategy in Singapore **Total Defence** is [Singapore](/wiki/Singapore)'s [whole-of-society](/wiki/Whole-of-society) national defence concept, based on the premise that every aspect of society contributes to the collective defence of the state. The strategy was first introduced in 1984 and adopted from the national defence strategies of [Sweden](/wiki/Sweden) and [Switzerland](/wiki/Switzerland). It initially consisted of five key tenets; military, civil, economic, social, and psychological, with the sixth, digital, being introduced in 2019. The strategy was amplified by the government slogan: *There's A Part For Everyone*, with a corresponding national song named after it when first introduced. Total Defence Day is commemorated on 15 February annually, the day colonial Singapore [surrendered to Japan](/wiki/Fall_of_Singapore) in 1942 during [World War II](/wiki/World_War_II). The Public Warning System is run by the Singapore Civil Defence Force and sounded annually on Total Defence Day.*Problems playing this file? See media help.* ## History On 9 August 1965, Singapore separated from Malaysia to become an independent state; conscription for all able-bodied males aged 16 and above was subsequently implemented in the form of [National Service](/wiki/National_service_in_Singapore) (NS) on 15 March 1967. By the 1980s, military defence was recognised to be an established fact of life in the island city-state, though several [Members of Parliament](/wiki/Parliament_of_Singapore) (MPs) questioned the effectiveness of the [Ministry of Defence](/wiki/Ministry_of_Defence_(Singapore))'s outreach program on inoculating the public on the concept of total defence. A series of questions were put forth to Minister for Defence [Goh Chok Tong](/wiki/Goh_Chok_Tong) during a parliamentary sitting on 16 March 1983. The following day, Minister of State for Defence [Yeo Ning Hong](/wiki/Yeo_Ning_Hong) replied that progress was underway on a program that would focus on five main points. During Civil Defence Week on 24 September 1983, Minister for Home Affairs [Chua Sian Chin](/wiki/Chua_Sian_Chin) acknowledged that the government had erred in not introducing civil defence alongside military defence, resulting in public apathy toward the former, and that it was seeking to rectify the problem by integrating both into the total defence strategy. On 6 January 1984, the government announced the creation of the civilian-led Advisory Council on Community Relations in Defence (Accord) to promote its media strategy and raise public awareness of the program, inviting Members of Parliament, businessmen, trade unionists and community leaders to join. It saw the necessity for civilians to take the lead in promoting the total defence strategy, instead of military personnel. The council would be established on 18 January 1984. Total Defence was officially proclaimed as Singapore's overarching defence strategy on 22 January 1984 with five pillars: military, civil, economic, social, and psychological. It received leading headlines in state-run newspapers carrying commentaries on its necessity juxtaposed with warfare scenarios going beyond the traditional scope of the military. Over the coming months, the Ministry of Defence launched a campaign to promote Total Defence in schools, business communities and amongst the people. Older people who had been through the [Japanese occupation](/wiki/Japanese_occupation_of_Singapore) were noted to be more \"enthusiastic\" in supporting it. Competitions were held to create a logo and song based around the strategy. In 2019, digital defence was added as the sixth pillar of Total Defence, with the government highlighting increasing threats in the cybersphere. There have been calls by Members of Parliament to add climate defence as the seventh pillar, to highlight Singapore's vulnerability to [climate change](/wiki/Climate_change) and rising seas. The strategy has seen widespread usage amongst successive [People's Action Party](/wiki/People%27s_Action_Party) (PAP) governments since its inception, being invoked during the [2003 SARS](/wiki/Severe_acute_respiratory_syndrome), [2009 H1N1](/wiki/2009_H1N1) and [COVID-19](/wiki/COVID-19_pandemic) pandemics, the [1997 Asian financial crisis](/wiki/1997_Asian_financial_crisis), the [2008 financial crisis](/wiki/2008_financial_crisis), and annual [Southeast Asian haze](/wiki/Southeast_Asian_haze). The rise of [domestic](/wiki/Domestic_terrorism) and international [terrorism](/wiki/Terrorism) abroad is also cited by the Singapore Government as the necessity of Total Defence to prevent or respond to an attack. ## Six pillars The [Singapore Government](/wiki/Government_of_Singapore) has justified Total Defence on several factors: the island city-state's small size and marginal population; lack of natural resources; and a racial and religious-diverse population. It states that these factors make Singapore vulnerable to threats such as international terrorism, natural disasters, pandemics and disinformation campaigns, that could result in an economic slowdown. ### Military defence Military defence involves heavy investment in armaments, training and equipment for the [Singapore Armed Forces](/wiki/Singapore_Armed_Forces) (SAF), with the Singapore Government maintaining a defence budget ranked amongst the highest in the [ASEAN](/wiki/ASEAN) region. A capable armed forces is seen as a necessity to deter potential aggressors. In addition to two years of national service, the onus is placed on reservist troops to maintain their physical fitness through annual individual physical proficiency tests (IPPT) and in-camp training (ICT). Corporate companies are encouraged to create \"pro-NS\" policies for reservists, such as training spaces, monetary incentives and flexible working hours, and are recognised at an annual awards ceremony. ### Civil defence Civil defence broadly refers to activities of the [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) (SCDF) to restore a sense of normalcy during a national crisis with the aid of active civilian participation. Civilians are trained in [first aid](/wiki/First_aid), urban survival, and management of blood, water and food resources. Donating blood to national blood banks, volunteer work, and being a medical frontliner are also activities seen as contributing to civil defence. The [Singapore Police Force](/wiki/Singapore_Police_Force) (SPF) also plays a crucial role in civil defence by maintaining law and order, which is essential for civil order during times of crisis. Their work in restoring a sense of normalcy and providing security contributes to the overall civil defence efforts. ### Economic defence Economic defence relates to governmental efforts to sustain and develop [Singapore's economy](/wiki/Economy_of_Singapore), while a policy is undertaken by the government for workers to upgrade their skill sets. The Singapore Government also stockpiles essential supplies of food, medication and [personal protective equipment](/wiki/Personal_protective_equipment), in addition to pursuing secondary supply chains, so as to offset potential disruptions. The conservation of essential resources including water is placed under economic defence. ### Social defence Social defence stems from official policies to maintain social cohesion among Singapore's diverse population through [multiculturalism](/wiki/Multiculturalism). As part of state-backed efforts, religious leaders engage in interfaith sessions through the Inter-Religious Organisation; such efforts are seen as necessary by the Singapore Government to counter [non-state actors](/wiki/Violent_non-state_actor) influence operations. Improving relations between neighbours is also listed as part of social defence. ### Psychological defence Psychological defence refers to the Singapore Government's programme to strengthen \"resolve and resilience\" amongst its citizens to face unexpected crises; it is also cited as necessary to combat [fake news](/wiki/Fake_news). The government views [psychological resilience](/wiki/Psychological_resilience) as the bedrock of a \"social compact\" and seeks to emulate Finland's example. Efforts to improve [mental health](/wiki/Mental_health) in Singapore is also placed under psychological defence. The presence and actions of the [Singapore Police Force](/wiki/Singapore_Police_Force) (SPF) also contribute to the psychological aspect of Total Defence. A sense of security and confidence in the [police force](/wiki/Singapore_Police_Force) helps to bolster the population's belief in the nation's ability to withstand threats. ### Digital defence Digital defence refers to efforts to increase awareness of online security threats, including misinformation, [cyberattacks](/wiki/Cyberattack) and [phishing](/wiki/Phishing) scams. The threat is seen as particularly acute due to the country's \"open and connected\" nature and governmental plans to orientate the country around a [digital economy](/wiki/Digital_economy) and the [Smart Nation](/wiki/Smart_Nation) concept. All civil servants are mandated to undergo cybersecurity training, with the government also increasing audits of state infrastructure. ## Commemoration ### Total Defence Day Total Defence Day was added to the list of dates for schools to commemorate on 17 May 1997, and first nationally marked on 15 February 1998[a] with the [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force) sounding the Important Message Signal through the island-wide [Public Warning System](/wiki/Public_Warning_System_(Singapore)) sirens and local radio stations for a minute. The date was chosen to mark the British [surrender of Singapore](/wiki/Fall_of_Singapore) to Japan during [World War II](/wiki/World_War_II). At its inception, the siren was sounded at 12:05 pm [Singapore Standard Time](/wiki/Singapore_Standard_Time); this was changed to 6:20 pm in 2015 to mark the actual time of the surrender in 1942. Schools conduct emergency preparedness drills, food and electricity rationing, and may organise tours to government exhibitions. The defence minister also delivers an address on the day prior, along with other ministers. A memorial service had been held annually at the [War Memorial Park](/wiki/War_Memorial_Park,_Singapore) since 1967 to recognise civilians who lost their lives during the Japanese occupation. The event would usually involve over 1,000 participants prior to the COVID-19 pandemic, but was reduced to 50 for 2021. ### Logo The competition to design a logo for Total Defence was announced on 8 May 1985 before being officially launched on 1 June. Contestants were divided into four segments of society: community, art student, school and Singapore Armed Forces personnel, with no limitations to the number of submissions per individual. The Ministry of Defence stipulated design rules that the proposed logo not exceed three colours or be based on any language. The submission phase ended on 3 July, with twelve designs thereafter selected for a public vote. The final design was to be unveiled on [National Day](/wiki/National_Day_(Singapore)) on 9 August 1985. The winning design was created by freelance artist Berwin See Hak Gei. The logo was outlined as a hand in salute, with five arrows representing the five original pillars. The crescent moon and five stars, and the colours of red and white, are elements from the national flag. Over the years, the logo was adapted to reflect the different campaign themes, but retained its distinctive five arrows design. The changes include updating the tagline which accompanied the logo, smoothening the sharp edges of the original and integrating the left-most arrow into the body in 2009, and overlaying a metallic sheen in 2017. The addition of digital defence mandated that the logo be redesigned to incorporate the sixth element, with a new competition launched on 17 September 2019. As with the first competition, 10 designs were chosen by the organisers and put up for a public vote, which ended on 29 December. The winner, Samantha Alexa Teng, a teacher at [Queensway Secondary School](/wiki/Queensway_Secondary_School) was awarded her prize on 15 February 2020. ### Campaign posters and themes Nexus is the agency responsible for Total Defence and national education under the Ministry of Defence. Earlier campaign posters and themes focused on military defence and civil defence, but has since evolved to also include the other four elements. List of themes over the years YearTheme1984There's a Part for Everyone2006Stay Vigilant, Be Resilient2007Confidence, Commitment and Cohesion2008Total Defence. It's Personal. Play Your Part2009What Will You Defend?2010I Will2011Home – Keeping It Together2012Total Defence – It's My Turn2013Will You Stand With Me?2014Because You Played a Part2015Our SAF: Giving Strength to Our Nation2016 – presentTogether We Keep Singapore Strong - [Counter-terrorism in Singapore](/wiki/Counter-terrorism_in_Singapore) - [Civil defense in Taiwan](/wiki/Civil_defense_in_Taiwan) ## Notes - Total Defence website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:10:22.249799",
  "title": "Total Defence (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Total_Defence_(Singapore)"
}