{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:10:24.144245"
  },
  "content": "Lottery in Singapore **Toto** (est. in 1968 and stylised as **TOTO**) is a legalised form of [lottery](/wiki/Lottery) sold in Singapore, known by different names elsewhere. It is held by [Singapore Pools](/wiki/Singapore_Pools), the only legal lottery operator in Singapore. As of April 2015, it was the second most popular type of gambling activity after [4-Digits](/wiki/4-Digits). The profits from Toto go to the Singapore Totalisator Board (the owner of Singapore Pools) which uses the money for charity and other worthy causes. ## History of Toto Toto was established to control widespread illegal gambling in Singapore during the 1960s. A manual version of Toto was launched on 9 June 1968. In 1981, \"snowballing\" was introduced. It allowed the top prize to increase from draw to draw. The system entry mode is introduced so multiple bets can be made on a single coupon. On 19 May 1986 Toto was offered as a computerised on-line game based on a '5 out-of 49' format. In 1988, the game was changed from a '5 out-of 49' format to a '6 out-of 42' format. On 1 July 1997, Toto's format was changed once again to a '6 out-of 45' format. The game introduced several popular draws, including the Toto Millennium Draw (30 December 1999), the [Hongbao](/wiki/Hongbao) Draw (10 February 2000) and the [Mooncake](/wiki/Mooncake) Draw (6 October 2006). On 7 October 2014 Toto was changed to a '6 out-of 49' format. In September 2016, Toto became available online. ## Method of Play A buyer picks at least six numbers, from 1 to 49. The winning numbers drawn include six numbers plus an additional number. Three or more winning numbers on a ticket matching the seven numbers drawn qualifies the buyer for a cash prize. The prize money escalates with the increase in numbers matched. The maximum allowed matching numbers is seven (with the winner winning both group 1 and group 2 of the draw – this can only happen if the person bought a ticket of system 7 and above). Thus, if six numbers on the Toto ticket matches the six numbers drawn (apart from the additional number), the jackpot (Group 1) prize is won. ### Placing of bets There are 4 different ways to place bets: **QuickPick**The computer randomly selects 6 numbers from 1 to 49 for the buyer. No bet slip is required for QuickPick bets.**Ordinary Bet**The buyer selects 6 numbers from 1 to 49 by marking them on a bet slip.**System Bet**The buyer selects 7 to 12 numbers from 1 to 49 by marking on a bet slip. For example, a System 9 bet is a selection of 9 numbers.**System Roll**The buyer selects only 5 numbers from 1 to 49. The 6th number is a guaranteed winning number. ### Bet Slip ### Bet Types **Bet Type****Number of Ordinary Bet combinations****Cost**Ordinary1S$1System 77S$7System 828S$28System 984S$84System 10210S$210System 11462S$462System 12924S$924System Roll44S$44 The minimum bet amount is S$1.00 per bet ticket. Bets can also be placed by bet amounts. The computer automatically sells the buyer the maximum number of bets for the bet type placed. The balance amount is placed on the next lowest bet type.[*citation needed*] ### Payout and odds Prize GroupMatchesPrizeOdds of winning1 (Jackpot)6 numbers38% of prize pool1 in 13,983,81625 numbers plus the additional number8% of prize pool1 in 2,330,63635 numbers5.5% of prize pool1 in 55,49144 numbers plus the additional number3% of prize pool1 in 22,19754 numbers$50 per winning combination1 in 1,08363 numbers plus the additional number$25 per winning combination1 in 81273 numbers$10 per winning combination1 in 62 The odds of winning any prize are 1 in 54. 54% of the total Toto sales for each draw goes to the Toto prize pool. The Group 1 prize has a minimum guaranteed amount of $1 million. If there are no winners in one of the groups (excluding Group 5, 6 & 7), the respective group's prize will be snowballed to the next draw. Group 1 prizes can only be snowballed up to 4 draws, thereafter, the prize will be cascaded to Group 2. ## Popularity A survey on participation in gambling activities among Singapore residents conducted in 2020 revealed that Toto is one of the most popular gambling activities, with 34% of respondents mentioning it. - [Lottery](/wiki/Lottery) - [National Council on Problem Gambling (Singapore)](/wiki/National_Council_on_Problem_Gambling_(Singapore))\n",
  "language": "en",
  "processed_at": "2026-01-12T12:10:24.143959",
  "title": "Toto (lottery)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Toto_(lottery)"
}