{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:10:28.236883"
  },
  "content": "Australian academic competition**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Tournament of Minds\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2022)* *(Learn how and when to remove this message)* **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(November 2022)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Tournament of Minds** (TOM) is an academic competition focusing on collaborative [problem solving](/wiki/Problem_solving) and [critical thinking](/wiki/Critical_thinking). It is open to both [primary](/wiki/Primary_school) and [secondary](/wiki/Secondary_school) students in Australia, New Zealand, South Africa and a number of other locations in Asia, Africa and the Middle East. Students work in a team to create a [dramatic performance](/wiki/Dramatic_performance) outlining their solution to an open-ended Long Term challenge in one of four disciplines: STEM, Language Literature, The Arts and Social Science. Students also participate in a shorter, unseen Spontaneous Challenge on the day of the Tournament. TOM Challenge Release, Regionals and Branch Finals take place during Australian Term 3, with successful teams coming together for an International Final in a chosen state or territory. ## History Tournament of Minds was founded in Australia in 1987, when a group of educators came together to develop a program through which to develop creative thinking and collaborative problem solving within students. The concept of a competition was floated, and quickly took off, with schools and educational institutions across the country signing up to take part in the Tournament. Over the years, TOM has undergone a number of changes, including the development of additional 'disciplines' for students to participate in, and the establishment of branches outside of Australia, including in New Zealand, South Africa, Thailand, Hong Kong, Uganda, Egypt, and the UAE, alongside a number of others. ## Disciplines Tournament of Minds is divided up into four separate competition disciplines. As of 2022, the disciples are: the arts, language literature, [social sciences](/wiki/Social_sciences) and science, technology, engineering, mathematics ([STEM](/wiki/STEM)). The arts is the most recently added discipline, having been added in 2018. Previously, the STEM discipline had been divided into engineering maths and science technology or applied technology. ## Competition structure The competition operates in a number of difference branches. Each state and territory in Australia operates as an individual branch, as does each other country participating. Students compete in teams of five to seven students in either the Primary division or the Secondary division. The age of the students in each division varies slightly according to local school systems. Schools in the majority of branches receive their long term challenge in the first weeks of Term 3 in the Australian [academic year](/wiki/Academic_year). They have six weeks to prepare their response without any assistance from people outside of their team. Students must make all props, costumes and any [STEM](/wiki/STEM) device required using recycled materials as outlined in the TOM Instruction Manual. Students must be prepared to present their solution within a 3x3m square and ensure that at least four team members are within the square at any given time during their performance. The six weeks of preparation time culminates in a Regional Final, often held at a participating high school or at a university. Students present the solution to their Long Term Challenge to a panel of judges as well as any supporters or competitors who wish to watch. The Spontaneous Challenge is completed separately with only a judging panel present. In larger branches, such as [New South Wales](/wiki/New_South_Wales), [Queensland](/wiki/Queensland), [Victoria](/wiki/Victoria_(Australia)), [Western Australia](/wiki/Western_Australia) and New Zealand, successful teams from this regional event are invited to participate in a Branch Final. The Branch Final allows teams three hours to create a ten-minute dramatic presentation outlining their solution to a different challenge in their Discipline. During their preparation time, they also complete another Spontaneous Challenge. The top-scoring team from the Primary and Secondary divisions of each Discipline is invited to participate in the TOM International Final (TIF), which follows the same competition format as the Branch Final. The event rotates through the Australian capital cities. ### Venues YearPlaceNotesRef2013[Australian National University](/wiki/Australian_National_University), [Canberra](/wiki/Canberra)2014[La Trobe University](/wiki/La_Trobe_University), [Melbourne](/wiki/Melbourne)2015[University of New South Wales](/wiki/University_of_New_South_Wales), [Sydney](/wiki/Sydney)2016[Griffith University](/wiki/Griffith_University), [Gold Coast](/wiki/Gold_Coast,_Queensland)2017[Flinders University](/wiki/Flinders_University), [Adelaide](/wiki/Adelaide)2018[Charles Darwin University](/wiki/Charles_Darwin_University), [Darwin](/wiki/Darwin,_Northern_Territory)2019[University of Tasmania](/wiki/University_of_Tasmania), [Hobart](/wiki/Hobart)2020Held onlineDue to [COVID-19 pandemic](/wiki/COVID-19_pandemic)2021Online TIF held and coordinated from [Edith Cowan University](/wiki/Edith_Cowan_University), [Perth](/wiki/Perth)Due to [COVID-19 pandemic](/wiki/COVID-19_pandemic) Edith Cowan University was expected to host the event 2022Australian National University, [Canberra](/wiki/Canberra)2023La Trobe University, [Melbourne](/wiki/Melbourne) - Official site\n",
  "language": "en",
  "processed_at": "2026-01-12T12:10:28.236609",
  "title": "Tournament of Minds",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tournament_of_Minds"
}