{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:10:30.224719"
  },
  "content": "Public bus operator in Singapore **Tower Transit Singapore** is a contracted [bus operator](/wiki/Bus_transport_in_Singapore) operating in [Singapore](/wiki/Singapore). It commenced operations on 29 May 2016 as a subsidiary of [Tower Transit](/wiki/Tower_Transit) in the United Kingdom, and later a subsidiary of Australian-based [Kelsian Group](/wiki/Kelsian_Group). ## History In October 2014, the [Land Transport Authority](/wiki/Land_Transport_Authority) called for bus operators to bid for a contract to operate 26 routes out of [Bulim Bus Depot](/wiki/Bulim_Bus_Depot) in [Jurong West](/wiki/Jurong_West) based from [Bukit Batok](/wiki/Bukit_Batok_Bus_Interchange), [Clementi](/wiki/Clementi_Bus_Interchange) and [Jurong East](/wiki/Jurong_East_Bus_Interchange) bus interchanges, as part of its new [Bus Contracting Model](/wiki/Bus_Contracting_Model) announced in May that year. Tower Transit Singapore Pte. Ltd. was incorporated as a subsidiary of Tower Transit Group on 3 July 2014 to bid for the contract. Tower Transit Group was a bus company based in the United Kingdom and was a subsidiary of [Transit Systems](/wiki/Transit_Systems) in Australia. In May 2015, the Land Transport Authority awarded Tower Transit Singapore the contract with operations to commence in May 2016, with services based at the Bulim Bus Depot. On 31 July 2015, the Land Transport Authority handed over Bulim Bus Depot to Tower Transit Singapore, allowing preparations such as fitting works on the depot and training of its staff to be carried out earlier. On 6 December 2015, the Bulim Bus Depot was officially opened by MP for [Hong Kah North](/wiki/Hong_Kah_North_Single_Member_Constituency), [Amy Khor](/wiki/Amy_Khor) and then-CEO of Tower Transit, Adam Leishman. A Bulim Carnival Day was also held on the same day to allow the public to tour the depot and learn more about Tower Transit. Tower Transit Singapore commenced operations on 29 May 2016, introducing new technologies and practices to public buses in Singapore. It became the first bus operator to use driver telematics to give Bus Captains feedback on their driving standards and to incentivise safe and smooth driving. It was also the first to install wheel nut covers. On 13 March 2017, Tower Transit Singapore started operating Singapore's first 3-door double-decker bus (SG5999Z) for a six-month trial period. In January 2020, Tower Transit Singapore was included in the sale of Tower Transit Group Limited to Australian-based [SeaLink Travel Group](/wiki/Kelsian_Group). SeaLink Travel Group was later renamed Kelsian Group in November 2021. On 30 September 2020, the Land Transport Authority awarded the Sembawang-Yishun Bus Package to Tower Transit Singapore, along with the second 5-year term of the Bulim Bus Package. Operations for the Bulim and Sembawang-Yishun packages commenced in May and September 2021 respectively, with [Mandai Bus Depot](/wiki/Mandai_Bus_Depot) handed over to Tower Transit Singapore for the Sembawang-Yishun Bus Package. Tower Transit Singapore is also currently (as of 2025[update]) the only public bus operator in Singapore to operate minibuses (BYD C6). These minibuses are deployed exclusively on Feeder Service 825, which runs between [Yio Chu Kang Bus Interchange](/wiki/Yio_Chu_Kang_Bus_Interchange) and the Lentor private housing estate. The service was previously operated by SMRT Buses until the bus package was transferred to Tower Transit. ### Initiatives On 10 December 2016, Tower Transit Singapore became the first bus operator in Singapore to award an employee with a leisure trip. Mr Kumaran joined Tower Transit Singapore in May after 16 years with Singapore's second public bus operator [SMRT Buses](/wiki/SMRT_Buses), and received a pair of return tickets to London and five nights’ accommodation worth S$4,500 from TTS for excellent service. On 13 February 2017, Tower Transit Singapore became the first bus operator in Singapore to celebrate [Valentine's Day](/wiki/Valentine%27s_Day). Tower Transit buses all had Happy Valentines Day programmed onto their buses' Electronic Destination Signages (EDS) and ran an article in [The New Paper](/wiki/The_New_Paper) regarding the couples working in Tower Transit. On 1 March 2017, Tower Transit Singapore rolled out its signature scent on 100 buses operating on routes 66, 97 and 106. Tower Transit is the first bus operator in Singapore to have such an initiative. On 8 March 2017, Tower Transit Singapore became the first bus operator to celebrate [International Women's Day](/wiki/International_Women%27s_Day). ## Bus routes Tower Transit Singapore currently operates 60 bus services under the Bulim and Sembawang-Yishun Bus Packages, consisting of 31 Bulim bus services and 29 Sembawang-Yishun bus services. They are mostly operated from [Bukit Batok](/wiki/Bukit_Batok_Bus_Interchange), [Jurong East](/wiki/Jurong_East_Bus_Interchange), [Jurong Town Hall](/wiki/Jurong_Town_Hall_Bus_Interchange), [Sembawang](/wiki/Sembawang_Bus_Interchange), [Tengah](/wiki/Tengah_Bus_Interchange) Bus Interchanges & [Yishun](/wiki/Yishun_Bus_Interchange) Integrated Transport Hub with some handful of routes operating from [Clementi](/wiki/Clementi_Bus_Interchange) Bus Interchange and [Woodlands](/wiki/Woodlands_Integrated_Transport_Hub) Integrated Transport Hub. Tower Transit is operating the Bulim bus package for another term on 29 May 2021 as continuous to commemorate its 5th anniversary of operations in Singapore, with bus services 653, 657 and 944 handed over to Tower Transit from SMRT Buses. It also handed over services 665 and 974 to SMRT Buses and SBS Transit respectively as they were not part of the new contract. Between September and October 2021, bus services were handed over from SMRT Buses in three tranches as part of the Sembawang-Yishun Package except for Service 110, 652, 963R, NR1 and NR2 (the later three were withdrawn at the expiry of the contract; 110 and 652 were transferred to other packages). City Direct service 663, which was under the bus package, was already operated by Tower Transit. The bus package was based at [Mandai Bus Depot](/wiki/Mandai_Bus_Depot). ## Bus fleet When Tower Transit Singapore started operations in 2016, it inherited a variety of buses previously operated by incumbent operators [SMRT Buses](/wiki/SMRT_Buses) and [SBS Transit](/wiki/SBS_Transit). ### Single-decker buses - [BYD GTK6127BEVB (BC12A04)](/wiki/BYD_B_series) (Zhuhai Guangtong) - BYD C6 ([Gemilang Coachworks](/wiki/Gemilang_Coachworks)) - [MAN NL323F](/wiki/MAN_Lion%27s_City#MAN_NLxx3F_(A22)) Lion's City (A22) ([Gemilang Coachworks](/wiki/Gemilang_Coachworks)) - [Mercedes-Benz O530 Citaro](/wiki/Mercedes-Benz_Citaro) ([Daimler Buses](/wiki/Daimler_Buses)) - [Mercedes-Benz OC500LE](/wiki/Mercedes-Benz_OC500LE) ([Gemilang Coachworks](/wiki/Gemilang_Coachworks)) - [Volvo B5LH](/wiki/Volvo_B5LH) ([MCV Evora](/wiki/MCV_Evora)) - [Yutong ZK6128BEVG E12](/wiki/Yutong_E10) - [Zhongtong LCK6126EVG N12](/wiki/Zhongtong_Bus) (Integral) ### Double-decker buses - [Alexander Dennis Enviro500 MMC](/wiki/Alexander_Dennis_Enviro500_MMC) - [MAN ND323F Lion's City](/wiki/MAN_Lion%27s_City) (A95) ([Gemilang Coachworks](/wiki/Gemilang_Coachworks)) - [Volvo B9TL](/wiki/Volvo_B9TL) ([Wright Eclipse Gemini 2](/wiki/Wright_Eclipse_Gemini_2)) - [Yutong ZK6125BEVGS E12DD](/wiki/Yutong) ### Articulated buses - [MAN NG363F Lion's City](/wiki/MAN_Lion%27s_City) (A24) ([Gemilang Coachworks](/wiki/Gemilang_Coachworks)) ### Former Vehicle Fleet - [Volvo BZL](/wiki/Volvo_BZL) (SC Neustar City) demonstrator - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:10:30.224441",
  "title": "Tower Transit Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tower_Transit_Singapore"
}