{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:10:32.885046"
  },
  "content": "Limited form of local government in SingaporeThis article is part of a series on[Politics of Singapore](/wiki/Politics_of_Singapore)[Constitution](/wiki/Constitution_of_Singapore) - [Law](/wiki/Law_of_Singapore) - [Human rights](/wiki/Human_rights_in_Singapore) [Legislature](/wiki/Parliament_of_Singapore) - **[Parliament](/wiki/Parliament_of_Singapore)** - [Speaker](/wiki/Speaker_of_the_Parliament_of_Singapore) [Seah Kian Peng](/wiki/Seah_Kian_Peng) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the House](/wiki/Leader_of_the_House_(Singapore)) [Indranee Rajah](/wiki/Indranee_Rajah) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)) ([WP](/wiki/Workers%27_Party_(Singapore))) - [14th Parliament](/wiki/14th_Parliament_of_Singapore) - [Constituencies](/wiki/Constituencies_of_Singapore) [Executive](/wiki/Government_of_Singapore#Composition) - **[President of Singapore](/wiki/President_of_Singapore)** ([list](/wiki/List_of_presidents_of_Singapore)) - [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) ([I](/wiki/Independent_politician)) - **[Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore)** - [Lawrence Wong](/wiki/Lawrence_Wong) ([PAP](/wiki/People%27s_Action_Party)) - [Cabinet](/wiki/Cabinet_of_Singapore) - [Ministries](/wiki/Organisation_of_the_Government_of_Singapore) - [The Reserves](/wiki/Reserves_of_the_Government_of_Singapore) [Judiciary](/wiki/Judicial_system_of_Singapore) - **[Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore)** - [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Sundaresh Menon](/wiki/Sundaresh_Menon) - **[Court of Appeal](/wiki/Court_of_Appeal_of_Singapore)** - [Prakash](/wiki/Judith_Prakash) - [Tay](/wiki/Tay_Yong_Kwang) - [Chong](/wiki/Steven_Chong) - [Ang](/wiki/Belinda_Ang) - **[High Court](/wiki/High_Court_of_Singapore)** - [State Courts](/wiki/State_Courts_of_Singapore) [Elections](/wiki/Elections_in_Singapore) - [Presidential elections](/wiki/Presidential_elections_in_Singapore) - [General elections](/wiki/General_elections_in_Singapore) Singapore portal - [Other countries](/wiki/Outline_of_political_science#Politics_by_region) - v - t - e In [Singapore](/wiki/Singapore), a **Town Council (TC)** is an administrative body led by one or more elected [Members of Parliament](/wiki/Member_of_Parliament) (MPs) together with appointed residents. It is responsible for managing the common property and overseeing the day-to-day maintenance of [public housing](/wiki/Public_housing_in_Singapore) estates built by the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) within a designated [town](/wiki/New_towns_of_Singapore). Established under the *Town Councils Act 1988*, town councils focus mainly on estate management and function as a limited form of [local governance](/wiki/Local_governance). Unlike in many countries, there are no separate [local elections](/wiki/Local_elections) for town councils; their composition is determined by the results of [parliamentary general elections](/wiki/General_elections_in_Singapore). Their leadership and structure are therefore tied to national political boundaries and depend entirely on which MPs are elected to represent their constituencies. Town councils have no independent legislative or executive powers apart from the [national government](/wiki/Government_of_Singapore) and may be altered when electoral boundaries are revised, although they are allowed to enact [by-laws](/wiki/By-law). To streamline administration, TCs usually cover one or more [constituencies](/wiki/Constituencies_of_Singapore) for the management of estates and services. As of the [2025 Singaporean general election](/wiki/2025_Singaporean_general_election), 19 town councils were formed across Singapore, with 17 under the ruling [People's Action Party](/wiki/People%27s_Action_Party) (PAP) and 2 under the opposition [Workers' Party](/wiki/Workers%27_Party_(Singapore)) (WP). Town councils have received a range of responses. Supporters state that they link estate management to elected representatives, which can make services more responsive and locally focused. Others note that this arrangement ties municipal services to political representation, which may create variations across constituencies and limits direct resident participation since there are no separate local elections. Some have suggested alternative models such as a more depoliticised system of estate governance or holding local elections independently of national ones. ## Functions and powers Town councils are a limited form of [local government](/wiki/Local_government) that primarily manage and maintain the common property of [public housing](/wiki/Public_housing_in_Singapore) estates. Their responsibilities typically include miscellaneous upkeep such as the cleaning of common areas, maintaining lifts, exterior wall painting and carrying out landscaping works such as grass cutting. Unlike most forms of local government, town councils are not directly elected but are instead led by [Members of Parliament](/wiki/Parliament_of_Singapore) (MPs) chosen through national general elections. Their role is therefore regarded as an extension of MPs' constituency responsibilities rather than a separate political office. In addition to their core functions, town councils may be tasked with managing or maintaining other property on an ad-hoc basis at the request of the [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) or the government. With the approval of the [Minister for National Development](/wiki/Ministry_of_National_Development_(Singapore)#Ministers), they may also carry out the work of any public authority or association if both parties agree. The *Town Councils Act* also grants them powers to establish new communal facilities, subject to HDB approval where required. They may maintain property that is not designated as common property if authorised by the Minister for National Development and are empowered to set service and conservancy charges (S&CC) to fund the upkeep of the town. Town councils do not cover private housing estates such as condominiums, landed properties or terraced houses, which are managed separately by management corporations or other private arrangements under the *Building Maintenance and Strata Management Act 2004*. ## List of town councils As of 2025, there are 19 town councils in Singapore administered by two political parties, the [People's Action Party](/wiki/People%27s_Action_Party) (PAP) with 17 and the [Workers' Party](/wiki/Workers%27_Party_(Singapore)) (WP) with the remaining two, those being AHTC and SKTC. - Aljunied–Hougang Town Council (AHTC) - Ang Mo Kio Town Council (AMKTC) - Bishan–Toa Payoh Town Council (BTPTC) - Chua Chu Kang Town Council (CCKTC) - East Coast Town Council (ECTC) - Holland–Bukit Panjang Town Council (HBPTC) - Jalan Besar Town Council (JBTC) - Jalan Kayu Town Council (JKTC) - Jurong–Clementi–Bukit Batok Town Council (JCBBTC) - Marine Parade–Braddell Heights Town Council (MPBHTC) - Marsiling–Yew Tee Town Council (MYTTC) - Nee Soon Town Council (NSTC) - Pasir Ris–Changi Town Council (PRCTC) - Punggol Town Council (PGTC) - Sembawang Town Council (SBTC) - Sengkang Town Council (SKTC) - Tampines Town Council (TTC) - Tanjong Pagar Town Council (TPTC) - West Coast–Jurong West Town Council (WCJWTC) ## History of local government in Singapore ### Municipal Commission (1887–1951) Singapore's rapid development in the 19th century meant that there was an increasing demand for the management of municipal matters beyond the ad-hoc management of such matters by the British colonial government. In 1887, the [Municipal Commission of Singapore](/wiki/Municipal_Commission_of_Singapore) was established that split the administration of the town area and the rural districts, and also had its own source of municipal funds that were separate from government revenue. The Commission initially comprised an appointed full-time salaried president, and five elected members. It supported numerous improvement projects over the next few decades such as establishing a fire brigade, enlarging reservoirs, and providing street lighting. In 1913, the commission was reorganised and elections were abolished, although they were reintroduced in 1949 to encourage greater civic participation. Three elections were held for the commission from 1949 to 1950 before it was renamed in 1951. ### City Council (1951–1963) In 1951, the Municipal Commission was renamed the City Council when Singapore officially attained city status in the British Commonwealth. The Municipal Building, from which the Commission operated, was also renamed [City Hall](/wiki/City_Hall,_Singapore). From 1951 to 1958, four full elections and one by-election were held for the City Council. #### Absorption of City Council into Government By 1959, there was a widespread perception that the City Council was inefficient and corrupt. For example, it was reported by *[The Straits Times](/wiki/The_Straits_Times)* that an advertising agent had to bribe his way to get his licenses on time. The [People's Action Party](/wiki/People%27s_Action_Party) (PAP) campaigned on the promise that if they were to win the general election on 30 May that they would reorganise the \"present unwieldy, inefficient, expensive and wasteful system of government\". First on the list of priorities was the absorption of the parallel administrations of the City Council and Rural Board into the central government.: 87 When the PAP won, then-Minister for National Development [Ong Eng Guan](/wiki/Ong_Eng_Guan) signed an order taking over the functions of the City Council and centralising these municipal functions under the Government. The water, electricity and gas functions stayed with the City Council until 1963, when it was absorbed into the [Public Utilities Board](/wiki/Public_Utilities_Board_(Singapore)) (PUB). ### Pilot Town Council programmes (1986–1988) Although the PAP campaigned in the early years that local government functions were \"inefficient\" for a small city-state such as Singapore,: 87 the party changed its mind a few decades later. It decided in 1986 to decentralise some municipal functions because it wanted ostensibly to increase resident participation in estate management. As a result, three town councils were set up in [Ang Mo Kio](/wiki/Ang_Mo_Kio) as a pilot programme to manage the estate. ### Town Councils Bill and Act (1988) The three pilot town councils, Ang Mo Kio West, Ang Mo Kio East and Ang Mo Kio South, were deemed to be highly successful and led to the introduction of the *Town Councils Bill* in Parliament in May 1988. [Goh Chok Tong](/wiki/Goh_Chok_Tong), who would eventually become [Prime Minister](/wiki/Prime_Minister_of_Singapore) in 1990, argued in Parliament that town councils not only provided for greater resident participation, but also would act as \"political stabilisers\".: 379 He cited the fact that in other democracies, e.g. the [United Kingdom](/wiki/United_Kingdom), there were \"inherent factors\" that resulted in \"greater political stability\", such as \"long-term allegiances of constituencies to a certain political party.\" But in Singapore, > ... it is the PAP which provides the political stability. There is no other party at present which can effectively govern Singapore. But this political stability can be threatened by sudden temporary swings in national mood. If there are such swings, the PAP can be out of power. If that happens, political instability will result because no alternative leadership has emerged which can effectively govern Singapore.: 384 Goh also noted in the same speech in Parliament that voters were confident that after decades of uninterrupted PAP rule, that even if they elected opposition candidates to Parliament that they would still have a competent PAP government managing their constituencies, which would result in a [\"free-rider\" problem](/wiki/Free-rider_problem): > For example, some voters who want a PAP government also want to see some opposition MPs. They may vote for an opposition candidate and depend on the PAP to look after their constituency because they expect other constituencies to return PAP candidates in sufficient numbers to form the government.: 385 [Chiam See Tong](/wiki/Chiam_See_Tong), then-MP for [Potong Pasir](/wiki/Potong_Pasir) and one of only two non-PAP MPs at that time, spoke at length rejecting the bill. Chiam argued that the role of an MP was to give direction to a nation, and not to manage municipal matters:: 413 > A party is elected because of its policy. The people may want the party to represent them so that the nation can move in a particular direction. The PAP first came into power on a socialist platform. People of Singapore voted them in because they thought that was good for Singapore and so they went on a socialist principle, up to lately, of course. Some people may want to vote people like [Margaret Thatcher](/wiki/Margaret_Thatcher), free enterprise, the capitalist line. You vote her in. So that is the purpose of voting Members of Parliament and a particular party. But you do not vote a Town Councillor to change the direction or have a national policy in regard whether to foreign policy or to national policies on education or defence, or how you should have a relationship with your neighbours. These are not the work of town councillors. These are the work of Members of Parliament. So there is a distinct different role.: 414 He also noted that most MPs did not stay in the same constituency, let alone the same housing estate, of their residents, and would therefore not add much value to the residents in such matters. He proposed that Town Councils should be made non-political, but was rebutted by [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) that MPs should care for their constituents as much as they cared about lawmaking: > If any MP stands in the next election and says, \"Please elect me. I will pay no attention to municipal matters. You go and find some non-political Town Councillor on your own to manage that and you have it out with HDB should anything happen\", I do not think he is going to be elected. I do not think the Member for Potong Pasir will put that in the [SDP](/wiki/Singapore_Democratic_Party) manifesto. Will he? Perhaps not.: 415 Ultimately, PAP's [supermajority](/wiki/Supermajority) in Parliament allowed it to pass the bill into law without further consultation.: 445 ## Formation Within 30 days after a general election, town councils will have to be formed. A town council comprises the MP(s) of one constituency, or two to three constituencies who collectively agree to become a town, and six to 30 appointed members. The town council is led by a chairperson who must be an elected MP, who can then appoint non-elected MPs to the town council as well. At least two-thirds of the appointed members must be residents living in the town to ensure good representation. ### By-laws Under the *Town Councils Act*, a town council may make [by-laws](/wiki/By-law) as part of its estate management role. As of 28 November 2019, there are 51 pieces of by-law legislation published in the Singapore Statutes. The by-laws generally cover three main areas: (1) the rules governing the use of common spaces and open areas in the estate; (2) service and conservancy charges (S&CC) charges to be paid to the Town Council; and (3) the penalties for not paying those charges. ## Funding ### Funding Sources Apart from the service and conservancy charges (S&CC) that are paid by the residents and commercial operators of the town, a town council is also able to tap on numerous grants that the government provides. #### S&CC Operating Grant The S&CC operating grant is given by the [Ministry of National Development](/wiki/Ministry_of_National_Development_(Singapore)) (MND) to support the town council with their operating needs. The grant is disbursed annually, and is allocated based on the number and type of HDB flats in the town. Smaller HDB flats are given a bigger grant than larger ones. No grant is given for 5-room flats. #### GST Subvention The GST Subvention is disbursed to the town council every quarter and has been used to offset the increase in GST on the S&CC costs for residents at least since December 2002, when then-Minister for Finance [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) announced an increase in GST from 3% to 4%. #### Lift Enhancement Programme The Lift Enhancement Programme is a S$450m programme that was announced in September 2016, in view that the funds maintained by all the town councils (estimated at S$1b in 2016) would not be sufficient for lift upgrading works in the housing estates, which was estimated at S$3b over the next 20 years. As a result of this programme, a new fund—the Lift Replacement Fund—was required to be set up by all town councils to contribute at least 14% of their income into. Under this programme, the HDB would co-fund up to 90% of the town councils' costs to retrofit older lifts with safety features and enhancements. #### Lift Maintenance Grant Announced in 2017, the Lift Maintenance Grant is disbursed annually and provides a S$600 grant per lift in every town to the town council to alleviate the higher costs of lift-related servicing and maintenance. #### Lift Replacement Fund Matching Grant Also announced in 2017, the Lift Replacement Fund Matching Grant matches 50% of a town council's contribution to the Lift Replacement Fund and is disbursed quarterly. #### CIPC Funding Town councils can also apply to the Community Improvement Projects Committee (CIPC) through the Citizens' Consultative Committees (CCC) of their towns for funding support for \"improvement projects in HDB estates for the benefit of local residents\". This funding source is not explicitly stated on the MND website, but was revealed after a query by [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)), MP for Aljunied GRC, in 2015. As of November 2019, the CIPC is made up of PAP MPs and losing PAP candidates from the most recent general election. ### Funds Town councils are required to allocate their monies into three distinct funds: - **Operating Fund:** For short-term, routine expenses; - **Sinking Fund:** For long-term, non-lift cyclical expenses; and - **Lift Replacement Fund:** For long-term, lift-related cyclical works. ## Accountability Town councils have to comply with legislation in the *Town Councils Act*. Some things that are considered offences include poor corporate governance procedures (e.g. not keeping a register of conflict of interests), not complying with notices from the [HDB](/wiki/Housing_and_Development_Board) or any official direction given by the Minister for National Development, misuse of monies from funds that are managed by the town council, and failure to submit audited reports or statements. In addition, the *Town Councils Act* also allows for the delegation of powers by the town council to \"any employee thereof or any agent\": s32(2) to exercise or perform any function, power or duty. ## Controversies ### Action Information Management Pte Ltd (AIM) In December 2012, Aljunied–Hougang Town Council was scored the lowest banding for S&CC arrears management. [Sylvia Lim](/wiki/Sylvia_Lim), chairwoman of the town council, blamed the poor results on Action Information Management Pte Ltd (AIM), a vendor that provided computer systems for town council management. She claimed that the town council was \"acutely aware\" of the possibility that AIM, as a long-standing IT vendor for PAP town councils, could choose to withdraw from their contractual obligations at short notice. Because of this, the town council had to put in effort to create a new IT system, which compromised their level of service. Chandra Das, AIM chairman, produced correspondence between the company and the town council that suggested otherwise—AIM in fact readily agreed to two extensions to the contract that was supposed to end on 1 August 2011. This point is later corroborated again in the judgment of *Aljunied–Hougang Town Council and another v Lim Swee Lian Sylvia and others and another suit*. #### The structure of AIM and AIM's purchase of TCMS The complaint by Sylvia Lim on AIM led to an exchange between her and [Teo Ho Pin](/wiki/Teo_Ho_Pin). During one of those exchanges it was revealed that AIM was in fact backed by the [PAP](/wiki/People%27s_Action_Party). It was owned by three former PAP MPs—Chandra Das, Chew Heng Ching and Lau Ping Sum. AIM was also discovered to be a company with just S$2 (the minimum) in paid-up capital, and put into question how such a company would be considered strong enough to sell a sophisticated piece of software to. Yet, AIM managed to bid successfully for the Town Council Management System (TCMS) owned by 14 town councils, for S$140,000, in 2010. This was done through an open tender where AIM was the only bidder. There was sufficient public interest in the matter for Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) to order an investigation into the transactions of AIM in January 2013. The scope of the investigation would also cover \"observations on the nature of TCs and how they are run, with a view to improving the current framework\". The Ministry of National Development published the report in May 2013, and it was also debated in Parliament. The ministry's review team concluded in the report that not only did the PAP town councils comply with the open tender process under the *Town Councils Act*, there was no \"pecuniary or direct interest\" on the part of any of the town council members on AIM. ### Aljunied–Hougang-Punggol East Town Council #### Aftermath of the AIM investigation In May 2013, the MND report on AIM and town councils was debated in Parliament. [Khaw Boon Wan](/wiki/Khaw_Boon_Wan), then-Minister for National Development, expressed during the ministerial statement that there were concerns on how Aljunied–Hougang Town Council (AHTC) waived the requirement for open tender and awarded a multi-million dollar contract to FM Solutions and Services Pte Ltd (FMSS), a company that was formed just days after the general election. Khaw mentioned several times during the ministerial statement that FMSS was formed and owned by a group of people loyal to the [Workers' Party](/wiki/Workers%27_Party_(Singapore)), and that awarding a contract without open tender seemed inappropriate. #### *Attorney-General v AHPETC* About a year later, in February 2014, AHTC submitted its audited financial statements for the financial year ending 31 March 2013. Its auditor, Foo Kon Tan [Grant Thornton LLP](/wiki/Grant_Thornton_LLP), prepared an auditor's report containing 13 grounds of qualification. The auditor-general subsequently audited AHTC's financial statements and released a final report in February 2015, which the Ministry of National Development used as its basis to sue AHTC, mainly to force AHTC to appoint independent accountants to review their statements and ensure they complied with the town council rules.: 22 The case was later dismissed in the High Court. ## Reception The town council model has been subject to criticism because it unnecessarily politicises what would have been a non-political function. In 2013, Mak Yuen Teen, a professor at the [National University of Singapore](/wiki/National_University_of_Singapore), suggested depoliticising the town council so that MPs can focus on \"serving the residents in more impactful ways and on issues of national importance\". He rejected the idea that town councils made MPs more accountable for the running of estates and said, > \"What were MPs doing before there were town councils in 1989?\" Didn't they have political accountability then? - [Community Development Council](/wiki/Community_Development_Council) (CDC)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:10:32.884778",
  "title": "Town Council (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Town_Council_(Singapore)"
}