{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:04:50.536595"
  },
  "content": "Singaporean socio-political blog **TR Emeritus** (**TRE**, formerly **Temasek Review Emeritus**) is a socio-political [blog](/wiki/Blog) and one of the alternative media that emerged in [Singapore](/wiki/Singapore) in the 2000s. While Malaysian newspaper *[The Star](/wiki/The_Star_(Malaysia))* recognised it to have Opposition sympathies, according to [SPH](/wiki/Singapore_Press_Holdings)-owned *[The New Paper](/wiki/The_New_Paper)*, \"News website Temasek Review has earned a reputation for its sharply critical views of the Government,\" and the [Jakarta Globe](/wiki/Jakarta_Globe) described the Temasek Review as \"one of Singapore’s few independent web sites\". ## Changes of name It was founded in 2004 as **Wayang Party**, and renamed **Temasek Review** in 2009, using an old name for Singapore. In late 2010, it was involved in a dispute with [government-linked](/wiki/Government-owned_corporation) corporation [Temasek Holdings](/wiki/Temasek_Holdings) over its name. Temasek Holdings argued that *Temasek Review* had been used as the name of the company's annual report since 2004 and that the [Javanese](/wiki/Javanese_language) word [Temasek](/wiki/Temasek) was \"indisputably associated with Temasek [Holdings]\" and that the website \"was just trying to capitalise on the goodwill and reputation\" linked to it. The website was renamed **Temasek Review Emeritus** on 25 May 2011. After a period offline, it was relaunched as TR Emeritus in December of that year. The shortened name was chosen to avoid trademark complications with Temasek Holdings. ## Closure and relaunch in 2011 Facing restrictions in both income and contributors, and unable to upgrade hardware to cope with increasing demand, the site's editor Amanda Tan announced on 7 April 2011 that it would close in July. She acknowledged the existence of pressure from the Government, but said that its effects were minimal and there had been no direct official request to close. Ang Peng Hwa, professor of journalism at [Nanyang Technological University](/wiki/Nanyang_Technological_University), described the closure as \"definitely a loss for the [blogsphere](/wiki/Blogsphere) and also for critical discourse in Singapore\". In late April 2011, Temasek Review complained that it had been hit with a [distributed denial of service](/wiki/Distributed_denial_of_service) (DDOS) attack during the height of the [2011 general elections](/wiki/2011_Singapore_general_election) campaign coverage. Another online site, [The Online Citizen](/wiki/The_Online_Citizen), made a similar announcement. Temasek Review was recorded by Experian [Hitwise](/wiki/Hitwise) as receiving a significant proportion of internet traffic from search engines during the campaign. In August 2011, Tan announced that the website had gained additional financial support and that the team behind it intended to keep it running for at least five years. She also pledged \"to improve and try to balance the articles on our site to cater to readers from all camps,\" aiming to be \"by Singaporeans for Singaporeans\". Temasek Review Emeritus was taken offline without explanation on 5 September 2011. It returned as TR Emeritus on 18 December 2011 with a new banner describing the site as *TR Emeritus: The Voice of Singaporeans for Singapore*. - http://www.tremeritus.com/ - The Temasek Review at the [Wayback Machine](/wiki/Wayback_Machine) (archived 17 October 2010)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:04:50.536309",
  "title": "TR Emeritus",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/TR_Emeritus"
}