{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:10:38.743028"
  },
  "content": "Statute of the Parliament of Singapore[Southeast Asian haze](/wiki/Southeast_Asian_haze) seriesHaze in [Borneo](/wiki/Borneo), (/wiki/2019_Southeast_Asian_haze)History1990s - [1997 Southeast Asian haze](/wiki/1997_Southeast_Asian_haze) - [1997 Indonesian forest fires](/wiki/1997_Indonesian_forest_fires) 2000s - [2005 Malaysian haze](/wiki/2005_Malaysian_haze) - [2006 Southeast Asian haze](/wiki/2006_Southeast_Asian_haze) - [2009 Southeast Asian haze](/wiki/2009_Southeast_Asian_haze) 2010s - [2010 Southeast Asian haze](/wiki/2010_Southeast_Asian_haze) - [2013 Southeast Asian haze](/wiki/2013_Southeast_Asian_haze) - [2015 Southeast Asian haze](/wiki/2015_Southeast_Asian_haze) - [2016 Malaysian haze](/wiki/2016_Malaysian_haze) - [2016 Southeast Asian haze](/wiki/2016_Southeast_Asian_haze) - [2017 Southeast Asian haze](/wiki/2017_Southeast_Asian_haze) - [2019 Southeast Asian haze](/wiki/2019_Southeast_Asian_haze) Key topics - [Chemical equator](/wiki/Chemical_equator) - Deforestation - [in Borneo](/wiki/Deforestation_in_Borneo) - [in Indonesia](/wiki/Deforestation_in_Indonesia) - [Mega Rice Project](/wiki/Mega_Rice_Project) - [Peat swamp forest](/wiki/Peat_swamp_forest) - [Borneo](/wiki/Borneo_peat_swamp_forests) Responses - [ASEAN Agreement on Transboundary Haze Pollution](/wiki/ASEAN_Agreement_on_Transboundary_Haze_Pollution) - [Operation Haze](/wiki/Operation_Haze) - [Transboundary Haze Pollution Act 2014](/wiki/Transboundary_Haze_Pollution_Act_2014) - [People's Movement to Stop Haze](/wiki/People%27s_Movement_to_Stop_Haze) See also - [Air pollution in Malaysia](/wiki/Air_pollution_in_Malaysia) - [API](/wiki/Air_Pollution_Index) - [Singapore PSI](/wiki/Pollutant_Standards_Index) - [Social and environmental impact of palm oil](/wiki/Social_and_environmental_impact_of_palm_oil) Category - v - t - e The **Transboundary Haze Pollution Act of 2014** (THPA) is a [statute](/wiki/Statute) of the [Parliament of Singapore](/wiki/Parliament_of_Singapore) that criminalizes conduct which causes or contributes to haze pollution in Singapore, and to provide for related matters such as deterrence. The law is designed specifically to allow legal in suing companies for environmental pollution. ## Background Since 1972, Malaysia and Singapore suffered recurrent episodes of severe air pollution due to agricultural burning in Sumatra and Kalimantan, Indonesia. The [ASEAN Agreement on Transboundary Haze Pollution](/wiki/ASEAN_Agreement_on_Transboundary_Haze_Pollution) was intended to prevent such pollution. However, as of 2006, Indonesia and the Philippines had not ratified the Agreement. Following a severe occurrence in 2006, economist and professor at the National University of Singapore, [Ivan Png](/wiki/Ivan_Png), wrote a series of opinion articles in the Malaysian and Singapore media to advocate that environmental laws be extended to outlaw trans-boundary emissions. ## Overview In August 2014, the Parliament of Singapore enacted the Transboundary Haze Pollution Act. The Act seeks to deter firms or entities in or outside Singapore from carrying out activities that contribute to transboundary haze affecting Singapore. The law targets companies, not countries, which pollute and those that condone pollution by other companies or individuals that they have management control over. Failure to prevent or stop burning may hence lead the culprit to being guilty of an offence under the law, unless steps are taken to stamp out the practice. The [National Environment Agency](/wiki/National_Environment_Agency) with the courts are empowered thus in obtaining information on their concessions upon request without the need of relying on the Indonesian authorities, as well as imprisoning and/or fining targeted companies or individuals which pollute, or whose subsidiaries and/or suppliers pollute. ## Uses of the Act This section **needs expansion**. You can help by expanding it. *(February 2016)* The Transboundary Haze Pollution Act (THPA) has been utilized in several significant ways since its enactment in 2014: **Issuance of Legal Notices**: In 2015, the National Environment Agency (NEA) of Singapore issued legal notices to six Indonesian businesses suspected of causing fires on their lands, which contributed to the haze pollution in Singapore. These notices were a direct application of the THPA to hold companies accountable for transboundary pollution. **Investigation and Enforcement**: By March 2017, the NEA had closed investigations into two companies, PT Bumi Sriwijaya Sentosa and PT Wachyuni Mandira, after determining their involvement in the fires. However, investigations into four other companies remained open as of September 2021. These companies, PT Bumi Andalas Permai, PT Bumi Mekar Hijau, PT Sebangun Bumi Andalas Woods Industries, and PT Rimba Hutani Mas, are suppliers to Asia Pulp and Paper. **Capacity Building**: With the onset of the El Niño in 2015, which exacerbated forest fires in Indonesia, the THPA facilitated the building of local capacity to address these fires in Indonesian provinces such as [Jambi](/wiki/Jambi) and [Riau](/wiki/Riau). This capacity building included enhancing the ability to identify and address sources of pollution more effectively. **Economic Impact**: The haze pollution in 2015 resulted in estimated losses of S$700 million. Environment and Water Resources Minister [Masagos Zulkifli](/wiki/Masagos_Zulkifli) highlighted this economic impact, emphasizing the importance of the THPA in mitigating such losses through preventive and punitive measures. **Public Health and Safety**: The Act has been crucial in addressing public health concerns related to haze pollution. By targeting companies responsible for forest fires, the [THPA](/wiki/THPA) helps protect the health and safety of Singapore’s residents from the adverse effects of air pollution. **International Cooperation**: The effectiveness of the THPA also relies on international cooperation, particularly with Indonesian authorities. The Act empowers Singapore to request information and take legal action independently, but collaboration with Indonesia remains vital for comprehensive enforcement. The Transboundary Haze Pollution Act of 2014 continues to be a key legislative tool for Singapore in combating transboundary haze pollution and holding responsible parties accountable. - [Masagos Zulkifli](/wiki/Masagos_Zulkifli) - Transboundary Haze Pollution Act 2014\n",
  "language": "en",
  "processed_at": "2026-01-12T12:10:38.742725",
  "title": "Transboundary Haze Pollution Act of 2014",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Transboundary_Haze_Pollution_Act_of_2014"
}