{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:10:43.461936"
  },
  "content": "Singaporean investigative authority The **Transport Safety Investigation Bureau (TSIB)** is a department within the [Ministry of Transport](/wiki/Ministry_of_Transport_(Singapore)) of the [Government of Singapore](/wiki/Government_of_Singapore) and is an independent investigation authority, responsible for the investigation of air, marine and land transport accidents and incidents in [Singapore](/wiki/Singapore). The head office is in Passenger Terminal 2, [Changi Airport](/wiki/Changi_Airport), [Changi](/wiki/Changi,_Singapore), Singapore. It was formed on 1 August 2016 as a restructuring of the **Air Accident Investigation Bureau** (**AAIB**) of Singapore. ## History The AAIB was set up in 2002 after the [SilkAir Flight 185](/wiki/SilkAir_Flight_185) and [Singapore Airlines Flight 006](/wiki/Singapore_Airlines_Flight_006) crashes. The bureau set up a facility in 2007 to analyze data from [flight data recorders](/wiki/Flight_data_recorder) (informally known as \"black boxes\") installed on commercial aircraft. On 1 August 2016, the AAIB was restructured and subsumed into an entity within TSIB. ## Responsibilities The TSIB consists of the following entities: - Air Accident Investigation Bureau (AAIB) - Marine Safety Investigation Branch (MSIB) - Rail Safety Investigation Branch (RSIB) The AAIB is responsible for the investigation of air accidents and serious incidents in [Singapore](/wiki/Singapore) involving both local and foreign commercial aircraft. The AAIB also participates in overseas investigations of accidents and serious incidents involving Singapore aircraft or aircraft operated by a Singapore air operator. The AAIB conducts investigations in accordance to the Singapore Air Navigation (Investigation of Accidents and Incidents Order 2003) and Annex 13 to the [Convention on International Civil Aviation](/wiki/Convention_on_International_Civil_Aviation) which governs the member states of the [International Civil Aviation Organization](/wiki/International_Civil_Aviation_Organization) that conducts these investigations. The MSIB is responsible for the investigation of very serious marine casualties within Singapore territorial waters, as well as accidents involving Singapore-registered ships. The MSIB carries out investigations in accordance with the Code of International Standards and Recommended Practices for a Safety Investigation into a Marine Casualty or Incident of the International Maritime Organization. It took over the role of conducting independent safety investigations from the [Maritime and Port Authority of Singapore](/wiki/Maritime_and_Port_Authority_of_Singapore). The RSIB is responsible for the investigation of serious incidents classified as a \"railway occurrence\" which can include, derailment, collision and fatality or serious injury arising from train operation. However, for cross border railway systems such as the [Johor Bahru–Singapore Rapid Transit System](/wiki/Johor_Bahru%E2%80%93Singapore_Rapid_Transit_System), the investigation arrangements are currently under review by the [Ministry of Transport (Singapore)](/wiki/Ministry_of_Transport_(Singapore)). For an investigated accident or incident, the TSIB will produce an investigation report. The investigative process involves the collection and analysis of data, from which causes and contributing factors are determined. Whenever safety issues are identified, the TSIB may make safety recommendations. ## Notable cases - As part of a [Memorandum of Understanding](/wiki/Memorandum_of_understanding) on Cooperation Relating to Aircraft Accident and Incident Investigation between MOT and Nepal's Ministry of Culture, Tourism and Civil Aviation, the TSIB assisted in investigation into the crash of [Yeti Airlines Flight 691](/wiki/Yeti_Airlines_Flight_691). - Singapore portal - Aviation portal - Official website This Singaporean organisation article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:10:43.461624",
  "title": "Transport Safety Investigation Bureau",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Transport_Safety_Investigation_Bureau"
}