{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:10:46.223795"
  },
  "content": "Areas where trees are protected **Tree conservation areas** are large urban areas in [Singapore](/wiki/Singapore) in which no tree with a girth above 1 metre when measured 50 centimetres from the ground may be felled without permission from the [National Parks Board](/wiki/National_Parks_Board). There are currently two such areas, Central TCA (South Central of Singapore) and Changi TCA (Eastern Parts of Singapore). ## Illegal felling of a *Hopea sangal* tree On 20 November 2002, a large tree was chopped down by a property management company, DTZ Debenham Tie Leung. The tree in question was a *[Hopea sangal](/wiki/Hopea_sangal)*, or Chengal pasir tree, a rare tree reputed to have given [Changi](/wiki/Changi) its name. In addition, the tree was standing in a tree conservation area, which forbids any unauthorised felling of a tree with a girth above 1 metre. The tree in question had a girth of 3.4 metres. Public sentiment against the felling was high, and the courts imposed a S$8,000 fine on the company for the offence, which has a maximum fine of S$10,000. The company was also ordered to pay S$76,035 to the state in compensation for the felling. Nature groups and concerned citizens were determined to ensure that this episode became a lesson to be learnt for others. In September 2003, the logs which has been cut down were recovered and transformed into sculptures. A major educational drive, called \"The Hopea sangal Tree: Sculpture Symposium\", was organised by The Sculpture Society (Singapore) in partnership with the [National Parks Board](/wiki/National_Parks_Board) and the [Nanyang Academy of Fine Arts](/wiki/Nanyang_Academy_of_Fine_Arts), and with the support of the [Nature Society (Singapore)](/wiki/Nature_Society_(Singapore)) and the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority), representing a government-NGO combined effort to raise awareness towards the conservation of trees. Seeds recovered in September 2002 were grown in National Parks Board's Pasir Panjang Nursery. On 7 November 2004, Minister Mentor [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) planted a sapling in Hendersonville (between blocks 103 and 104), Henderson Crescent. - National Parks Board, Singapore - The *Hopea sangal* Tree - A Timeline - *Hopea sangal* felled - The \"*Hopea sangal*\" Tree: Sculpture Symposium\n",
  "language": "en",
  "processed_at": "2026-01-12T12:10:46.223518",
  "title": "Tree conservation areas in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tree_conservation_areas_in_Singapore"
}