{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:10:49.063953"
  },
  "content": "Singaporean technology companyThis article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(May 2020)* *(Learn how and when to remove this message)* **Trek 2000 International** Limited is a Singaporean technology company that is listed on the [Singapore Exchange](/wiki/Singapore_Exchange) ([SGX](/wiki/Singapore_Exchange): TREK ). The company [claims to be](/wiki/USB_flash_drive#History) the inventor of the [ThumbDrive](/wiki/USB_flash_drive), a [USB](/wiki/USB) data storage device. The company owns a library of more than 600 [patents](/wiki/Patents), with 360 granted patents. It has also developed numerous other products in the same consumer electronics market segments including the Ai-Ball and offers products such as SSDs and Flash Drives. The ThumbDrive trademark is registered by Trek 2000 International in international markets, although the original inventors of the USB flash drive and the related patents are the subjects of multiple disputes. ## History In 1995, Trek's current chief executive officer and chairman [Henn Tan](/wiki/Henn_Tan) bought over the company, then a family-owned electronic components trading business, for S$1 million with a plan to provide customised engineering to companies. Tan and his engineers subsequently began to explore ways to utilise the USB interface to create a device that could replace the [floppy disk](/wiki/Floppy_disk), and this led to the eventual development of the ThumbDrive. In 2000, Trek launched the ThumbDrive at the [CeBIT](/wiki/CeBIT) international trade fair for information technology and telecommunications in [Germany](/wiki/Germany). Response to the product was overwhelming even though the booth was only modestly decorated. The success of the ThumbDrive propelled Trek into the global arena. The company grew from a five-man outfit to a global enterprise with offices in more than ten countries including the [United States](/wiki/United_States), [Netherlands](/wiki/Netherlands), [Japan](/wiki/Japan), [India](/wiki/India), [China](/wiki/China) and the [Philippines](/wiki/Philippines). ## Products Trek's products include the ThumbDrive, Flucard, and Ai-Ball. The Flucard, a [Wi-Fi](/wiki/Wi-Fi) enabled [SD card](/wiki/SD_card), is hoped to eventually replace the standard SD card. Trek also provides customised engineering design. ## Sustainability Trek 2000 International Ltd pursues sustainability by focusing on its renewable energy solutions business, which involves building and managing solar farms, supplying smart energy products, and developing AI-based energy management systems. - [USB flash drive ยง Patent controversy](/wiki/USB_flash_drive#Patent_controversy)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:10:49.063644",
  "title": "Trek 2000 International",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Trek_2000_International"
}