{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:10:55.833621"
  },
  "content": "* *Trinity Theological College Chapel** is a building and former chapel in Mount Sophia, Singapore. Completed in 1969, it served as the chapel for the [Trinity Theological College](/wiki/Trinity_Theological_College,_Singapore), which moved elsewhere in 2001. The building was later conserved and integrated into a condominium. ## Description The building's roof was designed to resemble the Chinese character \"人\", which means person. Bricks from the building which stood on the site on which the chapel was built, were used in the construction of the chapel's walls. Fibrous plaster was used in the construction of the roof. Ceramic tiles can be found on the floor while terrazzo can be found at the [chancel](/wiki/Chancel). The building also features timber screens that \"allow the surrounding greenery to flow in\", as well as \"optimising cross ventilation and natural daylight\". According to [Docomomo Singapore](/wiki/Docomomo_International), the building is an \"excellent example of later modern tropical church design that evolved from the 1950s.\" ## History A bungalow completed in 1840 was demolished to make way for the chapel of the Trinity Theological College, which was established in 1948. The building was completed in 1969 for $180,000 following six years of planning. At the time, it featured \"fixed seating\" for 150, which could be increased to 500 if necessary, a cross \"rising from the floor\" and a wooden communion table in the chancel. It also featured plexiglass depicting the \"descent of the Holy Spirit.\" The chapel was dedicated on 25 January. It was designed by prominent local architect Chan Kui Chuan. In 2001, the college moved to a newer premises at [Upper Bukit Timah](/wiki/Bukit_Timah), after which the campus was left vacant. The roof of the chapel at the college's campus was designed to resemble the roof of the chapel on Mount Sophia. The building, along with the rest of the buildings within the former college campus, later became an arts complex. The chapel housed Union, an architecture and interior design collective. The building was gazetted for conservation by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority). It was later restored, along with the [Olson Building](/wiki/Olson_Building) and the Former Nan Hwa Girls' School Building at 29 and 33 Mount Sophia respectively. The restoration project won a special mention at the 2018 Urban Redevelopment Authority Architectural Heritage Awards. The building was integrated into the Sophia Hills condominium complex as a restaurant, while the Olson Building was converted into a clubhouse and the Former Nan Hwa Girls' School Building was into a pre-school. 1°18′05″N 103°50′48″E﻿ / ﻿1.30134°N 103.84678°E﻿ / 1.30134; 103.84678\n",
  "language": "en",
  "processed_at": "2026-01-12T12:10:55.833346",
  "title": "Trinity Theological College Chapel",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Trinity_Theological_College_Chapel"
}