{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:04:52.634885"
  },
  "content": "Law firm in Singapore The **TSMP Law Corporation** is a law firm in Singapore. ## History In 1998, [Thio Su Mien](/wiki/Thio_Su_Mien) and Tan Bee Lian founded Thio Su Mien & Partners. In 2001, the [partnership](/wiki/Partnership) was dissolved, and a new law [corporation](/wiki/Corporation) was formed by Thio and her son, [Thio Shen Yi](/wiki/Thio_Shen_Yi), named TSMP Law Corporation. Tan would still be practising with the TSMP until her retirement in 2018. It later entered into a [joint law venture](/wiki/Joint_law_venture) with [Allens Arthur Robinson](/wiki/Allens_(law_firm)), an Australian law firm, in 2007, which allowed Allens to practice Singapore law through TSMP. The venture was eventually dissolved. In 2019, the partners of the firm formed a compliance consulting company, Integrium Private Limited. As of 2018, it had over 60 lawyers. As of 2015, it paid its newly-qualified associates a $7,000 monthly salary. ## Pro-bono work During the pandemic, TSMP delivered gift packs to frontline workers at the Singapore General Hospital. In 2020, it was noted as a Champion for Good by the National Volunteer And Philanthropy Centre. In 2023, TSMP began offering pro-bono legal services to victims of sexual harassment. ## Notable employees ### Current employees - Stefanie Yuen Thio, current joint managing partner of TSMP - Thio Shen Yi SC, current joint managing partner of TSMP - Jeffrey Chan SC, former deputy [solicitor-general](/wiki/Solicitor-General_of_Singapore) - Professor Hans Tjio, legal academic and consultant - Professor Tang Hang Wu, legal academic and consultant ### Former employees - [Nadia Ahmad Samdin](/wiki/Nadia_Ahmad_Samdin), [member of parliament](/wiki/Parliament_of_Singapore) - [Adrian Tan](/wiki/Adrian_Tan), 27th president of the [Law Society of Singapore](/wiki/Law_Society_of_Singapore) This [Singaporean corporation or company](/wiki/List_of_companies_of_Singapore) article is a stub. You can help Wikipedia by expanding it. - v - t - e This article about a [law firm](/wiki/Law_firm) is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:04:52.634605",
  "title": "TSMP Law Corporation",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/TSMP_Law_Corporation"
}