{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:11:08.584067"
  },
  "content": "Defunct TV studio in Tuas, Singapore **Tuas TV World**, also known as **Tuas Training Village**, was a [film set](/wiki/Film_set) facility formerly located at [Tuas](/wiki/Tuas) in Singapore. ## History Built in 1990 by [Singapore Broadcasting Corporation](/wiki/Singapore_Broadcasting_Corporation) at the estimated budget of S$35 million. the facility occupying a land area of 6.6 hectares was designed to resemble Singapore in the 1950s and the 1960s. The facility comprised five Singapore and three Chinese sets. The premises erected of structures resembling replicas of old cinema, railway station, fire station, church, mansions, and traditional shophouses. Three main streets traversed around these buildings, and a 215m-long replica of the [Singapore River](/wiki/Singapore_River) was also constructed for filming purposes. Originally envisioned for the local broadcaster to produce greater variety of dramas on English, Malay, and Tamil languages, Tuas TV World was aimed to break the constraints imposed by the predominantly Chinese-style set in [Caldecott Broadcast Centre](/wiki/Caldecott_Broadcast_Centre). Several [Television Corporation of Singapore](/wiki/Television_Corporation_of_Singapore) (later [Mediacorp](/wiki/Mediacorp) in 1999) [period dramas](/wiki/Period_dramas) were filmed there including *Strange Encounters 3* (1995), *[Tofu Street](/wiki/Tofu_Street)* (1996), *[The Price Of Peace](/wiki/The_Price_Of_Peace) (1997)*, *[Wok of Life](/wiki/Wok_of_Life)* (1999), and *[Hainan Kopi Tales](/wiki/Hainan_Kopi_Tales)* (2000). Some scenes will also shot there included those of a church in *[The Unbeatables I](/wiki/The_Unbeatables_I)* (1993) of *[The Unbeatables](/wiki/The_Unbeatables)* epic TV series, multiple scenes in *Shadows in the Dark* (1994) and also in *A Different Life* (1996). After about a decade of operations and declining demand for period dramas, the facility had become too costly for the broadcaster to maintain. In December 2001, [Special Operations Command](/wiki/Special_Operations_Command_(Singapore)) of the [Singapore Police Force](/wiki/Singapore_Police_Force) leased the premises from Mediacorp and converted it into a temporary facility called **Tuas Training Village** for training purpose. At that time, only 17 out of the original 100 structures in the facility remain, and the exact timeframe of their disappearance remains unclear. Still, according to satellite imagery, the structures were already torn down by 2008. It was also used by various land divisions and specialist police units for a range of trainings including public order incidents, public security, forensic investigations, and scenario-based exercises. The police trainings ceased in 2009 in preparation for the return of the site to the state. The 2012 Singaporean period drama *[Joys of Life](/wiki/Joys_of_Life)* was filmed there for [MediaCorp Channel 8](/wiki/MediaCorp_Channel_8) to celebrate the 30th anniversary of Chinese language drama in Singapore. The land on which the remaining structures of facility is currently zoned as a reserve site, with its future use yet to be determined. The Ministry of Home Affairs appointed a contractor in mid-September, following which the demolition was carried out from the 3rd quarter of 2023 and into the late 2024 and the land was taken over by the [Singapore Land Authority](/wiki/Singapore_Land_Authority).\n",
  "language": "en",
  "processed_at": "2026-01-12T12:11:08.583785",
  "title": "Tuas TV World",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tuas_TV_World"
}