{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:11:07.589134"
  },
  "content": "Planning Area in West Region, SingaporePlanning Area in West Region, Singapore **Tuas** ([IPA](/wiki/International_Phonetic_Alphabet): /ˈtwɑːs/ *TWAHSS*) is a [planning area](/wiki/Planning_Areas_of_Singapore) located within the [West Region](/wiki/West_Region,_Singapore) of [Singapore](/wiki/Singapore). It is bounded by the [Western Water Catchment](/wiki/Western_Water_Catchment) to its north, [Pioneer](/wiki/Pioneer,_Singapore) to its east and the [Straits of Johor](/wiki/Straits_of_Johor) to its west. Tuas also shares a maritime boundary with the [Western Islands](/wiki/Western_Islands,_Singapore) planning area to its east. It has six subzones, Tengeh, Tuas Bay, Tuas North, Tuas Promenade, [Tuas View](/wiki/Tuas_View) and Tuas View Extension. ## Etymology The name Tuas is derived from a [fishing](/wiki/Fishing) method previously used by coastal Malays. Shade was created by using coconut fronds as a shelter with a net spread underneath the shade in the water. Once fish are drawn in by the shade, the net is pulled up by the Malay fisherman. Levering or hauling up in Malay is *menuas*, without the noun-building prefix of me-, the [Malay](/wiki/Malay_language) word is *tuas*. ## History In Franklin and [Jackson](/wiki/Philip_Jackson_(surveyor))'s 1830 map of Singapore, the Tuas area is marked with three different names *Tg Kampong*, *Tg Rawa* and *Tg Gull*. *Tg* is the abbreviation for *tanjung* or *tanjong* ([Malay](/wiki/Malay_language) for cape). Tuas used to be swampland which was later cleared for squatter settlement. By the mid twentieth century, it became a fishing village. In the old days, it was not unusual to see about 200 fishing boats in Tuas every morning. In the 1970s, the residents in Tuas were resettled to [public housing estates](/wiki/Public_housing_in_Singapore). Tuas was then developed for industrial use. In the 1980s, land was [reclaimed](/wiki/Land_reclamation) off Tuas for more industrial development. By 1988, about 6.5 km2 of land off Tuas were reclaimed. Land reclamation off Tuas is still ongoing; the land area of Tuas increased from 17.02 km2 in 1996 to 30.04 km2 presently. [Penta-Ocean Construction](/wiki/Penta-Ocean) was the main construction firm involved in the land reclamation. The peninsular formed from the late 1980s to early 1990s is known as [Tuas South](/wiki/Tuas_View), while the land currently being reclaimed to the southeast of Tuas Jetty is known as the Tuas View Extension. On 2 January 1998, the [Malaysia–Singapore Second Link](/wiki/Malaysia%E2%80%93Singapore_Second_Link) that links Singapore to Malaysia was opened to traffic via Tuas on the Singapore side. ## Industry Being far away from the main residential areas and the [commercial district of Singapore](/wiki/Downtown_Core), Tuas was chosen as a site for industrial development as the adjacent industrial areas in [Jurong Industrial Estate](/wiki/Jurong) were being built. Heavy industries can be found in Tuas, although not as much as on [Jurong Island](/wiki/Jurong_Island). Two of Singapore's four [incinerators](/wiki/Incinerator) are also found in Tuas, namely Tuas Incinerator and Tuas South Incinerator. A world-scale renewable diesel plant, using palm oil as feedstock, which was completed in 2010, is also located in the area. Its capacity will make it the largest plant of its kind (800,000 tons per annum). Further reclamation as part of the [Tuas South](/wiki/Tuas_South) extension is being done to house the world's largest storage of oil. The Tuas mega port began operations in 2021, and will be completed by 2040 to house all of [PSA International](/wiki/PSA_International) current assets and operations, PSA will give up its city terminals by 2027 and [Pasir Panjang Terminal](/wiki/Pasir_Panjang#Pasir_Panjang_Terminal) by 2040. Tanjong Pagar terminal had ceased operations in October 2017 marking the beginning of the end of an era of port operation in the area which dates back to the modern founding of Singapore in 1819. ## Residential areas Tuas has a number of residential buildings provided at low cost for the people who work there. Some are located at Benoi Sector, which also has an eating place, whilst the others are located at Pioneer Road. The low rise flats are normally named from Blocks A to H, and are usually 9 to 11 stories high. They are built to meet basic residential requirements; they provide shelter with an electricity and water supply. Unlike other areas of Singapore, Tuas is mostly an industrial area and there are only a few flats around. ## Notable places - [Tuas Lamp Post 1](/wiki/Tuas_Lamp_Post_1) is the only lamp post in Singapore on which stickers may be pasted. It is located on land reclaimed for the Tuas mega port project. ## Transportation ### Road network Tuas is served by the [Ayer Rajah Expressway](/wiki/Ayer_Rajah_Expressway) (AYE) and the [Pan Island Expressway](/wiki/Pan_Island_Expressway) (PIE), connecting the area to the rest of the country. The AYE leads to the Tuas Checkpoint, Immigration and Quarantine (CIQ) complex via Tuas Checkpoint Viaduct and [Jalan Ahmad Ibrahim](/wiki/Jalan_Ahmad_Ibrahim), and onwards to the [Malaysia–Singapore Second Link](/wiki/Malaysia%E2%80%93Singapore_Second_Link). ### Mass Rapid Transit On 18 June 2017, four [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) stations opened on the [East–West line](/wiki/East%E2%80%93West_Line_(Singapore)) as part of the Tuas West Extension to serve the area. They are: - **EW30** [Gul Circle](/wiki/Gul_Circle_MRT_station) - **EW31** [Tuas Crescent](/wiki/Tuas_Crescent_MRT_station) - **EW32** [Tuas West Road](/wiki/Tuas_West_Road_MRT_station) - **EW33** [Tuas Link](/wiki/Tuas_Link_MRT_station) An extension of the East–West line to Tuas South is also under planning. ### Bus Tuas is served by the [Tuas Bus Terminal](/wiki/Tuas_Bus_Terminal) for workers arriving from [Boon Lay Bus Interchange](/wiki/Boon_Lay_Bus_Interchange).\n",
  "language": "en",
  "processed_at": "2026-01-12T12:11:07.588820",
  "title": "Tuas",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tuas_North"
}