{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:11:12.380155"
  },
  "content": "Traditional Southeast Asian Islamic headscarfPart of a series on[Islamic](/wiki/Islam) [female](/wiki/Women_in_Islam) [dress](/wiki/Islamic_clothing)[Types](/wiki/Types_of_hijab) - [Abaya](/wiki/Abaya) - [Boshiya](/wiki/Boshiya) - [Burkini](/wiki/Burkini) - [Burqa](/wiki/Burqa) - [Çarşaf](/wiki/%C3%87ar%C5%9Faf) - [Chador](/wiki/Chador) - [Haik](/wiki/Haik_(garment)) - [Hijab](/wiki/Hijab) - [Jilbāb](/wiki/Jilb%C4%81b) - [Kimeshek](/wiki/Kimeshek) - [Kurkhars](/wiki/Kurkhars) - [Niqaab](/wiki/Niq%C4%81b) - [Paranja](/wiki/Paranja) - [Safseri](/wiki/Safseri) - [Shayla](/wiki/Shayla) - Tudong - [Yashmak](/wiki/Yashmak) [Practices by country](/wiki/Islamic_veiling_practices_by_country) - [Australia](/wiki/Burqa_ban_in_Australia) - [Europe](/wiki/Hijab_and_burka_controversies_in_Europe) - [Britain](/wiki/British_debate_over_veils) - [France](/wiki/Islamic_scarf_controversy_in_France) - [Turkey](/wiki/Headscarf_controversy_in_Turkey) - [Egypt](/wiki/Niq%C4%81b_in_Egypt) - [Iran](/wiki/Hijab_in_Iran) - [Saudi Arabia](/wiki/Women%27s_rights_in_Saudi_Arabia#Hijab_and_dress_code) Concepts - [Andaruni](/wiki/Andaruni) - [Awrah](/wiki/Intimate_parts_in_Islam) - [Fahisha](/wiki/Fahisha) - [Feminist](/wiki/Muslim_feminist_views_on_hijab) - [Gender segregation](/wiki/Islam_and_gender_segregation) - [Haya](/wiki/Haya_(Islam)) - [Purdah](/wiki/Purdah) - [Zenana](/wiki/Zenana) Other - [Hijabophobia](/wiki/Hijabophobia) - [Hujum](/wiki/Hujum) - [Kashf-e hijab](/wiki/Kashf-e_hijab) - [My Stealthy Freedom](/wiki/My_Stealthy_Freedom) - [Wimple](/wiki/Wimple) - [World Hijab Day](/wiki/World_Hijab_Day) - v - t - e The **tudong** ([Malay](/wiki/Indonesian_language): ***tudung***, [Jawi](/wiki/Jawi_alphabet): **تودوڠ**) is a style of headscarf, worn as interpretation of the [Islamic](/wiki/Islam) [hijab](/wiki/Hijab), prevalent amongst many Muslim women in the [Malay](/wiki/Malay_language)-speaking world; [Indonesia](/wiki/Indonesia), [Brunei](/wiki/Brunei), [Malaysia](/wiki/Malaysia), and [Singapore](/wiki/Singapore). Today, the tudong forms part of the standard [dress code](/wiki/Dress_code) for many offices in Indonesia and Malaysia, as well as in school uniforms and formal occasions. Though initially considered a conservative form of dress, it is worn today by most moderate Muslim women in Malaysia and Indonesia. ## Name The term *tudong* or *tudung* is a [Malay](/wiki/Malay_language)/[Indonesian](/wiki/Indonesian_language) word, literally meaning the noun \"cover\", which is commonly translated as \"[veil](/wiki/Veil)\" or \"[headscarf](/wiki/Headscarf)\" in [English](/wiki/English_language). Tudong is usually used to describe the headscarf in Malaysia, while in Indonesia it is more common to call the tudong the *kerudung* or perhaps the *jilbab*. However, in recent years many speakers of Malay/Indonesian have simply began referring to the tudong/tudung/kerudung as *hijab*, a loanword from [Arabic](/wiki/Arabic) that reflects the growing Arabic cultural influence on the practice of Islam in [Southeast Asia](/wiki/Southeast_Asia). In the [Philippines](/wiki/Philippines), tudong or *talukbong* (Tagalog) refers to the standard [hijab](/wiki/Hijab) as worn by Muslim women. The term is interchangeable with the standard Arabic term *hijab* (alternatively spelled *hidyab* in Filipino), and usually takes the form of the [headwrap](/wiki/Headwrap), visor-type, [al-amira](/wiki/Al-amira), [khimar](/wiki/Khimar) or [niqab](/wiki/Niqab) (face veil) types of veiling. Another term, *kombong* (alternative spelling: *combong*), refers to an older style of headwrap hijab worn by [Maranao](/wiki/Maranao_people), [Iranun](/wiki/Iranun_people), and [Maguindanao](/wiki/Maguindanao_people) women with a semi-translucent [shayla](/wiki/Shayla) or [malong](/wiki/Malong) (sarong) worn over the chest and drawn over the kombong for prayers, or for additional veiling when out of the house or familiar areas. Tudong, talukbong or kombong are native [Austronesian](/wiki/Austronesian_languages) words and cognates with Malay and Indonesian *tudung* or *kerudung* for the hijab. They are commonly used in languages spoken by [Muslim Filipinos](/wiki/Muslim_Filipinos) or [Bangsamoros](/wiki/Bangsamoro), including the three [Danao languages](/wiki/Danao_languages) of [Maranao](/wiki/Maranao), [Maguindanao](/wiki/Maguindanao_people) and [Iranun](/wiki/Iranun), [Kaagan](/wiki/Kalagan_language), and [Tausug](/wiki/Tausug_language), [Yakan](/wiki/Yakan_language), and [Sinama](/wiki/Sinama) ([Bajau](/wiki/Bajau)). In [Tagalog](/wiki/Tagalog_language) or [Bisaya](/wiki/Bisayan_languages), the standard Arabic word of *hijab*, the native term *talukbong*, or the English terms of \"[headscarf](/wiki/Headscarf)\", \"veil\", or \"scarf\" are commonly used by non-Muslims to refer to the tudong instead. ## Description The tudong covers the hair, ears, and neck with a sewn-in curved visor, leaving only the face exposed. The tudong is typically colourful, sporting bright colours such as pinks, yellows, blues, and greens, and is of a square Arabic-style hijab shape, though the tudung is much more colourful than hijab in the [Middle East](/wiki/Middle_East). In both Indonesia and Malaysia a major fashion industry has blossomed around the tudong, with a wide variety of colours and styles as well as the use of buttoned raincoats such as the [jilbab](/wiki/Jilb%C4%81b), long [dresses](/wiki/Dress), and accessories to complement the tudong. Many women also simply wear it with Western-style [jeans](/wiki/Jeans) and [T-shirts](/wiki/T-shirt). [Make-up](/wiki/Cosmetics) is also commonly worn alongside the tudong. The growth of [social media](/wiki/Social_media) has allowed online tudung outlets such as Naelofa Hijab, Fareeda Tudung, SA Elegance, JelitaSARA, and Ariani to market the tudong to young Muslim women in the Malay-speaking world in an effort to remain both fashion-conscious and comply with Islamic [modesty](/wiki/Modesty). Many women attempt to emulate the latest tudong styles seen on celebrities in the Malay-speaking world. ## History The tudong, despite its popularity in the Malay-speaking world, is a recent phenomenon rather than a traditional one. Its origins lie in the mid-to-late 1970s, when the [Islamic revival](/wiki/Islamic_revival), fuelled by the rise of “[Petro-Islam](/wiki/Petro-Islam)” and the buildup to the [Iranian Revolution](/wiki/Iranian_Revolution), began to emerge in the Middle East. ### Pre-1970s Before the 1970s, interpretations of hijab varied amongst women in Malaysia and Indonesia, the most notable form being the *[selendang](/wiki/Selendang)*, a patterned shawl-like scarf loosely draped around the shoulders or around the head, usually not covering the front of the hair or the ears. Before the late 1970s, the headscarf in general, even the *selendang*, was something that was reserved for special occasions, such as during [funerals](/wiki/Funeral) or *kenduris*. Some offices and banks would put up notices that prohibited women with headscarves because headscarves were thought to make a woman look like a criminal. Wearing the headscarf was rare and often shunned; some women appeared on the front pages of newspapers for wearing it. At the time there was also resentment, most notably in Singapore, between Malay Muslims and Muslims of Arab and especially Yemeni origins, as they were viewed as exploiting Malays. This resentment resulted in Malay communities shunning traditions considered “Arab” and “foreign” in nature, such as the headscarf. ### 1970s The tudong emerged during the mid-to-late 1970s among reformist female Muslim university students studying in campuses in the Middle East, and also to a lesser extent in the United States, England, and Australia, as a result of [Ali Shariati](/wiki/Ali_Shariati)’s “authenticity movement” and with the emergence of modern hijab styles being worn by Iranian university students. The tudong was intended to reaffirm these students’ identity as pious Muslims, to reject Western fashion in the same way that Iranian women increasingly were, and to foster a sense of solidarity among themselves. This new form of Islamic dress would begin to also appear at Southeast Asian university campuses in the 1970s and was known as *dakwah* fashion (*fesyen dakwah*). After the [Iranian Revolution](/wiki/Iranian_Revolution) (1978-1979) took place, the [Islamic revival](/wiki/Islamic_revival) was brought to the centre of the [Muslim world](/wiki/Muslim_world). The revolution captured the imagination of not only those from the Middle East but many Malaysian Muslims, where the tudong first emerged before later arriving in Indonesia. ### 1980s While it was considered a rarity for Malay women to don the tudung (headscarf) before the 1980s, it eventially arrived into mainstream public space and conscience beginning in the early 1980s after the Islamic Cultural Revolution of Iran, taking inspiration from the [chador](/wiki/Chador) by law imposed on Iranian women. Some of the female Muslim students who decided to cover themselves from head to toe were being expelled from their universities for refusing to reveal their faces for identification. By the mid-1980s, within six years of the Iranian Revolution and the Islamic revival in Malaysia, tudong-clad women were becoming the majority in institutions of higher learning, and in the civil service. By the end of the 1980s, the tudong had visibly replaced the *selendang* as the form of headscarf most commonly worn by women in Malaysia, spreading from university campuses to schools, workplaces and eventually to the *[kampongs](/wiki/Kampong)*. ### 1990s By the 1990s, the tudong had also been exported to Indonesia, where it became mainstream, the result of the two countries sharing Malay-language media and Arabic oil money (known as “[Petro-Islam](/wiki/Petro-Islam)”) funded towards Islam in the two countries.[*citation needed*] - Clothing portal - Fashion portal - Malaysia portal - [Malaysian cultural outfits](/wiki/Malaysian_cultural_outfits) - [Culture of Malaysia](/wiki/Culture_of_Malaysia) - Media related to Tudung at Wikimedia Commons - (in Malay) \"Tudung, hijab dan… — Aisha Adam\" (Archive). *[The Malay Mail](/wiki/The_Malay_Mail)*. 16 October 2015.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:11:12.379875",
  "title": "Tudong",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tudong"
}