{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:11:15.264567"
  },
  "content": "Variety of cram schoolsSome of this article's listed sources **may not be reliable**. Please help improve this article by looking for better, more reliable sources. Unreliable citations may be challenged and removed. *(November 2024)* *(Learn how and when to remove this message)* **Tuition centres** are [cram schools](/wiki/Cram_school). They are private educational institutions which offer tutoring in various subjects and preparation for specific tests and examinations. Cram schools with the title \"tuition centre\" are predominantly found in [Malaysia](/wiki/Malaysia), [Singapore](/wiki/Singapore) and [India](/wiki/India). In other countries they may have different names, such as [hagwon](/wiki/Hagwon), [buxiban](/wiki/Buxiban), or [juku](/wiki/Juku).Tuition classes are seen as necessary for children to keep an edge in the competitive environment. ## Background The introduction and emergence of college and university entrance examinations led to the rise and growth of tuition centres. ## Locations ### Malaysia According to the [University of Malaya](/wiki/University_of_Malaya): \"Private tutoring has become a commonly rooted practice in Malaysia. It is defined as a supplementary instruction outside the formal schooling system where a tutor teaches academic subjects for a fee. The Malaysian government is very particular with the usage of the term “tuition centres”. Licence for tuition centers are only given to institutions that provide tutoring on academic subjects based on the Malaysian curriculum. The tuition centers function by providing extra coaching to the students so that they are prepared for centralized examinations. Parents often view private tutoring as an avenue for enabling their children to excel in examinations\". ### Singapore Private tuition is a billion dollar industry in Singapore with an estimated 1000 tuition centres. ### India Private tutoring has become a significant part of India's educational landscape. With the growing demand for academic excellence, private tutoring offers supplementary education outside the formal schooling system. This has led to the emergence of various tutoring centers and [EdTech](/wiki/EdTech) platforms that cater to the academic needs of students across the country. ## Tuition Many school teachers (i.e. **tutors**) earn supplementary income through tuition centres and agencies by offering tutoring in a range of subjects (predominantly in [English](/wiki/English_language), [Maths](/wiki/Maths) and the [Sciences](/wiki/Sciences)). Some teachers \"advertise\" their tuition classes and coach those who attend their classes on how to tackle examination questions (i.e. **test prep**). Their focus is primarily [rote learning](/wiki/Rote_learning). Because of fierce competition in [academia](/wiki/Academia) for entrance into [higher education](/wiki/Higher_education), the aim of tutoring through tuition centres is not merely a passing result in the corresponding admissions assessments but the highest score possible - resulting in the focus of teaching shifting from transferring a deep and profound understanding in a given subject to [drilling for exams](/wiki/Teaching_to_the_test). ## Tuition centres vs schools In contrast to schools where teaching occurs in groups (i.e. classes) and set timetables, tuition centres offer students (i.e. tutees) mostly one-on-one instruction and at times convenient to both, the tutor and the tutee. While teachers at schools are paid through fixed yet [capped](/wiki/Maximum_wage) monthly salaries, their counterparts at tuition centres are compensated through hourly rate payments with (theoretically) no boundaries. There are teachers who earn up to [RM](/wiki/Malaysian_ringgit)10,000 or [S](/wiki/Singapore_dollar)$8,000 by giving private tuition. Notwithstanding, there is a huge, and still growing, trend among local parents who send their kids to tuition. Given the immense academic competition attributed to foreign scholars and the proliferating private-tuition trend, some parents feel that they have little choice but to engage tuition centres or opt for home tuition. In recent years, online tutoring or online tuition has become increasingly popular as a way for students to receive additional support and instruction in a variety of subjects. Online tutoring can be done through video conferencing platforms, such as Zoom or Skype, and allows students to receive personalized instruction from the comfort of their own homes. This can be beneficial for students who live in remote areas, have scheduling conflicts, or have difficulty attending in-person tutoring sessions. Online tutoring also allows for flexibility in terms of scheduling and can be a more cost-effective option for families. It also allows for a wider range of teachers to be available to students, as there is no geographical limitation. However, it may lack the in-person interaction and support that can be provided by traditional in-person tutoring. - [College tuition](/wiki/College_tuition) - [Cram school](/wiki/Cram_school) - [Homeschooling](/wiki/Homeschooling) - [In-home tutoring](/wiki/In-home_tutoring) - [Tuition agency](/wiki/Tuition_agency)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:11:15.264150",
  "title": "Tuition centre",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tuition_centre"
}