{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:11:18.984865"
  },
  "content": "Singaporean cupcakery chain **Twelve Cupcakes** was a [Singapore](/wiki/Singapore) based chain of cupcakery selling [cupcakes](/wiki/Cupcake). It was [co-founded](/wiki/Co-Founder) by Singaporean DJ [Daniel Ong](/wiki/Daniel_Ong) and actress Jamie Teo in 2011, before being sold to Dhunseri Group in 2017. It ceased operations on 29 October 2025. ## Name According to Ong, the cupcakery is named \"for 12 strikes in a perfect game of bowling, 12 months in a year, 12 numbers on a clock and of course, the 12 holes in a typical baking tray\". ## History In 2011, Ong and Teo started Twelve Cupcakes with Teo having created the recipes of all the cupcakes sold in the stores. The cupcakes sold were made to suit to the Asian palate, which are less sweet compared to western cupcakes. The first outlet of Twelve Cupcakes was opened at United Square Shopping Mall, in [Novena](/wiki/Novena,_Singapore), which started with two service staff. The company then expanded and opened three more outlets during the first year of operations and sold over three million cupcakes in July 2011. In 2013, Twelve Cupcakes expanded internationally, opening outlets in Jakarta, Taipei, [Kuala Lumpur](/wiki/Kuala_Lumpur), and Hong Kong. In 2014, Twelve Cupcakes started a new dessert cafe known as Dulce and Sucre by Twelve Cupcakes at [Orchard Gateway](/wiki/Orchard_Gateway), where it sold freshly baked loaves, whoopie pies, push up cakes, parfaits, puddings, tiramisus, crunchies, coffees and other desserts. It converted to a Twelve Cupcakes outlet in 2015.[*citation needed*] On 24 January 2017, after the divorce of Ong and Teo in late 2016, the chain was sold to Dhunseri Group, which acquired it for [S$](/wiki/Singapore_dollar)2.5 million. At the [point of sale](/wiki/Point_of_sale), the company had 17 outlets in Singapore and more than 10 outlets in Jakarta, Taipei and Hong Kong that were run by franchise partners. Since 2023 until its closure in 2025, Twelve Cupcakes reported consecutive years of widening net loss and shrinking revenue annually. On 29 October 2025, Twelve Cupcakes ceased operations and was placed under provisional liquidation. The management did not notify its staff about the impending closure, while the union was notified the day before, and left 80 workers unemployed. ## Products and stores Twelve Cupcakes features 60 flavours of [cupcakes](/wiki/Cupcake) sold in its stores, with a standard '12 Everyday Flavours' and 50 specials sold on a rotational basis. A new flavour of cupcake is also launched monthly.[*citation needed*] Twelve Cupcakes new dine-in cafe outlet, Dulce and Sucre, offers a wider variety of menu items, with coffees, whoopie pies, push up cakes, parfaits and other baked items. The stores originally started with display counters made of wood and feature brick wall, but has since re-designed the interiors of newer outlets with a more modern glass display casing as well as a glossy feature wall. Twelve Cupcakes introduced the popular Honey Cakes in November 2015 and brownies in July 2016. Twelve Cupcakes had its presence in Indonesia before ceasing operations in 2018. At its time of closure, the chain operated 21 stores located in 2 locations with 1 in Hong Kong and 20 in Singapore. ## Controversy ### Singapore Press Holdings In 2012, [Singapore Press Holdings](/wiki/Singapore_Press_Holdings) (SPH) demanded payment from the cupcakery for reproducing its articles online. The cupcakery put up articles written about their business on [Facebook](/wiki/Facebook), [Twitter](/wiki/Twitter) and the company's website, which infringes the copyright of SPH and violates copyright law in Singapore. ### Underpayment of foreign staff Twelve Cupcakes was accused of underpaying its foreign workers between 2017 and 2019 by the [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)). When the workers were supposed to be paid salaries ranging from $2,200 to $2,600, the actual salaries paid were lower at $1,400 to $2,050. Initially, the salaries were paid in reduced amounts, before changing tactics to pay the actual salaries with a portion needing to be returned to the company. Twelve Cupcakes was first charged for its offences on 1 October 2020, before pleading guilty on 10 December. Twelve Cupcakes was fined $119,500 on 12 January 2021 for its offences. Separately on 29 December 2020, co-founders Ong and Teo were charged for offences related to underpayment and non-payment of salaries between 2012 and 2016. Teo pleaded guilty on 4 February 2021, and was fined $65,000 on 9 March. Ong was fined a similar amount on 21 May. In addition, former director Yvonne Ong was fined $20,000 for allowing underpayment of the company's workers in 2013 and 2014. After the company was sold to Dhunseri Group, the underpayment of the company's workers continued from 2017 to 2018 under the new management. In January 2021, the company was fined $119,500. Due to these instances of underpayment, the Food, Drinks and Allied Workers Union (a union affiliated to [National Trades Union Congress](/wiki/National_Trades_Union_Congress)) announced on 16 February 2021 plans to unionise the company to make sure workers are fairly represented and to work with the company's management on better employment practices. These plans were being set out as early as late 2020 with the management and employees of the company informed. The company was successfully unionised 10 days later with a secret ballot by the Ministry of Manpower, with majority of the workers voting overwhelmingly for the arrangement. - Twelve Cupcakes official website at the [Wayback Machine](/wiki/Wayback_Machine) (archived 7 August 2025) - Dulce and Sucre official website at the [Wayback Machine](/wiki/Wayback_Machine) (archived 15 April 2016)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:11:18.984591",
  "title": "Twelve Cupcakes",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Twelve_Cupcakes"
}