{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:04:53.690589"
  },
  "content": "Tea brand established in Singapore **TWG Tea** is a Singaporean luxury [teahouse](/wiki/Teahouse) chain and a namesake brand of artisanal [tea](/wiki/Tea). The brand was established in 2008 as a subsidiary of the Singaporean lifestyle company, The Wellbeing Group - from which the acronym, TWG, was derived. In 2014, [Osim International](/wiki/Osim_International), itself a subsidiary of the V3 Group, acquired a majority stake in TWG Tea. The company sells over 1,000 blends of tea in its more than 70 [boutiques](/wiki/Boutique) and salons in Asia, Europe, the Middle East, and North America. It also distributes its tea to international retailers. TWG Tea has expanded rapidly in the 2000s, with salons and boutiques in many countries like [UAE](/wiki/United_Arab_Emirates), UK, [USA](/wiki/United_States), [China](/wiki/China) and more. ## History TWG Tea was established in 2008 as a subsidiary of a Singaporean company, The Wellness Group. Its founder, Manoj M. Murjani (a Hong Konger of Indian descent), conceptualised the luxury teahouse chain together with French-Moroccan tea sommelier, Taha Bouqdib. Bouqdib's wife, Maranda Barnes Bouqdib, was also one of the founding partners. The company opened its first tea outlet in [Raffles Place](/wiki/Raffles_Place)'s [Republic Plaza](/wiki/Republic_Plaza_(Singapore)) in [Singapore](/wiki/Singapore) in 2008 followed by a larger location in the [ION Orchard](/wiki/ION_Orchard) mall. By 2009, TWG Tea products were sold at the [Dean & Deluca](/wiki/Dean_%26_Deluca) grocery store in [New York](/wiki/New_York_City) and were offered on [Singapore Airlines](/wiki/Singapore_Airlines)' flights. In 2010, the brand opened its first overseas store in [Jiyūgaoka](/wiki/Jiy%C5%ABgaoka,_Meguro,_Tokyo), [Tokyo](/wiki/Tokyo). In April 2011, Osim International acquired a 35% equity stake in TWG Tea. Later that year, the company expanded into [Hong Kong](/wiki/Hong_Kong) with a store at the [IFC Mall](/wiki/International_Finance_Centre_(Hong_Kong)). This ultimately led to a lawsuit alleging trademark infringement from the Tsit Wing Group, which had been doing business in Hong Kong since 1932 using the acronym \"TWG\". In 2014, courts ruled in favor of the Tsit Wing Group, prompting TWG Tea to change the name of its Hong Kong business to \"Tea WG\". In 2014, TWG Tea opened a training facility at its headquarters in Singapore to train its staff to become tea [sommeliers](/wiki/Sommelier). In the same year, following a legal dispute between Murjani and Bouqdib over TWG's ownership, Murjani and The Wellness Group exited the brand, and the brand passed into the ownership of The Wellbeing Group, a second parent company established by Bouqdib with acronymic similarities. In 2016, TWG Tea opened its first location in North America in [Vancouver](/wiki/Vancouver), [Canada](/wiki/Canada). In 2017, the company officially launched the TWG Tea Institute in Singapore, which offers training to all TWG Tea employees on brewing techniques and information on all tea blends offered by the company. By 2019, it had 70 outlets in 19 cities worldwide, with distribution of its tea products in over 40 countries. ## Products TWG Tea sells over 1,000 tea varieties, sourcing from 47 tea-producing locales throughout the world. The company's tea products are distributed in 42 countries in retailers like [Harrods](/wiki/Harrods) in London, Dean & Deluca in New York City, [El Corte Inglés](/wiki/El_Corte_Ingl%C3%A9s) in [Spain](/wiki/Spain) and [Portugal](/wiki/Portugal), and Feinkost Käfer in Germany (among others). The company's logo features the year 1837, which is a reference to the foundation of the Singapore Chamber of Commerce. Teas are classified by colour (black, blue, green, yellow, white, red) and have names like \"Singapore Breakfast Tea\", \"Silver Moon Tea\", and \"1837 Black Tea\". Rare and luxury tea varieties include the Imperial Gyokuro and the Gold Yin Zhen, which features flakes of 24-karat gold. TWG Tea also sells upscale tea accessories including teacups and teapots. ## Locations Its tea is also sold in TWG Tea-branded tea salons and boutiques in cities worldwide. The salons also sell tea-infused food such as salads, quiches, soups, pastries, and desserts. There are locations in Singapore, [Malaysia](/wiki/Malaysia), the United Kingdom, the [United Arab Emirates](/wiki/United_Arab_Emirates), [Thailand](/wiki/Thailand), [Taiwan](/wiki/Taiwan), Canada, [South Korea](/wiki/South_Korea), [China](/wiki/China), and other nations. In Hong Kong, the brand is known as \"Tea WG\". - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:04:53.690269",
  "title": "TWG Tea",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/TWG_Tea"
}