{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:11:21.169387"
  },
  "content": "2003 Singaporean film ***Twilight Kitchen*** ([Chinese](/wiki/Chinese_language): 聚味楼), is a 2003 Singaporean \"community\" film directed by Gerald Lee. The film was initially only meant to encourage companies to employ ex-prisoners. It was the first \"community film\" in Singapore. It was also the first time a film directed by Lee was screened in local theatres. ## Plot Mai Zhi Hao, an ex-offender, seeks a second chance at life, and is offered work at the 'Twilight Kitchen' restaurant, having learnt to cook in prison. ## Cast - [Moses Lim](/wiki/Moses_Lim) - Tang Miaoling - [Zhang Xinxiang](/wiki/Zhang_Xinxiang) - Chen Jian Hu - Zhou Shi Min - Hong Peixing - [Zhu Houren](/wiki/Zhu_Houren) ## Release The film was originally meant to be released straight-to-[VCD](/wiki/VCD) in 2003. However, after receiving praise, the film was instead given a theatrical release from 17 July to 30 July in two theatres, and premiered on 12 July in the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens), with the guest of honour being [Tan Choo Leng](/wiki/Tan_Choo_Leng), the wife of then Prime Minister of Singapore [Goh Chok Tong](/wiki/Goh_Chok_Tong). ## Reception Lee Yiyun of *[Lianhe Zaobao](/wiki/Lianhe_Zaobao)* rated the film C+ for entertainment and C for art, while Hong Minghua of *Lianhe Zaobao* rated the film C+ for entertainment and C− for art. Chen Yunhong of *[Shin Min Daily News](/wiki/Shin_Min_Daily_News)* gave the film three stars out of five. Hong Ai Li of *[The Straits Times](/wiki/The_Straits_Times)* praised the performances of Zhang and Lim, while criticising the conclusion for being predictable. This article related to a Singaporean film is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:11:21.169078",
  "title": "Twilight Kitchen",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Twilight_Kitchen"
}