{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:11:22.526501"
  },
  "content": "Historical landmark estate in SingaporePart of a series on the[History of Singapore](/wiki/History_of_Singapore)[Early history](/wiki/Early_history_of_Singapore) (pre-1819)[Srivijaya](/wiki/Srivijaya)650–1377[Temasek](/wiki/Temasek), [Long Ya Men](/wiki/Long_Ya_Men), [Ban Zu](/wiki/Ban_Zu)c.14th century[Kingdom of Singapura](/wiki/Kingdom_of_Singapura)1299–1398[Majapahit](/wiki/Majapahit)1398–1400[Malacca Sultanate](/wiki/Malacca_Sultanate)1400–1528[Johor Sultanate](/wiki/Johor_Sultanate)1528–1819British colonial era (1819–1942)[Founding](/wiki/Founding_years_of_modern_Singapore)1819–1826[Straits Settlements](/wiki/Singapore_in_the_Straits_Settlements)1826–1867[Crown colony](/wiki/Singapore_in_the_Straits_Settlements#Crown_colony_(1867–1942))1867–1942[Japanese Occupation](/wiki/Japanese_occupation_of_Singapore) (1942–1945)[Fall of Singapore](/wiki/Fall_of_Singapore)1942[Sook Ching](/wiki/Sook_Ching)1942[Double Tenth incident](/wiki/Double_Tenth_incident)1943[Post-war period](/wiki/Colony_of_Singapore) (1945–1962)[First Legislative Council](/wiki/History_of_Singapore#First_Legislative_Council_(1948–1951))1948–1951[Maria Hertogh riots](/wiki/Maria_Hertogh_riots)1950[Second Legislative Council](/wiki/History_of_Singapore#Second_Legislative_Council_(1951–1955))1951–1955[Anti-National Service Riots](/wiki/1954_National_Service_riots)1954[Internal self-government](/wiki/Self-governance_of_Singapore) (1955–1963)[Hock Lee bus riots](/wiki/Hock_Lee_bus_riots)1955[Singapore Glass Factory strikes](/wiki/Singapore_Glass_Factory_strikes)1960[Pulau Senang prison riots](/wiki/Pulau_Senang_prison_riots)1963[Merger with Malaysia](/wiki/History_of_the_State_of_Singapore_(Malaysia)) (1963–1965)[Singaporean referendum](/wiki/1962_Singaporean_integration_referendum)1962[Operation Coldstore](/wiki/Operation_Coldstore)1963[Race riots in Singapore](/wiki/1964_race_riots_in_Singapore)1964[MacDonald House bombing](/wiki/MacDonald_House_bombing)1965[Republic of Singapore](/wiki/History_of_the_Republic_of_Singapore) (1965–present)[ASEAN Declaration](/wiki/ASEAN_Declaration) ([ASEAN](/wiki/Association_of_Southeast_Asian_Nations))1967[1969 race riots of Singapore](/wiki/1969_race_riots_of_Singapore)1969[Laju incident](/wiki/Laju_incident)1974[Operation Spectrum](/wiki/Operation_Spectrum)1987[Asian financial crisis](/wiki/1997_Asian_financial_crisis#Singapore)1997[Embassies attack plot](/wiki/Singapore_embassies_attack_plot)2001[H1N1 pandemic](/wiki/2009_swine_flu_pandemic_in_Asia#Singapore)2009–2010[Bus drivers' strike](/wiki/2012_Singapore_bus_drivers%27_strike)2012[Little India riot](/wiki/2013_Little_India_riot)2013[2018 North Korea–United States Singapore Summit](/wiki/2018_North_Korea%E2%80%93United_States_Singapore_Summit)2018[COVID-19 pandemic](/wiki/COVID-19_pandemic_in_Singapore)2020–2022By topic - [Timeline](/wiki/Timeline_of_Singaporean_history) - [Riots](/wiki/List_of_riots_in_Singapore) - [Military](/wiki/Military_history_of_Singapore) Singapore portal - v - t - e **Tyersall Park** is an [estate](/wiki/Estate_(land)) in Singapore, bound by Holland Road and Tyersall Avenue, and near the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens). Previously a private land belonging to the [Sultan of Johor](/wiki/Sultan_of_Johor) from 1862, some portions of it had been acquired by the Government of Singapore in 1990 and in 2009 respectively. The property is generally restricted from the public (excluding the parts that have been acquired) and is fenced along Tyersall Avenue. The [ring road](/wiki/Ring_road) known as Catterick Circle used to run through the estate, and was still shown on maps even after the late Sultan of Johor's former palaces were no longer charted on any modern maps of Singapore. Catterick Circle was officially removed from updated maps of Singapore in the 1990s. ## History ### Early colonial years About three to four decades after Singapore was established as a [Straits Settlement](/wiki/Straits_Settlements) trading port in 1819, the adjoined estates consisted of **Woodneuk** and **Tyersall** at [Tanglin](/wiki/Tanglin) and were first owned by the English trader Captain John Dill Ross, and the lawyer [William \"Royal Billy\" Napier](/wiki/William_Napier_(lawyer)) respectively, as their private residences. The first mention of Tyersall in a Singapore newspaper was on 5 November 1860, when the wife of William Paterson, the merchant of Paterson, Simons & Co., gave birth to their son in [Tyersall House](/wiki/Tyersall_House) as reported by the *[Singapore Free Press](/wiki/Singapore_Free_Press)*. The estates would later be bought by [Abu Bakar](/wiki/Abu_Bakar_of_Johor) in the late 1850s. He would later move his residence there from [Teluk Belanga](/wiki/Teluk_Belanga) upon his reign as the [Temenggong of Johor](/wiki/Temenggong_of_Johor) of the death of his father [Temenggong Daeng Ibrahim](/wiki/Temenggong_Daeng_Ibrahim) in 1862. He made [Woodneuk House](/wiki/Woodneuk_House) his official residence named \"Istana\". On 19 November 1881, the [Maharaja](/wiki/Maharaja) of Johor, Abu Bakar, held the first [drag hunt](/wiki/Drag_hunt) in Singapore with his hounds around the Tanglin area, including Woodneuk and Tyersall. It was revealed later on 21 May 1883, that the first telephone line in Singapore had been in operation between Tyersall House and Woodneuk House (or Istana Woodneuk), before the opening of telephonic communication between Singapore and Johor by the [Oriental Telephone Company](/wiki/Oriental_Telephone_Company) the following month. On 7 September 1887, the Tyersall Drag Hunt Club was established there by the Committee. In 1890, Sultan Abu Bakar had Napier's former house demolished to build his palace on its former ground. The [Istana Tyersall](/wiki/Istana_Tyersall), or Tyersall Palace, was completed and had a grand opening by the 13th [Governor of the Straits Settlements](/wiki/Governor_of_the_Straits_Settlements) Sir [Cecil Clementi Smith](/wiki/Cecil_Clementi_Smith) on 3 December 1892. The Sultan held receptions for several historic events and parties. The palace was known to be first building in Singapore to be supplied with electricity. On 10 December 1892 at the palace, the Sultan received the First Class of the First Grade of the [Order of the Double Dragon](/wiki/Order_of_the_Double_Dragon) by the [Guangxu Emperor](/wiki/Guangxu_Emperor), as conveyed by the Consul General in Singapore of his care, sympathy and kindness for permitting the Chinese to settle in Johor. The presentation event was witnessed by a gathering of Chinese towkays (businessmen). On 6 April 1893, the Sultan held his reception to the [Archduke Franz Ferdinand of Austria](/wiki/Archduke_Franz_Ferdinand_of_Austria) and his party who arrived at his residence in the evening at 5.30 pm. The Archduke and Prince Franz Ferdinand, and his party was shown various rooms and items of the palace, before proceeding on the Sultan's carriages towards the direction of [Tanjong Pagar](/wiki/Tanjong_Pagar). In his will made on 14 April 1895, Woodneuk was bequeathed to his fourth wife, Sultana Khadijah, and the rest of his premises were made state property of the [State of Johor](/wiki/State_of_Johor). The Sultan held his last reception at the palace on 15 April 1895, before he left Singapore on the [mail steamer](/wiki/Mail_steamer) *Pekin* for Europe on 23 April 1895. Upon his death from pneumonia in [South Kensington](/wiki/South_Kensington), London, on 4 June 1895, the Tyersall and its premises were soon handed over to his son upon his reign as the Sultan [Ibrahim of Johor](/wiki/Ibrahim_of_Johor) in November 1895. The new Sultan however, would preferred to stay at the Woodneuk House. On 3 August 1896, Ungku Maimunah, the 1st Sultana to Sultan Ibrahim of Johor, invited [King of Siam](/wiki/King_of_Siam) [Rama V](/wiki/Rama_V) and his Queen [Savang Vadhana](/wiki/Savang_Vadhana) to the palace, where they met the Sultan's family with a cordial reception. On 29 May 1897, the Sultan gave a huge Race Week Tiffin in front of about a hundred of guests at Tyersall. On 24 April 1899, the Sultan Ibrahim set up a training ground for [polo](/wiki/Polo) players from the [Singapore Polo Club](/wiki/Singapore_Polo_Club) to use when the [Serangoon Road Race Course](/wiki/Serangoon_Road_Race_Course) (part of the present day [Farrer Park](/wiki/Farrer_Park)) was not available for their training. The training ground later became known as the Tyersall Polo Ground. On 30 September 1899, the Singapore Polo Club hosted the first Horse and Dog Show there. On 17 February 1900, the Sultan held the Farewell [Gymkhara](/wiki/Gymkhana_(equestrian)) with 4th [King's Own Regiment](/wiki/King%27s_Own_Royal_Regiment_(Lancaster)) at the Tyersall Polo Ground, Following the gymkhana, he held the farewell luncheon party at the palace on 21 February, with over 60 guests which included officers of the King's Own Regiment, the [16th Madras Native Infantry](/wiki/76th_Punjabis) and the rest of the Garrison, and also the representatives of the official, commercial and sports. The Singapore Polo Club held a second Horse and Dog Show on 14 July 1900. Sultan Ibrahim later took over Woodneuk following the death of Sultana Khadijah on 1 February 1904. On 11 September 1905, a fire broke out at Istana Tyersall at midnight and was put out by 6:00 a.m. the following day. The palace's ballroom and billiard room were destroyed as well as several pieces of furniture and art collections within the rooms which were badly burned. The palace was abandoned following the fire. The Sultan gave his permission to the Singapore Hunt Club to use the Tyersall Polo Ground to hold [gymkhana](/wiki/Gymkhana_(equestrian)) on 10 February 1907. Later, he gave his permission to the Singapore Automotive Club to hold the first [motor gymkhana](/wiki/Gymkhana_(motorsport)) which involved thirty cars on 18 October 1907. On 30 November 1910, a meeting was held at the Straits Chinese Recreation Club's pavilion clubhouse in [Hong Lim Green](/wiki/Hong_Lim_Green), Singapore, and it was announced that the Sultan was willing to lease the premises and the grounds for 21 years at a rent of [S$](/wiki/Straits_dollar)150 per month for the first seven years, S$250 per month for the following seven years, and S$350 per month for the final seven years. This was approved by the committee and members of the Straits Chinese Recreation Club. On 7 December 1910, the Tyersall Country Club was formed at a meeting attended by the members of the various Singapore clubs chaired by the 16th Governor of the Straits Settlements, Sir [John Anderson](/wiki/John_Anderson_(colonial_administrator)) at the abandoned Istana Tyersall house. The Club's proposed plans to become the lessees of Tyersall Palace (Istana Tyersall). It had to determine the issue of debentures and other matters, which included the dividing of its halls and apartments, the rebuilding of its ballroom and the erection of the new buildings nearby. However, later in the early 1912, this scheme was reported to have fallen through during a meeting at the [Tanglin Club](/wiki/Tanglin_Club). The last use of Tyersall Polo Ground by the Singapore Polo Club as a training ground was on 9 January 1915. In 1924, the road known as Garden Road which divided between Tyersall and [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens) was renamed to Tyersall Avenue. In 1932, a new palace [Istana Woodneuk](/wiki/Istana_Woodneuk), or Istana Wooden York to the State of Johor, was rebuilt on its former site on another hill not far away and completed in September 1935 as a replacement residence for the Sultan Ibrahim and his new wife [Sultanah Helen](/wiki/Sultanah_Helen). The dilapidated Istana Tyersall was reportedly demolished under the tender issued by the Sultan in 1935. ### World War II In 1939, the Sultan Ibrahim, based at Johor at the time, had allowed part of Tyersall, which was the once the sites of the former Istana Tyersall and former Tyersall Polo Ground, and including their surrounding grounds, to be used by the [Indian Army](/wiki/British_Indian_Army) to be stationed and converted as a military camp area. It included many vehicles in a mechanisation effort in preparation for [World War II](/wiki/World_War_II). Meanwhile, on 8 August 1939, the Second Battalion of [Argyll and Sutherland Highlanders](/wiki/Argyll_and_Sutherland_Highlanders) under Lieutenant Colonel [Ian MacAlister Stewart](/wiki/Ian_MacAlister_Stewart) arrived in Singapore from India and first settled temporarily at the [Gillman Barracks](/wiki/Gillman_Barracks). The [12th Indian Infantry Brigade](/wiki/12th_Indian_Infantry_Brigade) headquarters, and the Indian Military Hospital, which consisted of a cluster of thatched huts was completed by the contractor A. G. Dobb and Co. for the [4/19th Hyderabad Regiment](/wiki/19th_Hyderabad_Regiment) and [5/2nd Punjab Regiment](/wiki/2nd_Punjab_Regiment) at Tyersall Park. Following which, the Second Battalion of Argyll and Sutherland Highlanders later moved to Tyersall Park in December 1939 as part of 12th Indian Infantry Brigade under [Brigadier](/wiki/Brigadier) [Archibald Charles Melvill Paris](/wiki/Archibald_Charles_Melvill_Paris). The estate, or grounds, was referred to as **Tyersall Park**, **Tyersall Camp**, or **Tyersall Park Camp** in the news and by the military stationed there. On 7 August 1941, the [Maharaja of Patiala](/wiki/Maharaja_of_Patiala) [Yadavindra Singh](/wiki/Yadavindra_Singh), during his two-day visit in Singapore to inspect its defenses, visited the Indian Military Hospital at Tyersall Park on a Thursday afternoon. On 29 January 1942, the 210 [Royal Marines](/wiki/Royal_Marines), who were the survivors of the sunken [HMS *Prince of Wales*](/wiki/HMS_Prince_of_Wales_(53)) and [HMS *Repulse*](/wiki/HMS_Repulse_(1916)) after the [Naval Battle of Malaya](/wiki/Naval_Battle_of_Malaya), moved to Tyersall Park to join the 250 Argylls. Later on 3 February 1942, they were amalgamated into a composite battalion known as the **Plymouth Argylls** (in reference to the Argylls affiliation with the [Plymouth Argyle Football Club](/wiki/Plymouth_Argyle_Football_Club) and that all the Marines were from the Plymouth Division). ### Japanese invasion of Singapore On 9 February 1942, during the [Battle of Singapore](/wiki/Battle_of_Singapore), the Plymouth Argylls left late in the morning and moved towards the [Tengah airfield](/wiki/Tengah_Air_Base). The Istana Woodneuk, under the name of \"Tyersall Palace\", served temporarily as the [2/30th Battalion](/wiki/2/30th_Battalion_(Australia)) [AIF](/wiki/Second_Australian_Imperial_Force) headquarters under Major General [Gordon Bennett](/wiki/Gordon_Bennett_(general)). On 11 February 1942, the 2nd Battalion of the [Gordon Highlanders](/wiki/Gordon_Highlanders) moved to Tyersall Park from the bombed Birdwood Camp at [Changi](/wiki/Changi), and departed for [Bukit Timah](/wiki/Bukit_Timah) to [fight](/wiki/Battle_of_Bukit_Timah) the invading [Imperial Japanese Army](/wiki/Imperial_Japanese_Army). After the blast from a Japanese mortar attack which indicated that the nearby junction of Holland Road and Ulu Pandan Road was held by the Imperial Japanese Army, Major General Bennett withdrew his headquarters from Woodneuk to Tanglin Barracks. The Indian Military Hospital, despite having Red Crosses painted on its roof, was destroyed by a fire caused by incendiary bombs deliberately dropped by Japanese fighter planes. Later on the following day in the afternoon of 12 February 1942, the surviving Plymouth Argylls arrived back at Tyersall Park, only to find themselves involved in a major rescue operation there. It was later estimated that about 700 medics and patients had reportedly burned to death in the area. ### Japanese occupation of Singapore Following the [Japanese Occupation of Singapore](/wiki/Japanese_Occupation_of_Singapore), on 17 February 1942, Piper Charles Stuart was ordered by the Japanese to march the surviving Plymouth Argylls out of Tyersall Park to Changi. Tyersall Park would later serve as one of seven [POW camps](/wiki/POW_camp) for interned Indian Army personnel in Singapore under Lieutenant Colonel [Gurbaksh Singh](/wiki/Harbaksh_Singh#Prisoner_of_war) of [Jind State](/wiki/Jind_State) Forces. It was under the supervision of the [Imperial Japanese Army](/wiki/Imperial_Japanese_Army) until 1945. ### Post-war era After Singapore was liberated in 1945, the [Supreme Allied Command South East Asia](/wiki/Supreme_Allied_Command_South_East_Asia) (SACSEA) headquarters was set up at the Tyersall Park. 58 members of the [Women's Voluntary Service](/wiki/Women%27s_Voluntary_Service) were also stationed there. The Istana Woodneuk was briefly occupied by General Sir [Miles Dempsey](/wiki/Miles_Dempsey) and later by Commander-in-Chief Sir [Montagu Stopford](/wiki/Montagu_Stopford) in 1946 until SACSEA was disbanded in November. On 16 January 1947, the palace was occupied by the [Governor-General](/wiki/Governor-General) of [Malaya](/wiki/Federation_of_Malaya) [Malcolm MacDonald](/wiki/Malcolm_MacDonald) and his wife. By 1948, the palace was returned to the Sultan for his official residence in Singapore. In 1954, the Tyersall Park was leased out for military use and in 1959, the estate was returned to the Sultan of Johor. On 17 April 1959, the Johor State Council approved [$](/wiki/Malaya_and_British_Borneo_dollar)5,000 for the maintenance and upkeep of Tyersall Park. ### Recent developments In December 1990, the [Government of Singapore](/wiki/Government_of_Singapore) had acquired part of the former Tyersall Park from the [State of Johor](/wiki/State_of_Johor). On 1 June 2004, the sum of S$25 million was awarded as compensation for the compulsory acquisition of Tyersall. On 9 June 2004, the Collector obtained a court order to pay said compensation into court due to a dispute with the State of Johor over the title to receive the compensation. In 2006 a fire severely damaged Istana Woodneuk, after which it was not repaired. In 2009, the Government of Singapore had acquired a 9.8 ha part of the 24.4 ha of the former Tyersall Park estate from the State of Johor as part for the \"Tyersall\" extension of the [Singapore Botanic Gardens](/wiki/Singapore_Botanic_Gardens). This involved the repositioning of the existing Tyersall Avenue, the demolition of the two historic gate posts along Tyersall Avenue which once lead to the former Tyersall Park and Istana Woodneuk, the restructuring of visitor access to the [National Orchid Garden](/wiki/National_Orchid_Garden) and Ginger Garden, the creation of fresh water swamp forest and the extension of the National Orchid Garden nursery. On 31 March 2017, the Singapore Botanic Gardens' new extension was officially opened by [Lee Hsien Loong](/wiki/Lee_Hsien_Loong), the 3rd [Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore), as the Learning Forest. As of 2019, [Tunku Ismail Idris](/wiki/Tunku_Ismail_Idris), the Tunku Mahkota of Johor, is the current registered landowner of this estate, which was since zoned for \"special use of green space\", meaning that no developments of residential and commercial nature will be improvised on the site. According to Alan Cheong, a senior director at Savills Singapore Pte Ltd, if this estate was put up on sale, it could fetch at least S$4.7 billion. On 26 September 2021, it was reported that the representatives for the Tunku Mahkota of Johor were in discussions with the Singapore authorities since last year for permission to develop a cluster of high-end homes on the estate itself, but the final decision has yet to be reached. In June 2025, the Government of Singapore and the Tunku Mahkota of Johor reached a land-swap agreement. The 13-hectare palace estate and its surrounding grounds were transferred to Singapore as part of Plot C, that contained the dilapidated Istana Woodneuk, while Singapore ceded a parcel of state land, known as Plot A. Plot A is situated west of Plot B, the central plot that contained where the former Istana Tyersall stood before it was demolished in 1935. This followed proposed plans to develop the site, with the Singaporean government acting to protect the land near the Singapore Botanic Gardens. The land of Plot A is smaller than Plot C, however as it is further from the Botnaic Gardens there are less restrictions on its development. In September 2025 it was reported that Tunku Mahkota was seeking to sell some or all of the land. ## In popular culture Tyersall Park was first mentioned in the first novel of [Kevin Kwan](/wiki/Kevin_Kwan)'s the *Crazy Rich* trilogy, *[Crazy Rich Asians](/wiki/Crazy_Rich_Asians)* (2013), being re-imagined as a 64-acre (26 ha) estate belonging to Shang Su Yi, Nick Young's grandmother. The estate would later become a major plot point in Kwan's third and final novel in the trilogy, *[Rich People Problems](/wiki/Rich_People_Problems)* (2017). In the production of the 2018 film *[Crazy Rich Asians](/wiki/Crazy_Rich_Asians_(film))* based on the novel of the same name, [Carcosa Seri Negara](/wiki/Carcosa_Seri_Negara), the former luxury hotel which consisted of the two abandoned colonial mansions at [Perdana Botanical Gardens](/wiki/Perdana_Botanical_Gardens), Kuala Lumpur, [Malaysia](/wiki/Malaysia), were used to depict the interior and exterior of the restricted Tyersall Park mansion. A lake was later digitally added to the estate grounds in post-production. - Singapore portal - [Istana Tyersall](/wiki/Istana_Tyersall) - [Istana Woodneuk](/wiki/Istana_Woodneuk) - [Abu Bakar of Johor](/wiki/Abu_Bakar_of_Johor) - [Ibrahim of Johor](/wiki/Ibrahim_of_Johor)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:11:22.526215",
  "title": "Tyersall Park",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tyersall_Park"
}