{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:11:24.637497"
  },
  "content": "Singlish term for economic food stalls ***Tze char***,[a] also romanised ***Zi char***, is a [Singaporean](/wiki/Singapore) [Singlish](/wiki/Singlish) colloquialism deriving from the local [Hokkien](/wiki/Singaporean_Hokkien) dialect to describe an economical food stall which provides a wide selection of common and affordable dishes which approximate home-cooked meals. Most tze char stalls are commonly found throughout the country's [hawker centres](/wiki/Hawker_centre) and [kopitiams](/wiki/Kopi_tiam) located in the heartlands of Singapore,[b] selling dishes of [Singaporean cuisine](/wiki/Singaporean_cuisine). Hence, most of them are usually found in a casual, non air-conditioned setting. Nonetheless, a handful of tze char stalls do have their own air-conditioned dining area as well, and in those without them, [ceiling fans](/wiki/Ceiling_fan) are often present as a government policy. ## Meaning and use Stalls that have been characterised as tze char stalls tend to be those with \"wallet-friendly prices\", coupled with a big serving portion that makes it a favourite choice for gatherings or meet-ups between family and friends among the [Singaporean](/wiki/Singaporeans) population. As one of the many aspects of [Singaporean culture](/wiki/Culture_of_Singapore), not only is the price point a source of popularity, the offerings of home-cooked style food makes it a popular choice among Singaporeans too. Tze char stalls also serve at a great convenience for many workers to get a relatively cheap and well-balanced meal especially during [lunch breaks](/wiki/Break_(work)) or for [dinner](/wiki/Dinner). Tze char stalls tend to have a wide selection of food available, but are mainly focused on the local cuisine of Singapore. It is common to find variations of rice, noodle, vegetables, meat and seafood being offered. Through the years, there has also been an increase in the number of tze char chefs coming up with their own creative spin on specialty dishes. - [Yam ring](/wiki/Yam_ring), a Singaporean dish that originated from a tze char restaurant ## Notes and references ### Notes ### Works cited - Lai, Ah Eng (January 2010), *The Kopitiam in Singapore: An Evolving Story about Migration and Cultural Diversity*, Asia Research Institute Working Paper Series, retrieved 8 January 2017 - Friends, Goz Lee and (January 2014). *Plusixfive: A Singaporean Supper Club Cookbook*. [Epigram Books](/wiki/Epigram_Books). [ISBN](/wiki/ISBN_(identifier)) 9789810759070. Retrieved 7 November 2021. Portals: - Food - Drink - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T12:11:24.637191",
  "title": "Tze char",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Tze_char"
}