{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:11:47.659185"
  },
  "content": "* *Ultimate Magic** is [Singapore](/wiki/Singapore)’s first permanent illusion show at The Arena @ [Clarke Quay](/wiki/Clarke_Quay). The show was Singapore’s only magic attraction and it was officially endorsed as a live attraction by the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board). ## Background Produced and managed by Concept: Magic, Singapore’s only full service magic production house, the show opened in September 2008 and started its third season, ***Ultimate Magic: The Revolution*** on 2 May 2009 and ended in August 2009. ## Synopsis Ultimate Magic starred Singapore professional magic duo, [J C Sum](/wiki/J_C_Sum) & ['Magic Babe' Ning](/wiki/Magic_Babe_Ning). The show is a partnership between the co-stars, Sum and Ning. The show is described as “Urban Illusions in the City” and is a magical personification of the characteristics of Singapore city. ## Stars Sum and Ning's partnership as a professional magic duo has been acknowledged as “very groundbreaking and refreshing” and they were said to represent “the new faces of an age-old art form”. They are best known for a teleportation feat across [Singapore River](/wiki/Singapore_River) where three volunteers were teleported across Singapore River in just 2.5 seconds. ## Illusions in the show Original illusions in the show (all seasons) include: - J C's cross country teleportation - Crystal Metamorphosis – J C & Ning's instant double teleportation - Revollusion – An illusion with an 8-ft industrial fan - Dreamscape: The Realm of Sandman - Extreme Burn – An escape from a flaming spear - Ultimate Magic Related videos - Singapore's first permanent illusion show \"Ultimate Magic\" video trailer - Singapore Magic tourist attraction and first daily illusion show \"Ultimate Magic: The Revolution\" - “Ultimate Magic” - AsiaOne Video - Revollusion fan illusion by 'Magic Babe' Ning and J C Sum, Asia's most lethal combination in magic - Youtube Video - 'Magic Babe' Ning and J C Sum Crystal Metamorphosis - see-through substitution trunk illusion - Youtube video\n",
  "language": "en",
  "processed_at": "2026-01-12T12:11:47.658887",
  "title": "Ultimate Magic",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ultimate_Magic"
}