{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:11:49.485565"
  },
  "content": "During the 1960s in Malaysia and Singapore, some racial extremists were referred to as \"**ultras**\". The phrase was most commonly used by the first [Prime Minister](/wiki/Prime_Minister_of_Singapore) of Singapore, [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), and other leaders of his political party, the [People's Action Party](/wiki/People%27s_Action_Party) (PAP), to refer to Malay extremists. However, it was also used by some members of the [United Malays National Organisation](/wiki/United_Malays_National_Organisation) (UMNO) — the leader of the [Alliance](/wiki/Barisan_Nasional) coalition governing Malaysia – to refer to Lee instead, as Lee was perceived to be a Chinese chauvinist himself. ## History Lee was the first to use the phrase \"ultras\" in 1964, when he publicly demanded that UMNO's leadership \"Smack down their ultras.\" This was barely a year after Singapore had merged with [Malaya](/wiki/Federation_of_Malaya), [Sabah](/wiki/Sabah), and [Sarawak](/wiki/Sarawak) to form a united [Malaysia](/wiki/Malaysia), and this profoundly troubled the UMNO leadership. It is not clear where Lee got the idea of labelling Malay chauvinists as \"ultras\", but it is possible that he may have obtained it from a student's PhD thesis. In 1960, Lee served on a three-man panel that evaluated Gordon Paul Means' PhD thesis, entitled \"Malayan Government and Politics in Transition\". On one page of his copy of the manuscript, Lee had reportedly underlined in thick [pencil](/wiki/Pencil) the word \"ultra\" and placed an [exclamation mark](/wiki/Exclamation_mark) over it. ## Chauvinists Some of the perceived Malay \"ultras\" were [Syed Jaafar Albar](/wiki/Syed_Jaafar_Albar), once the UMNO Secretary-General, [Syed Nasir Ismail](/wiki/Syed_Nasir_Ismail), a strong advocate of expanding the scope of the [Malay language](/wiki/Malay_language) in Malaysian society, [Mahathir Mohamad](/wiki/Mahathir_Mohamad), then a UMNO [Member of Parliament](/wiki/Parliament_of_Malaysia) and future [Prime Minister of Malaysia](/wiki/Prime_Minister_of_Malaysia), and [Musa Hitam](/wiki/Musa_Hitam), another UMNO MP who would later serve as deputy prime minister. What these men had in common was their perceived support of *[ketuanan Melayu](/wiki/Ketuanan_Melayu)*, or Malay supremacy (although these exact phrases were then not in vogue). Syed Jaafar Albar had campaigned strongly for the Singaporean branch of UMNO in the [1963 Singaporean general election](/wiki/1963_Singaporean_general_election), and made heated statements condemning Malay PAP politicians as un-Islamic, anti-Malays, and traitors to their community. [Othman Wok](/wiki/Othman_Wok), a senior Malay PAP politician, later insinuated Syed Jaafar's rhetoric had set the stage for the [1964 Race riots in Singapore](/wiki/1964_race_riots_in_Singapore). Syed Nasir Ismail had insisted on closing down all Chinese schools in Malaysia as soon as possible, making Malay the sole official language. Mahathir was a strong proponent of strengthened [affirmative action](/wiki/Affirmative_action) for the Malays, and reportedly demanded (together with Syed Nasir Ismail and Syed Jaafar Albar) a one-party Malay-only government led by UMNO in the wake of the [13 May racial riots](/wiki/May_13_Incident) in Kuala Lumpur, the Malaysian capital. He would later author *[The Malay Dilemma](/wiki/The_Malay_Dilemma)*, which contended that the Malays as the \"definitive people\" of Malaysia had a birthright guaranteeing them special privileges such as those outlined by [Article 153](/wiki/Article_153_of_the_Constitution_of_Malaysia) of the [Constitution of Malaysia](/wiki/Constitution_of_Malaysia). Musa, who was closely associated with Mahathir, thus became also associated with Mahathir's \"ultra\" approach to politics. Both would later be expelled from UMNO by then Prime Minister and UMNO President [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman) after Mahathir's reaction to the 13 May riots. Then Home Minister [Ismail Abdul Rahman](/wiki/Ismail_Abdul_Rahman) would issue an explanation of the decision where he stated: \"These ultras believe in the wild and fantastic theory of absolute dominion by one race over the other communities, regardless of the Constitution.\" Musa and Mahathir would later be rehabilitated by the Tunku's successor, [Tun Abdul Razak](/wiki/Tun_Abdul_Razak). In some cases, Lee also would refer to media outlets as \"ultras\"; he once criticised the *[Utusan Melayu](/wiki/Utusan_Melayu)* as \"their [the ultras'] newspaper\". Lee himself would later be considered an \"ultra\" by the Alliance government for some of the statements he made; on 24 May 1965, Lee publicly stated: \"Let us be quite frank. Why should we go back to old Singapore and once again reduce the non-Malays in Malaya to a minority?\" His [Malaysian Malaysia](/wiki/Malaysian_Malaysia) campaign was not received well either by UMNO or most of the Malays, who tended to view a Malaysian Malaysia as a \"Chinese Malaysia\". It has been speculated that this was due to the limited vocabulary of Malay at the time; the only Malay word for \"nation\" then was \"bangsa\", which was also synonymous with race. Since there was (and is) no \"Malaysian race\", it has been argued that some Malays considered anything other than a \"Malay nation\" as threatening to their rights. The conflict between Lee and his Chinese-majority PAP with the Malaysian government culminated in the secession of Singapore from Malaysia in 1965. ## Reduction in usage in 1970s The usage of the phrase \"ultra\" declined greatly in the 1970s, not long after the 13 May riots of 1969. This may have been due to strong restrictions on making potentially incendiary declarations in public; even Parliament was banned from discussing the repeal of certain articles of the Constitution, such as Article 153, which touched on Malay rights. Due to this, the political atmosphere cooled down, which may have indirectly contributed to the decline in usage of \"ultra\" to describe racial chauvinists. ### Works cited - Sopiee, Mohamed Noordin (1976). *From Malayan Union to Singapore Separation: Political Unification in the Malaysia Region 1945-1965*. Penerbit Universiti Malaya. - Means, Gordon P. (1991). *Malaysian politics : the second generation*. Singapore: Oxford University Press. [ISBN](/wiki/ISBN_(identifier)) 0-19-588983-5. [OCLC](/wiki/OCLC_(identifier)) 22278996.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:11:49.485285",
  "title": "Ultra (Malaysia)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ultra_(Malaysia)"
}