{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:11:50.734334"
  },
  "content": "Bus depot in Singapore **Ulu Pandan Bus Depot** is the fourth [bus depot](/wiki/Bus_garage) (after [Seletar Bus Depot](/wiki/Seletar_Bus_Depot)) to be built by the [Land Transport Authority](/wiki/Land_Transport_Authority) in [Singapore](/wiki/Singapore). The depot is intended to accommodate additional buses that are being introduced over the years, as the overall bus capacity increases under the Bus Service Enhancement Programme (BSEP) and Bus Contracting Model (BCM). The depot is bordered by Sungei Pandan, Sungei Ulu Pandan and Boon Lay Way, with Business Park Drive bisecting the depot complex, with the open-air bus park to the west of the road and the main depot building to the east of the road. Phase 1 (West of Business Park Drive) is an open-air bus park to the west of Business Park Drive, is in operational which was completed in early 2017. SMRT Buses is temporarily using it to park buses overnight, as with the pre-handing over stages of the depot in line with other BCM bus depots, such as Bulim and Loyang bus depots. Phase 2 (East of Business Park Drive) is the main depot building, complete with offices and facilities for day-to-day bus operations, located to the east of Business Park Drive. The depot is scheduled to be completed by 1st Quarter 2018, and it will be equipped with facilities for daily bus operations, bus repair/ maintenance, bus parking, offices, rest areas for bus drivers and canteen, being able to accommodate about 500 buses. The depot was officially opened by [Minister for Transport](/wiki/Ministry_of_Transport_(Singapore)) [Khaw Boon Wan](/wiki/Khaw_Boon_Wan) on 27 October that year. ## History Contract RD300 for the design and construction of Ulu Pandan Depot was awarded to Tiong Seng Contractors Pte Ltd for roughly S$70 million. The bus depot spans 8.3 ha and was designed to accommodate about 500 buses. As it is located in close proximity to office developments in the area, the depot will likely be built with a noise barrier wall along its perimeter. Ulu Pandan Bus Depot also replaces the smaller Ayer Rajah Bus Park, and takes certain services from selected depots such as 120, 121, 122, 400 and 402 from Ang Mo Kio Bus Depot; and 160/170 from Bukit Batok Bus Depot. Operations commence from 29 July 2018 and the same operator, SBS Transit has allowed garaging of bus routes as per pre-BCM under Alternative Contract, and also compulsorily transferred APAD-registered buses and the general offices from Bukit Batok Bus Depot. This Singapore bus-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:11:50.734063",
  "title": "Ulu Pandan Bus Depot",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ulu_Pandan_Bus_Depot"
}