{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:12:02.733454"
  },
  "content": "Singaporean regional bank **United Overseas Bank Limited** ([Chinese](/wiki/Traditional_Chinese_characters): 大華銀行有限公司; [pinyin](/wiki/Pinyin): *Dàhuá Yínháng Yǒuxìan Gōngsī*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Tāi-hôa Gûn-hâng Iú-hān Kong-si*), often known as **UOB**, is a [Singaporean](/wiki/Singapore) regional [bank](/wiki/Bank) headquartered at [Raffles Place](/wiki/Raffles_Place), Singapore, with branches mostly found in [Southeast Asia](/wiki/Southeast_Asia) countries. It is one of the three \"big local banks\" in the country, the other two being [DBS Bank](/wiki/DBS_Bank) and [Oversea-Chinese Banking Corporation](/wiki/OCBC_Bank) (OCBC). First founded during the [Great Depression](/wiki/Great_Depression) in 1935 as **United Chinese Bank (UCB)** by a group of [Hoklo](/wiki/Hoklo_people) businessmen including [Sarawak](/wiki/Sarawak)-born [Wee Kheng Chiang](/wiki/Wee_Kheng_Chiang), the bank operated from a single branch bank in rented premises of Bonham Building, located in [Boat Quay](/wiki/Boat_Quay), close to the [Singapore River](/wiki/Singapore_River). It was principally engaged in short-term loans to a segment of local businessmen, to be precise, [Hokkien Chinese](/wiki/Singaporean_Hokkien) businessmen in Singapore. UOB is the [third largest bank in Southeast Asia](/wiki/List_of_largest_banks_in_Southeast_Asia) by total assets. The bank provides [personal financial](/wiki/Personal_financial_management) services, [commercial banking](/wiki/Commercial_bank), [private banking](/wiki/Private_banking) and [asset management](/wiki/Asset_management) services, as well as [corporate finance](/wiki/Corporate_finance), [venture capital](/wiki/Venture_capital) and [insurance](/wiki/Insurance) services. It has 68 branches in Singapore and a network of more than 500 offices in 19 countries and territories in [Asia Pacific](/wiki/Asia_Pacific), Western Europe and North America. ## History On 6 August 1935, Sarawak-born businessman Wee Kheng Chiang, together with six other partners, established the bank with a paid-up capital of [S$](/wiki/Singapore_dollar)1 million. The bank was originally incorporated as *United Chinese Bank (UCB)* and served the mainly [Hokkien](/wiki/Hokkien) [Chinese](/wiki/Chinese_Singaporeans) community in Singapore. Wee, being the largest shareholder, became its first chairman. In October 1935, UCB opened for business in the three-story Bonham Building. On 23 January 1965, UCB changed its name to United Overseas Bank (Chinese name unchanged) to avoid duplication with another *[United Chinese Bank](/wiki/Bank_of_East_Asia#Origins,_and_until_2008)* in [Hong Kong](/wiki/Hong_Kong) ([simplified Chinese](/wiki/Simplified_Chinese_characters): 中国联合银行; [traditional Chinese](/wiki/Traditional_Chinese_characters): 中國聯合銀行), and opened its first overseas branch in Hong Kong. In 1970, UOB was listed on the Joint Stock Exchange of Singapore and [Malaysia](/wiki/Malaysia). At the time, the stock exchange had an office in both Singapore and [Kuala Lumpur](/wiki/Kuala_Lumpur). After it was publicly listed, the bank went through a series of targeted acquisitions. The bank first acquired the controlling stake of [Chung Khiaw Bank](/wiki/Chung_Khiaw_Bank) in 1971, which expanded its domestic presence and also gave the bank offices in Malaysia and Hong Kong. A new logo for both United Overseas Bank and Chung Khiaw Bank was launched in January 1972. In 1973, UOB acquired Lee Wah Bank, which was originally founded in 1920 by [Eu Tong Sen](/wiki/Eu_Tong_Sen) with Cheong Yoke Choy as one of its co-founders and original directors, provided services in Malaysia and Singapore. In that same year, the bank built a new 30-storey office tower in place of the Bonham Building, which was named the UOB Building (now known as [UOB Plaza Two](/wiki/UOB_Plaza)). The company continued with acquisitions, with Far Eastern Bank in 1984, Westmont Bank (now known as UOB Philippines) and Radanasin Bank (now known as United Overseas Bank (Thai) Public Company Limited) in 1999. In September 2001, UOB acquired Overseas Union Bank, then Singapore's fourth largest local bank, in a deal worth [S$](/wiki/Singapore_dollar)10 billion. In 2002, UOB started expanding into the Chinese market by opening a new full-service branch office in [Shanghai](/wiki/Shanghai) and upgrading of its [Beijing](/wiki/Beijing) office to a full-service branch. On 16 January 2019, UOB was listed in the [Bloomberg](/wiki/Bloomberg_L.P.) Gender-Equality Index (GEI) for the first time in recognition of [gender equality](/wiki/Gender_equality). On 14 January 2022, UOB purchased [Citigroup](/wiki/Citigroup)'s consumer banking franchise in Indonesia, Malaysia, Thailand and Vietnam for about [S$](/wiki/Singapore_dollar)5 billion. ## Shareholders The ten largest shareholders as of 1 March 2017 are: Name of ShareholdersNo. of Shareholdings%*1.Citibank Nominees Singapore Pte Ltd300,184,67218.352.DBS Nominees (Private) Limited278,681,03317.043.DBSN Services Pte. Ltd.141,007,3248.624.United Overseas Bank Nominees (Private) Limited134,666,9108.235.Wee Investments Pte Ltd128,119,4457.836.Wah Hin & Co Pte Ltd83,858,6715.137.HSBC Singapore (Nominees) Pte Ltd82,830,1865.068.Tai Tak Estates Sendirian Berhad68,168,0004.179.[UOB Kay Hian Private Limited](/wiki/UOB-Kay_Hian)41,198,7172.5210C Y Wee & Co Pte Ltd36,319,2992.22 ** Percentage is calculated based on the total number of issued ordinary shares, excluding treasury shares.* ## International operations UOB has branches and offices located across Asia Pacific, North America and Western Europe, with most of their operations located in Southeast Asian countries such as [Brunei](/wiki/Brunei), [Malaysia](/wiki/Malaysia), [Indonesia](/wiki/Indonesia), [Myanmar](/wiki/Myanmar), [Philippines](/wiki/Philippines), [Thailand](/wiki/Thailand) and [Vietnam](/wiki/Vietnam). ### Australia Headquartered in the UOB Building in Sydney, UOB Australia opened its first branch in [MLC Centre](/wiki/MLC_Centre) as a merchant bank in 1986 to emphasize trade and financing between Australia and Asia. The bank now has offices in [Melbourne](/wiki/Melbourne) and [Brisbane](/wiki/Brisbane), in addition to the branch in Sydney and currently offers merchant bank services comprising current accounts, deposits, lending, asset finance, trade finance, structured finance, cash management, and cross-border payments. ### Brunei UOB's operations in Brunei started in 1974, under Overseas Union Bank (OUB). When UOB acquired the Overseas Union Bank in January 2002, the operations of the branches in Brunei was handed over to UOB. On 1 October 2005, the bank relocated its branch office in [Bandar Seri Begawan](/wiki/Bandar_Seri_Begawan). In 2015, UOB sold its retail banking business to Baiduri Bank Berhad for [S$](/wiki/Singapore_dollar)65.044 million. The bank currently provides a full range of commercial and corporate banking services through the branch located in the country. It also operates UOB Asset Management in Brunei, which offers investment management expertise to individuals, institutions and corporations. ### China Operations in mainland China first started in 1984, with a representative office in Beijing. Incorporated on 18 December 2007 as UOB (China) and headquartered in Shanghai, UOB has 17 branches and sub-branches strategically located in major cities such as [Shenyang](/wiki/Shenyang), Shanghai, [Beijing](/wiki/Beijing), [Shenzhen](/wiki/Shenzhen), [Tianjin](/wiki/Tianjin), [Xiamen](/wiki/Xiamen), [Hangzhou](/wiki/Hangzhou), [Chengdu](/wiki/Chengdu), [Guangzhou](/wiki/Guangzhou), [Suzhou](/wiki/Suzhou) and [Chongqing](/wiki/Chongqing) offering retail and wholesale banking services. ### Hong Kong UOB opened its first overseas branch in [British Hong Kong](/wiki/British_Hong_Kong) in 1965, with the branch mainly focusing on trade financing and corporate banking. The bank currently has 2 branches offering commercial and corporate banking services. ### India In December 2009, UOB opened its first branch in [Mumbai](/wiki/Mumbai), offering retail and wholesale banking services, including lending, treasury and trade finance products, to corporates, financial institutions and consumers. ### Indonesia UOB Indonesia was founded on 31 August 1956 as PT Bank Buana Indonesia. Headquartered in [Jakarta](/wiki/Jakarta), the bank offers commercial banking and treasury services, such as deposits taking, loans to small and medium enterprises, and foreign exchange transactions. The company also offers various fee-based services, such as purchase and sale of travellers cheques and banknotes. It has a network of 41 branches, 172 sub-branches and 173 ATMs located across 30 cities in Indonesia. ### Japan Founded in December 1972, UOB Japan offers wholesale services including corporate banking, debt securities investments, treasury, trade finance, current accounts and banknotes trading. UOB has 1 branch in Tokyo. Operations of OUB in Tokyo was also integrated in 2002 when UOB acquired the bank in 2002. ### Malaysia Incorporated in 1993, UOB Malaysia was integrated with Lee Wah Bank in 1994 to operate as a single entity. Lee Wah Bank was founded in 1920 in Singapore, with its first Malaysian branch opened in 1956. In 1973, Lee Wah Bank became a wholly owned subsidiary of UOB and was merged with UOB Malaysia in 1994. In 1997, UOB Malaysia merged with Chung Khiaw Bank (Malaysia) before merging with OUB Malaysia in 2002 to centralise its operations in Malaysia. The bank offers commercial and personal financial services: deposits, unit trusts, UOB Bancassurance, privilege banking, e-banking, commercial lending, investment banking, treasury services, trade services, home loans, debit and credit cards, wealth management, structured investment, general insurance and life insurance. ### Myanmar UOB opened its [Yangon](/wiki/Yangon) branch in Myanmar on 4 May 2015. ### Philippines In November 1999, UOB bought a 60% stake in a local bank, Westmont Bank and the bank was renamed UOB Philippines. In July 2002, UOB increased it stake to 100%, resulting in UOB Philippines becoming a wholly owned subsidiary of the banking group. In 2006, UOB Philippines's 66 bank branches were sold to [Banco De Oro Universal Bank](/wiki/Banco_de_Oro) and the bank ceased to be a commercial bank, with its license converted into a thrift bank license. In August 2015, [Bangko Sentral ng Pilipinas](/wiki/Bangko_Sentral_ng_Pilipinas), the central bank of the Philippines, approved the bank's application for a commercial bank license, and in the following year UOB Philippines opened its first commercial branch in [Manila](/wiki/Manila), being the 6th foreign bank in the Philippines to receive the license. ### South Korea In 1983, UOB opened its first representative office in [Seoul](/wiki/Seoul) and in 1998, the bank has a total of S$81 million assets in South Korea. The bank currently operates a branch in Seoul. ### Thailand UOB merged Radanasin Bank with Bank of Asia in 2005 with 154 branches across Thailand. ### Vietnam UOB is the first Singapore bank to set up representative office in Vietnam in 1992 at the Central Plaza Office Building on [Lê Duẩn Boulevard](/wiki/L%C3%AA_Du%E1%BA%A9n_Boulevard), [District 1, Ho Chi Minh City](/wiki/District_1,_Ho_Chi_Minh_City). On July 20, 2017, UOB obtained an in-principle foreign-owned subsidiary bank (FOSB) licence from the [State Bank of Vietnam](/wiki/State_Bank_of_Vietnam) to expand its branch network in Vietnam. In March 2023, UOB announced completion of the acquisition of Citigroup's consumer banking business, including the transfer of 575 Citigroup's employees in Vietnam. On April 8, 2025, UOB announced that they will increase its charter capital of its Vietnamese subsidiary to 10 trillion VND ($385 million), with the fresh capital injection of 2 trillion VND (about $77 million) into UOB Vietnam is currently under review by the State Bank of Vietnam. They will also build a new headquarters in Vietnam, the building is named UOB Vietnam Plaza, it is believed to be located at the [Ba Son Complex](/wiki/Ba_Son_Shipyard), next to the Marina Central Tower and [Ba Son station](/wiki/Ba_Son_station), also in District 1, not too far from the current headquarters. ### United States UOB is represented in the US by two agencies located in Los Angeles and New York. Both agencies provide services such as syndicated loan participations, corporate/commercial loans, asset swaps and deposits. ### Canada United Overseas Bank (Canada) was originally established in 1986 as a Schedule II wholly owned subsidiary of United Overseas Bank Limited, in Singapore. In 2002, United Overseas Bank (Canada) was converted to a Full Service Foreign Bank Branch (Schedule III), operating under the name United Overseas Bank Limited, in Vancouver, British Columbia.[*citation needed*] ## Subsidiaries and joint ventures All subsidiaries are headquartered in [UOB Plaza](/wiki/UOB_Plaza), Singapore Subsidiaries - Far Eastern Bank Limited - UOB Bullion and Futures Limited - UOBBF Clearing Limited - United Overseas Insurance Limited - UOB Asia Investment Partners Pte. Ltd. - UOB Asset Management Ltd - UOB-SM Asset Management Pte. Ltd. - UOB Venture Management Private Limited Joint ventures - United Orient Capital Pte. Ltd Associates - [UOB Kay Hian Private Limited](/wiki/UOB-Kay_Hian) ## Digital banking On 14 February 2019, UOB announced that it will launch TMRW (the first [mobile-only bank](/wiki/Neobank)) with Thailand the first country to get this service. More ASEAN countries will get this service in the coming months, in a push to cater to millennials who mainly use mobile phones for banking. UOB aims to attract three to five million users for this service in the next five years. The service launched in March that year. On 3 August 2020, UOB launched TMRW in Indonesia after alluding to it earlier on 21 February. Subsequently on 28 September 2021, UOB announced a $500 million boost in [digital banking](/wiki/Digital_banking) investments over the next five years to double its digital customers to seven million by 2026 and expand digital offerings in Singapore and ASEAN. This will include combining UOB Mighty app with the TMRW app to form the UOB TMRW app, which will be launched in Singapore by the fourth quarter of 2021. The app was first given to UOB employees as a pilot. In addition, digital banking services will be unified in countries like Malaysia and Vietnam. ## Controversies ### 1Malaysia Development Berhad scandal In May 2017, the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS) fined UOB a total of [S$](/wiki/Singapore_dollar)900,000 for several breaches of anti-[money laundering](/wiki/Money_laundering) rules and control lapses in [transactions](/wiki/Financial_transaction) related to [Malaysia](/wiki/Malaysia)’s scandal-ridden [sovereign wealth fund](/wiki/Sovereign_wealth_fund) [1Malaysia Development Berhad](/wiki/1Malaysia_Development_Berhad) (1MDB). These include weaknesses in conducting [due diligence](/wiki/Due_diligence) on customers and inadequate scrutiny of customers’ transactions and activities. ### RBI fine due to compliance lapses On 1 October 2019, UOB was fined [INR₹](/wiki/Indian_rupee)10 million by the [Reserve Bank of India](/wiki/Reserve_Bank_of_India) (RBI) for compliance failures based on deficiencies in [regulatory compliance](/wiki/Regulatory_compliance). ### Money laundering and business conduct compliance failures fine On 31 August 2022, the [stockbroking](/wiki/Stockbroker) arm of UOB – [UOB Kay Hian Private Limited](/wiki/UOB-Kay_Hian) which is an [associated company](/wiki/Associate_company) of UOB, was fined [S$](/wiki/Singapore_dollar)375,000 for failing to comply with business conduct requirements under the Securities and Futures (Licensing and Conduct of Business) Regulations, as well as anti-money laundering and [countering the financing of terrorism](/wiki/Terrorism_financing) requirements listed by the Monetary Authority of Singapore (MAS). ### S$3 billion money laundering case in 2023 On 4 July 2025, UOB and UOB Kay Hian (UOBKH) were each handed [S$](/wiki/Singapore_dollar)5.6 million and [S$](/wiki/Singapore_dollar)2.85 million respectively in penalties by the [Monetary Authority of Singapore](/wiki/Monetary_Authority_of_Singapore) (MAS) for flouting anti-money laundering controls related to the 2023 money laundering case involving more than S$3 billion in assets. The 10 criminals were reportedly part of the Fujian gang, an [organised crime](/wiki/Organised_crime) syndicate originally from [China](/wiki/China)’s [Fujian](/wiki/Fujian) province who washed more than S$3 billion in [illicit funds](/wiki/Illicit_financial_flows) and using multiple [passports](/wiki/Passports) to avoid detection. All have been jailed, deported after serving their sentences and barred from re-entering Singapore. UOB and UOBKH did not adequately establish and corroborate the source of wealth of customers who posed a higher risk of money laundering, even though there were significant discrepancies in the documents they had provided. UOB and UOBKH also did not adequately investigate suspicious transactions flagged by their own systems and fell short in following up on [suspicious transaction reports](/wiki/Suspicious_activity_report) filed against their customers. The institutions failed to take adequate and timely [risk mitigation](/wiki/Risk_appetite) measures, such as enhanced monitoring and reviewing the customers’ risk classification. In additional, UOBKH failed to implement adequate policies or processes for rating money laundering risks presented by some of their customers. This led to mis-rating of the risks and affected its ability to address higher money laundering risks presented by several persons of interest. - Companies portal - Business and economics portal - Banks portal - [UOB Plaza](/wiki/UOB_Plaza) - [List of banks in Singapore](/wiki/List_of_banks_in_Singapore)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:12:02.733199",
  "title": "United Overseas Bank",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/United_Overseas_Bank"
}