{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:12:05.942606"
  },
  "content": "Left-wing political organization in Singapore The **United People's Party** ([abbreviation](/wiki/Abbreviation): **UPP**) was a political party in Singapore founded by former [People's Action Party](/wiki/People%27s_Action_Party) (PAP) leader [Ong Eng Guan](/wiki/Ong_Eng_Guan). The party was officially registered on 14 July 1961. In the [1963 general election](/wiki/1963_Singaporean_general_election), the UPP fielded 46 candidates to contest 51 seats in the [Legislative Assembly](/wiki/Legislative_Assembly_of_Singapore). Despite the broad participation, the party secured only one seat, won by Ong himself in the [Hong Lim](/wiki/Hong_Lim_Constituency) seat, where he garnered 44.5 per cent of the vote, a significant decline compared to the over 70 per cent majority he had achieved in the [1959 election](/wiki/1959_Singaporean_general_election) under the PAP and the [1961 by-election](/wiki/1961_Singaporean_by-elections) as an independent. The future of the UPP became uncertain following [Singapore's separation from the Malaysia](/wiki/Independence_of_Singapore_Agreement_1965) in 1965. In June of that year, Ong resigned from his legislative seat citing the lack of an \"effective media whereby opposition parties can convey their message to the people\". The by-election for his vacated seat was subsequently won by the PAP. After this the UPP became dormant and ceased contesting in further elections although it remains officially registered as a political party. On 7 August 2025, the Singapore Ministry of Home Affairs sought proof of UPP's existence along with 13 other political parties due to its failure to comply with the [Foreign Interference (Countermeasures) Act 2021](/wiki/Foreign_Interference_(Countermeasures)_Act_2021). If there is no proof of existence provided to the Singapore Government within 3 months, the Registrar of Societies will deem the party as officially defunct. The party was officially deregistered on 4 December 2025. ## Election results ### Legislative Assembly ElectionLeaderVotes%SeatsPositionResultContestedTotal+/–SeatsWonLost(/wiki/1963_Singaporean_general_election)[Ong Eng Guan](/wiki/Ong_Eng_Guan)48,9678.39%461451 / 51 1 4thOpposition - Background of UPP This article about a Singaporean political party is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:12:05.942215",
  "title": "United People's Party (Singapore)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/United_People%27s_Party_(Singapore)"
}