{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:12:06.879957"
  },
  "content": "Private university in Singapore‹ The template *Infobox university* is being considered for merging. › 1°18′01″N 103°51′06″E﻿ / ﻿1.300229°N 103.851573°E﻿ / 1.300229; 103.851573 **The University of the Arts Singapore** (**UAS**) is [Singapore](/wiki/Singapore)'s first university of the arts. It was formally announced in 2021, as an alliance between [LASALLE College of the Arts](/wiki/LASALLE_College_of_the_Arts) (LASALLE) and [Nanyang Academy of Fine Arts](/wiki/Nanyang_Academy_of_Fine_Arts) (NAFA). Under this arrangement, the two institutions operate as distinct entities yet allows students to access opportunities from both schools. The UAS office is located at the [National Design Centre](/wiki/National_Design_Centre) in [Middle Road](/wiki/Middle_Road,_Singapore), amidst the arts and heritage precinct of Bras Basah Bugis. UAS commenced its inaugural intake in August 2024 and confers degrees as Singapore's 7th University. ## History The idea of a Singapore arts university was mooted as early as the Report of the Advisory Council on Culture and the Arts in 1989. The ACCA Report noted that none of the local institutions taught the arts at a degree level and Singaporeans had to pursue their art studies overseas. In addition, facilities of private schools were inadequate and did not enjoy Government assistance. The ACCA Report recommended that the Ministry of Education could consider establishing a Faculty of Art and Design and a School of Performing Arts in the proposed new university. In the late 1990s to early 2000s, the notion of \"Creative Singapore\" was extolled to unlock the potential of the arts and to cultivate a global city for the arts. There was a Committee to Upgrade LASALLE-SIA and NAFA, which recommended polytechnic level government funding for both institutions and to establish an Institute of the Arts (ITA) at [National University of Singapore](/wiki/National_University_of_Singapore) in 2001 to conduct degree courses in the performing arts. It is unknown why the ITA proposal evolved to [Yong Siew Toh Conservatory of Music](/wiki/Yong_Siew_Toh_Conservatory_of_Music) in 2003 and the School of Art, Design and Media at [Nanyang Technological University](/wiki/Nanyang_Technological_University) in 2005. The formation of an arts University was revived during the Parliamentary debate for the Ministry of Education's budget in March 2021. Minister [Lawrence Wong](/wiki/Lawrence_Wong) announced the appointment of a pro-tem committee led by Prof Chan Heng Chee, tasked to envisage the role of the first arts University in Singapore and the region, and to develop a sustainable operating model. ## Programmes The University will offer Bachelor and Master degree programmes in fine arts, design, media arts, performing arts and arts management, as well as in new and upcoming areas in the applied arts. Undergraduate students will undergo a common curriculum and industry attachments to complement their specialized arts education.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:12:06.879701",
  "title": "University of the Arts Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/University_of_the_Arts_Singapore"
}