{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:11:30.670960"
  },
  "content": "Singaporean real estate organisation **UOL Group Limited** ([Chinese](/wiki/Simplified_Chinese_characters): 华业集团有限公司; [pinyin](/wiki/Pinyin): *Huáyè Jítuán Yǒuxiàn Gōngsī*), is a [Singaporean](/wiki/Singapore) headquartered company focusing on investment, development and management of real estate across the [Asia-Pacific](/wiki/Asia-Pacific) region. The Wee Family, significant shareholders of [United Overseas Bank](/wiki/United_Overseas_Bank) are the largest shareholders of the company. The company is a constituent member of the [Straits Times Index](/wiki/Straits_Times_Index). ## History The company was founded in 1963 as Faber Union Limited, a subsidiary of Faber Union (HK) Limited. It became a publicly traded company on the Singapore Exchange in 1964. In 1975, the company changed its name to United Overseas Land Limited after [Wee Cho Yaw](/wiki/Wee_Cho_Yaw) and United Overseas Bank acquired a controlling interest in the company in 1973. In 2002, the company acquired Parkroyal, a hotel and property company. In 2006, the company was renamed to UOL Group Limited. In 2007, UOL Group Limited acquired [Pan Pacific Hotels and Resorts](/wiki/Pan_Pacific_Hotels_and_Resorts) from the [Tokyu Group](/wiki/Tokyu_Group), and renamed it to Pan Pacific Hotels Group. The company then merged Parkroyal with Pan Pacific for its hotel brand. In 2013, the company decided to delist Pan Pacific Hotels and Resorts from the [Singapore Exchange](/wiki/Singapore_Exchange). In 2018, the company acquired Singapore Land Group Limited (SingLand). ## Group structure The company has the following business segments: - Property development – development of properties for sale - Property investments – leasing of commercial properties and serviced suites - Hotel operations – operation of owned hotels - Investments – investment in quoted and unquoted financial assets - Technology operations – the distribution of computers and related products - Management services – provision of hotel management services ## Notable properties Properties that the company currently owned or previously owned include: - [Heron Plaza](/wiki/Heron_Tower#Heron_Plaza) - [Mandarin Oriental, Singapore](/wiki/Mandarin_Oriental,_Singapore) - [Marina Square](/wiki/Marina_Square) - [Pan Pacific Singapore Hotel](/wiki/Pan_Pacific_Singapore_Hotel) - [Pan Pacific Sonargaon](/wiki/Pan_Pacific_Sonargaon) - [Pan Pacific Suzhou](/wiki/Pan_Pacific_Suzhou) - [Parkroyal Collection Pickering](/wiki/Parkroyal_Collection_Pickering) - [Parkroyal Collection Marina Bay, Singapore](/wiki/Parkroyal_Collection_Marina_Bay,_Singapore) - [The Plaza](/wiki/The_Plaza_(Singapore)) - [West Mall](/wiki/West_Mall) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:11:30.670685",
  "title": "UOL Group",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/UOL_Group"
}