{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:12:11.509771"
  },
  "content": "This article includes a list of references, related reading, or external links, **but its sources remain unclear because it lacks inline citations**. Please help improve this article by introducing more precise citations. *(October 2021)* *(Learn how and when to remove this message)*Reservoir in Singapore **Upper Peirce Reservoir** ([Chinese](/wiki/Simplified_Chinese): 贝雅士蓄水池上段) is [Singapore](/wiki/Singapore)'s fourth [reservoir](/wiki/Water_reservoir). The 6-[hectare](/wiki/Hectare) [Upper Peirce Reservoir Park](/wiki/Upper_Peirce_Reservoir_Park) overlooks the Upper Peirce Reservoir. ## History Originally known as the Kallang River Reservoir, Singapore's second reservoir was impounded across the lower reaches of the [Kalang River](/wiki/Kalang_River) in 1910. In 1922, it was renamed Peirce Reservoir in commendation of the services of Robert Peirce, who was the [municipal](/wiki/Municipal) [engineer](/wiki/Engineer) of Singapore from 1901 to 1916. In late 1960s, due to increasing demand for water and the need to increase the capacity of Peirce Reservoir, a higher dam was constructed upstream of the existing dam at Peirce Reservoir in 1970. In 1975, a major water supply project to develop new water resources was undertaken to support Singapore's rapid housing and [industrialisation](/wiki/Industrialisation) programmes. A dam was constructed at the upper reaches of the Peirce Reservoir, forming the Upper and [Lower Peirce](/wiki/Lower_Peirce_Reservoir) Reservoirs. Upper Peirce Reservoir was officially opened by then [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) on 27 February 1977. The fourth and largest reservoir of Singapore has a capacity of 27.8 million m3 of water over 304 hectares of water surface. ## Upper Peirce Reservoir Park Upper Peirce Reservoir Park is a 5 hectares park beside the reservoir. Adding to its local scenery is the surrounding [secondary forest](/wiki/Secondary_forest) which was protected as a [water catchment area](/wiki/Water_catchment_area) when the reservoir was built.[*citation needed*] - National Parks Board website - Infopedia, Peirce Reservoir (National Library Board) This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:12:11.509484",
  "title": "Upper Peirce Reservoir",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Upper_Peirce_Reservoir"
}