{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:12:16.844823"
  },
  "content": "Singapore government agency The **Urban Redevelopment Authority** (**URA**) is the national [urban planning](/wiki/Urban_planning) authority of Singapore, and a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the [Ministry of National Development](/wiki/Ministry_of_National_Development_(Singapore)) of the [Government of Singapore](/wiki/Government_of_Singapore). ## Mission The authority was established on 1 April 1974, and is of critical importance to the city-state. [Singapore](/wiki/Singapore) is an extremely dense country where land usage is required to be efficient and maximized. The city state is trying to reduce land wastage in the face of land shortage in the area. ## Responsibilities ### Land use planning URA's main responsibility is [land-use planning](/wiki/Land-use_planning). URA planners devise both long-term strategic plans, along with medium-term plans, which are reviewed every five to ten years. These plans designate the land use and [urban density](/wiki/Urban_density) for the entirety of Singapore. These designations are divided by URA into 55 [planning areas](/wiki/Planning_Areas_of_Singapore). ### Development control It is the responsibility of URA to evaluate and [grant](/wiki/Land_grant) planning approval for development projects from the [public](/wiki/Public_sector) and [private sectors](/wiki/Private_sector). In approving development applications, the URA states its goal is to foster orderly development conforming to the planning guidelines as stated in the statutory Master Plan and the existing control factors. URA tries to provide quality service when working in partnership with building industry professionals and the general public to foster development. ### Urban design URA is responsible for the [urban design](/wiki/Urban_design) of the city. For areas of special interest, such as the [Singapore River](/wiki/Singapore_River) area, the [Orchard Road](/wiki/Orchard_Road) shopping belt, and the [Marina Bay](/wiki/Marina_Bay,_Singapore), URA devises specific medium and short-term urban design and land use plans. It also works with [other government agencies](/wiki/Statutory_boards_of_the_Singapore_Government) in enhancing the city's urban design. ### Building conservation [Building conservation](/wiki/Architectural_conservation) in Singapore is the responsibility of URA, which issued a Conservation Master Plan in 1989. This plan laid down guidelines and processes for the conservation of culturally and historically significant buildings. More than 7,000 buildings in Singapore have been gazetted as conserved buildings. ### Land sales URA also sells land by tender on behalf of the [Singapore government](/wiki/Government_of_Singapore) to meet demand from private developers. URA deals with tenders for government land and applications to buy reserved land. ### Car park management The URA plays an important role in managing all public car parks outside of [Housing Development Board](/wiki/Housing_Development_Board) estates. It provides information and services to the public in regard to coupon parking, season parking, and heavy vehicle parking. URA also sets the [bylaws](/wiki/Bylaw) to parking infringement and fines. ## URA Centre In keeping with URA's function as the authority for urban design in Singapore, the URA Centre was conceptualised by URA's in-house architects. [Kenzō Tange](/wiki/Kenz%C5%8D_Tange) Associates and [Kajima](/wiki/Kajima) Design Asia Pte Ltd served as design consultants. The building consists of two blocks: a 16-floor tower block, and a 5-floor podium block. ## Singapore City Gallery The URA maintains a regular and ever updated public urban planning exhibition on the first three floors of their headquarters. Highlights include three scale models of the island of Singapore, the [central region](/wiki/Central_Region,_Singapore), and the [central area](/wiki/Central_Area,_Singapore). Special exhibits and models on current projects and developments island-wide are regularly displayed as well. - [Development Guide Plan](/wiki/Development_Guide_Plan) - [Urban planning in Singapore](/wiki/Urban_planning_in_Singapore) - [Planning Areas of Singapore](/wiki/Planning_Areas_of_Singapore) - History of the Urban Redevelopment Authority - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:12:16.844526",
  "title": "Urban Redevelopment Authority",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Urban_Redevelopment_Authority"
}