{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:12:20.949327"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)*The topic of this article **may not meet Wikipedia's notability guidelines for companies and organizations**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"V-Key\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(July 2023)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **V-Key** is a software-based digital security provider. Headquartered in [Singapore](/wiki/Singapore), it provides products to financial institutions, [mobile payment](/wiki/Mobile_payment) providers and governments to implement cloud-based payments, [authentication](/wiki/Authentication) for [mobile banking](/wiki/Mobile_banking), and secured [mobile applications](/wiki/Mobile_app) for user access and data protection. ## Background & founders V-Key was founded in 2011 by entrepreneurs Eddie Chau, Benjamin Mah and Joseph Gan. Eddie Chau, who are the founders of digital agency Brandtology, acquired by iSentia in 2014, started V-Key primarily to secure [mobile devices](/wiki/Mobile_device) and applications with [patented](/wiki/Patent) technology. Benjamin Mah is the co-founder and chief executive officer of V-Key. He was general manager at e-Cop (acquired by a wholly owned subsidiary of [Temasek Holdings](/wiki/Temasek_Holdings)) and regional director at [Encentuate](/wiki/Encentuate) (acquired by [IBM](/wiki/IBM)), before he co-founded V-Key. He is a concurrently venture partner of Venture Craft, chairman of Jump Start Asia and a mentor at UOB Finlabs. Joseph Gan is the third co-founder of V-Key. Before joining V-Key, he was at the Center for Strategic Info comm Technologies (CSIT) as the head of the Cryptography Lab, where he oversaw research and development into cryptographic software for the [Ministry of Defence (Singapore)](/wiki/Ministry_of_Defence_(Singapore)). Companies that have funded V-Key are IPV Capital and [Ant Financial Services](/wiki/Ant_Financial_Services_Group), which runs the [Alipay](/wiki/Alipay) mobile wallet app. ## Technology V-Key provides security to businesses to support cloud-based payments, [digital identity](/wiki/Digital_identity) and authentication for [mobile banking](/wiki/Mobile_banking) as well as other secured mobile applications via its core technology—V-OS. V-Key's partners are financial institutions, governments and mobile payment providers in various markets. Its technology has been used by: - ChinaPnR - financial payment provider: V-Key integrates a virtual secure element into \"ChinaPnR POS Acquirer\" ([Point-of-Sale](/wiki/Point_of_sale) payment acquisition query platform) to protect mobile applications' runtime environment, program logic and important data. - DBS Bank: India's first mobile-only bank is powered by V-Key and DBS Bank collaboration - [Application Security](/wiki/Application_security) - [Encryption](/wiki/Encryption) - [Cryptographic Key Types](/wiki/Cryptographic_key_types)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:12:20.949069",
  "title": "V-Key",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/V-Key"
}