{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:12:29.672037"
  },
  "content": "This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Varieties of sambal\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2025)* *(Learn how and when to remove this message)* **[Sambal](/wiki/Sambal)** is a group of chili-based sauces and condiments widely consumed in maritime [Southeast Asia](/wiki/Southeast_Asia), especially in [Indonesia](/wiki/Indonesia), [Malaysia](/wiki/Malaysia), [Brunei](/wiki/Brunei), [Singapore](/wiki/Singapore) and [Sri Lanka](/wiki/Sri_Lanka). Traditionally made by grinding fresh or dried [chili peppers](/wiki/Chili_pepper) with ingredients such as [shrimp paste](/wiki/Shrimp_paste), [garlic](/wiki/Garlic), [shallots](/wiki/Shallot) and [lime juice](/wiki/Lime_(fruit)), sambal is served as a condiment, dipping sauce,or cooking ingredient. Its flavour ranges from mildly spicy to intensely hot, often reflecting local tastes and the availability of regional ingredients. Across [Indonesia](/wiki/Indonesian_cuisine) alone, culinary records and ethnographic surveys identify between 212 and 300 varieties of sambal. Each region has developed distinctive recipes, from fruit-based sambals of [South Kalimantan](/wiki/South_Kalimantan) and [Palembang](/wiki/Palembang) to the [andaliman](/wiki/Zanthoxylum_acanthopodium)-infused sambals of the [Batak people](/wiki/Batak) in [North Sumatra](/wiki/North_Sumatra), [lemongrass](/wiki/Lemongrass)-rich [Balinese](/wiki/Balinese_people) sambal matah, and fermented durian sambal [tempoyak](/wiki/Tempoyak) found in [Sumatra](/wiki/Sumatra). In [Malaysia](/wiki/Malaysian_cuisine), sambal belacan is a [staple](/wiki/Staple_food), while [Sri Lankan](/wiki/Sri_Lankan_cuisine) sambols are usually prepared from uncooked ingredients such as [coconut](/wiki/Coconut), onion and lime. In addition to being served as a condiment, sambal is also used as a base for cooking. Many Indonesian, Malaysian, [Singaporean](/wiki/Singaporean_cuisine) and [Bruneian dishes](/wiki/Bruneian_cuisine) are prepared by stir-frying sambal with meat, seafood or vegetables, creating dishes such as sambal goreng ati (liver), udang balado (chilli shrimp), and sambal tumis kangkung (water spinach). In some regions, specific sambals are closely associated with traditional meals or festive occasions, contributing both flavour and cultural identity to local cuisine. ## Indonesia In the [Indonesian archipelago](/wiki/Indonesian_archipelago), there are as many as 212 to 300 varieties of sambal. The intensity ranges from mild to very hot. Some varieties include: *Sambal acan*Fruit sambal, which is *acan* or *belacan* (shrimp paste) sambal mixed with tropical fruits of Kalimantan. Specialty of [Banjar](/wiki/Banjar_people) culture of [South Kalimantan](/wiki/South_Kalimantan). Sliced tropical local fruits used in this sambal including young raw [mango](/wiki/Mango), *[binjai](/wiki/Mangifera_caesia)* (white mango), *[gandaria](/wiki/Bouea_macrophylla)*, *[belimbing wuluh](/wiki/Averrhoa_bilimbi)*, *[limau kuit](/wiki/Kaffir_lime)* or [key lime](/wiki/Key_lime).*Sambal andaliman*Sambal made of *[andaliman](/wiki/Andaliman)* pepper, locally known as *merica batak* (Batak pepper). Culinary signature of [Batak tribes](/wiki/Batak_cuisine) of [North Sumatra](/wiki/North_Sumatra).*Sambal asam*This is similar to *sambal terasi* with an addition of [tamarind](/wiki/Tamarind) concentrate. *Asam* means tamarind or sour or acid in Indonesian.*Sambal bajak (badjak)*[Banten](/wiki/Banten) sambal. Chilli (or another kind of red pepper) fried with oil, shallot, garlic, [terasi](/wiki/Shrimp_paste#Belacan_or_terasi), [candlenuts](/wiki/Candlenut), palm sugar and other condiments. This is darker and richer in flavour than *sambal asam*.*[Sambal balado](/wiki/Balado_(food))*[Minangkabau](/wiki/Padang_cuisine) style sambal. Chilli pepper or green chili is blended together with garlic, shallot, red or green tomato, salt and lemon or lime juice, then sauteed with oil. Minang *sambal balado* often mixed with other ingredients to create a dish, such as egg, eggplant, shrimp or anchovy.*Sambal bawang*Sambal made from sliced [shallot](/wiki/Shallot), chilli pepper, garlic, shrimp paste and lemon juice.: 32 *Sambal beberuk terong*A type of sambal from [West Nusa Tenggara](/wiki/West_Nusa_Tenggara), made of chili, tomato, shallot, asparagus bean, and [pea eggplant](/wiki/Solanum_torvum).*Sambal belimbing* or *sambal belimbing wuluh*Sambal made of sour tasting *belimbing wuluh* (*[Averrhoa bilimbi](/wiki/Averrhoa_bilimbi)*), can be found in some places in Indonesia, especially in Java and [East Nusa Tenggara](/wiki/East_Nusa_Tenggara).*Sambal bengkoang*[Jicama](/wiki/Jicama) (*bengkoang*) sambal, made from the mixture of jicama or replaced with [water chestnut](/wiki/Water_chestnut), red chillies, garlic, Asian basil, shrimp paste and lemon juice.: 32 *Sambal berandal (brandal)*A fried sambal made with [kemiri nuts](/wiki/Kemiri_nut), garlic and onion. Sometimes tamarind (asem) or [kaffir lime](/wiki/Kaffir_lime) leaves (daun djeruk perut) are added.*Sambal bongkot*A speciality sambal from Bali, sambal with a mixture of sweet, sour, and spicy flavours, made with bongkot or kecombrang flower stems, shallots, chilli, grilled shrimp paste, sugar, salt, and lime juice.*Sambal buah*(lit: fruit sambal) Speciality of [Palembang](/wiki/Palembang_cuisine), made from the mixture of chilli, shrimp paste, *kemang* (a type of [mango](/wiki/Mango)) and [pineapple](/wiki/Pineapple).*Sambal cibiuk*A sambal recipe speciality of Cibiuk village, [Garut Regency](/wiki/Garut_Regency), West Java. It consists of coarsely chopped and ground green bird's eye chilli, green raw tomato, shallot, galangal, lemon basil, shrimp paste and salt.*[Sambal colo-colo](/wiki/Colo-colo_(condiment))*From [Ambon](/wiki/Ambon_Island), it consists of chilli, tomato pieces, [shallots](/wiki/Shallot) and [lime](/wiki/Lime_(fruit)) and has a chiefly sour taste. It is suitable for barbecue dishes, especially fish. Some variations add butter or vegetable oil to the sambal.*[Sambal dabu-dabu](/wiki/Dabu-dabu)*[Dabu-dabu](/wiki/Dabu-dabu) comes close to the Mexican [salsa](/wiki/Salsa_(sauce)), it is of [Manado](/wiki/Manado) origin. It consists of coarsely chopped tomatoes, [calamansi](/wiki/Calamansi) or known as *lemon cui* or *jeruk kesturi*, shallots, chopped bird's eye chili, red chilli, basil, poured with hot vegetable oil, salt.*Sambal durian* or *Sambal tempoyak*It is made from fermented durian called *[tempoyak](/wiki/Tempoyak)*. The fermentation process takes three to five days. The chilli and the tempoyak may be readily mixed or served separately, to cater the individual preference in ratio of chili to tempoyak to determine the scale of hotness. This sambal is available in two varieties: raw and cooked. In the cooked variety, pounded chillies, shallots and lemongrass are stir-fried with anchovies, tempoyak and turmeric leaf (for aroma). [Petai](/wiki/Petai) (*Parkia speciosa*) and tapioca shoots are also frequently added. The sweet-sour-hot sambal can be found in Sumatra and Kalimantan (Indonesian Borneo), especially in Palembang and Bengkulu, and also in Malay Peninsula.*Sambal ebi*[Dried shrimp](/wiki/Dried_shrimp) (*ebi*) sambal, made from the mixture of dried shrimp, candlenut, galangal, red chillies, shallot, garlic, brown sugar and salt.: 33 *Sambal gami*Sambal made of ground chili pepper, shrimp paste, tomato slices, onion slices, sugar, salt, and seasoning, cooked with several types of [cockles](/wiki/Cockle_(bivalve)) on earthenware plate. Specialty of [Bontang](/wiki/Bontang) coastal town in [East Kalimantan](/wiki/East_Kalimantan).*Sambal gandaria*Freshly ground *sambal terasi* with shredded *[gandaria](/wiki/Bouea_macrophylla)*, a kind of tropical fruit native to Southeast Asia.*Sambal goang*An extra hot [Sundanese](/wiki/Sundanese_cuisine) sambal associated with the town of [Tasikmalaya](/wiki/Tasikmalaya), made from the mixture of cayenne pepper, garlic, salt and *kencur* (*[Kaempferia galanga](/wiki/Kaempferia_galanga)*).*Sambal goreng*Literally means \"fried sambal\". It is a mix of crisp fried red shallots, red and green chilli, shrimp paste and salt, briefly stir-fried in coconut oil. It can be made into a whole different dish by adding other ingredients, such as *sambal goreng ati* (mixed with diced liver) or *sambal goreng udang* (added with small shrimp).*Sambal gota*[Blood](/wiki/Blood_as_food) sambal made of *[andaliman](/wiki/Zanthoxylum_acanthopodium)*, chili pepper, garlic and other seasoning mixed and cooked with pork blood or sometimes chicken blood. Specialty of [Batak cuisine](/wiki/Batak_cuisine), North Sumatra.*Sambal jenggot*Sambal with addition of grated coconut, similar to [urap](/wiki/Urap).*Sambal jengkol*Freshly ground *sambal terasi* mixed with sliced fried *[jengkol](/wiki/Archidendron_pauciflorum)*, a kind of tropical bean with slightly stinky aroma native to Southeast Asia. Sambal jengkol can be found in Sundanese and Cirebon cuisine.*Sambal kalasan*Sometimes also called *sambal jawa*, a [Javanese](/wiki/Javanese_cuisine) stir-fried sambal similar to sambal tumis. It uses a handful of *gula jawa* [palm sugar](/wiki/Palm_sugar) which gives its dark brown color, tomato, spices and chilli. The overall flavour is sweet, with mild hints of spices and chili.*Sambal kacang*A mixture of chilli with garlic, shallot, sugar, salt, crushed fried peanuts, and water. Usually used as condiments for *[nasi uduk](/wiki/Nasi_uduk)*, *ketan*, or *[otak-otak](/wiki/Otak-otak)*. The simple version only employ *cabe rawit* chilli, crushed fried peanuts, and water.*Sambal kandas serai*A typical sambal of the Dayak tribe in [Central Kalimantan](/wiki/Central_Kalimantan), made of chilies, lemon grass and shredded fish.*Sambal kecap*A sambal consists of Indonesian *kecap manis* (sweet soy sauce), red chilli, tomato pieces, [shallots](/wiki/Shallot) and [lime](/wiki/Lime_(fruit)), it has a sweet and spicy taste and usually used for barbecue dishes.*Sambal kecombrang*A sambal made from *kecombrang* (*[Etlingera elatior](/wiki/Etlingera_elatior)*) flower, mixed with red cayenne pepper, shallot, garlic, salt and lime leaves.*Sambal kemangi*Sambal made with a mixture *kemangi* ([Lemon basil](/wiki/Lemon_basil)) fragrant leaf.*Sambal kemiri*This is similar to *sambal terasi* with addition of [candlenuts](/wiki/Candlenut).*Sambal kenari*Sambal made with a mixture of *kenari* (*[Canarium ovatum](/wiki/Canarium_ovatum)*) nut, speciality of Maluku islands.: 8 *Sambal lado mudo* or *sambal ijo*Literally a [Minangkabau](/wiki/Minangkabau_language) word for \"green sambal\". It is also known as sambal hijau or sambal ijo, also \"green sambal\". Sambal lado mudo, a [West Sumatran](/wiki/West_Sumatra) speciality, used green chilli, stir-fried with dried shrimp, red shallots, garlic, and spices. It is less hot compared to common sambals, and has a fresh flavour that complements the richness of Sumatran food.*Sambal lado uwok*A sambal made from steamed chili, garlic, shallot, tomato and mixed with sauteed anchovies.*Sambal lampung*A popular variant of slightly sweet chilli, garlic, tomato sambal of [Lampung](/wiki/Lampung) origin, Sumatra.*Sambal leunca*A Sundanese sambal, especially popular in West Java, made with the mixture of red chilli pepper, bird's eye chilli, shallot, shrimp paste and *leunca* (*[Solanum nigrum](/wiki/Solanum_nigrum)*) berries.*Sambal luat*Sambal made of the mixture of red chilli pepper, *terasi* shrimp paste, key lime juice, shallot, scallion, coriander, tomato, salt. Specialty of [East Nusa Tenggara](/wiki/East_Nusa_Tenggara) province. Usually consumed as a condiment to accompany *[Se'i](/wiki/Se%27i)* smoked pork or beef.*Sambal mandai*Sambal made with mixture of fermented inner skin of *[cempedak](/wiki/Cempedak)* fruit (*Artocarpus integer*), specialty of [East Kalimantan](/wiki/East_Kalimantan).*Sambal matah*Raw shallot and lemongrass sambal of [Bali](/wiki/Bali) origin. It contains a lot of finely chopped shallots, chopped bird's eye chilli, lemongrass, cooking oil with a dash of lime juice.*Sambal pare*Bitter gourd sambal. Ground chilli and shallot fried with finely chopped bitter gourd to reduce bitterness. *Sambal pecak*Sambal pecak is served as the condiment of fried fish or chicken. The [Betawi](/wiki/Betawi_people) version is more soupy and using ginger in the sambal.*Sambal petai*A mixture of red chilli, garlic, shallot, and *[petai](/wiki/Petai)* green stinky bean as the main ingredients.*Sambal petis*An [east Javanese](/wiki/East_Java) sambal uses chilli, [petis](/wiki/Shrimp_paste) (a kind of shrimp paste), peanuts, young banana, herbs and spices.*Sambal pencit/mangga muda*Green [mango](/wiki/Mango) sambal: 32 from [Central Java](/wiki/Central_Java). Freshly ground *sambal terasi* with shredded young unripe [mango](/wiki/Mango). This is a good accompaniment to seafood. *Pencit* means young mango in Indonesian.*Sambal plecing*Originating from Lombok island, the sambal consists of Lombok's chili variety and Lombok's *lengkare* shrimp paste, tomatoes, salt, and lime juice.*Sambal rampai*A sambal from [Lampung](/wiki/Lampung) made of chili and [*rampai*](/wiki/Solanum_pimpinellifolium) tomato.*[Sambal rica rica](/wiki/Rica-rica)*A hot sambal from [Manado](/wiki/Manado) region, it uses ginger, chili, lemon and spices. Suitable for barbecue meats and chicken.*Sambal roa*Spicy smoked *roa* fish ([halfbeak](/wiki/Halfbeak)) sambal from Manado region, North Sulawesi.*Sambal rujak**[Rujak](/wiki/Rujak)* spicy sauce, made from palm sugar, tamarind, chili pepper and shrimp paste.*Sambal seruit*A sambal from [Lampung](/wiki/Lampung), made of fish, *[tempoyak](/wiki/Tempoyak)*, chili, shrimp paste, and aren palm juice.*Sambal setan*A very hot sambal with Madame Jeanette peppers (red brownish, very sharp). The name literally means \"devil's sauce\". It is popular in [Surabaya](/wiki/Surabaya).*Sambal taliwang*This variant is native to Taliwang, a village near [Mataram](/wiki/Mataram_(city)), [Lombok](/wiki/Lombok) Island, and is made from [naga jolokia](/wiki/Naga_jolokia) pepper grown specially in [Lombok](/wiki/Lombok), garlic and [Lombok](/wiki/Lombok) shrimp paste. A kilogram of [naga jolokia](/wiki/Naga_jolokia) pepper is extracted, ground and pressed. This is mixed with ground garlic and shrimp paste, then cooked with vegetable oil.*Sambal tape (tapai)*A variant of sambal from [Tegal](/wiki/Tegal) in Central Java that consists of chili pepper, salt and the addition of sour fermented cassava called *[tapai](/wiki/Tapai)*. Usually served to spice up [krupuk](/wiki/Krupuk) crackers or vegetables.*Sambal tauco*A [Sulawesi](/wiki/Sulawesi) sambal, contains the Chinese [tauco](/wiki/Tauco), lime juice, chilli, brown sugar, and salt.*Sambal terasi*A common Indonesian style of sambal with a distinct shrimp paste flavor. Similar to the Malaysian *[belacan](/wiki/Belacan)*, but with a stronger flavour, since *[terasi](/wiki/Terasi)* is more tangy and fermented. Red and green peppers, *terasi*, sugar, salt, lemon or lime juice (tangy, strong). One version omits the lime juice and has the sambal fried with pounded tomatoes. Popularly eaten raw. Alternate spelling in the Netherlands: *trassi* or *trassie*.*Sambal teri lado*A [Padang](/wiki/Padang,_Indonesia) speciality, sambal is made using chilli pepper, tomato, shallot, spices, and mixed with salted *ikan teri* ([anchovy](/wiki/Anchovies_as_food)). The sambal is stir fried and similar to Malay *sambal ikan*.*Sambal terung asam*Sour and spicy sambal made of *terung dayak* (*[Solanum ferox](/wiki/Solanum_lasiocarpum)*), specialty of [Kalimantan](/wiki/Kalimantan) (Indonesian Borneo).*Sambal tomat*Similar to sambal tumis but with the addition of crushed tomato and sugar. It can be served as fresh sambal or stirred sambal. The tomato is stir fried along with the other ingredients until a paste-like consistency. The overall taste is hot and sweet, it is a good mix with *lalapan*.[*original research?*] For very young children, *sambal tomat* sometimes uses very little or no chilli at all; it is regarded as one of the first steps in introducing children to the taste of Indonesian sambal.*Sambal tuktuk*A traditional hot and spicy [condiments](/wiki/Condiment) typically served in [Batak cuisine](/wiki/Batak_cuisine) of [Batak people](/wiki/Batak_(Indonesia)), native of Tapanuli region, [North Sumatra](/wiki/North_Sumatra), [Indonesia](/wiki/Indonesia). The ingredients to make *sambal tuktuk* is similar to other [chili sauce](/wiki/Chili_sauce) ingredients, distinguished by the use of *andaliman* ([Sichuan pepper](/wiki/Sichuan_pepper)). It is often served as *tuktuk aso-aso*, being mixed with dried fish called *aso-aso* (a type of dried and preserved [mackerel](/wiki/Mackerel_(food))), but sometimes *aso-aso* fish is replaced with fresh [anchovy](/wiki/Anchovy_(food)).*Sambal tumis*Chilli fried with *belacan* shrimp paste, onions, garlic, tamarind juice. *Tumis* means 'stir fry'. Often the cooking oil is re-mixed with the sambal. It may be mixed with other ingredients to produce dishes such as *sambal [kangkong](/wiki/Ipomoea_aquatica)*, *sambal cumi* ([squid](/wiki/Squid_(food))) and *sambal telur* ([egg](/wiki/Egg_(food))).*Sambal tumpang*Javanese sambal made from the mixture of chili pepper, other spices and *semangit* (old and pungent) [tempeh](/wiki/Tempeh).*Sambal udang bawang*A speciality sambal from [Surabaya](/wiki/Surabaya,_Indonesia). It is one of Indonesia's super hot sambal. It used simple ingredients, such as chili pepper, shallot, garlic, *asam jawa* (tamarind) and coconut oil. People of [Surabaya](/wiki/Surabaya) often called it *Njaluk Sambal*, as they eat it with fragrant steamed white rice.*Sambal ulek (oelek)*Raw chilli paste (bright red, thin and sharp-tasting). Can be used as the base for making other sambals or as an ingredient for other cuisines. Some types of this variant call for the addition of salt or lime into the red mixture. *Oelek* is the old [pre-1947](/wiki/Van_Ophuijsen_Spelling_System) Indonesian spelling (based on Dutch orthography) which has since become *ulek*. The pronunciation has not changed and is in line with Malay pronunciation. Some suppliers use the older spelling due to its association with the Dutch East Indies and [Indo culture](/wiki/Indo_people). *Cobek* is Indonesian special stoneware derived from the common village [basalt](/wiki/Basalt) stone kitchenware still ubiquitous in kitchens, particularly in Java. The *cobek* is a [mortar](/wiki/Mortar_and_pestle) shaped like a hybrid of a dinner and soup-plate with an old, cured [bamboo](/wiki/Bamboo) [root](/wiki/Root) or stone [pestle](/wiki/Pestle) (*ulek* or *ulekan*) employed in an *ulek* manner: a crushing and twisting motion (like using a [screwdriver](/wiki/Screwdriver)) for crushing lime leaves, chilies, peppers, shallots, peanuts, and other kinds of ingredients.*Sambal stroberi*A sambal made with [strawberries](/wiki/Strawberries) originated from [Bandung](/wiki/Bandung), [West Java](/wiki/West_Java). Usually served to accompany [breaded fish cutlet](/wiki/Breaded_cutlet).*Sambal uyah-lombok*A kind of sambal which is only made from raw chilli and salt. Very simple and easy to make, and usually be eaten with steamed rice and fried foods like fried chicken. ## Malaysia *Sambal belacan*A Malay-style sambal. Fresh chillies are pounded together with toasted [shrimp paste](/wiki/Shrimp_paste) (*belacan*) in a stone mortar to which sugar and lime juice are added. *Limau kesturi* or [calamansi lime](/wiki/Calamondin) is used traditionally but may be substituted with lime outside Southeast Asia. Tomatoes are optional ingredients. Sometimes, sweet-sour mangoes or equivalent local fruits are also used. It can be eaten with cucumbers or *ulam* (leafy herbs) in a meal of rice and other dishes. A Malaysian-Chinese version is to fry *belacan* with chili.*Sambal jeruk*Green or red pepper with [kaffir lime](/wiki/Kaffir_lime). In Malaysia, it is called *cili* (chili) *jeruk* (pickle). Sometimes vinegar and sugar are substituted for lime. Used as a condiment with fried rice and noodle-based dishes.*Sambal tempoyak*This sambal may be raw or cooked. Raw sambal tempoyak is prepared from fresh chilis pounded together with dried anchovies and served with fermented durian (*[tempoyak](/wiki/Tempoyak)*). The sambal and the [tempoyak](/wiki/Tempoyak) may be readily mixed or served separately, so that the person eating can determine the ratio of sambal to tempoyak that they want (tempoyak has a sweet-sour taste that offsets the hotness of the chilli). In the cooked variety, pounded chilis, shallots, and lemongrass are stir-fried with anchovies, tempoyak and turmeric leaf (for aroma). Commonly found in [Pahang](/wiki/Pahang) and [Perak](/wiki/Perak) of Peninsular Malaysia, sambal tempoyak could be found also at Sumatra. [Petai](/wiki/Petai) (*Parkia speciosa*) and tapioca shoots are also frequently added.*Sambal kicap*Made from a mix of sweet soy sauce, shallot, garlic, [bird's eye chili](/wiki/Bird%27s_eye_chili) for any fried dishes especially for fried banana, fried [tempeh](/wiki/Tempeh) or condiment for [soto](/wiki/Soto_(food)) and [bihun](/wiki/Rice_vermicelli) soup.*Sambal goreng*Dishes consist of [tempeh](/wiki/Tempeh), [anchovies](/wiki/Anchovies), peanut fried together with sambal until dried.*Sambal kacang*Condiment for satay.*Sweet sambal*This is sambal made from dried chillies, fresh chilies, *belacan* and *gula Melaka* ([palm sugar](/wiki/Palm_sugar)) as main ingredients. Sweet sambal is traditionally served with *[nasi lemak](/wiki/Nasi_lemak)* and also side dishes fried crispy anchovies, toasted peanuts, boiled egg and cucumber. ## Sri Lanka Sambols in Sri Lanka differ from those originating in Malaysia and Indonesia, in that they are generally made from uncooked ingredients, such as fresh chillies, shallots, coconut, garlic, which are then ground with a mortar and pestle and mixed with a citric acid, such as lime or lemon juice. They resemble a Mexican [salsa](/wiki/Salsa_(Mexican_cuisine)) or Laotian [jaew](/wiki/Lao_cuisine#Dips). *[Seeni sambol](/wiki/Seeni_sambol)*This is a hot/sweet sambal of the [Sri Lankan cuisine](/wiki/Sri_Lankan_cuisine) that includes onion, crumbled [Maldives fish](/wiki/Maldives_fish), and spices as its main ingredients. Its name, also spelled as \"sini sambol\" or \"seeni sambal\", is derived from the local word for \"sugar\".*[Pol sambol/Thengkai sambal](/wiki/Pol_sambol)*This is a sambal made of scraped coconut (pol and thengkai mean coconut in Sinhala and Tamil, respectively), onion, green chilli, red chilli powder, and lime juice as its main ingredients. Sometimes, crumbled Maldives fish is also added, and tomatoes can be used instead of lime juice for flavor.*[Lunumiris](/wiki/Lunumiris) (Katta sambal)*This is a red onion sambal. The name \"lunu miris\" can be literally translated as \"salt chili\" and is a paste of red chilli pounded with sea salt. A widespread derivative is *katta sambal*, which adds onions, crumbled Maldives fish, salt, and lime juice to the chilli-and-salt mixture.*[Vaalai kai sambal](/wiki/Vaalai_kai_sambal)*This is sambal made of boiled and mashed plantain, scraped coconut, chopped green chillies and onion, salt and lime juice. Vaalai kai means unripe plantain in Sri Lankan Tamil. [Jaffna](/wiki/Jaffna) Tamils make *campal* that is more close to a [chutney](/wiki/Chutney). ## Dishes *Sambal* can also be used as an ingredient to a dish, which uses a large amount of chili peppers. The dishes started with the term *sambal goreng* means \"fried sambal\" dishes. It refer to stir fried sambal mixed with certain ingredients such as *sambal goreng kentang* (potato), *sambal goreng hati* (liver), *sambal goreng [krechek](/wiki/Krechek)* (cow's skin), *sambal goreng teri* (anchovy), etc. In [Padang cuisine](/wiki/Minangkabau_cuisine), any dishes started with *[balado](/wiki/Balado_(food))-* (lit: with chili pepper) indicate the *sambal*-mixed dish. Dishes bearing the word *sambal* include: *Sambal lalab*Sambal served with *[lalab](/wiki/Lalab)* (assorted of fresh vegetables), consumed as a dip dressing for [salad](/wiki/Salad). A Sundanese dish.*Sambal sotong* or *Sambal cumi*(with cuttlefish or squid)*Sambal udang kering*(with dried prawns), also known in Penang as \"Sambal Hae Bee\"*Sambal lengkong*(with ikan parang/[wolf herring](/wiki/Wolf_herring)).*Sambal belut*(with eel). An Indonesian dish.*Sambal goreng ati*(with cow's or chicken liver, potato, and sometimes [petai](/wiki/Petai)). An Indonesian dish.*Sambal goreng teri kacang*(with anchovy and peanuts). An Indonesian dish.*Sambal goreng kering tempe*(with [tempeh](/wiki/Tempeh)). An Indonesian dish.*[Sambal goreng krecek](/wiki/Krechek)*(with cow or water buffalo skin cracker). A Javanese dish.*[Sambal goreng udang](/wiki/Sambal_goreng_udang)*or [sambal shrimp](/wiki/Sambal_shrimp) (with fresh shrimp), also known as *udang balado*. A Minang dish.*Sambal jamur*(with oyster mushroom). An Indonesian dish.*Sambal radio*A traditional dish from Sarawak, it is an omelette mixed with fried belacan and anchovies.*Sambal ikan*A Malay-style dish prepared from [fish](/wiki/Fish_(food)) and spices and cooked until the fish loses its shape. Available in varieties, some are in the shape of dry [fish floss](/wiki/Fish_floss) known as *serunding ikan*, and some are moist such as *sambal ikan bilis* ([anchovies](/wiki/Anchovies)) or *sambal ikan tongkol* ([skipjack tuna](/wiki/Skipjack_tuna)).*Sambal daging/serunding daging*A Malay style sambal prepared from meat and spices and cooked for more than 4 hours until the meat loses its shape, similar to [meat floss](/wiki/Meat_floss).*[Sambal stingray](/wiki/Sambal_stingray)*A Malaysian/Singaporean seafood dish of barbecuing stingray served with sambal paste.*Sambal wader*A [Javanese](/wiki/Javanese_cuisine) dish made of [yellow rasbora](/wiki/Rasbora_lateristriata) and *sambal terasi*. It is believed to have been served since [Majapahit](/wiki/Majapahit) era.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:12:29.671740",
  "title": "Varieties of sambal",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Varieties_of_sambal"
}