{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:12:30.928410"
  },
  "content": "Television channel **Vasantham** ([Tamil](/wiki/Tamil_language): வசந்தம், [lit.](/wiki/Literal_translation) 'Spring') is a [Tamil-language](/wiki/Tamil_language) [free-to-air](/wiki/Free-to-air) [terrestrial television channel](/wiki/Television_channel) in [Singapore](/wiki/Singapore). Owned by state media conglomerate [Mediacorp](/wiki/Mediacorp), the channel broadcasts entertainment and news programming targeting the [Singaporean Tamil](/wiki/Singapore_Tamils) community. ## History Since the inception of television broadcasting in Singapore, Tamil-language programming had been broadcast by Mediacorp and its predecessors via its existing channels; after having carried programming in all four of Singapore's official languages on [Channel 5](/wiki/Channel_5_(Singaporean_TV_channel)) and (/wiki/Channel_8_(Singaporean_TV_channel)), the channels were split on 30 March 1973. Channel 5 would focus on English and Malay, and Channel 8 would focus on Chinese and Tamil. On 1 September 1995, [Channel 12](/wiki/Suria_(TV_channel))—which took on Malay programming after Channel 5 relaunched as an English-language channel a year prior—relaunched as Prime 12, and Tamil programming moved to the channel. With the move, Tamil output increased from an average of 10 hours per-week to 16 hours. In September 1999, [Singapore Television Twelve](/wiki/Mediacorp_TV12) announced changes to its two channels taking effect in 2000, with Prime 12 becoming a full-time Malay channel known as Suria, and Premiere 12 (which took on arts and cultural programming after the Prime 12 relaunch) becoming [Central](/wiki/Central_(TV_channel))—a channel divided into blocks for children's programming, Tamil programming, and arts programming. \"Vasantham Central\" would be one of the three main [program strands](/wiki/Block_programming) carried by Central. In February 2008, it was announced that Central would be split into two full-time channels dedicated respectively to Tamil-language programming, and children's and arts programming. The new channels—Vasantham and [Okto](/wiki/Okto)—would launch in 19 October 2008. ## Programming Vasantham's programming consists primarily of Tamil-language [dramas](/wiki/Indian_television_drama) and [variety shows](/wiki/Variety_show). *Seithi* (செய்தி) serves as the station's evening newscast. In 2019, the channel launched *Muthal Paarvai*, a viewer-voted [pilot](/wiki/Television_pilot) contest for new Vasantham dramas. Vasantham broadcasts from 9:00 a.m. [SGT](/wiki/Singapore_Time) daily, signing off at 12:00 a.m. SGT on Mondays, Tuesdays, and Wednesdays, 12:30 a.m. on Thursdays, Fridays, and Sundays, and 1:30 a.m. on Saturdays (except on national holidays where it broadcasts for 24 hours). A simulcast of Mediacorp's Tamil-language radio station [Oli 968](/wiki/Oli_968) is carried during the overnight and morning hours until [sign-on](/wiki/Sign-on_and_sign-off). - Vasantham Official Website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:12:30.928091",
  "title": "Vasantham (TV channel)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Vasantham_(TV_channel)"
}