{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:12:34.741428"
  },
  "content": "Singapore vehicle license platesThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Vehicle registration plates of Singapore\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(April 2021)* *(Learn how and when to remove this message)* **Vehicle registration plates in Singapore** are administered and issued by the [Land Transport Authority](/wiki/Land_Transport_Authority). All vehicles in Singapore are required to display front and back plates bearing its registration number. Purchasers of vehicles and current vehicle owners have the option to bid for a vehicle registration number, retain a registration number from an existing vehicle or get an automatically assigned vehicle registration number on the day of the vehicle's registration. Vehicle registration numbers can be retained on new or old vehicles owned by the same person, with a validity of 1 year and with extensions of 6 months thereafter, with proper documentations and fees paid for bidding or number retention. ## Formats The following are examples of the formats currently used on commonly seen vehicle types; Type of number plateLayoutPrivate and commercial vehicles**S** – Vehicle class (\"S _ _\", with some exceptions such as plates starting with \"E _\", prefix reserved for private vehicles since 1984)Taxis & Cross Border Private Omnibuses**SH_** or **SH** are prefixes used by taxis and a small number of omnibuses operated by Singapore-Johore Express bearing the same prefix.Motorcycles**F** – Vehicle class (\"F _ _ \", or \"F _\", with some exceptions such as plates starting with A were the earliest series for motorcycles, prefix reserved for motorcycles)Light Goods vehicles**G** – Vehicle class (\"G _ _\", with some exceptions such as plates starting with \"G _\", prefix reserved for private vehicles since 1970s)Public Buses**SG** or formerly \"SBS\", \"SMB\" or \"TIBS\", are prefixes reserved for use by Government-owned omnibuses, operated by contracted public bus operators under the Bus Contracting Model.Engineering Plant vehicles**W** – Vehicle class (\"W _\", Class 5, some registered Jeeps and Rovers.Heavy Goods vehicles**Y** – Vehicle class (\"Y _\", Class 3/4 which are constructed to carry load or passengers only.Very Heavy Goods vehicles**X** – Vehicle class (\"X _\", Class 5/prime movers not constructed to carry any load.Trailers**T** – Vehicle class (\"TR _\", Trailers towed by very heavy goods vehicles.Emergency**QX**– Vehicle class are prefixes used by Emergency vehicles and law enforcement agencies.Law enforcement**TP** & **LTA** – Vehicle class are prefixes used by law enforcement agencies.Military**MID** - Singapore Armed Forces vehicles (this is a suffix with up to five digits before it, e.g., \"12345 MID\"). A typical vehicle registration number comes in the format **S_ _ #### _**: - **S** – Vehicle class (\"S\", with some exceptions, stands for a private vehicle since 1984) - **_** – Alphabetical series (\"I\" and \"O\" are not used to avoid confusion with \"1\" and \"0\") - **####** – Numerical series (from 1 to 9999, without leading zeroes) - **_** – Checksum letter (\"F\", \"I\", \"N\", \"O\", \"Q\", \"V\" and \"W\" are never used as checksum letters; absent on special government vehicle plates and events vehicle plates) ## Current scheme In general, every motor vehicle in Singapore requires a vehicle registration number to be displayed at the front center (in almost all cases or otherwise set by car manufacturer due to bumper constraints) and rear of the vehicle. Two colour schemes are in use: white font on black scheme that is standard on cars and motorcycles from dealerships, or the Euro white/yellow (on front and rear) scheme. These plates are either represented in rectangular single line or squarish two line format. The number plate has to be made of a reflective plastic with flat characters or metal based with bolded or embossed characters which are black (for Euro white-yellow), while white or silver are used (for black based). Although no standardised typeface is used, all typefaces are based on the Charles Wright number plate typeface that was and is still used in the UK. Rarely, the [Arial Bold](/wiki/Arial_Bold) or [FE-Schrift](/wiki/FE-Schrift) font used in Germany can be seen – though the use of these fonts is prohibited by the [Land Transport Authority](/wiki/Land_Transport_Authority) (LTA). For motorists who would be attaching a bicycle rack of which the vehicle licence plate would be blocked at the rear of a vehicle, or any other fittings that obstructs the view of the number plate, motorists are required to hang an additional licence plate prominently at the rear of the vehicle. ## Types of numbers Private car licence plate numbers began in the early 1900s when Singapore was one of the four [Straits Settlements](/wiki/Straits_Settlement), with a single prefix **S** for denoting [Singapore](/wiki/Singapore), then adding a suffix letter S 'B' to S 'Y' for cars, but skipping a few like S 'A' (reserved for motorcycles), S 'H' (reserved for taxis), S 'D' (reserved for municipal vehicles), and S 'G' for goods vehicles large and small. There was no checksum letter, for example, S. When the checksum letter was implemented, these plate numbers were given checksum letters as well, for example SG5999 became SG5999Z. When 'S' was exhausted at SY, in January 1972, private cars started with E and [Land Transport Authority](/wiki/Land_Transport_Authority) begin to create separate vehicle categories according type of vehicles. Previously all vehicles in Singapore had to bear the prefix **S** due to previous standardization with Peninsular Malaysia according to geographical location (**A** is for [Perak](/wiki/Perak), **B** is for [Selangor](/wiki/Selangor), **S** is for [Singapore](/wiki/Singapore)/[Sabah](/wiki/Sabah)), motorbikes with A and goods vehicles under 3 tonnes with Y. E was followed by EA, EB with the letters EC in 1973 up to EZ. E was chosen then as letters A-D were already in used by other states in Malaysia. From 1984, the \"S\" series of number plates was launched again after **EZ**, but now with two serial suffix letters, starting from SBA, although several prefixes were skipped as they are reserved, such as SBS and SMB for omnibuses registered under public bus operators SBS Transit and SMRT Buses respectively. The SG-prefix was subsequently revived in November 2015 for government-owned omnibuses operated by contracted public bus operators under the LTA's [Bus Contracting Model](/wiki/Bus_Contracting_Model). Since August 2017, the [Land Transport Authority](/wiki/Land_Transport_Authority) announced that electric bicycle (also known as Power-Assisted Bicycle) owners would have to register their personal mobility vehicles between 2017-08-14 and 2018-01-31 and install number plates, with sealing and registration to be done by the individual. Since then, if the unregistered PAB already has an LTA orange seal, a registration is only needed. Alternatively, if a registered PAB is bought from a retailer, only a transfer the registration to the individual's name is needed. Registration for PAB with blue seal has ceased as of 2018. Since January 2019, the [Land Transport Authority](/wiki/Land_Transport_Authority) announced that electric scooter owners would also have to register their personal mobility vehicles between 2019-01-02 and 2019-07-30. A registered e-scooter must have a LTA Registration Mark and an Identification Mark (which bears the unique registration number assigned to the e-scooter) affixed. However, non-UL2272 certified vehicles were deregistered automatically on 2020-07-01. Other classes of vehicles have registration numbers beginning with specific letters: SeriesVehicle classExample**S, S_, E_, S_ _**Private vehicles. SB – SY were the earliest series, issued till 1969. EA - EZ from the early 1970s until the mid-1980s. SBA began since 1984, the first 3-letter prefix combination. Also for vehicles registered to Government agencies on or after 2019-04-01, except for Emergency and law enforcement agencies. The current prefix being issued is **SPD**. Except SA, SD, SG, SH, SZ, SBS, SCB, SCC, SCD, SCS, SCT, SDC, SH_, SKY, SLY, SMB, SPA, SPF, SPY, STC, STE. Vowels 'A', 'E', 'I', 'O', 'U' are not used in the middle letter in 3-letter combination. **SH, SH_** (except SHE, SHY)Taxis and omnibuses operated by Singapore-Johore Express. The current prefix being issued is **SHF**. **SH** was also previously used for former SBS buses operating Sentosa and Airport services (AIRBUS), Singapore Explorer Trolley – City Sightseeing buses and public buses that were not operated by the [Singapore Traction Company](/wiki/Singapore_Traction_Company) (e.g. buses under the Chinese bus companies and later, [SBS](/wiki/SBS_Transit) from the 1960s to 1974, when new SBS-prefixed registration numbers were issued specifically for SBS buses.) **A_, SA, F_, F_ _**Motorcycles. Plates starting with A were the earliest series for motorcycles, and are still valid. FA–FZ series till exhausted in late 2005. FBA, the first 3-letter prefix combination began at the end of December 2005. The current prefix being issued is **FBY.** Vowels 'A', 'E', 'I', 'O', 'U' are not used in the middle letter in 3-letter combination. **G_, G_ _**, **SG** (old)Light Goods vehicles (class 3). GA-GZ till late 2006. GBA onwards were introduced at the end of December 2006. The current prefix being issued is **GBN**. Vowels 'A', 'E', 'I', 'O', 'U' are not used in the middle letter in 3-letter combination. SG prefix series were used until early 1970s for all goods vehicles regardless of class. SG-prefixed goods vehicles were de-registered by 1998. Now used on government-owned public buses, see \"SG (modern day)\" below. **SG** (modern day)Government-owned omnibuses operated by contracted public bus operators under the [Bus Contracting Model](/wiki/Bus_Contracting_Model). Previously SG-prefixed plates were issued until the early 1970s to goods vehicles of any class, and have been deregistered since 1998. **Y_**Heavy goods vehicles (class 3/4) which are constructed to carry load or passengers only. The current prefix being issued is **YR**.**X_**Very heavy goods vehicles (Class 5/prime movers) not constructed to carry any load. The current prefix being issued is **XF**.**W_ (except WE)**Engineering plant vehicles (Class 5), some registered Jeeps and Rovers. The current prefix being issued is **WF**. Vowels are not used in the middle letter in 3-letter combination to avoid words like \"WE\" is skipped as it forms the English word (We) **P_ (except PU)**Private operator buses (PA, PC, PD, PH, PZ were used to separate private buses, and so on, but later on all private hire buses were issued plates with PA, PC and so on). The current prefix being issued is **PD**. Vowels 'A', 'E', 'I', 'O', 'U' are not used in the middle letter in 3-letter combination. **TR_**Trailers towed by very heavy goods vehicles.**CB**Company or school buses (discontinued in 1996)**CSS**City Shuttle Service buses (no longer issued: some re-registered under TIB series while the rest were deregistered.)**EVS**Special prefix for the first 100 locally assembled [EVs](/wiki/Electric_vehicle).**LM**Lifting machines such as crane. i.e. (LM123456A) issued by the Ministry of Manpower.**LTA**[Land Transport Authority](/wiki/Land_Transport_Authority) enforcement officers' vehicles.**MID**[Singapore Armed Forces](/wiki/Singapore_Armed_Forces) vehicles (this is a suffix with up to five digits before it, *e.g.*, \"12345 MID\"). \"MID\" originally stood for the [Ministry of Interior and Defence](/wiki/Ministry_of_Interior_and_Defence). General ranks in the armed forces are provided with staff cars with two-digit MID plates.**MP**Vehicles operated by the [Singapore Armed Forces Military Police Command](/wiki/Singapore_Armed_Forces_Military_Police_Command). (**SAFPU** plates were formerly used)**NZ**Vehicles of New Zealand diplomats, New Zealand Defence Support Unit (NZDSU), and Installations Auxiliary Police Force (IAPF).**PU**Pulau Ubin vehicles**Q, Q_ (except QX, QY),** **QE_, QB_, QC_** Once issued to company-registered vehicles. Expenses incurred in the use of these cars were tax-deductible, though the road tax payable was twice that of a private car. After a tax rationalisation in 1998 which did away with these benefits, company cars have been issued with standard number plates ever since. The Q-prefix was used both standalone (e.g. QB 1 K) and as a prefix for, E, B and C-series plates (e.g. QEZ 6257 R, QBX 2223 K, QCK 6861 Z) **QX**Emergency and law enforcement agencies (e.g. [Singapore Police Force](/wiki/Singapore_Police_Force), [Singapore Civil Defence Force](/wiki/Singapore_Civil_Defence_Force), [Immigration and Checkpoints Authority](/wiki/Immigration_and_Checkpoints_Authority), *etc.*)**QY**Motor cars registered in the name of the Government or a Statutory Board (e.g. Land Transport Authority, Singapore Food Agency, Ministry of Transport, *etc*) registered on or before 2019-03-31. Excludes Emergency and law enforcement agencies. Vehicles registered to Government agencies on or after 2019-04-01 are now assigned plate numbers with the same registration series as private vehicles. **RD**Vehicles used for research and development, Electric and autonomous vehicles; and for other purposes that are approved by the Government to evaluate technologies**RU**Restricted use vehicles. Pushback trucks at Changi Airport, plus company vehicles at Sentosa. Previously used for Sentosa Buses. When travelling out of the restricted boundaries, such vehicles are either required to be tagged with a trade-plate or towed.**S1 - S10**State cars used for ferrying official government guests and dignitaries**SBS**Omnibuses registered under public bus operator [SBS Transit](/wiki/SBS_Transit) from 1973 until 2015-12. Some SBS-prefixed omnibuses are registered under the LTA for the Bus Service Enhancement Programme (BSEP).**S / CC**Vehicles of the Consular Corps**S / CD**Vehicles of the Diplomatic Corps**S / TE**\"Technical employment\" vehicles**SD**Municipal Government vehicles**SDC**Sentosa Buses, before it was renamed to RU plate in 1990s.**SEP**\"Singapore Elected President\" – the official state car of the [President of the Republic of Singapore](/wiki/President_of_Singapore) (SEP 1)**SJ**[Supreme Court](/wiki/Supreme_Court_of_Singapore) judges (the [Chief Justice](/wiki/Chief_Justice_of_Singapore)'s car has the plate number \"SJ 1\").**SMB**Omnibuses registered under public bus operator [SMRT Buses](/wiki/SMRT_Buses) from 2008-06 until 2016-01. Some SMB-prefixed omnibuses are registered under the LTA for the Bus Service Enhancement Programme (BSEP).**SP**[Speaker of Parliament](/wiki/List_of_Speakers_of_the_Parliament_of_Singapore) (SP 1)**SPF**[Commissioner of Police](/wiki/Commissioner_of_Police_(Singapore)), [Singapore Police Force](/wiki/Singapore_Police_Force) (SPF 1)**STC**Buses operated by [Singapore Traction Company](/wiki/Singapore_Traction_Company). (All deregistered, operations ceased since 1971).**SZ, SZ_**Older rental vehicles and chauffeur-driven private hire cars. Since the car tax rationalisation of 1998, private hire and rental cars have been issued with standard passenger vehicle prefixes. Currently SZ prefixes are used on private boats/yachts with (a suffix with up to five digits after it with checksum).**TIB**Buses operated by [SMRT Buses](/wiki/SMRT_Buses) registered prior to the merger of [Trans-Island Bus Services](/wiki/SMRT_Buses) (TIBS) and SMRT from 1983 to 2004. The last 3 buses TIB1245L, TIB1246J and TIB1247G were deregistered in January 2021.**TP**Motorcycles of the Traffic Police Department, Singapore Police Force.**TR_**Trailers. The current prefix being issued is **TRE**.**12345**Power-Assisted Bicycle (PAB) number plate for blue sealed vehicles with a maximum of 5 digits. Issue of these series of prefixes has ceased as of 2018.**_123** **_ _12**Power-Assisted Bicycle (PAB) number plate for orange sealed vehicles with a maximum of 4 alphanumerics. The first generation prefix (A - Z) was exhausted in 2021. The second generation prefix (AA - ZZ) is currently being issued.**123_ _**E-scooter number plate with a maximum of 5 alphanumerics. ### Other specific vehicle types Special prefixes were used for specific events, such as: - **ASN**: Vehicles used by VIPs and delegates during the [ASEAN Summit](/wiki/ASEAN_Summit) held in Singapore in November 2018 - **WTO**: Vehicles used during the [World Trade Organization](/wiki/World_Trade_Organization)'s [inaugural Ministerial Conference](/wiki/WTO_Ministerial_Conference_of_1996) held in Singapore in December 1996 - **IOC**: Vehicles used during the [International Olympic Committee](/wiki/International_Olympic_Committee)'s [117th Session](/wiki/117th_IOC_Session) held in Singapore in July 2005 - **NDP**: Vehicles used during the [National Day Parade, 2005](/wiki/Singapore_National_Day_Parade), on 2005-08-09 - **AIRSHOW**: Vehicles used during [Singapore Airshow](/wiki/Singapore_Airshow) - **APEC**: Vehicles used during the [APEC](/wiki/Asia-Pacific_Economic_Cooperation) Annual Meetings in November 2009. - **SIWW**: Vehicles used during [Singapore International Water Week](/wiki/Singapore_International_Water_Week) - **WCS**: Vehicles used during [World Cities Summit](/wiki/World_Cities_Summit) - **YOG**: Vehicles used during the [2010 Summer Youth Olympics](/wiki/2010_Summer_Youth_Olympics). - **SEAG**: Vehicles used during the [2015 Southeast Asian Games](/wiki/2015_Southeast_Asian_Games). - **APG**: Vehicles used during the [2015 ASEAN Para Games](/wiki/2015_ASEAN_Para_Games). - **HSBC**: Vehicles used during the events organised by HSBC ([Hongkong and Shanghai Banking Corporation](/wiki/Hongkong_and_Shanghai_Banking_Corporation)) - **HWWC**: Vehicles used during the HSBC Women's World Championship ([Hongkong and Shanghai Banking Corporation](/wiki/Hongkong_and_Shanghai_Banking_Corporation)) - **OCBC**: Vehicles used by OCBC during annual cycling event. Such as OCBC Cycle yearly - **SGP**: Vehicles used during the [Singapore Grand Prix](/wiki/Singapore_Grand_Prix). - **IMDEX**: Vehicles used during the 2017 Maritime Defence Exhibition & Conference (IMDEX Asia 2017) - **CESS**: Vehicles used during the CleanEnviro Summit. - **IW**: Vehicles used during the Interpol World. - **LIV**: Vehicles used during the LIV Golf Tournament. - **GYSS**: Vehicles used during the Global Young Scientists Summit. - **MEDIATE**: Vehicles used during the Singapore Convention on Mediation. - **SIN**: Vehicles used during the 2023 [Singapore Classic](/wiki/Singapore_Classic). They are neither used after the events nor sold for to the public, but unofficial series for cosmetic purposes. Civil Mobilisation Exercise or Vehicle Recalls have a large A3/A2 sticker stuck at the rear and front of the vehicle denoted that the vehicle is being mobilised or deployed for civil emergency exercises. These usually happen during weekends. ## Checksum The checksum letter is calculated by converting the letters into numbers, *i.e.*, where A=1 and Z=26, potentially giving seven individual numbers from each registration plate. However, only two letters of the prefix are used in the checksum. For a three-letter prefix, only the last two letters are used; for a two-letter prefix, both letters are used; for a single letter prefix, the single letter corresponds to the second position, with the first position as 0. For numerals less than four digits, additional zeroes are added in front as placeholders, for example \"1\" is \"0001\". SBS 9889 would therefore give 2, 19, 9, 8, 8 and 9 (note that \"S\" is discarded); E 12 would give 0, 5, 0, 0, 1 and 2. SG 2017 would be given as 19, 7, 2, 0, 1, 7. Each individual number is then multiplied by 6 fixed numbers (9, 4, 5, 4, 3, 2). These are added up, then divided by 19. The remainder corresponds to one of the 19 letters used (A, Z, Y, X, U, T, S, R, P, M, L, K, J, H, G, E, D, C, B), with \"A\" corresponding to a remainder of 0, \"Z\" corresponding to 1, \"Y\" corresponding to 2 and so on. In the case of SBS 9889, the final letter is a \"U\"; for E 23, the final letter should be a H. SG 2017 back letter should be a C. The letters F, I, N, O, Q, V and W are not used as checksum letters. Checksum suffix letters are not applied to special government vehicles and event vehicles. - Online Checksum Calculator ## Prefix exceptions LTA has introduced policies where certain series of licence plate prefixes are deliberately skipped for various reasons. The policies include: PlateReasons**FA_**After the exhaustion of FZ plates, these plates were skipped and the next lettering FBA starts. This is done to avoid constituting the word 'fuck' (FAK).**GA_**After the exhaustion of GZ plates, these plates were skipped and the next lettering GBA starts. Several plates are prohibited because it forms objectionable word combinations such as \"GAY\" (resembles spelling of 'gay').**SA_**The SA sequence was never issued (the S-sequence in 1984 started with SBA), because the [West Coast Division](/wiki/West_Coast_Division) of [Sabah](/wiki/Sabah) state in [Malaysia](/wiki/Malaysia) has been using the SA sequence.**SE_**Several plates are prohibited because it forms objectionable word combinations such as \"SEE\" (resembles spelling of 'see'), \"SEL\" (resembles spelling of the word 'sell'), \"SEX\" (resembles spelling of '[sex](/wiki/Sex)'), \"SEY\" (resembles spelling of 'say'). When the SDZ series was exhausted, the next plates issued was the SFA.**SHE**SHE also forms a meaningful word (she), so it's skipped despite the middle letter being a consonant.**SHY**It forms a meaningful word (shy).**SI_**Several plates are prohibited because it forms objectionable word combinations such as \"SIA\" (resembles [Singapore Airlines](/wiki/Singapore_Airlines)), \"SIN\" (resembles abbreviation of [Singapore](/wiki/Singapore) as well as 'sin' the word). \"I\" and \"O\" are not used to avoid confusion with \"1\" and \"0\". When the SGZ series was exhausted, the next plates issued was the SJA since SH_ is used for taxis.**SKY**It forms a meaningful word ([sky](/wiki/Sky)).**SLY**It forms a meaningful word ([Sly](/wiki/Sly_(disambiguation))).**SO***LTA announced that it had adopted the policy of not issuing series with vowels in the middle of the three-letter prefixes. \"I\" and \"O\" are not used to avoid confusion with \"1\" and \"0\". When the SNZ plates was exhausted, the next plates issued was the SPB.**SPA**It forms a meaningful word ([Spa](/wiki/Spa)).**SPY**It forms a meaningful word ([Spy](/wiki/Spy)).**SU_**Several plates are prohibited because it forms objectionable word combinations such as \"SUX\" (resembles spelling of 'sucks'). In the future, once the STZ series is exhausted, the next plates issued was the SVA.**WA_**After the exhaustion of WZ plates, these plates were skipped and the next lettering WBA starts. Several plates are prohibited because it forms a meaningful and objectionable words such as \"WAR\" ([war](/wiki/War)), \"WAS\" ([Was](/wiki/Was_(disambiguation))) and \"WAY\" ([Way](/wiki/Way_(disambiguation))).**WE**It forms a meaningful word ([We](/wiki/We)).**WP**This plate is prohibited because it leads to the term [Workers' Party](/wiki/Workers%27_Party_of_Singapore). ## Personalised registrations To date, [vanity plates](/wiki/Vanity_plate) or such a scheme has not been introduced, as it would understandably bear similarities with neighbouring Malaysian plates. Also, it would further encourage more private vehicles to be bought and registered with vanity plates as personal choice, which contradicts the efforts by the state in discouraging the usage of private vehicles. With the limitation in having vanity plates, some owners have opted to have personalised text on their number plate frames instead. For now, there is a thriving trade in the sales of number plates that have single, double or significant digits (*i.e.*, [lucky numbers](/wiki/Luck#Numerology) and or repetitive recurring digits) with registration numbers from the older series and increased popularity in retention of older registration numbers of certain significance. Bids for vehicle registration numbers starts at S$1,000, with the number awarded to the highest bidder, for new series of prefix available for bidding that lasts between 3 and 4 weeks. The highest amount recorded for a bid was in 2016, where the registration number of '**S32H'** was sold for S$335,000. ## Other schemes & miscellaneous ### Off-peak vehicles Vehicles registered as \"Off-peak Vehicles\", colloquially known as \"weekend cars\" or red plate, pay a cheaper annual road tax compared to ordinary private cars, and rebates towards the registration of [Certificate of Entitlement](/wiki/Certificate_of_Entitlement) (COE) and Additional Registration Fee (ARF) on a new vehicle purchase. Off-peak vehicles display number plates with white characters on a red background and are held with a tamper seal at the corner, bolted onto the bumper beam frame or the trunk itself. They are also not to be confused with the preserved vehicle licence plate format for de-registered vehicles. These vehicles are only allowed to run on the roads in Singapore after peak hours (7:00 pm – 7:00 am) on weekdays, and the whole day on Saturday (Revised OPC scheme allows on whole Saturday, non-revised old OPC scheme vehicles must adhered to the old scheme restriction which is 7:00 am – 3:00 pm on Saturday), Sunday and public holidays. The restrictions do not apply if the vehicle is not in Singapore and is in Malaysia during restricted hours. For owners of off-peak vehicles who wish to drive on weekdays during restricted hours, they are required to buy an e-licence for $20 either online or through major post offices. Car owners have up to 24 hours on the following day to purchase the e-licence. First-time offenders may be fined up to $5,000 for failing to display a valid day coupon or using an invalid day coupon, and up to $10,000 for using an altered day coupon when their vehicles are used during the restricted hours. Off-peak vehicles pay a relatively lower road tax (a discount of up to $500) as compared to other private vehicles, and are also given rebate of $17,000 which can be offset against the COE and ARF. Once seen as an alternative for motorists to use on selected days, a majority of people in Singapore do not use off-peak vehicles in today's trends due to its restrictions on day usage. Similarly, due to rising vehicle ownership costs as an alternative, they are not beneficial financially beyond COE expiry and COE renewal and for cars above 1600cc. Off-peak vehicles are popular among cars below 1600cc due to lower road tax rebates. ### Vintage and Classic vehicles Vehicles registered under the Classic Vehicle Scheme, Vintage (Restricted) Vehicle Scheme, and the Revised Vintage Vehicle Scheme bear the Vintage and Classic vehicle registration plate, which has an ordinary registration number but with white lettering on a half-red, half-yellow background, with a seal affixed on the number plate by an authorised inspection centre. According to [Land Transport Authority](/wiki/Land_Transport_Authority) (LTA) guidelines, classic vehicles are required to be of at least 35 years of age, while vintage vehicles must be manufactured in 1939 or earlier. Under the Classic Vehicle Scheme and the Revised Vintage Vehicle Scheme, the maximum allowable road usage for these vehicles is limited to 45 days per year, while vehicles registered under the Vintage (Restricted) Vehicle Scheme are limited to 28 days of annual road usage. Owners of these vehicles are required to display a valid Day License every time they use their vehicle. These vehicles enjoy rebates on road tax and the registration of [Certificate of Entitlement](/wiki/Certificate_of_Entitlement) (COE). However, they cannot be converted to other vehicle registration schemes and are required to pay [ERP](/wiki/Electronic_Road_Pricing). ### Other categories A \"Restricted Use\" vehicle displays a registration plate with white letters on a diagonally bisected background, the upper half of which is red and the lower half emerald green. The two lead characters of the plate are \"RU\". \"Hazardous Cargo\" plates were introduced in 2005, using normal commercial vehicle registrations, often in the 'Y' code, but with, unusually, black figures on a reflective orange background. These trucks are permitted to carry fuel, gas canisters and chemicals (flammables), and are not permitted to enter both tunnels and city areas unless route arrangements have been made in advance with the [fire services](/wiki/Singapore_Civil_Defence_Force). Malaysian lorries are also required to have a separate HAZMAT orange licence plate affixed to both the trailer and wagon (tow head). Such vehicles are subject to the same rules as Singapore-registered hazardous cargo vehicles. \"Research and Development\" vehicles display a half-yellow, half-blue plate with the prefix \"RD\". Motor dealers and traders use white on blue plates using the suffix \"S\", preceded by up to four numerals for their test drive vehicles. Driving instructors teaching students in Singapore must display an \"L\" (\"learner\") plate beside their [vehicle registration plates](/wiki/Vehicle_registration_plates) on both the front and back of the vehicle. ### Similarities with Malaysian plates Potential conflicts with Malaysian vehicle registration number schemes, but all foreign vehicles must have Autopass Card in the vehicle. Singaporean registration plate formats having similarities with Malaysian registration plate formatsAlgorithm (Singapore)Algorithm (Malaysia)**A_ #### _** (Motorcycles registered prior to mid-1980s)**A_ ####** (Perak) **A #### A** (Commemorative Series)**CB #### _** (School buses)**CB ####** (Pahang)**E_ #### _** (1972-1984 Private vehicles series)**E_ _ ####** (Pre-1980s Sabah) **EV ####** (Electric Vehicles) **F_ #### _** (Motorcycles)**F_ ####** (Putrajaya)**G_ #### _** (Light Goods vehicles pre-2006)**G ####** / **GG ####**/ **GM ####** / **G ### G**(Commemorative Series)**MP ##** (Military Police motorcycles)**MP ####** (Malacca)**P_ #### _** (Private Buses using formats PA, PC, PD, PH; Pulau Ubin vehicles using PU)**P_ ####** (Penang)**Q/Q_/Q_ _ #### _** (Pre-1998 company vehicles, private ambulances, except government vehicles with QX and QY prefixes)**Q/Q_/Q_ _ ####** **Q/Q_/Q_ _ #### _** (Sarawak) **RD/RU #### _** (Restricted Use vehicles and Research and Development vehicles)**R_ ####** (Perlis)**SG #### _** (Public buses after 2016)**SG ####** (Sabah & Sarawak Government)**SJ ####** / **SJ_ #### _** (Supreme Court Justice vehicles and 2007-2010 Private vehicles)**SJ_ ####** (West Coast, Sabah)**SM_ #### _** (2018-2021 Private vehicles and public buses using SMB prefixes)**SM_ ####** (Sandakan, Sabah)**SP_ #### y** (2025-Present Private vehicles and Singapore Police Force)**SP_ ####** (Lahad Datu, Sabah)**S_ _ #### _** (Private vehicles, pre-1969 and 1984–present formats and public buses using SBS prefixes)[a]**S_ _ #### _** (Sabah divisions with extended series)**TP #### _** (Traffic Police motorcycles)**TP ####** (Terengganu)**W_ #### _** (Engineering plant vehicles and Land Rovers & Jeeps)**W_ ####** / **W_ #### _** (Kuala Lumpur first series including extended)**X_ #### _** (Very Heavy Goods vehicles)**XX ####** (Commemorative series)**Y_ #### _** (Heavy Goods vehicles)**Y_ ####** (Commemorative series) - Land Transport Authority - Singapore Market Place for Car plate Numbers - Age of Singapore Car plate\n",
  "language": "en",
  "processed_at": "2026-01-12T12:12:34.741114",
  "title": "Vehicle registration plates of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Vehicle_registration_plates_of_Singapore"
}