{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:12:43.020438"
  },
  "content": "Performing arts centre in Singapore The **Victoria Theatre and Concert Hall** is a [performing arts centre](/wiki/Performing_arts_centre) in the [Central Area](/wiki/Central_Area,_Singapore) of [Singapore](/wiki/Singapore), situated along Empress Place. It is a complex of two buildings and a [clock tower](/wiki/Clock_tower) joined together by a common corridor; the oldest part of the building was first built in 1862, and the complex was completed in 1909. The complex has undergone a number of renovations and refurbishment, mostly recently in 2010 when the complex was closed for a four-year renovation project. It reopened on 15 July 2014. The buildings in the complex have been used for a number of purposes, such as public events, political meetings, exhibitions, musical and stage performances, and for a brief period as a hospital. The concert hall is used as a performance venue by the [Singapore Symphony Orchestra](/wiki/Singapore_Symphony_Orchestra) (SSO), and the complex is managed by Arts House Limited. The Victoria Theatre and Concert Hall was gazetted as a [national monument](/wiki/National_monuments_of_Singapore) on 14 February 1992. ## History The Victoria Theatre and Concert Hall first began as the Town Hall in 1862. In the early 1900s, a second public hall was built next to it joined by a clock tower to form a larger complex. ### Town Hall origin The Town Hall was originally built to replace the older Assembly Rooms, where local operas and dramas were held but had fallen into disrepair. The foundation stone was laid in 1855, and the building completed in 1862. The building was designed by the Municipal Engineer, John Bennett. It was built during an era of [Victorian Revivalism](/wiki/Victorian_architecture) that was then popular in Britain, and its design therefore reflected this architectural style with Italianate windows, and it was the first such building in Singapore built in this style. The completed town hall originally housed a theatre on the ground floor as well as meeting rooms and offices of various government agencies on the second floor. It also housed the Singapore Library from 1862 to 1876. However, the increase in population resulted in higher demand for entertainment, and the town hall was unable to cope with increasing demand for the use of the building for both entertainment and as administrative purposes, thus by 1893, the offices was moved out of the building. ### Construction of Victoria Concert Hall In 1901, it was decided that a public hall would be built in memory of [Queen Victoria](/wiki/Victoria_of_the_United_Kingdom) who died that year. Public funds for its construction amounting to $368,000 were collected, exceeding the construction costs, thus leaving a surplus of $22,000 for the renovation of the town hall so that it blended in with the new hall. The foundation stone was laid on the occasion of [King Edward VII](/wiki/King_Edward_VII)'s coronation celebration on 10 August 1902, and the new building was built between 1903 and 1905 next to the Town Hall. The plan of the memorial hall was initially drawn up by Major Alexander Murray and the Public Works Department, which included the reconstruction of the front elevation of the old town hall on similar lines to the facade of the new memorial hall, which was later modified by [R. A. J. Bidwell](/wiki/R._A._J._Bidwell) of [Swan and Maclaren](/wiki/Swan_and_Maclaren). The new layout of the hall consisted of a stage, stalls and pit on the ground floor and dress circle, promenade and a gallery on top of the foyer. ### Construction of Clock Tower and renovation of Town Hall The two buildings, the town hall and the Victoria Memorial Hall, were joined together by a clock tower built in 1906 to give the impression of a single building. The 54 metre-high tower connects the two buildings with a common corridor, and is topped by a timepiece donated by the Straits Trading Company. The tower is built on an axial line with the Anderson Bridge nearby. Renovation of the Town Hall began in July 1906. A portico was created on the town hall mirroring that of the new Memorial Hall, thereby creating a unified appearance. The construction of the signature clock tower was delayed due to delays in the donation of the clock and chimes by the Straits Trading Company. The clock, four metres wide, weighs 1 tonne and cost $6,000. Its dial faces look in four directions, and there is a bell turret above it, capped by a cupola. ### Opening The Victoria Memorial Hall was officially opened by the Governor of the Straits Settlements, Sir [John Anderson](/wiki/John_Anderson_(colonial_administrator)), on 18 October 1905. The renovated Town Hall was reopened on 11 February 1909. *[The Pirates of Penzance](/wiki/The_Pirates_of_Penzance)* was the first performance to be staged in the renovated building when it reopened. The town hall was renamed Victoria Theatre. On 6 February 1919, the centenary of Singapore's founding, a statue of Stamford Raffles by T. Woolner was moved from [the Padang](/wiki/Padang,_Singapore) to the front of the Memorial Hall. The statue was complemented with a new semicircular colonnade and a pool. ### Historical events and uses In World War II, the memorial hall was used as a hospital for victims of bombing raids by Japanese forces during the Battle of Singapore before their successful occupation of the colony. During the occupation, the buildings themselves escaped major physical damage, although the colonnade was destroyed and Raffles's statue moved to the National Museum. The statue was returned to its original site in 1946. In that year [Seven Keys to Baldpate](/wiki/Seven_Keys_to_Baldpate_(play)) was staged, which was [Kenneth Williams](/wiki/Kenneth_Williams)' début. In 1947 the Straits Settlements coat of arms that was hung on the tympanum of both wings of the building was replaced by the newly formed coat of arms of the Crown Colony of Singapore. It was brought down in 1959 to make a plaster cast of the coat of arms of Singapore, which was topped off with two flagpoles with the flag of Singapore on them. A number of significant civic as well as historical events were held on the premises. The Memorial Hall was the venue for Japanese war crimes trials from 1946 to 1947. From 1948 onward, the Hall was used during elections as the centre for the briefing of election officials and the counting of ballot papers. On 21 November 1954, it was the venue of the [People's Action Party](/wiki/People%27s_Action_Party)'s founding. Two public meetings of the [Rendel Commission](/wiki/Rendel_Commission) were held 1953 and 1955 in the hall to review the Constitution of the Colony of Singapore in preparation for its independence. On 15 February 1963, Singapore's pilot television broadcasting service, [Television Singapura](/wiki/Television_Singapura), was launched here. The town hall underwent major renovation between 1952 and 1958, and it was also internally restructured to allow air-conditioning and soundproofing to be installed. Singapore's national song, “Majulah Singapura “, was performed for the first time at Victoria Theatre in 1958 after the major renovations. In 1979, the Memorial Hall was renovated again to accommodate the Singapore Symphony Orchestra (SSO), at which time it was renamed the Victoria Concert Hall. Additional works up to the 1980s added a gallery to the Concert Hall, increasing seating capacity and enclosing the second storey balconies on the front and back facades with glass. ### Refurbishment (2010–2014) In June 2010, Victoria Theatre and Concert Hall were closed for major renovations. The S$180-million refurbishment was undertaken by W Architects, and Rider Levett Bucknall (RLB) Singapore as the project manager and quantity surveyor, with Architectural Restoration Consultants Pte Ltd (ARC) as its conservator and Arup Singapore Pte Ltd as acoustician and theatre planner. The refurbishment repaired and updated the buildings to meet contemporary standards. The façade of the buildings is retained, and some elements belonging to the original 1905 structure restored. This includes reinstating the central passageway between the theatre and the concert hall, which leads to the Arts House. New spaces were created to accommodate building services and for commercial rental and amenities like a café. While the significant interior features of the concert hall were retained, most of the theatre (save the façade) was completely demolished during the renovations. The building now has extra new spaces for the public, performers and support crew. The theatre has new changing rooms and a loading bay, while the central atrium has been opened up and has become an additional area for hosting arts activities. The roof level of the theatre was raised to match that of the concert hall, and the extra space under the roof houses a new dance studio. But having new spaces means some sacrifices were necessary. For instance, the theatre now seats fewer people – about 600 from some 900 before – to free up space in what is now the atrium. The concert hall's balcony was also made smaller and higher, so that acoustics are not compromised for those sitting below. ## Facilities (1990s–2010s) The Victoria Theatre had a seating capacity of 904, reduced to 614 after its refurbishment. The Victoria Concert Hall also had a higher capacity of 883 seats originally, but is now reduced to 673, as an unsightly and intrusive balcony inserted during an earlier renovation was removed. Prior to its refurbishment, the theatre had a stage of 167.28 square metres in size, and the concert hall a stage that could be expanded up to 139.76 square metres. The concert hall was considered the venue with the best acoustics in the city, and was the main performance venue for the SSO until the completion of the [Esplanade - Theatres on the Bay](/wiki/Esplanade_-_Theatres_on_the_Bay) in 2002 when the orchestra moved its home base to take advantage of superior acoustics and facilities brought about by technological and architectural advances over the years. - Official website of Victoria Theatre and Concert Hall - Singapore infopedia - \"Victoria Theatre and Concert Hall\". *National Heritage Board*. Archived from the original on 22 December 2015. Retrieved 18 December 2015.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:12:43.020125",
  "title": "Victoria Theatre and Concert Hall",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Victoria_Theatre_and_Concert_Hall"
}