{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:12:44.967781"
  },
  "content": "Ethnic group **Vietnamese people in Singapore** are about 0.3% of the country's population, with about 15,000 residents at least in presence. The Vietnamese community of Singapore largely includes food and restaurant servicepeople, and school/university students. Initial waves of Vietnamese immigrants and migrants were mainly [refugees](/wiki/Vietnamese_boat_people) fleeing the [collapse](/wiki/Fall_of_Saigon) of [South Vietnam](/wiki/South_Vietnam), in the aftermath of the [Vietnam War](/wiki/Vietnam_War)'s conclusion in 1975. ## Refugee migration During the [Vietnam War](/wiki/Vietnam_War), Singapore became one of the main transit points for [Vietnamese refugees](/wiki/Indochina_refugee_crisis), hosting 32,457 Vietnamese refugees from 1978 to 1996 alone. 5,000 settled during the first set of waves throughout the late 1970s. Despite this, the Government of Singapore refused to accept refugees, resulting in a policy code-named [Operation Thunderstorm](/wiki/Operation_Thunderstorm). In 1996, the country's only refugee camp (located in Hawkins Road [Sembawang](/wiki/Sembawang)), a former [military barracks](/wiki/Military_barracks) outpost, was closed by authorities after two decades of running, and the refugees repatriated to Vietnam at the request of the [UNHCR](/wiki/UNHCR). Prior to significant waves of immigration or refugee migration in the late 1970s, there was an attempt of singular mass migration via plane holding [South Vietnamese](/wiki/South_Vietnam) refugees in 1975. On April 4, a [C-130](/wiki/C-130) transport plane was commandeered by four [South Vietnam Air Force](/wiki/South_Vietnam_Air_Force) majors and 52 Vietnamese refugees. The plane was flown from South Vietnam to Singapore, where the pilots requested permission to land, claiming that they were off-course and running low on fuel. Singaporean authorities impounded the plane, and arrested its passengers as illegal immigrants pending repatriation. ## Community and organizations The Vietnamese community in Singapore is supported by several key organizations. For business and trade, the Vietnam Chamber of Commerce in Singapore promotes bilateral economic ties and provides a network for Vietnamese enterprises. Social and cultural integration is primarily facilitated by the Vietnamese Association in Singapore (VAS), which organizes community events and offers support to Vietnamese residents. ## Notable people - [Tila Tequila](/wiki/Tila_Tequila) (born Nguyễn Thị Thiên Thanh, or Tila Nguyễn), actress/model, born in Singapore and grew up in Texas - Vietnam portal - Singapore portal - [Singapore–Vietnam relations](/wiki/Singapore%E2%80%93Vietnam_relations) - [Vietnamese diaspora](/wiki/Vietnamese_diaspora) - [Ethnic groups in Singapore](/wiki/Ethnic_groups_in_Singapore) Portals: - Vietnam - Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T12:12:44.967469",
  "title": "Vietnamese people in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Vietnamese_people_in_Singapore"
}