{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:12:48.965346"
  },
  "content": "Vietnamese automotive companyYou can help **expand this article with text translated from the corresponding article in Vietnamese**. *(June 2019)* Click [show] for important translation instructions. - View a machine-translated version of the Vietnamese article. - Machine translation, like DeepL or Google Translate, is a useful starting point for translations, but translators must revise errors as necessary and confirm that the translation is accurate, rather than simply copy-pasting machine-translated text into the English Wikipedia. - Do not translate text that appears unreliable or low-quality. If possible, verify the text with references provided in the foreign-language article. - You **must** provide copyright attribution in the edit summary accompanying your translation by providing an interlanguage link to the source of your translation. A model attribution edit summary is `Content in this edit is translated from the existing Vietnamese Wikipedia article at [[:vi:VinFast]]; see its history for attribution.` - You may also add the template `{{Translated|vi|VinFast}}` to the talk page. - For more guidance, see Wikipedia:Translation. **VinFast Auto Ltd.** is a Vietnamese [multinational](/wiki/Multinational_corporation) [automotive](/wiki/Automotive_industry) company founded by [Vingroup](/wiki/Vingroup), one of the largest private conglomerates in [Vietnam](/wiki/Vietnam) that was founded by [Pham Nhat Vuong](/wiki/Pham_Nhat_Vuong). Established in 2017 in [Haiphong](/wiki/H%E1%BA%A3i_Ph%C3%B2ng), it is the first Vietnamese car brand to expand into global markets as well as the first to expand into producing [electric vehicles](/wiki/Electric_vehicle) (EV) such as [electric cars](/wiki/Electric_car) and [electric scooters](/wiki/Electric_motorcycles_and_scooters). ## History VinFast was founded in 2017 by Vingroup. VinFast broke ground in September 2017 on an 828-acre (3,350,000 m2) facility in an industrial park located on [Cat Hai Island](/wiki/C%C3%A1t_H%E1%BA%A3i_District) near the city of [Hai Phong](/wiki/Hai_Phong). The factory includes a paint shop, press shop, assembly shop, and engine shop; it was built in 21 months. During the launch of the first phase of development in 2018, the company reported an initial investment of US$1.5 billion to manufacture cars and electric motorbikes at a greenfield factory. The company claimed that it has aggregated talent from multiple established companies and is sourcing European design, engineering, and production technology partners. The first two vehicles that were shown at Paris motorshow in the fall of 2018 are the LUX A2.0 and the LUX SA 2.0, designed by Pininfarina and Italdesign Giugiaro. Previously, in July 2017, all the designs of VinFast's first cars were posted on the website and VinFast asked Vietnamese consumers to vote for which design they liked the most. There were more than 60,000 votes for 20 sketches from four of the world's best auto design studios - Italdesign Giugiaro, Pininfarina, [Torino Design](/wiki/Studiotorino) and [Zagato](/wiki/Zagato). Lux A2.0 and Lux SA 2.0 are the results of the vote. In 2018, [General Motors](/wiki/General_Motors) announced its partnership between the company and VinFast. VinFast will have exclusive rights to distribute the [Chevrolet](/wiki/Chevrolet) brand in Vietnam and will take ownership of the existing [General Motors](/wiki/General_Motors) (GM Korea) factory in Hanoi (VIDAMCO). That factory will then build a GM-licensed \"all-new global small car\" to be sold under the VinFast name. VinFast signed two contracts with Siemens Vietnam, a unit of [Siemens](/wiki/Siemens), for the supply of technology and components to manufacture electric buses in [Southeast Asian](/wiki/Southeast_Asia) countries in August 2018. On 21 March 2019, it sent the first batch of 155 VinFast Lux cars, 113 completed vehicles and 42 semi-finished cars, abroad in Europe, Asia, Australia and Africa to conduct field tests for quality testing and to qualify for a 5-star ASEAN NCAP rating. The company was to have been the title sponsor of the inaugural edition of the [Formula One](/wiki/Formula_One) [Vietnamese Grand Prix](/wiki/Vietnamese_Grand_Prix), which was slated to take place during the (/wiki/2020_Formula_One_World_Championship) season; the race was subsequently cancelled due to [COVID-19 pandemic](/wiki/COVID-19_pandemic). In Q1 2020, VinFast was the fifth best-selling car brand in Vietnam. On 25 February 2020, it was reported that VinFast vehicles were spotted in [South Africa](/wiki/South_Africa) for field tests at Kakamas in the Northern [Cape Province](/wiki/Cape_Province) and in [Cape Town](/wiki/Cape_Town). On September 20, the company announced a loss of VND 6.6 trillion ($284 million) in the first half of the year. In December 2020, VinFast released preliminary images of a pickup truck being developed weeks after the Lang Lang testing centre was purchased. Other vehicles in development included a three-door hatchback, two different coupe-type SUVs, a small SUV, a four-door sedan, a couple of people movers and electric scooters. According to the Intellectual Property Office of Vietnam, the patents for these vehicles are set to expire on 14 January 2024. On 27 July 2021, parent Vingroup announced that [Michael Lohscheller](/wiki/Michael_Lohscheller), the CEO of [Opel](/wiki/Opel), had been appointed CEO of VinFast Global. Five months later, on December 27, it was announced that Lohscheller had resigned the position. On 30 September 2021, VinFast reported that [Cerence](/wiki/Cerence) software would be used for its electric vehicles as an intelligence voice assistant. On 25 December, it delivered the first batch of 100 VF e34 electric crossovers to Vietnamese customers at VinFast's manufacturing complex in Hai Phong. The VF e34 marks VinFast's first EV model and the first ever electric vehicle to be manufactured and sold in Vietnam. According to *[Reuters](/wiki/Reuters)*, VinFast had only made 7,400 car sales in 2022, all of which occurred in Vietnam. The company however has set itself a target of 50,000 car sales globally for 2023. They missed the goal but delivered close to 35,000 electric cars in 2023. Their Chairwoman, Le Thi Thu Thuy, projected sales of 40,000–50,000 vehicles in 2024. On 6 January 2022, reports emerged that VinFast plans to build new EV plants in Germany and the United States as part of the company's plans to retire production of gas-powered vehicles and transition fully to EVs by late 2022. In November 2024, Vingroup JSC, the parent company for VinFast, pledged to loan VinFast as much as $1.38 billion to help the company break even by the end of 2026. Pham Nhat Vuong also pledged an additional $1.97 billion, according to a company statement. ### Move to Singapore, efforts to go public VinFast appeared to making its first efforts to become a [public company](/wiki/Public_company) in early 2021. Sources told Reuters that the automaker planned to merge with a [special-purpose acquisition company](/wiki/Special-purpose_acquisition_company) (SPAC) in the United States. On 28 May 2021, the plan was put on hold due to SPAC scrutiny. VinFast announced on 7 April 2022 that it planned an initial public offering (IPO) through a Singapore-based holding company. A few weeks later on 24 May 2022, VinFast announced that it would be moving its headquarters to [Singapore](/wiki/Singapore), with the company stating that \"We feel that Singapore is a jurisdiction that will give investors more confidence.\" Singapore will be its legal and financial headquarters while Vietnam remains its operational headquarters. However, at the same time, the company said it would again put its plans to go public on hold. VinFast announced in July 2023 that it was planning to merge with a SPAC operated by Black Spade Capital. The move allows the company to avoid the process of issuing an IPO. The transaction, valued at $23 billion, was completed on 14 August 2023, and the company finally went public on the US-based [Nasdaq](/wiki/Nasdaq) exchange on 15 August 2023. ### Overseas operations On 31 July 2018, VinFast GmbH was established in Frankfurt, Germany. The office is in charge of distributing auto parts and other related services. On the same day it was announced that VinFast would set up branch offices in Shanghai, China, and Seoul, South Korea. In February 2020, ex-[Holden](/wiki/Holden) engineers were being recruited by VinFast in [Port Melbourne](/wiki/Port_Melbourne), making Australia the second overseas country to have a branch after the company moved in December 2019. The branch, known as VinFast Engineering Australia, is staffed by ex-[Ford](/wiki/Ford_Australia), Holden and [Toyota](/wiki/Toyota_Australia) employees and opened on 12 June 2020. On 6 May 2021, the Port Melbourne office was announced to be closed due to the COVID-19 pandemic temporarily. The [Lang Lang test track](/wiki/Lang_Lang_Proving_Ground) appeared to be unaffected by the closure, but on October that year, VinFast announced the sale of the proving ground, although it has not found a buyer as of 2024. On 29 March 2022, VinFast announced it would locate its first North American auto plant in [Chatham County, North Carolina](/wiki/Chatham_County,_North_Carolina). The auto manufacturer will create 7,500 jobs. In July 2023, the company broke ground at its electric vehicle manufacturing site, located within the Triangle Innovation Point in Chatham County, North Carolina. ### Export plans In April 2019, VinFast reported that the Lux SA2.0 and Sedan Lux A2.0 were the first two models introduced to Russia at the end of 2018. According to *Auto.Vesti*, the models are expected to be sold throughout Russia by the end of 2020. Vuong mentioned that electric vehicles will be sold in the country after 2021. In December 2019, it was announced that VinFast had plans to market electric vehicles to the United States by 2021. Exactly one year later, the company did not mention dates when reporting that it intended to sell its vehicles in Australia. On 22 January 2021, VinFast unveiled three finalized designs of their electric SUV models VF31, VF32, VF33 intended for the US, Canada, Germany, France and the Netherlands export markets, of which, VF32 and VF33 are available in both gasoline and electric engine versions. These vehicles are stated to meet the NHTSA, Euro NCAP and ASEAN NCAP 5 star-ratings and feature self-driving capabilities thanks to a suite of electronic driver-assist features. In July 2021, VinFast appointed Michael Lohscheller, who previously worked as an executive of [Volkswagen America](/wiki/Volkswagen_Group_of_America) and as CEO of Opel, to lead its overseas operations. The VF31 was later rebranded as [VF e34](/wiki/VinFast_VF_e34) and became available in Europe in November. On 16 November 2022, the first VinFast showroom opened in Toronto at the Yorkdale Shopping Centre. In the same year, the company had chosen Santa Monica as one of two locations to promote its vehicles in California. VinFast plans to expand in seven more markets in Asia, including [Indonesia](/wiki/Indonesia), where the company aims to start deliveries from 2024. In January 2024, VinFast announced plans to enter the Philippine market. Three dealerships were opened in the country and the electric SUVs VF3, VF5 and VF7 were launched in September and October 2024, respectively. ### In the media In August 2023, and in tandem with their NASDAQ listing, VinFast launched an ad campaign for their [VF 8](/wiki/VinFast_VF_8) and US debut featuring [Joey Lawrence](/wiki/Joey_Lawrence), reviving his catchphrase, \"Whoa!\", from the hit TV series *[Blossom](/wiki/Blossom_(American_TV_series))* on [NBC](/wiki/NBC) that amassed a million views on [YouTube](/wiki/YouTube) in under a week, produced by production company Anaheim Studios. Four million views and four months later, VinFast released a second installment of the Whoa commercial, in which Joey Lawrence reprised his starring role, in December of the same year. ### India operations In February 2024, VinFast officially broke ground on its first integrated electric vehicle (EV) manufacturing facility in India, located in [Thoothukudi](/wiki/Thoothukudi) (also known as Tuticorin), [Tamil Nadu](/wiki/Tamil_Nadu). The project, spanning 400 acres within the State Industries Promotion Corporation of Tamil Nadu (SIPCOT) industrial estate, represents a planned investment of up to US$2 billion, with an initial commitment of US$500 million over the first five years. The plant is designed to have an annual production capacity of up to 150,000 vehicles and is expected to generate approximately 3,000–3,500 local jobs. The Thoothukudi facility is scheduled to commence operations by the end of June 2025. Initially, the plant will focus on assembling vehicles using completely knocked down (CKD) kits, with a starting capacity of 50,000 units per year, scalable up to 150,000 units based on market demand. In January 2025, VinFast presented its first electric vehicles for the Indian market—the VF 6 and VF 7—at the Bharat Mobility Global Expo in New Delhi. Designed for right-hand drive configurations, these models are part of VinFast's approach to address the increasing demand for premium electric SUVs in India. In addition to vehicle production, VinFast intends to create a comprehensive EV ecosystem in India, which will include battery manufacturing and charging infrastructure. The company is also considering the establishment of a second EV and battery manufacturing facility in Andhra Pradesh, with an investment proposal of around ₹4,000 crore (US$480 million). Tamil Nadu is recognized as a key hub for automobile manufacturing in India, featuring significant automotive clusters in cities such as Chennai, Krishnagiri, and Coimbatore. The establishment of VinFast’s facility in Thoothukudi represents the development of the state's fourth major auto cluster, reinforcing Tamil Nadu's role in the automotive industry. ## Etymology The name **VinFast** is an abbreviation of [Vietnamese words](/wiki/Vietnamese_language): - ***Vi**ệt **N**am* (*Vietnam*) - ***Ph**ong cách* (*Style*, spelled Ph as F) - ***A**n toàn* (*Safety*) - ***S**áng tạo* (*Creativity*) - ***T**iên phong* (*Pioneer*) ## Corporate Leadership *Current* - Lê Thị Thu Thủy (Chairwoman since 2017) - [Phạm Nhật Vượng](/wiki/Ph%E1%BA%A1m_Nh%E1%BA%ADt_V%C6%B0%E1%BB%A3ng) (Chief Executive Officer since January 2024) ### Previous Chief Executive Officers - James DeLuca (2017–2021) - [Michael Lohscheller](/wiki/Michael_Lohscheller) (2021) - Lê Thị Thu Thủy (2021–2024) ## Products ### Automobiles VinFast announced their first two models, the LUX A2.0 and the LUX SA2.0, at the [2018 Paris Motor Show](/wiki/2018_Paris_Motor_Show). Both models are based on previous generation BMW products with various changes and enhancements, including the extensive redesign of the chassis to meet future international safety standards. Both will come in rear-wheel drive and all wheel drive, and both will be powered by the licensed [BMW N20](/wiki/BMW_N20) turbocharged petrol engine in 175 bhp and 227 bhp options. Comprehensive reliability and safety testings have been completed. Production of both models started in 2019. In January 2022, VinFast announced it will put an end to the production of its internal combustion engine (ICE) vehicles lineup by the end of 2022. The company will instead focus research and development efforts on [battery electric vehicles](/wiki/Battery_electric_vehicle). VF8 is the first American market model for the company. In October 2024, VinFast also launched its brand in Dubai. Collectively, in the first 48 hours of being able to sell electric automobiles,[*when?*] more than 24,000 orders[*clarification needed*] were placed, with 15,237 placed for the VF8 and 9,071 for the VF9. #### Internal combustion engine vehicles - [VinFast LUX A2.0](/wiki/VinFast_LUX_A2.0) – [executive sedan](/wiki/Executive_car), based on the [F10 BMW 5 Series](/wiki/BMW_5_Series_(F10)). - [VinFast LUX SA2.0](/wiki/VinFast_LUX_SA2.0) – [mid-size](/wiki/Mid-size_car) [luxury](/wiki/Luxury_vehicle) [crossover](/wiki/Crossover_(automobile)), based on the [F15 BMW X5](/wiki/BMW_X5_(F15)). - [VinFast President](/wiki/VinFast_President) – V8 version of the LUX SA2.0 with additional luxury features. - [VinFast Fadil](/wiki/VinFast_Fadil) – [city car](/wiki/City_car) manufactured under license with General Motors as a rebadged variant of the [Opel Karl](/wiki/Opel_Karl). #### Battery electric automobiles - [VinFast Nerio Green](/wiki/VinFast_VF_e34) (formerly known as VF e34) - [B-segment](/wiki/B-segment) (subcompact) SUV for the Vietnam market. The company's first EV offering. Deliveries began in December 2021. - [VinFast VF 3](/wiki/VinFast_VF_3) - Mini car designed for the Vietnam market. Two-door vehicle with seating for five. Deliveries began in August 2024. - [VinFast VF 5](/wiki/VinFast_VF_5) - [A-segment](/wiki/A-segment) (city car) SUV for the Vietnam market. Deliveries began in 2023. - [VinFast VF 6](/wiki/VinFast_VF_6) - [B-segment](/wiki/B-segment) (sub-compact) SUV for the global market. Deliveries expected to begin in 2023. - [VinFast VF 7](/wiki/VinFast_VF_7) - [C-segment](/wiki/C-segment) (compact) SUV for the global market. Deliveries began in March 2024. - [VinFast VF 8](/wiki/VinFast_VF_8) (formerly known as VF32 and VF e35) – [D-segment](/wiki/D-segment) (mid-size) SUV for the global market. Deliveries began in 2022. - [VinFast VF 9](/wiki/VinFast_VF_9) (formerly known as VF33 and VF e36) – [E-segment](/wiki/E-segment) (full-size) SUV for the global market. Deliveries began in 2023. - VinFast Minio Green - Mini car specifically designed for ride-hailing services. - [VinFast Limo Green](/wiki/VinFast_Limo_Green) - MPV specifically designed for ride-hailing services. Although other Electric Vehicle companies in the past offered some sort of infinite-mile warranty but currently, Vinfast still offers 8 to 10 year infinite-mile battery warranty (whichever comes first: the infinite miles or the years. Years depends on the models). In 2022, VinFast has a vision of achieving [SAE Level](/wiki/Self-driving_car#Classifications) 2+ and incrementally to Level 3, then eventually Level 4. With the ProAI high-performance computer, unlike others who rely on pre-mapping (like Waymo), it will intend to solely rely on its sensor suite. ##### Concepts - VF Wild - [Mid-size pickup truck](/wiki/Pickup_truck#Mid-size_pickup_truck) for the global market. Deliveries begin in 2026. ### Electric scooters VinFast has planned to produce seven different electric motorcycle models by 2019. It has signed agreements with state owned petrol distributor [PV Oil](/wiki/Petrovietnam) to have charging stations built at existing gas stations. - [VinFast Klara](/wiki/VinFast_Klara) – VinFast's first [electric](/wiki/Electric_motorcycles_and_scooters) [motorcycle](/wiki/Scooter_(motorcycle)) model launched in November 2018. It has a range of 80 kilometres (50 mi) and a maximum speed of 50 kilometres per hour (31 mph). VinFast signed an agreement with Bosch-Vietnam, a division of [Bosch](/wiki/Robert_Bosch_GmbH), for the supply of components. The batteries are supplied by a joint venture with [LG Chem](/wiki/LG_Chem). Two versions of the Klara are sold, featuring lead acid and lithium-ion batteries respectively. The Klara features 3G and bluetooth connectivity to allow remote lock and unlock and tracking. - [VinFast Ludo](/wiki/VinFast_Ludo) - VinFast Impes - VinFast Klara S - VinFast Theon – equipped with a mid-engine and chain transmission system with a power of up to 7,100 W. It can reach a power of 9,000 W equivalent to 12 horsepower and a maximum torque of 22.27 N⋅m, accelerate from 0 to 50 km per hour in just six seconds and reach a maximum speed of 90 km/h. - VinFast Feliz - VinFast Tempest - VinFast Vento - VinFast Evo200 ### Electric transit buses VinFast produces [low-floor](/wiki/Low-floor_bus) electric [city buses](/wiki/City_bus) for sister company [VinBus](/wiki/VinBus), a privately operated non-profit bus route network service established by Vingroup in 2019. The bus is powered by a 281 kWh battery pack which gives the bus up to 260 km (160 mi) of range. Using the VinBus-designated 150 kWh [DC](/wiki/Direct_current) [fast-charging stations](/wiki/Charging_station) provided by StarCharge, the battery can be charged within ~2 hours. ## Production facilities VinFast operates a 335 hectares (1.29 sq mi) greenfield factory at [Cat Hai Island](/wiki/C%C3%A1t_H%E1%BA%A3i_District), [Hai Phong](/wiki/Haiphong). The factory produces cars and motorbikes and parts for both of them. In 2017, VinFast also acquired [GM Vietnam](/wiki/GM_Vietnam)'s Hanoi factory (VIDAMCO). In September 2020, VinFast purchased the [Lang Lang Proving Ground](/wiki/Lang_Lang_Proving_Ground) in Australia from General Motors. VinFast purchased the former Holden proving ground for $30 million and settled on the purchase on 2 November. In October 2021, VinFast disbanded its local engineering operations and put the Lang Lang Proving Ground test track up for sale. VinFast will build a plant in Indonesia, targeting production in 2025 with an output of 30,000 to 50,000 units each year. ## Controversy and reception In May 2021, VinFast reported one of its customers, Tran Van Hoang, a Vietnamese [YouTuber](/wiki/YouTuber), to the [police](/wiki/Vietnam_People%27s_Public_Security) over comments that the customer made on his YouTube video about the quality of his [VinFast Lux A2.0](/wiki/VinFast_LUX_A2.0) car. VinFast claimed that the video contained \"[untrue content](/wiki/Disinformation_attack)\" that \"[affected the reputation](/wiki/Defamation)\" of the company to increase views and interactions for his YouTube channel. On the video, Hoang complained about faults in the [tire pressure](/wiki/Tire_pressure) sensor, the [windshield wipers](/wiki/Windscreen_wiper), the wireless phone charger, and squeaking doors. Vinfast alleged that Hoang lied about the number of times he went to the dealership for repairs, though Hoang claims to have evidence to support his statements. Hoang claimed he hired lawyers and was ready to confront VinFast in the lawsuit. However, he suggested later, \"The two sides should meet and share to have a common voice because the incident that happened was not expected by either side\". VinFast received The Rising Star award from Autobest in 2022 and named among world's 100 most influential companies in 2024 by *[Time](/wiki/Time_(magazine))*. In the US, the [VinFast VF 8](/wiki/VinFast_VF_8) has received negative reception after press cars became available to automotive journalists. A number of well-established and widely followed automotive journalists and car critics have given the VF8 poor reviews. In a May 2023 review, *[Motor Trend](/wiki/Motor_Trend)* said the vehicle is \"nowhere near ready for the customer deliveries\" due to many software glitches. *[Car and Driver](/wiki/Car_and_Driver)* said the vehicle has \"immediately obvious flaws\" that would make it difficult for VinFast to find customers. In Vietnam, on 15 May 2024, after VinFast opened deposits for VF3 cars, there were 27,649 orders after 66 hours, setting a new record in Vietnam. On 21 May 2024, US regulators began an investigation into the crash of a VinFast VF 8 that resulted in the deaths of a family of four from Pleasanton, California. \"The vehicle owner had complained about the performance of the SUV's automated steering, although it's not clear if that was a factor in the crash.\" In December 2024, a chassis designer who worked on development of VinFast cars came public as a [whistleblower](/wiki/Whistleblower), claiming that VinFast ignored his recommendations to redesign parts that suffered from premature failure during prototype testing. Reports indicate that engineers faced significant pressure to meet stringent deadlines, raising concerns about the safety and quality of VinFast vehicles. Allegations suggest that engineers were even locked in factories overnight to speed up production, potentially compromising vehicle safety. - [Vinaxuki](/wiki/Vinaxuki) - [StoreDot](/wiki/StoreDot) - [Bangkok International Motor Show](/wiki/Bangkok_International_Motor_Show) 2024 Portals: - Cars - Companies - Singapore - Vietnam - Official website - Business data for VinFast Auto Ltd.: - Google - Reuters - SEC filings - Yahoo!\n",
  "language": "en",
  "processed_at": "2026-01-12T12:12:48.965067",
  "title": "VinFast",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/VinFast"
}