{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:12:55.916713"
  },
  "content": "Singaporean camera museumThis article **may have been created or edited in return for undisclosed payments**, a violation of Wikipedia's terms of use. It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. *(July 2021)* The **Vintage Camera Museum** is a camera museum in [Kampong Glam](/wiki/Kampong_Glam) which is a neighbourhood and ethnic enclave in Singapore. ## History and background Started by steel trader Solaiyappan Ramanathan and his cousin (and artist) A.P. Shreethar, the camera museum opened on 1 June 2017. It was started to educate people the evolution of camera. The exhibits consist of approximately 1,000 cameras from the personal collections of Ramanathan and Shreethar, who both collectively own 7,000 cameras. The cameras are from as far back as the late 19th century all the way to the early 2000s, and include [pigeon camera](/wiki/Pigeon_camera), a [Minox spy camera](/wiki/Minox#Spy_camera), and Rokuoh-sha Type 89 'Machine Gun' camera that was used by the Japanese as a training weapon during [World War II](/wiki/World_War_II). The museum was affected by the onset of [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore) which it saw a 90% drop in traffic, forcing it to be temporarily closed in 2020. ## Architecture Ramanathan bought a building located at Jalan Kledek and retrofitted it. The façade of the building is shaped after a [Rollei](/wiki/Rollei) camera, and is thus called as the 'world's biggest camera-shaped building'. Housed in the 2,500 sq ft (230 m2) building are the Vintage Camera Museum, and Click Art Museum, which showcases Shreethar's artwork while allowing visitors to experiment photography with the art pieces. The museum is housed in a white camera-shaped building with a total floor area of 2,500 square feet, divided into two museums – Vintage Camera Museum and Click art Museum. - [List of museums in Singapore](/wiki/List_of_museums_in_Singapore) - Official website This Singapore-related article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:12:55.916485",
  "title": "Vintage Camera Museum",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Vintage_Camera_Museum"
}