{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:13:00.677328"
  },
  "content": "3D digital replica of Singapore **Virtual Singapore** is a [3D digital model](/wiki/3D_modeling) of [Singapore](/wiki/Singapore) that uses [real-time](/wiki/Real-time_data) and [topographical data](/wiki/Topographic_map). It is a [digital twin](/wiki/Digital_twin) of the [city-state](/wiki/Singapore), and the first [digital twin](/wiki/Digital_twin) of a country. Virtual Singapore is co-led by the National Research Foundation, the [Singapore Land Authority](/wiki/Singapore_Land_Authority) (SLA) and the [Government Technology Agency](/wiki/Government_Technology_Agency). The [Government of Singapore](/wiki/Government_of_Singapore) used [Dassault Systèmes](/wiki/Dassault_Syst%C3%A8mes)' *[3DEXPERIENCE City](/wiki/Dassault_Syst%C3%A8mes#2012–2019)* to create the digital model. Virtual Singapore was first launched on 3 December 2014, as part of Singapore's [Smart Nation](/wiki/Smart_Nation) drive, and was completed in 2022. ## Development SLA began developing a 3D national map in 2012 to help the country make better use of its limited land and identify areas at [risk of flooding](/wiki/Flood). The [Government of Singapore](/wiki/Government_of_Singapore) launched a 3D mapping program in 2011 after a [flood](/wiki/Floods_in_Singapore#Sunday,_30_January_2011_and_Monday,_31_January_2011) occurred in the country after a very heavy downpour. The first map of the Virtual Singapore project was completed in 2014. “Indirectly, it started with the idea of digitizing a city,” stated Ingeborg Rocker, Vice President of the *[3DEXPERIENCE City](/wiki/Dassault_Syst%C3%A8mes#2012–2019)* project. Rocker had resigned from [Harvard University](/wiki/Harvard_University) to work on the Virtual Singapore project. In 2014, LA began a [3D](/wiki/3D_modeling) national mapping effort to create a *Singapore Advanced Map* that would depict the complicated urban environment in great detail and help in the development of endless space from restricted land. The project's ethical high-resolution and [open-source map data](/wiki/Open-source_software) offer a digital framework for the [Smart Nation](/wiki/Smart_Nation). It also aids in transitioning to a [3D-enabled](/wiki/3D_modeling) [Smart Nation](/wiki/Smart_Nation), where data would be used in applications such as [national security](/wiki/National_security), [urban development](/wiki/Urban_planning), [climate change adaptation](/wiki/Climate_change_adaptation), etc. The [Singapore Land Authority](/wiki/Singapore_Land_Authority) spearheaded the program to construct and maintain a high resolution [3D map](/wiki/3D_reconstruction) of the country. It was funded half by the [Government of Singapore](/wiki/Government_of_Singapore) and half by agencies, principally the [Civil Aviation Authority of Singapore](/wiki/Civil_Aviation_Authority_of_Singapore) and the [Public Utilities Board](/wiki/Public_Utilities_Board_(Singapore)). The project required the collecting of massive amounts of data in various formats totaling more than [50 terabytes](/wiki/Byte). The [Singapore Land Authority](/wiki/Singapore_Land_Authority) hired the *AAM Group* to conduct airborne and [land surveys](/wiki/Surveying) to collect data. ### Phases The project was divided into two phases. During Phase one, [aerial photography](/wiki/Aerial_photography) and [airborne LiDAR](/wiki/Lidar) were utilized in the first phase to record the country's topographical and surface data and develop [digital models](/wiki/3D_modeling), which served as the overarching framework for the *Singapore Advanced Map*. Phase two had vehicle-mounted [laser scans](/wiki/Laser_scanning) to augment the aerial footage with street level data as part of the project's second phase, considerably improving map detail. A vehicle-based mobile mapping survey of the nation's 5500 kilometer [road network](/wiki/Street_network) was done to acquire more than three million photos, as well as build extremely detailed [3D models](/wiki/3D_modeling) of the congested [urban highway system](/wiki/Highway). [Bentley Systems](/wiki/Bentley_Systems)' [MicroStation](/wiki/MicroStation)'s quickest data gathering and manipulation capabilities were employed to achieve a modeling accuracy of 0.3 metres and save over 3000 resource days and related expenditures. ## Purpose Ng Siau Yong, Director of the Geospatial Division at the [Singapore Land Authority](/wiki/Singapore_Land_Authority), had stated that Virtual Singapore \"aims to synergize all the 3D efforts from various agencies of the [Government](/wiki/Government_of_Singapore) onto a common platform, so that, all public agencies can make use of a common 3D digital city model of Singapore.\" ### Urban planning and design Virtual Singapore serves as an opportunity to urban planners and architects. The [three-dimensional](/wiki/Three-dimensional_space) [digital twin](/wiki/Digital_twin) allows these professionals to visualize the [cityscape](/wiki/Cityscape) in intricate detail, experiment with different architectural and infrastructure scenarios, and assess the potential impact of proposed changes on the urban environment. This aids in the creation of more efficient and aesthetically pleasing urban spaces. a comprehensive 3D digital twin that integrates real-time data for simulating urban scenarios and optimizing infrastructure projects. This data-rich platform, a collaborative effort between the National Research Foundation, Singapore Land Authority, and GovTech, allows planners to test various strategies, from disaster preparedness and flood management to energy consumption and traffic control, enabling data-driven, sustainable, and resilient urban development. ### Infrastructure The [digital model](/wiki/3D_modeling) facilitates the simulation of infrastructure projects such as roads, bridges, buildings, and utilities. By virtually constructing and testing these elements before implementation, planners can optimize designs, anticipate challenges, and make informed decisions to enhance the overall efficiency and sustainability of the city's infrastructure. ### Transport optimization Virtual Singapore provides a platform for simulating and optimizing transportation systems. This includes analyzing traffic flow, testing different public transportation strategies, and identifying potential congestion points. By understanding how changes in transportation infrastructure impact the city, authorities can make data-driven decisions to improve mobility and reduce congestion. ### Disaster management and resilience The [digital twin](/wiki/Digital_twin) is instrumental in [disaster management](/wiki/Emergency_management) and resilience planning. It allows authorities to simulate and plan for various disaster scenarios, such as [floods](/wiki/Flood), [earthquakes](/wiki/Earthquake), or [pandemics](/wiki/Pandemic). By understanding how the city might be affected under different conditions, [emergency response plans](/wiki/Emergency_management) can be refined, and resilience strategies can be developed to mitigate the impact of potential disasters. ### Environmental monitoring Virtual Singapore facilitates real-time monitoring and analysis of environmental factors. This includes tracking [air quality](/wiki/Air_quality_index), monitoring green spaces, and assessing the impact of [urbanization](/wiki/Urbanization) on the ecosystem. The data gathered helps in formulating strategies for sustainable development, minimizing environmental impact, and fostering a healthier living environment for the city's residents. ## Smart City initiatives The project aligns with the broader goals of transforming [Singapore](/wiki/Singapore) into a [smart city](/wiki/Smart_city). By integrating technologies like the [Internet of things](/wiki/Internet_of_things) (IoT) and [data analysis](/wiki/Data_analysis), Virtual Singapore supports the deployment of smart city solutions. This includes initiatives such as [smart grids](/wiki/Smart_grid), [intelligent street lighting](/wiki/Intelligent_street_lighting), and other innovations aimed at improving overall quality of life for residents. ## Accessibility Virtual Singapore is accessible to many research institutes and university labs, such as the [Government](/wiki/Government_of_Singapore)’s [Agency for Science, Technology and Research](/wiki/Agency_for_Science,_Technology_and_Research) and the [National University of Singapore](/wiki/National_University_of_Singapore). Alexander Parilusyan, Vice President at [Dassault Systèmes](/wiki/Dassault_Syst%C3%A8mes) stated that \"They can use this model to do very large-scale simulations, like wind, noise, traffic simulation.\" Parilusyan also adds that \"In the future, citizens and businesses will also get access to Virtual Singapore.\" We are working on this topic with agencies to see what kind of data we can provide to this external platform.\" \"For instance, companies could use Virtual Singapore to test [driverless cars](/wiki/Self-driving_car) without placing them on heavy-traffic roads,\" the [Government of Singapore](/wiki/Government_of_Singapore) has stated. ## Benefits to businesses Companies can use Virtual Singapore to visualize how the city will develop and evolve in response to [population growth](/wiki/Population_growth), new construction, and other major events. Virtual Singapore captures a large amount of data, which can help planners learn and share lessons about construction and infrastructure before they become expensive urban planning problems. The platform allows [stakeholders](/wiki/Stakeholder_(corporate)) from different sectors to test solutions for effective planning and decision-making without taking too many risks. Virtual Singapore can be used for [flood risk analysis](/wiki/Flood_control), opportunities for [solar panels](/wiki/Solar_panel) and [green roofs](/wiki/Green_roof), and examining the impact of wind load on [vegetation](/wiki/Vegetation). Businesses can use the platform's wealth of data and information for [business analytics](/wiki/Business_analytics), [resource planning](/wiki/Enterprise_resource_planning), and delivering specialized services.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:13:00.677050",
  "title": "Virtual Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Virtual_Singapore"
}