{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:13:07.810937"
  },
  "content": "This article **is an orphan, as no other articles link to it**. Please introduce links to this page from related articles. *(December 2025)* **Vivek A. Kumar** (born August 8, 1984) is an American scientist, innovator and entrepreneur. He is faculty at the [University of Houston](/wiki/University_of_Houston) (UH) in the department of Biomedical Engineering; he began his academic career at the [New Jersey Institute of Technology](/wiki/New_Jersey_Institute_of_Technology) (NJIT). At UH, he is the director of the KumarLab for Engineering Better Medicines kumarlab.us Vivek has also co-founded several startups. ## Early life and education Vivek was born to Indian parents, grew up in [Singapore](/wiki/Singapore) where he attended Parry primary school, [Kuo Chuan Presbyterian Secondary School](/wiki/Kuo_Chuan_Presbyterian_Secondary_School) for his O levels and [Nanyang Junior College](/wiki/Nanyang_Junior_College) for his A levels. He received a BSc in biomedical engineering from [Northwestern University](/wiki/Northwestern_University) in 2006, pursuing research in synthetic biomaterials in the lab of [Guillermo Ameer](/wiki/Guillermo_Ameer), ScD. In 2006, he started pursuing his doctoral in bioengineering with Elliot Chaikof, MD, PhD, at [Georgia Tech](/wiki/Georgia_Tech) and [Emory University](/wiki/Emory_University) in [Atlanta](/wiki/Atlanta), where he was awarded an American Heart Association Predoctoral Fellowship, graduating in 2011. ## Academic career Vivek began his post-doctoral work in 2011 with Elliot Chaikof at the [Wyss Institute for Biologically Inspired Engineering](/wiki/Wyss_Institute_for_Biologically_Inspired_Engineering) and [Beth Israel Deaconess Medical Center](/wiki/Beth_Israel_Deaconess_Medical_Center), a teaching hospital of [Harvard Medical School](/wiki/Harvard_Medical_School). He continued his post-doctoral work with Jeffrey Hartgerink at Rice University in 2012 till 2016, and was awarded an NIH F32 fellowship for his work. At [Rice University](/wiki/Rice_University), Vivek alongside Jeffrey Hartgerink created a new high-tech hydrogel to aid healing and make natural tissue recovery easier for humans. He began his academic career at NJIT as an assistant (2016-2022), associate (tenured 2022) professor in [biomedical engineering](/wiki/Biomedical_engineering), [chemical engineering](/wiki/Chemical_engineering), biology; and Endodontics at the [Rutgers School of Dental Medicine](/wiki/Rutgers_School_of_Dental_Medicine), funded by NIH, NSF and foundation grants. He moved to the UH in 2025 as a tenured associate professor. He has co-authored over 65 peer-reviewed journal articles, over 6 dozen abstracts, co-invented over a dozen patents/applications; and mentored over a 100 undergraduates, graduates and post-doctoral students. As of January 2020 Vivek has been cited over 2,200 times and has an H-index of 26. ## Business career He is the President and founder of startups namely, SAPHTx Inc, NangioTx, ForK Financials, and Pullup Technologies. During his academic career, he has successfully mentored students who have received notable funding from NIH, NSF and other foundations. NangioTx, his Biotechnology startup, was awarded the TMCx Bioventures 2015 1st place award, 2016 OPEN prize and was the winner of the first pitch competition at the first Life Pitch Science Competition by Mid Atlantic Bio Angels in 2016. NangioTX was also a finalist for Mass Challenge 2016-2017 under the healthcare and life sciences category. - Vivek Kumar - Dr. Vivek Kumar - NJIT Biomedical Engineering Info Session - Self-Assembled Peptide-Based Drugs and Biomaterials - Dealing a therapeutic counterblow to traumatic brain injury - A Nanostructured Synthetic Collagen Mimic for Hemostasis - Dental Pulp Regeneration Using Novel Self-Assembling Peptide Scaffolds - Dealing a therapeutic counterblow to traumatic brain injury - Vivek Kumar, PhD\n",
  "language": "en",
  "processed_at": "2026-01-12T12:13:07.810609",
  "title": "Vivek A. Kumar",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Vivek_A._Kumar"
}