{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:13:11.955575"
  },
  "content": "Ground floor open area on public housing blocks in Singapore **Void decks** refer to the open areas on the ground level of [Housing and Development Board](/wiki/Housing_and_Development_Board) (HDB) public housing buildings in [Singapore](/wiki/Singapore), which are commonly known as [HDB blocks](/wiki/HDB_blocks). They are one of the most used public spaces in housing estates. The first void deck was implemented in 1963 at Block 26 Jalan Klinik. The void deck is used for a range of casual community activities such as playing board games, exercising, and socialising. It is often booked for Malay weddings, Chinese funerals, and birthday parties. Void decks today are occasionally populated with convenience stores, [early education centres](/wiki/Early_childhood_education), community clubs, senior citizen clubs, and [coffee shops](/wiki/Kopi_tiam). In contemporary Singapore, Malay wedding receptions are typically conducted at the void deck as it serves as an equivalent to the courtyards of the family's house at which Malay wedding receptions are traditionally held. These receptions take place throughout the day and typically invite over 1,000 guests, who are not required to stay for the entire duration, in line with Malay customs. However, there is a misconception that Malay void deck weddings are inexpensive. In reality, these weddings are often heavily decorated and accompanied by a feast, with each reception costing the average couple around S$40,000 to S$50,000. Chinese funerals are also common at the void deck for Buddhist and Taoist traditions. Christian and Hindu funerals are also held in void decks. They often take place over few days and family members and relatives take turns looking over the venue overnight, typically playing games such as mahjong to keep themselves awake. It is a misconception that void deck funerals are merely convenient and superstitious. Writer and photographer Tan Dingwei stated that \"The heritage surrounding death practices in Taoist belief systems are abundant and sophisticated.\" Tan published a photo-essay \"A Chinese Funeral in a Void Deck\" in the book *Death and the Afterlife* edited by Kit Ying Lye and Terence Heng which shows that Chinese funerals vary across beliefs in Singapore. ## Etymology The earliest record of the term \"void deck\" dates back to a 1967 *[Straits Times](/wiki/The_Straits_Times)* newspaper article, where it was used to describe the in-between floors of mixed-use buildings that separated the shopping levels from the residential blocks above them. In 1973, HDB referred to the open ground level as a 'void area' in the government panel in the newspaper. However, HDB did not utilise the term \"void deck\" in their annual reports until 1977–1978. Dr. Yaacob Ibrahim Former Minister for Ministry of Communications and Information stated that the term \"void deck\" is a uniquely Singaporean one. ## Design ### Architecture Despite the name, void decks are not completely empty. The void deck is a largely open space with [structural columns](/wiki/Column) that support the residential blocks above it. Smooth white walls coat the verticals, and matte grey covers the base, with some walkways textured to prevent slippage. Although there is some variation, the center of the void deck houses its iconic elevators lobbies and dedicated letterbox area. Residents can collect mail before or after using the elevator. The lift lobby at void decks can be treated as the main entrance or \"lobby lounges\" to HDB blocks. In newer void decks, they are even marked with a different wall and floor design and kept open for the community to furnish and decorate. The void deck's large open spaces allow for a variety of temporary functions, acting as \"a space that can serve community needs.\" The void deck's abundance of uses allows residents to establish a niche experience with other residents. However, scholars such as the late Ooi Giok Ling and Thomas Tan have stated that the void deck can become a place for frequent yet superficial social interactions, especially when limited to passing greetings. In their book chapter The Social Significance of Public Spaces in Public Housing Estates, Ooi and Tan noted that the space is a \"radical embrace of functional indeterminacy,\" meaning that the void deck is intentionally designed to have no fixed or predetermined purpose. Hence, Ooi and Tan described the institution of void decks as a 'gamble' because of this uncertainty of its usage. In the book chapter \"Void Deck\" in *Public Space in Urban Asia* by William S. W. Lim, Cairns, et al. dedicated one section called \"The Void Deck Gamble\", stating that the void deck was meant to be an open space with no particular function, but the hope was for it to promote \"community and identity formation\" as mentioned explicitly in [government](/wiki/Government_of_Singapore) documents. ### Origins There are various theories behind the implementation of the void deck. According to the biography of late [SNOC](/wiki/Singapore_National_Olympic_Council) president and law minister [E.W. Barker](/wiki/Edmund_W._Barker), edited by Susan Sim, the initial idea of the void deck originated from a 1973 conversation Barker had with former Secretary General S.S. Dhillon while driving at Kim Keat Road towards Toa Payoh. Barker commented on children being drenched in the rain, suggesting, \"If only we could raise buildings one level up.\" Susan Sim and Dhillon suggested that this was how \"the idea of a void deck at the foot of each HDB block came about.\" In 2024, TODAY online posted an article which claimed that HDB \"initially built void decks for ventilation and flood prevention in dense urban areas\", citing urban planners. However, Scholars like Louisa-May Khoo and Stephen Cairns echoed the official view that the void deck exists to mix people up, to promote social interaction between people in Singapore's ethnically diverse, multicultural, and multi-religious society. In 1989, the [Ethnic Integration Policy](/wiki/Ethnic_Integration_Policy) (EIP) was introduced, which kept the percentage of each racial group in HDB blocks in line the national [CMIO](/wiki/CMIO) racial composition. It is suggested that the presence of void decks below HDB blocks would promote social interaction and contribute to fostering racial harmony. The NHB's e-book titled *Void Deck* from their *Community Heritage Series III* (2013) stated that the intention of the void deck was to provide \"a sense of relief\" in a highly urbanised environment and create opportunities for community bonding. It also suggested that \"[the] introduction of void decks has undeniably improved the lives of HDB flat dwellers as they provide shelter from the rain and sun, promote good airflow and natural light, and allow passers-by easy passage through the estates,\" mentioning the other possible reasons stated by Sim, Khoo, Cairns, and Tan. ## History ### The 1960s When HDB blocks were first constructed in the 1960s, they did not include void decks. It was only in the 1970s that HDB began building its flats starting from the second level, creating open space on the ground level. However, exceptions to some new HDB blocks were made to allow for greater convenience for the elderly. At the start, void decks featured only basic amenities such as [bicycle racks](/wiki/Bicycle_parking_rack), [letterboxes](/wiki/Letter_box), [elevators](/wiki/Elevator), and [telephone booths](/wiki/Telephone_booth). In around every four blocks, early void decks had [kiosks](/wiki/Kiosk) that sold household necessities and groceries near the lift lobby. After the creation of the precinct, the kiosks were replaced by precinct facilities such as nearby convenience stores. ### 1970s to 1980s From the 1970s to 1980s, Singapore began moving kampong residents into HDB estates, otherwise known as New Towns. During this process, New Town HDB void decks served as the functional equivalent of communal kampong spaces for gathering. In the 1980s, HDB began incorporating entertainment facilities like [chess](/wiki/Chess) and [checker](/wiki/Checkers) tables, [vending machines](/wiki/Vending_machine), and advertisement corners, along with safety and security features such as [CCTV surveillance](/wiki/Closed-circuit_television) and [defibrillators](/wiki/Defibrillation). In 1980, HDB announced that every new HDB block and older estates will have electrical and water facilities for usage at the void deck. Until the 1990s, void decks followed similar rectangular designs, which only changed when HDB began encouraging teams of private firms to 'design-and-build' HDB flats in 1991. Since 1982, HDB blocks have been built in a way that links void decks and [playgrounds](/wiki/Playground) into territories known as [precincts](/wiki/Public_housing_in_Singapore). A precinct constitutes up to 750 flats and joins roughly 4 hectares of flats, creating a common space with which residents can identify. In a precinct, a playground becomes the focal point around which void deck facilities have been built and concentrated. Residents are also within walking distance to conveniences such as small shops, eateries, and [grocery stores](/wiki/Grocery_store). Precinct [pavilions](/wiki/Pavilion) have been added to newer void decks. ### 1990s to 2000s In the 1990s, seeing that certain void deck spaces were regularly populated by [senior citizens](/wiki/Senior_Citizens), \"Senior Citizens' Corners\" were created. When the first void deck [community garden](/wiki/Community_gardening) was established in [Tampines](/wiki/Tampines) in 1999, there was an increasing demand from seniors to convert more open spaces into gardening areas. In 2005, [National Parks Board](/wiki/National_Parks_Board) created the \"Community in Bloom\" programme which provided a platform for seniors to initiate their own [community gardens](/wiki/Community_gardening). In 2006, The Committee on Ageing Issues (CAI) called for more void decks to be utilised for senior activities. In newer HDB blocks such as SkyVille@Dawson and Pinnacle@Duxton, void decks are not located on the ground floor but rather integrated with [sky gardens](/wiki/Elevated_park). Newer void decks are also smaller in size. Residents have also been allowed a greater say in how the void deck is decorated. Artists may decorate the void deck, but they must first apply for permission from the relevant authorities before displaying their works, as the space belongs to the Town Council of the area where the void deck is located. ### 2000s to 2010s By the 2010s, the void deck had become normalised as a point of departure and rendezvous for people going for work, school, or the market on the weekdays. People heading to and returning from work or school normally cut across void decks heading the [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) or bus station with very little social interaction with other residents. However, the void deck is still an important meeting point for the senior citizens who spend their days doing light housework and socialising with other seniors. ### COVID-19 pandemic During the height of the [COVID-19 pandemic](/wiki/COVID-19_pandemic) from 2020 to 2022, void decks facilities were cordoned off and restricted from public use. Void deck facilities were an everyday leisure spot for many Singaporeans. [The COVID-19 restrictions](/wiki/COVID-19_pandemic_in_Singapore) saw frequent and public cases of residents flouting rules which were recorded and shared through social media along with misinformation. ## Void deck issues Depending on its users, the void deck can either be a space for wholesome community bonding or a site for inconsiderate behaviour. For some residents, the void deck has developed a negative association due to occasional instances of loitering, playing of loud music, gambling, drinking, drug-taking, etc. In his chapter on the Void Deck, Cairns quoted the concerns of Tan Szue Hann, then Principal Designer of Architecture at Jurong International, stating that: > *“School students have always been advised to stay away from void decks, as it’s where smokers hang out, or card-playing happens. Smoking and card-playing is then associated with loitering/antisocial behaviour/gang-related activity, for some reason. And as such, students are indoctrinated to avoid these spaces, and will tend to do so 'til even later on in life.\"* It is common for noise complaints to arise regarding the use of the void decks. When there are complaints regarding void deck use, the government often urges communication between residents. Meanwhile, the Singapore-based website Stomp encourages users to publicise and report cases of residents who misuse the void deck. On 3 November 2023, an area of the Block 638 Woodlands Ring Road void deck was taped off by the town council due to noise complaints regarding children playing ball games at the void deck. On 23 November 2023, a netizen contacted TMSG and commented that the decision was 'ridiculous.' ## In popular culture In a 1995 Singapore Literature Prize Competition, a Commendation Prize was awarded for a collection of poems called *Void Decks and Other Empty Places* by *Colin Cheong.* The first section consisted 20 poems about life in Singapore revolving the void deck. The first one goes as follows: > *Long after the birdsong ends* > > *spirits gather that never left* > > *drawn by the memory of a well-loved face* > > *drawn by the life of an empty place* An exhibition titled *Void & Void Decks* by Singaporean artists Chow Chee Yong and Tang Ling Nah was held at the Private Museum from August to September 2012. The interior design of the exhibition room was modelled after a void deck, featuring iconic smooth grey concrete floors, white walls, and rectangular pillars, creating the impression of being at home whilst inside the art gallery. The artist statement on the website is as follows: > Chow juxtaposes different locations with a single shot, creating an ambiguous “Void” that exists only within the photograph. On the other hand, Tang suggests the extension of space through her charcoal drawings of the city’s transitory spaces such as “Void Decks”, corridors and underground passageways. On 22 August 2023, an HDB estate-themed cafe called Lou Shang by Mama Diam opened on Prinsep Street. The cafe's entrance and interior mimics the void deck staircase landings and common area. It also serves Singapore-inspired dishes and is furnished with blue-tiled, rounded tables and benches reminiscent of a void deck. - [Common area](/wiki/Common_area) - [Undercroft](/wiki/Undercroft) - Housing and Development Board\n",
  "language": "en",
  "processed_at": "2026-01-12T12:13:11.955294",
  "title": "Void deck",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Void_deck"
}