{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:13:15.150362"
  },
  "content": "Status of the right to vote in SingaporeThis article is part of a series on[Politics of Singapore](/wiki/Politics_of_Singapore)[Constitution](/wiki/Constitution_of_Singapore) - [Law](/wiki/Law_of_Singapore) - [Human rights](/wiki/Human_rights_in_Singapore) [Legislature](/wiki/Parliament_of_Singapore) - **[Parliament](/wiki/Parliament_of_Singapore)** - [Speaker](/wiki/Speaker_of_the_Parliament_of_Singapore) [Seah Kian Peng](/wiki/Seah_Kian_Peng) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the House](/wiki/Leader_of_the_House_(Singapore)) [Indranee Rajah](/wiki/Indranee_Rajah) ([PAP](/wiki/People%27s_Action_Party)) - [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Singapore)) [Pritam Singh](/wiki/Pritam_Singh_(Singaporean_politician)) ([WP](/wiki/Workers%27_Party_(Singapore))) - [14th Parliament](/wiki/14th_Parliament_of_Singapore) - [Constituencies](/wiki/Constituencies_of_Singapore) [Executive](/wiki/Government_of_Singapore#Composition) - **[President of Singapore](/wiki/President_of_Singapore)** ([list](/wiki/List_of_presidents_of_Singapore)) - [Tharman Shanmugaratnam](/wiki/Tharman_Shanmugaratnam) ([I](/wiki/Independent_politician)) - **[Prime Minister of Singapore](/wiki/Prime_Minister_of_Singapore)** - [Lawrence Wong](/wiki/Lawrence_Wong) ([PAP](/wiki/People%27s_Action_Party)) - [Cabinet](/wiki/Cabinet_of_Singapore) - [Ministries](/wiki/Organisation_of_the_Government_of_Singapore) - [The Reserves](/wiki/Reserves_of_the_Government_of_Singapore) [Judiciary](/wiki/Judicial_system_of_Singapore) - **[Supreme Court of Singapore](/wiki/Supreme_Court_of_Singapore)** - [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Sundaresh Menon](/wiki/Sundaresh_Menon) - **[Court of Appeal](/wiki/Court_of_Appeal_of_Singapore)** - [Prakash](/wiki/Judith_Prakash) - [Tay](/wiki/Tay_Yong_Kwang) - [Chong](/wiki/Steven_Chong) - [Ang](/wiki/Belinda_Ang) - **[High Court](/wiki/High_Court_of_Singapore)** - [State Courts](/wiki/State_Courts_of_Singapore) [Elections](/wiki/Elections_in_Singapore) - [Presidential elections](/wiki/Presidential_elections_in_Singapore) - [General elections](/wiki/General_elections_in_Singapore) Singapore portal - [Other countries](/wiki/Outline_of_political_science#Politics_by_region) - v - t - e The **right to vote in Singapore** is not explicitly stated in [Singapore](/wiki/Singapore)'s [Constitution](/wiki/Constitution_of_Singapore), but the [Government](/wiki/Government_of_Singapore) has expressed the view that it may be inferred from the fact that Singapore is a [representative democracy](/wiki/Representative_democracy_in_Singapore) and from specific constitutional provisions, including Articles 65 and 66 which set out requirements for the [prorogation and dissolution of Parliament](/wiki/Parliament_of_Singapore#Sessions) and the holding of [general elections](/wiki/Parliamentary_elections_in_Singapore). Speaking on the matter in [Parliament](/wiki/Parliament_of_Singapore) in 2009, the [Minister for Law](/wiki/Ministry_of_Law_(Singapore)), [K. Shanmugam](/wiki/K._Shanmugam), said that the [right to vote](/wiki/Suffrage) could not be a mere privilege as this would imply the existence of an institution superior to the body of citizens that is empowered to grant such a privilege, but that no such institution exists in a free country. In 1966 a Constitutional Commission chaired by [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Wee Chong Jin](/wiki/Wee_Chong_Jin) advocated entrenching the right to vote within the Constitution, but this was not taken up by the Parliament of the day. When this proposal was repeated during the 2009 parliamentary debate, the Government took the view that such entrenchment was unnecessary. In *[Taw Cheng Kong v. Public Prosecutor](/wiki/Public_Prosecutor_v._Taw_Cheng_Kong#Constitutional_arguments_before_the_High_Court)* (1998), the [High Court](/wiki/High_Court_of_Singapore) suggested on an *[obiter](/wiki/Obiter_dictum)* basis that voting is a privilege rather than a right. It has been suggested by law academic [Thio Li-ann](/wiki/Thio_Li-ann) that, if called upon to decide the issue, the court might infer the existence of the right to vote in the Constitution from its text and structure, and from the fact that it is an adaptation of the [Westminster system](/wiki/Westminster_system) of democracy. If the right to vote were to be found to be implicit in the Constitution, the [judiciary](/wiki/Judicial_system_of_Singapore) would be better able to protect the right when issues arise before the courts. The Parliamentary Elections Act and Presidential Elections Act regulate the exercise of the vote and set out the procedures for [parliamentary](/wiki/Parliamentary_elections_in_Singapore) and [presidential elections in Singapore](/wiki/Presidential_elections_in_Singapore). These are ordinary statutes which can be changed by a [simple majority](/wiki/Majority) in Parliament. All [Singapore citizens](/wiki/Singaporean_nationality_law) not less than 21 years old on the cut-off date for the registration of electors (1 January of a particular year), and ordinarily resident in the country, are entitled to vote in both parliamentary and presidential elections. A [one person, one vote](/wiki/One_man,_one_vote) system is currently in operation, though in 1994 [Senior Minister](/wiki/Senior_Minister_of_Singapore) and former [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) suggested that people aged between 35 and 60 who were married with children should be given two votes each due to their greater responsibilities and contributions to society. [Overseas voting](/wiki/Overseas_voting) was introduced in 2001, and first carried out during the [2006 general election](/wiki/2006_Singaporean_general_election). A person is disqualified from voting in certain circumstances, which include engaging in acts incompatible with being a Singapore citizen, being of unsound mind, or being in prison for committing a criminal offence. The constitutionality of the statutory provisions denying prisoners the right to vote has not yet become an issue in Singapore, though it has been controversial in some foreign jurisdictions. ## Introduction The [right to vote](/wiki/Suffrage) forms the foundation of [representative democracy](/wiki/Representative_democracy), that is, [democracy](/wiki/Democracy) based on the principle of citizens electing a group of people to represent their interests. The various models of government that fall under the general term \"representative democracy\", namely, the protective, participatory and elite models, are all based upon the underlying principle of equality of rights, including the right to vote. \"Popular government\" was referred to by [John Stuart Mill](/wiki/John_Stuart_Mill) as \"where the supreme controlling power ... is vested in the entire aggregate of the community\", while [Edmund Burke](/wiki/Edmund_Burke) argued that it has the desirable consequence of establishing a government that has a unified public interest, with its citizens absent of personal prejudices except for that of the public good. The right to vote then provides the means for individuals to voice their support of or opposition to government. Their aggregated choices enable the will of the people to control the extent of power and perpetuity of governments, thus protecting society's rights and interests. [Thomas Paine](/wiki/Thomas_Paine), one of the [Founding Fathers of the United States](/wiki/Founding_Fathers_of_the_United_States), said that the right to vote is critical in the protection of individual freedoms. He called it one of an individual's personal rights, which are \"a species of property of the most sacred kind\", and expressed the view that \"[t]o take away this right is to reduce a man to slavery, ... subject to the will of another ... [T]o disfranchise any class of men is as criminal as the proposal to take away property\". Paine's view was that there is no justification for one part of a community to deny another its right to vote on any basis, whether class, race, religion or political creed. His view survives in various international instruments such as [Article 21(1)](/wiki/Universal_Declaration_of_Human_Rights#Article_21) of the [Universal Declaration of Human Rights](/wiki/Universal_Declaration_of_Human_Rights). In the [United States Supreme Court](/wiki/Supreme_Court_of_the_United_States) case *[Reynolds v. Sims](/wiki/Reynolds_v._Sims)* (1964), [Chief Justice](/wiki/Chief_Justice_of_the_United_States) [Earl Warren](/wiki/Earl_Warren) wrote: > The right to vote freely for the candidate of one's choice is of the essence of a democratic society, and any restrictions on that right strike at the heart of representative government. ... Undoubtedly, the right of suffrage is a fundamental matter in a free and democratic society. ... As long as ours is a representative form of government, and our legislatures are those instruments of government elected directly by and directly representative of the people, the right to elect legislators in a free and unimpaired fashion is a bedrock of our political system. The term *[representative democracy](/wiki/Representative_democracy_in_Singapore)* does not appear in the [Constitution of Singapore](/wiki/Constitution_of_Singapore). However, an analogy may be drawn from the approach taken by the [High Court of Australia](/wiki/High_Court_of_Australia) to the [Australian Constitution](/wiki/Constitution_of_Australia). In *[Lange v. Australian Broadcasting Corporation](/wiki/Lange_v_Australian_Broadcasting_Corporation)* (1997), the Court inferred that the Constitution embodies a system of representative and [responsible government](/wiki/Responsible_government) from various provisions, including those requiring periodic elections to choose the members of the [Senate](/wiki/Australian_Senate) and the [House of Representatives](/wiki/Australian_House_of_Representatives). Similarly, the Singapore Constitution prescribes that [Parliament](/wiki/Parliament_of_Singapore) may be dissolved by the [Prime Minister](/wiki/Prime_Minister_of_Singapore) under certain conditions, and will be automatically dissolved by [operation of law](/wiki/Operation_of_law) five years from its first sitting. A [general election](/wiki/Parliamentary_elections_in_Singapore) must be held within three months after each dissolution of Parliament. The Constitution also states that \"[t]he President shall be elected by the citizens of Singapore in accordance with any law made by the Legislature\", and requires a poll for the election to be held not more than three months before the incumbent's term of office expires, or, if the office is vacated before the expiry date, within six months of the date when it becomes vacant. In addition, in the Proclamation of Singapore contained in the Independence of Singapore Agreement, which was entered into by the [Governments of Malaysia](/wiki/Government_of_Malaysia) and [Singapore](/wiki/Government_of_Singapore) to effect Singapore's separation from Malaysia, the then Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) proclaimed on behalf of the people and the Government that as from 9 August 1965 \"Singapore shall be forever a sovereign democratic and independent nation ...\". ## Status of the right ### Judicial view In *[Taw Cheng Kong v. Public Prosecutor](/wiki/Public_Prosecutor_v._Taw_Cheng_Kong#Constitutional_arguments_before_the_High_Court)* (1998), the [High Court](/wiki/High_Court_of_Singapore) expressed the *[obiter](/wiki/Obiter_dictum)* view that the right to vote does not have constitutional status but is a privilege: > Constitutional rights are enjoyed because they are constitutional in nature. They are enjoyed as fundamental liberties – not stick-and-carrot privileges. To the extent that the Constitution is supreme, those rights are inalienable. Other *privileges* such as subsidies or the *right to vote* are enjoyed because the Legislature chooses to confer them – they are expressions of policy and political will. [Emphasis added.] ### Government's view The juridical status of the right to vote was subsequently debated in Parliament on 16 May 2001 upon an [adjournment](/wiki/Parliament_of_Singapore#Suspension_and_adjournment) [motion](/wiki/Motion_(parliamentary_procedure)) introduced by [Non-constituency Member of Parliament](/wiki/Non-constituency_Member_of_Parliament) [Joshua Benjamin Jeyaretnam](/wiki/Joshua_Benjamin_Jeyaretnam). Jeyaretnam argued that since \"the marking of a [ballot paper](/wiki/Ballot) is an expression of the voter\", the right to vote is protected by the freedom of expression clause set out in [Article 14 of the Constitution of Singapore](/wiki/Article_14_of_the_Constitution_of_Singapore). Responding, the [Minister for Home Affairs](/wiki/Ministry_of_Home_Affairs_(Singapore)), [Wong Kan Seng](/wiki/Wong_Kan_Seng), stated: > While the Constitution does not contain an expressed declaration of the right to vote, I have been advised by the Attorney General ... that the right to vote at parliamentary and presidential elections is implied within the structure of our Constitution. We have a parliamentary form of government. The Constitution provides for regular general elections to make up Parliament and establishes representative democracy in Singapore. So the right to vote is fundamental to a representative democracy, which we are, and that is why we have the Parliamentary Elections Act to give effect to this right. The heading of section 38 of the Parliamentary Elections Act (\"PEA\") is \"Registers of electors to be conclusive evidence of right to vote\". Subsection (1) provides that the current register of electors is conclusive evidence for determining whether a person is entitled to vote at an election, and subsection (2) states that a person's \"right and duty of voting\" is not prejudiced if there is an appeal pending as to whether his or her name is properly on the register. The status of the right to vote was again considered in Parliament in 2009. During debates on the [Ministry of Law](/wiki/Ministry_of_Law_(Singapore))'s annual budget on 12 February, [Nominated Member of Parliament](/wiki/Nominated_Member_of_Parliament) [Thio Li-ann](/wiki/Thio_Li-ann) asked if the right to vote is \"a constitutional right and part of the fundamental law of the land, or merely a statutory right, regulated by ordinary law?\" Replying to Thio the following day, Minister for Law [K. Shanmugam](/wiki/K._Shanmugam) referred to the 2001 debate on the matter and confirmed that, having conferred with the [Attorney-General](/wiki/Attorney-General_of_Singapore), in the [Government](/wiki/Government_of_Singapore)'s view the right to vote is an implied constitutional right arising from various provisions of the Constitution, including Articles 65 and 66. Article 65 sets out the requirements for the [prorogation and dissolution of Parliament](/wiki/Parliament_of_Singapore#Sessions). Articles 65(2) to 65(3A) explain when the Prime Minister may dissolve Parliament, while Article 65(4) specifically provides that Parliament has a fixed term: \"Parliament, unless sooner dissolved, shall continue for 5 years from the date of its first sitting and shall then stand dissolved.\" Article 66 states: \"There shall be a general election at such time, within 3 months after every dissolution of Parliament, as the [President](/wiki/President_of_Singapore) shall, by Proclamation in the Gazette, appoint.\" The Minister also said: > The power of our citizens to vote cannot be a privilege, because that would imply that there is some institution superior to the body of citizens which is in a position to grant such a privilege to the citizens. But in a free country, there is no institution that can be in such a position to grant such a privilege to the citizens. In a Representative Democracy like Singapore, voting is therefore a right, not a privilege. As regards the High Court's view in *Taw Cheng Kong*, the Minister noted that it could not be treated as a [precedent](/wiki/Precedent) since \"[t]he legal nature of the citizens' right to vote was not an issue in that case and was not specifically argued\". Thio Li-ann has commented that the Minister's clarification \"dealt the *quietus est* to the High Court's odd pronouncement in *Taw Cheng Kong v. Public Prosecutor*\". ## Proposals to express the right in the Constitution ### 1966 Constitutional Commission On 18 January 1966, shortly after [Singapore's independence](/wiki/History_of_the_Republic_of_Singapore#Independence_from_Malaysia), the President appointed a Constitutional Commission led by [Chief Justice](/wiki/Chief_Justice_of_Singapore) [Wee Chong Jin](/wiki/Wee_Chong_Jin) to consider how the rights of racial, linguistic, and religious minorities in the nascent nation should be protected. In its report on 27 August 1966, the Commission recommended entrenching the right to vote as a \"fundamental right\" in the form of \"the right to elect a government of their choice as expressed in general elections held at reasonable periodic intervals by secret vote\". The chief justification for this proposal was the relatively infant or immature culture of democracy in a newly independent nation that was \"barely one year old\". The report noted that citizens had only exercised the right to vote twice in general elections, in (/wiki/1959_Singaporean_general_election) and (/wiki/1963_Singaporean_general_election) respectively. Hence: > The people of Singapore have thus had little experience of general elections nor can it be safely assumed that they have grown up to cherish as an inalienable right, the right to be governed by a government of their own choice, expressed in periodic and general elections by universal and equal suffrage and held by secret vote ... [W]e do not consider it safe to assume that a significant proportion of the people of Singapore will be able to realise, until it is too late to prevent it, that any inroads have been made into the democratic system of general elections by a future government intent on undermining first and ultimately destroying the practice of democracy in Singapore. However, Parliament decided not to entrench the right to vote, instead relegating voting rights to statutory regulation under the Parliamentary Elections Act. ### 2009 parliamentary debate During the 2009 parliamentary debate on the right to vote's status, Thio Li-ann proposed that, to avoid doubt, the right should be specifically set out in the Constitution. She argued that entrenching the right to vote through an Article in the Constitution would provide the opportunity to protect the details of the right. Currently, voting is regulated by the PEA. As it is an ordinary statute, it can be altered with a simple parliamentary majority by future governments seeking to amend or restrict voting rights. Thio said that expressing the right to vote clearly in the Constitution would allow aspects of that right such as voter secrecy and the universality and equality of votes to be protected from unjust manipulation. However, the Minister for Law said the Government was of the opinion that as the right to vote is an implied right in the Constitution, it was unnecessary for the Constitution to be amended to expressly mention the right. Articles 65 and 66 of the Constitution would be entrenched once Article 5(2A) is brought into force. That Article, which has remained in abeyance since it was introduced in 1991, provides that a [bill](/wiki/Bill_(proposed_law)) that seeks to amend, among other things, Article 65 or 66, must be supported at a national [referendum](/wiki/Referendum) by not less than two-thirds of the votes cast, unless the President consents to the amendment. Shanmugam went on to state that the concerns of the 1966 Constitutional Commission were now moot, as Singapore had since experienced ten general elections with a 95% voter turnout each time. Therefore, it could be assumed that the idea and experience of voting were deeply ingrained in Singaporean voters. Furthermore, some countries choose to draft their constitutions in great detail while others, like Singapore, set out a basic philosophy. He noted that countries such as North Korea and Myanmar were among those that had set out the right to vote within their constitutions. Shanmugam concluded that what was fundamental to protecting the right to vote was a Government committed to the [rule of law](/wiki/Rule_of_law_doctrine_in_Singapore). Following the parliamentary debate, in a 2009 article Thio elaborated that entrenching the right to vote in the Constitution would make it significantly more difficult for any corrupt government that came into power to curtail it, as a [super-majority](/wiki/Supermajority) of at least two-thirds of all [elected Members of Parliament](/wiki/Parliament_of_Singapore#Elected_Members) would be needed before a constitutional amendment could be made. Otherwise, with control over a [simple majority](/wiki/Majority) of Parliament, a ruling party, if it chose to, could direct amendments to the PEA or create new legislation to provide some citizens with, say, double the number of votes and protect this from constitutional challenge using a [notwithstanding clause](/wiki/Notwithstanding_clause) (that is, a provision stated to have legal effect despite the existence of other inconsistent laws). By not protecting such an important right, the freedom of Singapore's electoral system could be progressively curtailed. A similar point has been made by [Singapore Management University](/wiki/Singapore_Management_University) constitutional law professor Jack Lee who noted that since Article 66 does not define the term *general election*: > ... there does not appear to be anything in the Constitution to prevent a future government from, say, requiring all candidates to have their \"suitability\" for political office determined by a government-appointed committee meeting in private, the decision of which would be final. There could still be a \"general election\" of sorts, but clearly a greatly-impoverished version. Thio also argued that without a constitutionally expressed right to vote, the judiciary is handicapped in interpreting this implied right, given its conservative approach to reading the Constitution and the fact that it is unlikely to appeal to normative ideas such as representative democracy. ## Judicial implication of the right in the Constitution Despite the Government's unequivocal view that the right to vote is an implied constitutional right, in Singapore it is the courts that ultimately determine the meaning of the Constitution. Thio Li-ann has suggested that since the right's status is not likely to be brought before the courts in a dispute, the [Cabinet](/wiki/Cabinet_of_Singapore) should refer the matter to the [Constitution of the Republic of Singapore Tribunal](/wiki/Constitution_of_the_Republic_of_Singapore_Tribunal) pursuant to Article 100 of the Constitution for an authoritative opinion. Thio has argued that a court convened to determine whether the right to vote exists in the Constitution would give serious weight to the Minister of Law's pronouncements on the status of the right, as to agree with it would affirm rather than challenge executive or legislative power. Also, section 9A of the Interpretation Act requires a [purposive interpretation](/wiki/Purposive_theory) of written law, including the Constitution, to \"promote the purpose or object underlying the written law\". Sections 9A(3)(c) and (d) identify ministerial speeches made at the second readings of bills or \"any relevant material in any official record of debates in Parliament\" as appropriate aspects of the interpretive matrix. The court might then take one or both of the following approaches. ### Originalist interpretation The courts may choose to establish an imputed intention or traditional understanding of the existence of a right to vote, derived from the drafting style associated with the drafters of [Westminster](/wiki/Westminster_system) constitutions rather than the drafted text as it is. Thio has said that the framers of the Constitution worked with certain assumptions which they did not make explicit. In *Hinds v. The Queen* (1975), the [Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council) said that: > ... a great deal can be, and in drafting practice often is, left to necessary implication from the adoption in the new constitution of a governmental structure which makes provision for a legislature, an executive and judicature. It is taken for granted that the basic principle of [separation of powers](/wiki/Separation_of_powers) will apply to the exercise of their respective functions by these three organs of government. The court in *Hinds* held that, as \"a rule of construction applicable to constitutional instruments\" adopting the Westminster system, the \"absence of express words\" did not prevent the judicial powers of the new state being exclusively exercised by the judicature\". Similarly, the right to vote was necessarily implied into the Constitution through its genesis as an adaptation of the Westminster system of democracy. ### Interpretation based on text and structure Thio has also argued that the courts may find that an implied right to vote can be derived from the existing structure of the Constitution and a purposive reading of Articles 65 and 66. According to this reading, a constitutional right to vote must be logically or practically necessary for preserving the integrity of that structure, as constitutionally established. In Articles 25 and 26 of the Constitution, the appointment of the Prime Minister requires that he commands \"the confidence of the majority of the Members of Parliament\". As the Constitution places emphasis on the need for democratic legitimacy as well as general elections, it may be reasonable to infer that the structure of the Constitution provides for a right to vote as a fundamental instrument of democratic legitimacy. ## Exercise of the vote The Parliamentary Elections Act regulates the exercise of the vote and sets out the procedures for [parliamentary elections in Singapore](/wiki/Parliamentary_elections_in_Singapore). The right to vote in Singapore extends only to [Singapore citizens](/wiki/Singaporean_nationality_law) who are ordinarily resident in Singapore and not less than 21 years old on the cut-off date for the registration of electors. This is known as the \"prescribed date\", and is currently 1 January of a particular year. A person is considered to be ordinarily resident in Singapore on 1 January in a year if he or she has lived in the country for a total of 30 days during the three years immediately before that date, even if on 1 January the person is not resident in the country. Whether people are entitled to vote at a [presidential election](/wiki/Presidential_elections_in_Singapore) also depends on whether they are entitled to have their names entered or retained in a register of electors maintained under the PEA. Singapore has a [one person, one vote](/wiki/One_man,_one_vote) system: [plural voting](/wiki/Plural_voting) – that is, voting more than once in the electoral division that one is assigned to, or voting in more than one electoral division – is illegal. Following a relative swing in votes against the ruling [People's Action Party](/wiki/People%27s_Action_Party) government in the [general election of 1984](/wiki/1984_Singaporean_general_election), the Prime Minister [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) raised the possibility of modifications to the one person, one vote system and said: \"It is necessary to try and put some safeguards into the way in which people use their votes to bargain, coerce, to push, to jostle and get what they want without running the risk of losing the services of the government, because one day, by mistake, they will lose the services of the government.\" Subsequently, in an interview to the US magazine *[Foreign Affairs](/wiki/Foreign_Affairs)* in January 1994, Lee, now [Senior Minister](/wiki/Senior_Minister_of_Singapore), suggested that a person between the ages of 40 and 60 with a family should be given two votes because \"he is likely to be more careful, voting also for his children. He is more likely to vote in a serious way than a capricious young man under 30. But we haven't found it necessary yet. If it became necessary, we should do it. ... I'm not intellectually convinced that one-man, one-vote is the best. We practise it because that's what the British bequeathed us and we haven't really found a need to challenge that.\" In a later media interview published in *[The Straits Times](/wiki/The_Straits_Times)* on 8 May 1994, Lee said: > It is not necessary to change our system at present. But, later, we may have to give more weighting to the people whose views should carry more weight because their contributions are greater, and their responsibilities are greater; in which case, we should consider giving those between the ages of 35 and 60, married and with families, one extra vote. Their contribution to the economy and to society is greatest at this stage of life. Also, they need to vote for themselves and also for their children. Their children have an interest that needs to be protected. Once past 60, their children would have grown up, and would vote for themselves. Then the parents should drop back to one vote. But during those critical years, 35–60, people who carry twice as much responsibility should have two votes. This will make for a more viable system and a more stable society. Lee suggested that such a change should perhaps be implemented \"in 15 to 20 years\" if Singapore's [birth rate](/wiki/Birth_rate) had not increased, as policies might then be disproportionately influenced by people aged 60 and over. However, he emphasized that these were his personal views and had not been discussed by the Cabinet. To date, no such modification to the voting system has been made. ### Overseas voting Prior to May 2001, voters who were overseas on polling day could not vote. Operational concerns such as insufficient Singapore missions around the world, the possibility that the last known addresses of Singapore citizens overseas might not be current, and the difficulty of keeping track of citizens who were abroad, were cited for this restriction. Some commentators took the view that such logistical issues should not deprive Singaporeans of their \"sacred right to vote\". Overseas voting was eventually introduced for both parliamentary and presidential elections with effect from 15 May 2001. Speaking during the Second Reading of the bill that led to the change in the law, the Minister for Home Affairs, Wong Kan Seng, said that the Government recognized that increasing numbers of Singaporeans studied and worked abroad due to [economic globalization](/wiki/Economic_globalization). Thus, it had decided to introduce overseas voting on a small scale at the next general elections. At that time, the law generally required overseas voters to have resided in Singapore for an aggregate of two years during the five-year period before the prescribed date. However, Singaporeans whom the Government had posted abroad were exempted from this requirement and so were their families. The Minister explained that this requirement for residence in Singapore was a \"necessary pre-condition to constituency representation and to prevent plural voting\". J.B. Jeyaretnam criticized this restriction as discriminating against overseas voters. However, following the [terrorist attacks that occurred in the United States on 11 September 2001](/wiki/September_11_attacks) and [American military action in Afghanistan](/wiki/War_in_Afghanistan_(2001%E2%80%93present)) on 7 October, the Government decided to temporarily suspend overseas voting at the [2001 general election](/wiki/2001_Singaporean_general_election) as having large numbers of Singaporeans congregating at known locations at known times could put them at risk of further terrorist attacks. Therefore, overseas voting first took place at the [2006 general election](/wiki/2006_Singaporean_general_election). The number of Singapore citizens who registered to vote overseas was 1,017, and of these, 553 resided in the 16 constituencies that were contested in the election. Eventually, 335 electors voted at eight polling stations around the world. With effect from 3 March 2009, the residence requirement for overseas voters was reduced to an aggregate of 30 days during the three years immediately before the prescribed date, and the special dispensation of the requirement applying to citizens working or studying abroad at the Government's direction and their families was removed. The change was described in Parliament as a measure to \"allow more overseas Singaporeans to vote. All an overseas Singaporean needs to do is to come home for 10 days a year to visit his family and friends.\" ### Limitations on voting A person is disqualified from voting in the following situations, which include engaging in acts incompatible with being a Singapore citizen, being of unsound mind, or being in prison for committing a criminal offence: PersonVoter QualificationReasonPersons in drug rehabilitation centreYesHowever, there is no voting place for drug rehabilitation centre for people to vote. The name will be removed from the Registers of Electors, and can apply to restore his name on e-Services. It is a free restoration.Persons in prison in any countryNoThere is no voting place for a voter serving the prison sentence, or death sentence to vote, as it is due to safety, security and operational concerns. Hence, the name will be removed from the Registers of Electors immediately. Upon completion of the prison sentence (except for death sentence), the name can be restored on e-Services. It is also a free restoration.Convicted of corrupt or illegal practice, or disenfranchised due to report by election judge; Voting in an electoral division that one is not assigned to, or engaging in plural voting amounts to an illegal practice.NoIt will violate the Parliamentary Elections Act or Presidential Elections Act. Liable on conviction by a District Court to a fine and to imprisonment for a term not exceeding 5 years and shall, on conviction, become incapable for a period of 7 years from the date of his or her conviction of being registered as an elector or of voting at any election under this Act or of being elected as the President or a Member, and if at that date he or she has been elected a Member, his or her election shall be vacated from the date of the conviction.Applying for or acquiring citizenship of another countryNoThe voter will be revoked from voting in Singapore and the Register of Electors will delete the person involved. Dual citizenship is only allowed until the age of 21, where either you have to renounce foreign citizenship or lose Singapore citizenship. New citizens will then be allowed into the data register. Also, Singapore voters who vote in foreign countries may lose their right to vote in Singapore. One issue that has arisen is whether a Singaporean who votes in a foreign country where the right to vote is not exclusive to nationals of that country is disqualified from voting in a Singapore election. For instance, the United Kingdom permits citizens of [Commonwealth](/wiki/Commonwealth_of_Nations) countries, including Singapore, who are resident in the UK and have leave to remain there (or do not require such leave) to register to vote in [general elections](/wiki/Elections_in_the_United_Kingdom#General_elections) and [local government elections](/wiki/Elections_in_the_United_Kingdom#Regional_and_local_elections). When queried, the [Elections Department](/wiki/Elections_Department) stated that since suffrage in the UK is not exclusive to British citizens, Singaporeans who vote there are still eligible to vote in Singapore. However, this interpretation of the PEA has not been tested in court.Voluntarily claiming or exercising rights in a country outside Singapore, such rights being given exclusively to nationals of that country.NoTaking an [oath of allegiance](/wiki/Oath_of_allegiance) to any foreign power.NoApplying to another country for a passport of that country.NoBeing a serving member of any foreign armed force, unless the person is [domiciled](/wiki/Domicile_(law)) in Singapore.NoHospitalisation or giving birthYesThere is no voting facility in the hospitals. Hospitalisation is regarded as a valid reason for not voting. It is a free restoration.Persons who are travelling overseasYesOverseas voting facility is only meant for overseas Singaporeans. Hence, locals who travel overseas will be removed from the Registers of Electors after the election. Upon the return to Singapore, you may restore the name on e-Services. It is a free restoration.Unsound mindNoBeing found to be of unsound mind.Death of voterYesThe voter’s name will be removed from the Registers of Electors when they are next revised. Family members of the deceased do not need to take any action.Registration of Elector DataNoHaving had his or her name removed from the register of electors, and not having had it restored after the data closure deadline. #### Voting by prisoners Another potentially controversial provision is section 6(1)(b) of the Parliamentary Elections Act, which denies voting to convicted criminals serving jail sentences. Once the person has been sentenced to imprisonment whether Singapore or any other country, the name will immediately be removed from the Register of Electors, but upon release, ELD will send a restoration application form. Being in prison or drug rehabilitation centre is acceptable reason for restoration and is free. The issue of the constitutionality of this restriction has not yet arisen in any Singapore court, but during a Parliamentary debate in May 2001, Non-constituency Member of Parliament J.B. Jeyaretnam challenged the provision as unconstitutional. The Singapore position may be compared with the situation in other jurisdictions. In Malaysia, the right to vote is entrenched in Article 119 of the [Federal Constitution](/wiki/Constitution_of_Malaysia), but suffrage is similarly denied to those serving prison terms. In *Yazid bin Sufaat v. Suruhanjaya Pilihanraya Malaysia* (2009), it was held that while detainees under the [Internal Security Act 1960](/wiki/Internal_Security_Act_(Malaysia)) – who have not been convicted of any crime – still enjoy the right to vote in national elections, that right may only be exercised only in the constituencies they are registered in, and does not extend to allowing them to vote while incarcerated elsewhere. A survey of European countries reported in *[Hirst v. United Kingdom (No. 2)](/wiki/Hirst_v_United_Kingdom_(No_2))* (2005), a judgment of the [European Court of Human Rights](/wiki/European_Court_of_Human_Rights), found that 18 states allowed prisoners to vote without restriction (Albania, Azerbaijan, Croatia, the Czech Republic, Denmark, Finland, Germany, Iceland, Lithuania, Macedonia, Moldova, Montenegro, the Netherlands, Portugal, Slovenia, Sweden, Switzerland and Ukraine), while in 13 states all prisoners were not allowed to vote (Armenia, Belgium, Bulgaria, Cyprus, Estonia, Georgia, Hungary, Ireland, Russia, Serbia, Slovakia, Turkey and the United Kingdom). In another 13 states, the right to vote could be restricted in some way (Austria, Bosnia and Herzegovina, France, Greece, Italy, Luxembourg, Malta, Norway, Poland, Romania, Spain, Latvia and Liechtenstein). In *Hirst*, the [UK Government](/wiki/Government_of_the_United_Kingdom)'s denial of the vote to prisoners was ruled contrary to [Protocol 1, Article 3](/wiki/European_Convention_on_Human_Rights#Article_3_–_elections), of the [European Convention on Human Rights](/wiki/European_Convention_on_Human_Rights), which protects the right to regular, free and fair elections. The European Court said that the UK had to justify any deviation from universal suffrage, but the UK Government has so far desisted from applying the judgment after the [House of Commons](/wiki/House_of_Commons_of_the_United_Kingdom) voted on 10 February 2012 to maintain the country's blanket ban on voting by prisoners. In Canada, the [Supreme Court](/wiki/Supreme_Court_of_Canada) held in *[Sauvé v. Canada (Chief Electoral Officer)](/wiki/Sauv%C3%A9_v._Canada_(Chief_Electoral_Officer))* (2002), that a statutory provision prohibiting prisoners serving a sentence of two years or more from voting unjustifiably infringed the fundamental right to vote guaranteed by [section 3](/wiki/Section_Three_of_the_Canadian_Charter_of_Rights_and_Freedoms) of the [Canadian Charter of Rights and Freedoms](/wiki/Canadian_Charter_of_Rights_and_Freedoms). The Court noted that the [Government](/wiki/Government_of_Canada) could not demonstrate how denying prisoners the vote helped the stated aims of the relevant statute; a democracy built on inclusiveness, democracy and citizen participation cannot be party to a law that disenfranchises a considerable part of the population. There was also no credible theory why prisoners should be denied the right to vote as a form of punishment, as it is arbitrary and not related to the offender's criminal act nor does it deter crime or rehabilitate criminals. The foregoing cases may be contrasted with the position in the United States. The [Supreme Court of the United States](/wiki/Supreme_Court_of_the_United_States) held in *[Richardson v. Ramirez](/wiki/Richardson_v._Ramirez)* (1974) that a California statute permanently removing the right to vote from any person convicted of an \"infamous crime\" unless the right to vote was restored by court order or executive pardon did not violate the [Equal Protection Clause](/wiki/Equal_Protection_Clause) of the [Fourteenth Amendment](/wiki/Fourteenth_Amendment_to_the_United_States_Constitution) to the [United States Constitution](/wiki/United_States_Constitution). The Court noted that there was explicit constitutional approval for laws [disenfranchising](/wiki/Disfranchisement) [felons](/wiki/Felony#United_States) since section 2 of the Amendment reduced a state's representation in [Congress](/wiki/United_States_Congress) if the state has denied the right to vote for any reason \"except for participation in rebellion, or other crime\". Thus, it was unnecessary for the statute in question to be narrowly tailored to serve compelling state interests to be consistent with equal protection. - [Elections in Singapore](/wiki/Elections_in_Singapore) - [Parliamentary elections in Singapore](/wiki/Parliamentary_elections_in_Singapore) - [Presidential elections in Singapore](/wiki/Presidential_elections_in_Singapore) ## Notes - [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore) (1999 Reprint). - \"Is Voting a Privilege or a Right?\", *Singapore Parliamentary Debates, Official Report* (16 May 2001), vol. 73, cols. 1720–1730. - Parliamentary Elections Act (Cap. 218, 2011 Rev. Ed.) (\"PEA\"). - [Thio, Li-ann](/wiki/Thio_Li-ann) (2009), \"Westminster Constitutions and Implied Fundamental Rights: Excavating an Implicit Constitutional Right to Vote\", *Singapore Journal of Legal Studies*: 406–434, [SSRN](/wiki/SSRN_(identifier)) 1543638. ### Articles - Lua, Ee Laine; Sim, Disa Jek Sok; Koh, Christopher Theng Jer (1996), \"Principles and Practices of Voting: The Singapore Electoral System\", *Singapore Law Review*, **17**: 244–321, archived from the original on 7 February 2021, retrieved 8 November 2012. - Tey, Tsun Hang (2008), \"Singapore's Electoral System: Government by the People?\", *Legal Studies*, **28** (4): 610–628, [doi](/wiki/Doi_(identifier)):10.1111/j.1748-121X.2008.00106.x, [S2CID](/wiki/S2CID_(identifier)) 143965283. - [Thio, Li-ann](/wiki/Thio_Li-ann) (1993), \"The Post-colonial Constitutional Evolution of the Singapore Legislature: A Case Study\", *Singapore Journal of Legal Studies*: 80–122. - Thio, Li-ann (2002), \"The Right to Political Participation in Singapore: Tailor-making a Westminster-modelled Constitution to Fit the Imperatives of Asian Democracy\", *Singapore Journal of International and Comparative Law*, **6**: 181–243. ### Books - Tan, Kevin Y[ew] L[ee]; Thio, Li-ann (2010), \"The Legislature\", *Constitutional Law in Malaysia and Singapore* (3rd ed.), Singapore: [LexisNexis](/wiki/LexisNexis), pp. 299–360 at 324–331, [ISBN](/wiki/ISBN_(identifier)) 978-981-236-795-2. - Thio, Li-ann (2012), \"The Legislature and the Electoral System\", *A Treatise on Singapore Constitutional Law*, Singapore: [Academy Publishing](/wiki/Singapore_Academy_of_Law), pp. 285–359 at 293–298, [ISBN](/wiki/ISBN_(identifier)) 978-981-07-1515-1.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:13:15.150059",
  "title": "Voting rights in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Voting_rights_in_Singapore"
}