{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:13:23.075195"
  },
  "content": "Malaysian politician (born 1952) **Wan Azizah binti Wan Ismail**[b] (born 3 December 1952) is a Malaysian politician who served as the [spouse of the prime minister of Malaysia](/wiki/Spouse_of_the_prime_minister_of_Malaysia) as the wife of [Anwar Ibrahim](/wiki/Anwar_Ibrahim). A member of the [People's Justice Party](/wiki/People%27s_Justice_Party_(Malaysia)), she is the first woman to served as [deputy prime minister of Malaysia](/wiki/Deputy_Prime_Minister_of_Malaysia), a position she held from 2018 to 2020. Born in Singapore, Wan Azizah graduated from the [Royal College of Surgeons in Ireland](/wiki/Royal_College_of_Surgeons_in_Ireland). She practised medicine, specialised in ophthalmology, and served as a government doctor for 14 years before leaving in 1993. Entering politics in 1998 after her husband's dismissal, she led the *[Reformasi](/wiki/Reformasi_(Malaysia))* movement and founded the National Justice Party (PKN), later [People's Justice Party](/wiki/People%27s_Justice_Party_(Malaysia)) (PKR), becoming the second woman to lead a parliamentary party in Malaysia. She won the [Permatang Pauh](/wiki/Permatang_Pauh_(federal_constituency)) seat in (/wiki/1999_Malaysian_general_election), retained it in (/wiki/2004_Malaysian_general_election), and briefly stepped aside in (/wiki/2008_Malaysian_general_election) for her husband's return, but continued to lead PKR as it grew into an opposition force. Wan Azizah became Malaysia's first female [leader of the Opposition](/wiki/Leader_of_the_Opposition_(Malaysia)) in April 2008, but resigned later that year to allow her husband to succeed her. During her time in opposition, she spoke out on [human rights issues](/wiki/Human_rights_in_Malaysia), and was active in domestic debates on [Malay supremacy](/wiki/Malay_supremacy), governance, and land issues. She continued her political career, winning the [Kajang by-election](/wiki/2014_Kajang_by-election) in 2014 and later reclaiming [Permatang Pauh](/wiki/Permatang_Pauh_(federal_constituency)) in (/wiki/2015_Permatang_Pauh_by-election). She won the [Pandan](/wiki/Pandan_(federal_constituency)) seat in (/wiki/2018_Malaysian_general_election) and became Malaysia's first female deputy prime minister, while also serving as [minister of women, family and community development](/wiki/Minister_of_Women,_Family_and_Community_Development_(Malaysia)). She left office during the [2020 political crisis](/wiki/2020%E2%80%932022_Malaysian_political_crisis) but returned to the [Dewan Rakyat](/wiki/Dewan_Rakyat) in (/wiki/2022_Malaysian_general_election) after winning the [Bandar Tun Razak](/wiki/Bandar_Tun_Razak_(federal_constituency)) seat. Following her husband's appointment as [prime minister](/wiki/Prime_Minister_of_Malaysia) that year, she became the spouse of the prime minister. ## Early life and education Wan Azizah was born on 3 December 1952 at [KK Women's and Children's Hospital](/wiki/KK_Women%27s_and_Children%27s_Hospital) in [Singapore](/wiki/Colony_of_Singapore). Her father was Wan Ismail Wan Mahmood, and her mother, Mariah Khamis, raised her along with her three sisters and one brother. She is of [Peranakan Chinese](/wiki/Peranakan_Chinese) descent and was raised as a [Malay Muslim](/wiki/Islam_in_Malaysia). She began her education at St. Nicholas Convent School before continuing her secondary studies at [Tunku Kurshiah College](/wiki/Tunku_Kurshiah_College). She went on to study medicine at the [Royal College of Surgeons in Ireland](/wiki/Royal_College_of_Surgeons_in_Ireland), where she received a gold medal in [obstetrics](/wiki/Obstetrics) and [gynaecology](/wiki/Gynaecology). Wan Azizah established a medical practice where she primarily treated women, later specialising in ophthalmology. She served as a government doctor for 14 years before resigning in 1993. That same year, she shifted from her medical career to roles more closely associated with political life, taking on honorary positions, hosting visiting dignitaries, and becoming a patron of the [National Cancer Council](/wiki/MAKNA). ## Early political career Wan Azizah entered politics in September 1998 following the dismissal and arrest of her husband [Anwar Ibrahim](/wiki/Anwar_Ibrahim) on [charges of sodomy and corruption](/wiki/Anwar_Ibrahim_sodomy_trials). The event drew widespread domestic and international criticism and led her to assume leadership of the *[Reformasi](/wiki/Reformasi_(Malaysia))* movement.[c] She founded the Social Justice Movement, later named the National Justice Party (PKN) in April 1999. She was the second woman in Malaysia to lead a political party and the first to do so with parliamentary representation after winning the [Permatang Pauh](/wiki/Permatang_Pauh_(federal_constituency)) seat with a 9,077-vote majority that year. She promoted reform and attempted to unite opposition forces to confront [Mahathir's government](/wiki/First_premiership_of_Mahathir_Mohamad), although she was unsuccessful in preventing his party from retaining a supermajority in the [1999 general election](/wiki/1999_Malaysian_general_election). Wan Azizah rejected the idea of [Malay unity](/wiki/Ketuanan_Melayu) as the central political issue following the election. Instead, she argued that Malay support had shifted to the opposition due to disillusionment with leadership, abuses of power, [corruption](/wiki/Corruption_in_Malaysia), police brutality, mismanagement of the [economy](/wiki/Economy_of_Malaysia), and a judiciary that was seen to lack independence. In August 2003, PKN merged with the [Malaysian People's Party](/wiki/Malaysian_People%27s_Party) (PRM) to become the [People's Justice Party](/wiki/People%27s_Justice_Party_(Malaysia)) (PKR), with Wan Azizah as president. She contested the [2004 general election](/wiki/2004_Malaysian_general_election) on the ticket of the new party and retained the Permatang Pauh seat by a margin of 590 votes and became the PKR's sole representative in Parliament. In 2007, Wan Azizah indicated her readiness to vacate the party presidency when Anwar announced his intention to return to politics despite being legally barred. She also relinquished the Permatang Pauh parliamentary seat, allowing Anwar, running as a PKR candidate, to win the [by-election](/wiki/2008_Permatang_Pauh_by-election). Under her continued leadership, the PKR won 31 seats in the [2008 general election](/wiki/2008_Malaysian_general_election), during which she defended her Permatang Pauh seat with a majority of 13,388 votes. ## Leader of the Opposition On 30 April 2008, Wan Azizah became the first woman to hold the post of [Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Malaysia)). Her position was acknowledged during coalition negotiations by the [Malaysian United Indigenous Party](/wiki/Malaysian_United_Indigenous_Party), led by [Mahathir Mohamad](/wiki/Mahathir_Mohamad) and [Muhyiddin Yassin](/wiki/Muhyiddin_Yassin). This recognition helped sustain the PKR's leadership role within the opposition despite internal divisions and uncertainty over succession. That same year, Wan Azizah sent a letter to [Myanmar's ambassador](/wiki/Tin_Latt_(diplomat)) expressing concern over the [military junta](/wiki/State_Peace_and_Development_Council)'s decision to proceed with a [constitutional referendum](/wiki/2008_Myanmar_constitutional_referendum) despite the ongoing [Cyclone Nargis](/wiki/Cyclone_Nargis) crisis. She submitted a motion urging [Speaker](/wiki/Speaker_of_the_Dewan_Rakyat) [Pandikar Amin Mulia](/wiki/Pandikar_Amin_Mulia) to call for a postponement of the vote, to prioritise relief efforts and to press the regime to grant greater access to aid workers. She also called on the [Malaysian government](/wiki/Third_Abdullah_cabinet) to use its influence to advocate for a delay, though the motion was rejected on the grounds of Malaysia's policy of neutrality and noninterference. Her tenure as opposition leader ended on 28 August 2008, when she resigned to make way for her husband, who succeeded her. In 2010, Wan Azizah Wan Ismail called for the abolition of [Malay supremacy](/wiki/Malay_supremacy), highlighting its exploitation by a small elite and advocating for Malaysian children to grow up as \"Malay of Integrity.\" In June 2011, she faced a [RM](/wiki/Malaysian_ringgit)200 million defamation suit filed by [Federal Land Development Authority](/wiki/Federal_Land_Development_Authority) (Felda) over articles in **Suara Keadilan**, with the [High Court](/wiki/High_court_(Malaysia)) deciding her case would be heard separately from a related suit against former [deputy minister](/wiki/Minister_of_Entrepreneur_and_Cooperatives_Development_(Malaysia)) [Tan Kee Kwong](/wiki/Tan_Kee_Kwong). In April 2012, she urged Felda to return 306,000 acres (124,000 ha) of [Sabah](/wiki/Sabah) land, arguing the agency had failed to develop it for settlers and had converted it into profitable [palm oil plantations](/wiki/Palm_oil_production_in_Malaysia). In 2013, she confirmed she would not contest the [general election](/wiki/2013_Malaysian_general_election), focusing instead on the PKR's campaign and engaging women voters. In 2014, the High Court ruled in favour of Felda, raising the defamation damages Wan Azizah and her co-defendants were required to pay from RM70,000 to RM2 million. Later that year, on 9 March, the PKR selected Wan Azizah as its candidate for the [Kajang by-election](/wiki/2014_Kajang_by-election), and she won the seat on 23 March with a majority of 5,379 votes. In August, she received support from the [Pan-Malaysian Islamic Party](/wiki/Pan-Malaysian_Islamic_Party) to lead [Selangor](/wiki/Selangor), a move by the opposition to challenge the long-ruling [UMNO](/wiki/UMNO)-led [Barisan Nasional](/wiki/Barisan_Nasional) (BN) coalition, which had faced criticism over governance and ethnic policies. Wan Azizah later contested the Permatang Pauh seat for the PKR, winning with a majority of 8,841 votes, and was sworn in as opposition leader on 18 May 2015, reclaiming the seat vacated by Anwar following his imprisonment in February. In 2016, she helped forge an alliance between the opposition coalition and Mahathir's [Malaysian United Indigenous Party](/wiki/Malaysian_United_Indigenous_Party). By January 2018, the coalition, known as the [Alliance of Hope](/wiki/Alliance_of_Hope), designated Mahathir as its prime ministerial candidate and Wan Azizah as his prospective deputy, uniting diverse factions and contributing to BN's defeat in the 2018 general election. Wan Azizah subsequently contested and won the [Pandan](/wiki/Pandan_(federal_constituency)) seat with a majority of 52,543 votes. ## Deputy Prime Minister Following the [general election](/wiki/2018_Malaysian_general_election), she was appointed as [deputy prime minister](/wiki/Deputy_Prime_Minister_of_Malaysia) in the [seventh Mahathir cabinet](/wiki/Seventh_Mahathir_cabinet) and took office on 21 May 2018 after securing 64,733 votes. She became the first woman to hold the position and was sworn in before [Muhammad V of Kelantan](/wiki/Muhammad_V_of_Kelantan) at [Istana Negara](/wiki/Istana_Negara,_Jalan_Tuanku_Abdul_Halim), alongside 13 other cabinet ministers, while also serving concurrently as [minister of women, family and community development](/wiki/Minister_of_Women,_Family_and_Community_Development_(Malaysia)). During her time in office, Wan Azizah made several diplomatic visits. On 26 February 2019, she held a meeting with [Hassanal Bolkiah](/wiki/Hassanal_Bolkiah) during her first official visit to Brunei. Later that year, on 9 July, she met with [Vice President of China](/wiki/Vice_President_of_China) [Wang Qishan](/wiki/Wang_Qishan) at [Zhongnanhai](/wiki/Zhongnanhai). On 12 February 2020, she publicly honoured three women whistle-blowers from the Auditor General's Office for exposing tampering in the [1MDB](/wiki/1MDB) audit report, praising their courage and calling for greater female involvement in anti-corruption efforts. On the following day, she urged women's empowerment and greater engagement at an [APEC](/wiki/APEC) symposium in [Putrajaya](/wiki/Putrajaya), highlighting the need for education, advocacy, and safe reporting channels to combat corruption. According to former attorney-general [Tommy Thomas](/wiki/Tommy_Thomas_(barrister)), Wan Azizah was the preferred candidate of [Abdullah of Pahang](/wiki/Abdullah_of_Pahang) for interim [prime minister](/wiki/Prime_Minister_of_Malaysia) following Mahathir’s resignation in February 2020. She officially left office on 25 February 2020. Her tenure as deputy prime minister ended when Abdullah dissolved the cabinet on Mahathir's advice, amid the [2020 political crisis](/wiki/2020%E2%80%932022_Malaysian_political_crisis), which involved the resignation and interim reinstatement of the prime minister. Her successor, [Ismail Sabri Yaakob](/wiki/Ismail_Sabri_Yaakob), was appointed later, in July 2021, by Prime Minister Muhyiddin. ## Spouse of Prime Minister In the [2022 general election](/wiki/2022_Malaysian_general_election) on 19 November, Wan Azizah won the [Bandar Tun Razak](/wiki/Bandar_Tun_Razak_(federal_constituency)) parliamentary seat with a majority of 9,817 votes, defeating candidates from [Perikatan Nasional](/wiki/Perikatan_Nasional) and BN. Her husband was sworn in as Malaysia's prime minister on 24 November 2022, making her the [spouse of the Prime Minister of Malaysia](/wiki/Spouse_of_the_prime_minister_of_Malaysia). She later participated in a mental health discussion at the [APEC United States 2023](/wiki/APEC_United_States_2023) on 17 November, hosted by [Jill Biden](/wiki/Jill_Biden), where she highlighted concerns over artificial intelligence and data privacy's impact on mental well-being. On 9 September 2024, Wan Azizah called for global action to end the [Gaza war](/wiki/Gaza_war) and prioritise rebuilding educational institutions, emphasising that education is a fundamental right and vital for children's survival. On 10 January 2025, she welcomed [Yoshiko Ishiba](/wiki/Yoshiko_Ishiba), wife of [Shigeru Ishiba](/wiki/Shigeru_Ishiba), in Putrajaya. ## Personal life Wan Azizah married Anwar Ibrahim on 28 February 1980, and the couple have six children, the eldest being [Nurul Izzah](/wiki/Nurul_Izzah_Anwar), a member of parliament. In November 2022, she declared assets worth about RM1.4 million, including RM1 million in cash and savings and four vehicles valued at RM360,000, with no debts, property, or other investments. She accompanied her husband to perform [Umrah](/wiki/Umrah) on 12 November 2023, where they also prayed for peace and prosperity in [Palestine](/wiki/Palestine) following the [OIC](/wiki/OIC) Extraordinary Summit in [Riyadh](/wiki/Riyadh). In October 2024, Wan Azizah underwent a medical procedure at Sultan Idris Shah Hospital in [Serdang](/wiki/Serdang,_Kedah). ## Election results [Parliament of Malaysia](/wiki/Dewan_Rakyat) YearConstituencyCandidateVotesPctOpponent(s)VotesPctBallots castMajorityTurnout(/wiki/1999_Malaysian_general_election)**P044 [Permatang Pauh](/wiki/Permatang_Pauh_(federal_constituency))****Wan Azizah Wan Ismail** ([**keADILan**](/wiki/People%27s_Justice_Party_(Malaysia)))**23,820****61.77%**[Ibrahim Saad](/wiki/Ibrahim_Saad) ([UMNO](/wiki/United_Malays_National_Organisation))14,74338.23%39,2109,07778.94%(/wiki/2004_Malaysian_general_election)**Wan Azizah Wan Ismail** ([**PKR**](/wiki/People%27s_Justice_Party_(Malaysia)))**21,737****50.69%**[Pirdaus Ismail](/wiki/Pirdaus_Ismail) ([UMNO](/wiki/United_Malays_National_Organisation))21,14749.31%43,73459080.93%(/wiki/2008_Malaysian_general_election)**Wan Azizah Wan Ismail** ([**PKR**](/wiki/People%27s_Justice_Party_(Malaysia)))**30,338****64.16%**[Pirdaus Ismail](/wiki/Pirdaus_Ismail) ([UMNO](/wiki/United_Malays_National_Organisation))16,95035.84%47,44213,38881.17%(/wiki/2015_Permatang_Pauh_by-election)**Wan Azizah Wan Ismail** ([**PKR**](/wiki/People%27s_Justice_Party_(Malaysia)))**30,316****57.09%**Suhaimi Sabudin ([UMNO](/wiki/United_Malays_National_Organisation))21,47540.44%53,1028,84174.53%(/wiki/2018_Malaysian_general_election)**P100 [Pandan](/wiki/Pandan_(federal_constituency))****Wan Azizah Wan Ismail** ([**PKR**](/wiki/People%27s_Justice_Party_(Malaysia)))**64,733****75.47%**Leong Kok Wee ([MCA](/wiki/Malaysian_Chinese_Association))12,19014.21%85,77452,54384.66%Mohamed Sukri Omar ([PAS](/wiki/Malaysian_Islamic_Party))8,3359.72%[Lee Ying Ha](/wiki/Lee_Ying_Ha) ([PRM](/wiki/Parti_Rakyat_Malaysia))4420.52%Wan Muhd Azri Wan Deris ([IND](/wiki/Independent_politician))730.09%(/wiki/2022_Malaysian_general_election)**P124 [Bandar Tun Razak](/wiki/Bandar_Tun_Razak_(federal_constituency))****Wan Azizah Wan Ismail** ([**PKR**](/wiki/People%27s_Justice_Party_(Malaysia)))**43,476****46.74%**[Kamarudin Jaffar](/wiki/Kamarudin_Jaffar) ([BERSATU](/wiki/Malaysian_United_Indigenous_Party))33,65936.18%93,0219,81778.74%Chew Yin Keen ([MCA](/wiki/Malaysian_Chinese_Association))15,88617.08%[Selangor State Legislative Assembly](/wiki/Selangor_State_Legislative_Assembly) YearConstituencyCandidateVotesPctOpponent(s)VotesPctBallots castMajorityTurnout(/wiki/2014_Kajang_by-election)**N25 [Kajang](/wiki/Kajang_(state_constituency))****Wan Azizah Wan Ismail** ([**PKR**](/wiki/People%27s_Justice_Party_(Malaysia)))**16,741****59.57%**[Chew Mei Fun](/wiki/Chew_Mei_Fun) ([MCA](/wiki/Malaysian_Chinese_Association))11,36240.43%28,3145,37972.09% ## Awards and honours In 2008, Wan Azizah was awarded the [Order of the Defender of State](/wiki/Order_of_the_Defender_of_State#Knight_Commander), carrying the title *[Datuk Seri](/wiki/Datuk_Seri)*, during [Penang](/wiki/Penang)'s [state honours](/wiki/List_of_honours_of_Penang_awarded_to_heads_of_state_and_royalty) in recognition of her contributions to public service and leadership. She later received an honorary fellowship from the Academy of Medicine Malaysia on 7 July 2023, followed by an honorary Doctorate of Philosophy in Political and Social Sciences from the [University of Selangor](/wiki/University_of_Selangor) on 9 September 2023. She also had a new orchid hybrid named after her, during the launch of Orkid Putrajaya 2023, on 14 December of that year. On 26 April 2025, she was awarded the Lifetime Achievement Award in Ophthalmology by the Malaysian Society of Ophthalmology for her contributions to eye care and medical education. On 14 June 2025, she was conferred the Eminent Educator Award by [Nazrin Shah of Perak](/wiki/Nazrin_Shah_of_Perak) for her role in advancing medical education and the Parallel Pathway training programme in Malaysia. - [Penang](/wiki/Penang) - Knight Commander of the [Order of the Defender of State](/wiki/Order_of_the_Defender_of_State) (DPPN) – **Dato' Seri** (2008) ## Notes - Asia Week: A Woman of Grace - Result of Malaysian General Election 2008 for Permatang Pauh Party political officesPreceded byPosition established **President of the [People's Justice Party](/wiki/People%27s_Justice_Party_(Malaysia))** 1999–2018Succeeded by[Anwar Ibrahim](/wiki/Anwar_Ibrahim) **Leader of the [People's Pact](/wiki/Pakatan_Rakyat)** 2008[Parliament of Malaysia](/wiki/Parliament_of_Malaysia)Preceded byAnwar Ibrahim **Member of the [Dewan Rakyat](/wiki/Dewan_Rakyat) for [Permatang Pauh](/wiki/Permatang_Pauh_(federal_constituency))** 1999–2008Succeeded byAnwar Ibrahim **Member of the [Dewan Rakyat](/wiki/Dewan_Rakyat) for [Permatang Pauh](/wiki/Permatang_Pauh_(federal_constituency))** 2015–2018Succeeded by[Nurul Izzah Anwar](/wiki/Nurul_Izzah_Anwar)Preceded by[Rafizi Ramli](/wiki/Rafizi_Ramli) **Member of the [Dewan Rakyat](/wiki/Dewan_Rakyat) for [Pandan](/wiki/Pandan_(federal_constituency))** 2018–present**Incumbent**Political officesPreceded by[Lim Kit Siang](/wiki/Lim_Kit_Siang) **[Leader of the Opposition](/wiki/Leader_of_the_Opposition_(Malaysia))** 2008, 2015–2018Succeeded byAnwar IbrahimPreceded byAnwar IbrahimSucceeded by[Ahmad Zahid Hamidi](/wiki/Ahmad_Zahid_Hamidi)Preceded by[Ahmad Zahid Hamidi](/wiki/Ahmad_Zahid_Hamidi) **[Deputy Prime Minister of Malaysia](/wiki/Deputy_Prime_Minister_of_Malaysia)** 2018–2020Succeeded by[Ismail Sabri Yaakob](/wiki/Ismail_Sabri_Yaakob)Portals: - Malaysia - Biography - Politics\n",
  "language": "en",
  "processed_at": "2026-01-12T12:13:23.074905",
  "title": "Wan Azizah Wan Ismail",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Wan_Azizah_Wan_Ismail"
}