{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:13:35.646406"
  },
  "content": "Park at Singapore River **Waterboat House Garden** is a small park located near the mouth of the [Singapore River](/wiki/Singapore_River), near the [Central Business District](/wiki/Central_business_district#Singapore) (CBD) in Singapore. The park was once the original site of the former Merlion Park where the two iconic statues of the [Merlion](/wiki/Merlion) and its miniature form were originally located. ## History ### Launch The first Merlion Park was originally located near the mouth of the [Singapore River](/wiki/Singapore_River) was designed by the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) as an emblem of Singapore in 1964. The park was officially opened at an installation ceremony for the [Merlion](/wiki/Merlion) statue, officiated by [Prime Minister](/wiki/Prime_Minister_of_Singapore) [Lee Kuan Yew](/wiki/Lee_Kuan_Yew) on 15 September 1972. The original statues of the Merlion and its miniature version used to stand at the mouth of the Singapore River with [Anderson Bridge](/wiki/Anderson_Bridge_(Singapore)) as its background. The main statue was made from November 1971 to August 1972 by Singaporean sculptor [Lim Nang Seng](/wiki/Lim_Nang_Seng). It measures 8.6 meters high and weighs 70 tons. ### Relocation of the Merlion Statue Due to the completion of the [Esplanade Bridge](/wiki/Esplanade_Bridge) in 1997, the statue could no longer be viewed clearly from the [Marina Bay](/wiki/Marina_Bay,_Singapore) Waterfront. On 23 April 2002, the Merlion statue and its miniature statue were relocated from its original location to a new pier specially built on the other side of the Esplanade Bridge adjacent to the [One Fullerton Hotel](/wiki/The_Fullerton_Hotel_Singapore), which was completed on 25 April 2002. The new [Merlion Park](/wiki/Merlion_Park), which is four times bigger than the original site, had officially been opened since then. ### Present The site of former Merlion Park had since being renamed as the Waterboat House Garden, so named from the nearby historical building [Waterboat House](/wiki/Waterboat_House), the renovated Water House which was built in 1919. - [Merlion](/wiki/Merlion) - [Merlion Park](/wiki/Merlion_Park)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:13:35.646129",
  "title": "Waterboat House Garden",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Waterboat_House_Garden"
}