{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:13:31.609598"
  },
  "content": "Both [Singapore](/wiki/Singapore) and [Malaysia](/wiki/Malaysia) have a [conflict](/wiki/Water_conflict) over [water supplies](/wiki/Water_supply) ever since Singapore was separated from Malaysia in 1965. In 1910, the municipal leadership of Singapore and Sultan Ibrahim of the state and territories of [Johor](/wiki/Johor) in neighbouring [Malaya](/wiki/British_Malaya) signed an agreement that allowed Singapore to rent land in Johor and use its water for free. This was to ensure sufficient water supply in the rapidly modernising colonial city of Singapore during the 1900s. The Municipal Water Department of Singapore, under [David J. Murnane](/wiki/David_J._Murnane), began importing raw water from Gunong Pulai in 1927 and filtered water on 31 December 1929. Since then, several water agreements had been signed between two countries. ## History ### The 1927 Agreement The first water agreement was signed between [Sultan Ibrahim II](/wiki/Ibrahim_of_Johor) the [Sultan of Johor](/wiki/Sultan_of_Johor) and the Municipal Commissioners of the Town of Singapore on 5 December 1927, under the [Legislative Council of the Straits Settlements](/wiki/Legislative_Council_of_the_Straits_Settlements). It is no longer in force. Singapore was allowed to rent 8.5 km2 of land in Gunong Pulai in the [Malaysian state](/wiki/States_and_federal_territories_of_Malaysia) of [Johor](/wiki/Johor_Bahru) for supplying raw water, for the price of 30 sen per 4,047 sqm as annual rental fees but the cost of water was zero. An additional 64.7 km2 of land in Johor was set aside for possible further use, with additional fees. For its part, Johor could have 3,637 cubic metres daily of treated water from Singapore at a rate of 25 sen per 4.55 cu m, with a provision for an increase after 1929. ### The 1961 Agreement On 1 September 1961, the [Federation of Malaya](/wiki/Federation_of_Malaya) signed an agreement giving Singapore the right to draw up to 86 million imperial gallons (390,000 m3) of water per day collectively from the [Tebrau River](/wiki/Tebrau_River), the [Skudai River](/wiki/Skudai_River), the [Pontian](/wiki/Pontian_District) Reservoir, and the [Gunung Pulai](/wiki/Mount_Pulai) Reservoir, with effect through 2011. Under this agreement, Singapore to pay annual rent of RM5 per acre for the land, as well as 3 sen for every 1,000 gallons of raw water drawn. In return, Singapore to supply Johor daily with treated water of up to 12 percent of the raw water drawn, with a minimum of 18,184 cu m, and at the price of 50 cents per 1,000 gallons. The agreement outlines a possible review in 25 years. ### The 1962 Agreement On 29 September 1962, a further agreement was signed providing Singapore the right to draw up to 250 million imperial gallons (1,100,000 m3) per day from the [Johor River](/wiki/Johor_River), with effect until 2061. Both agreements stipulated the price of 3 Malaysian cents per 1,000 imperial gallons (4,500 L). Under the agreement, Singapore pays rent on the land “at the standard rate applicable to building lots on town land”, and follows water rates and prices stated in the 1961 agreement with the provision of price review possible in 25 years. *1986 and 1987, the 25-year mark for the two agreements.* Johor decides not to review the prices under the agreement and further agrees that neither country can unilaterally raise the price of water. ### The 1990 Agreement In 1994, Linggiu Reservoir was built upstream of the Johor River and collects and releases rainwater. This pushes seawater back into the sea, ensuring that the river water is not too salty to be treated. It is operated by the [Public Utilities Board](/wiki/Public_Utilities_Board) (PUB) of Singapore. The agreement has been further supplementary to the 1962 agreement. [The Separation Agreement](/wiki/Independence_of_Singapore_Agreement_1965) signed between Singapore and Malaysia on 7 August 1965 guaranteed the water agreements from 1961 and 1962 and grant Singapore rights to the use of water originating on the Malaysia side of border till 2061. ## Conflicts On 5 July 2018, the Malaysian government has stated that the agreements were signed in a different time and that the price should increase. It cites the example of water sold by China to Hong Kong in the past, which was approximately US$5.8 per 1,000 imperial gallons (4,500 L). However, Singapore claimed that this price comparison is not fair because while Hong Kong has borne the cost of constructing the infrastructure and China has borne the cost of maintaining to provide water to Hong Kong, Singapore paid for all the costs of the reservoirs in Johor, the dams, pipelines, plant, equipment, etc., and Singapore paid all costs of operating and maintaining the infrastructure. On 31 August 2011, the 1961 water agreement expired, and the waterworks and facilities were handed over to the Johor state government. The handover included the Skudai and Gunung Pulai water treatment plants, which were built by the Singapore's [Public Utilities Board](/wiki/Public_Utilities_Board) and managed by them for 50 years, as well as two pump houses in [Pontian](/wiki/Pontian_District) and [Tebrau](/wiki/Tebrau). The 1962 Water Agreement, which expires in 2061, entitles Singapore to draw up to 250 million gallons a day (mgd) of water from the [Johor River](/wiki/Johor_River). Singapore pays 3 sen per thousand gallons of raw water and sells treated water back to Johor at 50 sen per thousand gallons, a fraction of the cost of treating the water. There has been numerous disputes between the two nations over the fairness of the deal, with Malaysia arguing Singapore is an affluent nation profiting from Malaysia's water resources due to the deal, and Singapore arguing that its treatment of water and subsequent resale of said treated water to Malaysia is done at a generous price, as Singapore makes no economic profit off the resale due to the costs involved in refining the water.[*citation needed*] On 25 June 2018, [Malaysian Prime Minister](/wiki/Prime_Minister_of_Malaysia) [Mahathir Mohamad](/wiki/Mahathir_Mohamad) stated his intentions of renegotiating the agreement with Singapore as he views the low price at which water is being exported to Singapore has resulted in Malaysia losing a significant amount of revenue. ## Johor River pollution Since early 2015, drought, pollution and large discharges to combat salinity have depleted water levels in Johor River dams to historic lows, forcing Johor to seek additional potable water supplies from Singapore on three occasions in 2015 and 2016 and to impose water rations for 85,000 residents and industrial users in April 2016. On 4 April 2017, the Johor River had become polluted after a reservoir at a bio-composite center burst, causing the contaminated water to flow into the water body. This was one of the several pollutions in the river including the case on 4 April 2019 when high levels of ammonia were found in the river. Singapore's Foreign Affairs Minister [Vivian Balakrishnan](/wiki/Vivian_Balakrishnan) on 8 May 2019 warned that the \"biggest threat\" of the Johor River was the lack of environmental protection and the current water treatments are drawing more water from the river than it can yield on a sustainable basis. There were also growing concern that incidents such as [Kim Kim River toxic pollution](/wiki/2019_Kim_Kim_River_toxic_pollution) would be disastrous for both countries. - [Malaysia–Singapore relations](/wiki/Malaysia%E2%80%93Singapore_relations) - \"1927 Water Agreement\" (PDF). Retrieved 24 February 2010. - Lee Poh Onn (2003). \"The water issue between Singapore and Malaysia: no solution in sight?\" (PDF). *Ecomics and Finance No.1*. Institute of Southeast Asian Studies. Retrieved 18 January 2008.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:13:31.609312",
  "title": "Water conflicts between Malaysia and Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Water_conflicts_between_Malaysia_and_Singapore"
}