{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:13:34.074692"
  },
  "content": "* *Water supply and sanitation in Singapore** are intricately linked to the historical development of [Singapore](/wiki/Singapore). It is characterised by a number of outstanding achievements in a challenging environment with geographical limitations. Access to water in Singapore is universal, affordable, efficient and of high quality. Innovative [hydraulic engineering](/wiki/Hydraulic_engineering) and integrated water management approaches such as the reuse of [reclaimed water](/wiki/Reclaimed_water), the establishment of protected areas in urban rainwater catchments and the use of estuaries as freshwater reservoirs have been introduced along with seawater [desalination](/wiki/Desalination) in order to reduce the country's dependence on untreated imported water. As a result of such efforts, Singapore has achieved self-sufficiency with its water supply since the mid-2010s. Examples include its \"Four National Taps\" for its water supply. Five desalination plants[a] have been opened throughout the country since 2003, which in total are able to produce a maximum capacity of approximately 195,000 million imperial gallons (890,000,000 m3) per day. Singapore's approach does not simply rely on physical infrastructure, but it also emphasises proper legislation and enforcement, water pricing, public education as well as research and development. In 2007, Singapore's water and sanitation utility, the [Public Utilities Board](/wiki/Public_Utilities_Board), received the [Stockholm Industry Water Award](/wiki/Stockholm_Industry_Water_Award) for its holistic approach to water resources management. Singapore was also the first country in Asia to institute a comprehensive [fluoridation](/wiki/Fluoridation) programme which covers the entirety of its population. The water was fluoridated at 0.7 ppm using [sodium](/wiki/Sodium) [silicofluoride](/wiki/Silicofluoride). ## History ### Early local water supply (until 1979) The history of common water supply in Singapore began with the construction of the [MacRitchie Reservoir](/wiki/MacRitchie_Reservoir), which was built by the British in 1866. During the drought of 1902 the Water Department cut supply to just 2–3 hours per day. Singapore faced a severe shortfall in water and stored water was estimated to be 70 million gallons, or less, against consumption of 2.5 million gallons per day. Evaporation from the reservoir made the situation worse and there were daily records of the falling water level in the reservoir. There was public pressure to prioritise the town's water supply over 'shipping interests'. The leader writer in the Singapore Free Press Weekly recognised the needs of the port and shipping industry for fresh water had to be considered as 'most important' otherwise '[Singapore] may as well be shut up'. Water meters were already in use in Singapore in 1902. In an article during the 'Water Famine' a householder complained of his meter whizzing round even though only air came through the pipe. The householder feared being charged the tariff (20 cents per 1,000 gallons or 4.4 cents per m3) but was assured by the Water Department that his bill would be corrected to the average consumption over previous months. The same article highlights that, in searching for water and drilling artesian wells, it was discovered that no geological survey of the island of Singapore had ever been undertaken. Another faulty water meter resulted in a court case involving attempted bribery of a Water Department official. A large water consumer was convicted of offering a bribe to have his faulty water meter left alone and uncorrected. [Lower Peirce Reservoir](/wiki/Lower_Peirce_Reservoir) and the [Upper Seletar Reservoir](/wiki/Upper_Seletar_Reservoir) were completed in 1913 and 1949 respectively, in order to supply the rapidly modernising colonial city with sufficient water. In 1927 the municipal leadership of Singapore and Sultan Ibrahim of the state and territories of [Johor](/wiki/Johor) in neighboring [Malaya](/wiki/British_Malaya) signed an agreement that allowed Singapore to rent land in Johor and use its water for free. The Municipal Water Department, under [David J. Murnane](/wiki/David_J._Murnane), began importing raw water from Gunong Pulai in 1927 and filtered water on 31 December 1929. The water filtration and pipeline capacity from Gunong Pulai was doubled in 1939. In 1938, another pipeline was built to return a quantity of treated water to Johor. During the [Fall of Singapore](/wiki/Fall_of_Singapore) in 1942, the causeway that linked Singapore with the Malay Peninsula was blown up by retreating British troops to slow down the Japanese advance, thus destroying the pipeline, which left Singapore with decreased water reserves that could last at most two weeks. According to [Lee Kuan Yew](/wiki/Lee_Kuan_Yew), this was one of his motives to envision water self-sufficiency for Singapore going forward when he became the country's first prime minister. ### Expansion of water imports and of local reservoirs (1965–1997) After the war, Singapore continued to grow rapidly and more water was needed to sustain the city’s growth. The 1927 agreement was superseded by two new agreements signed in 1961 and 1962 between the independent federation of Malaya and the self-governing British territory of Singapore. They foresaw the payment of a water rate in addition to the rent for the land. Under these agreements Singapore built two water treatment plants in Singapore and a new, expanded pipeline from Johor. Singapore also supplied treated water to Johor far below the cost of treating the water. At the time of the agreements it was expected that Singapore would become part of Malaysia, as it did for a brief period beginning in 1963. When Singapore separated from Malaysia in 1965, then Malaysian Prime Minister [Tunku Abdul Rahman](/wiki/Tunku_Abdul_Rahman) said that \"If Singapore’s foreign policy is prejudicial to Malaysia’s interests, we could always bring pressure to bear on them by threatening to turn off the water in Johor\". Decades later, Malaysia clarified that the statement should be seen in context that at the time, [Malaysia and Indonesia were engaged in a confrontation](/wiki/Indonesia%E2%80%93Malaysia_confrontation) and that the remark referred to the possibility of Singapore siding with Indonesia. This was another motive for Singapore to further develop its local water resources, according to Lee Kuan Yew. Therefore, in parallel to the gradual expansion of water imports from Johor the [Public Utilities Board](/wiki/Public_Utilities_Board), created in 1963, embarked on the construction of more water schemes inside Singapore. They included the damming of river estuaries to allow for greater storage volumes. For example, the Kranji-Pandan Scheme, completed in 1975, included the damming of the estuary of the Kranji river and the construction of a reservoir at Pandan. In the same year, the [Upper Peirce Reservoir](/wiki/Upper_Peirce_Reservoir) was completed. As part of the Western Catchment Scheme, completed in 1981, another four rivers were dammed. In 1983, a dam was built across the estuary of the Seletar River to form the [Lower Seletar Reservoir](/wiki/Lower_Seletar_Reservoir). But these amounts were still not sufficient, and seawater desalination was too expensive at the time to be considered. Singapore was thus interested in building a dam on the Johor River in Malaysia and an associated new water treatment plant. After six years of difficult negotiations, the Prime Ministers of Singapore and Malaysia signed a Memorandum of Understanding (MOU) in 1988 paving the way for an agreement in 1990 with Johor that allowed the construction of a dam (Linggiu Dam) in the state that will be operated by Singapore. Ever since, Singapore's Public Utilities Board has operated a water treatment plant in [Kota Tinggi](/wiki/Kota_Tinggi), Johor, known as the Johor River Water Works. ### Water negotiations (1998–2002) In 1998, Singapore began new negotiations with Malaysia to extend its water agreements beyond 2011 and 2061 respectively. In return, Malaysia initially asked to increase the raw water price to 60 sen per 1,000 imperial gallons (4,500 L), corresponding to 4 US cents per cubic meter. This price was still much lower than the cost of desalinated seawater or of NEWater. However, in 2002 Malaysia asked for a much higher price of 6.4 Malaysian Ringgit per 1,000 imperial gallons (4,500 L) (US$0.45 per cubic meter), arguing that Hong Kong paid the equivalent of 8 Malaysian Ringgit per 1,000 imperial gallons (4,500 L) for water from China. The new price proposed by Malaysia was close to the price of desalinated water. The government of Singapore said that Malaysia had no right to alter the price of water because of the deal that they have, which included Malaysia receiving treated water from Singapore. It further clarified that the price paid by Hong Kong included payment for substantial infrastructure provided by China, while Malaysia provided only access to raw water and the infrastructure necessary to convey the water inside Malaysia was entirely paid for by Singapore. Singapore decided to refuse to accept a higher price and its initial goal to extend the agreements beyond 2061. Instead, Singapore decided to achieve a different path of self-sufficiency in its water supply before 2061. Subsequently, negotiations would end in 2003 without result. ### Towards water self-sufficiency (2002–2011) While the negotiations were ongoing however, Singapore was already prepared for greater water self-sufficiency through an integrated water management approach including [water reuse](/wiki/Water_reuse) and desalination of seawater. In 1998, the government initiated a study, the Singapore Water Reclamation Study (NEWater Study), to determine if reclaimed water treated to potable standards was a viable source of water. In order to facilitate the new integrated approach, the [Public Utilities Board](/wiki/Public_Utilities_Board), which had previously been in charge of water supply only, was given the responsibility for sanitation as well in 2001. Previously sanitation had been under the direct responsibility of the Ministry of Environment. The new policy was called the \"Four Taps\": The first and second taps were local water catchments and water imports. In 2002, Singapore commissioned its first reclaimed water plant, thus opening a \"Third Tap\". This was done carefully, after a monitoring period of two years to ensure safe water quality. There was also an active marketing campaign that included the opening of a visitor center, the sale of NEWater in [bottles](/wiki/Water_bottle) and the Prime Minister drinking a bottle of NEWater in front of the cameras. In 2005 Singapore opened its first seawater desalination plant, the \"Fourth Tap\". In the meantime it also further expanded its reservoirs, the \"First Tap\". Today's largest reservoir, the [Marina Bay reservoir](/wiki/Marina_Bay_reservoir), was inaugurated in 2008. It is located in the estuary of a river that has been closed off by a barrage to keep the seawater out. Two similar barrages were completed in July 2011, forming the [Punggol Reservoir](/wiki/Punggol_Reservoir) and the [Serangoon Reservoir](/wiki/Serangoon_Reservoir). When the 1961 water agreement with Malaysia ended in August 2011, Singapore could thus afford to let it expire without any issues to its water supply. Singapore's water usage reaches a demand of about 430 million gallons per day. Of the Four Taps of Supply, Imported water from Johor satisfies about 50 percent of the demand, NEWater can meet up to 40 percent, Desalination up to 25, and the local catchments help to make up the rest. Furthermore, Singapore has become a global water research and technology hub with active support from the government. ### Self-sufficiency and outlook (2011–present) Shortly after its independence, Singapore has set a goal to be entirely water self-sufficient before the 1962 long-term water supply agreement with Malaysia expires in 2061. Nevertheless, a 2003 analysis by the [Institute of Southeast Asian Studies](/wiki/Institute_of_Southeast_Asian_Studies) stated that such efforts made within the last few decades meant that Singapore has achieved self-sufficiency decades earlier beginning from 2011 and that \"the 'water threat' is now significantly less than what it seemed to be\". This analysis eventually proved true; a report in 2016 has shown that Singapore has achieved self-reliance with its water supply during the mid-2010s. Nevertheless, water demand in Singapore is expected to double from 380 to 760 million gallons per day between 2010 and 2060. Demand are to keep up with this increase. By the mid-21st century, water demand is expected to be met by reclaimed water at the tune of 50% and by desalination accounting for 30%, compared to only 20% supplied by internal catchments. In response, the government especially since the 2010s has constructed multiple desalination plants throughout the country to keep up with the demand. These include the Tuas South Desalination Plant, Tuas Desalination Plant, the Keppel Marina East Desalination Plant and the [Jurong Island Desalination Plant](/wiki/Jurong_Island_desalination_plant), which began operations in 2013, 2018, 2020 and 2022 respectively. ## Water sources and integrated management **The water resources of Singapore** are especially precious given the small amount of densely settled land. Singapore receives an average of 2,400 mm of rainfall annually, well above the global average of 1,050 mm. The constraint is the limited land area to catch and store the rainfall, and the absence of natural [aquifers](/wiki/Aquifer) and lakes. Therefore, Singapore relies on four water sources, called the \"Four National Taps\": - Rainfall, collected in artificial [reservoirs](/wiki/Reservoir_(water)) that collect water from carefully managed catchment areas (200–300 million gallons per day, depending on rainfall), - Imported water (up to 250 million imperial gallons (1,100,000 m3) per day, according to the 99-year agreement signed in 1962, plus an additional quantity under the 1990 agreement), - [Reclaimed water](/wiki/Reclaimed_water) (producing what is called [NEWater](/wiki/NEWater)) (up to 115 million imperial gallons (520,000 m3) per day, officially only \"30% of demand\"), and - Seawater [desalination](/wiki/Desalination) (up to 50 million imperial gallons (230,000 m3) per day, officially only \"10% of demand\"). This \"four tap\" strategy aims to reduce reliance on foreign water supply by increasing the volume supplied from the three other sources, or \"national taps\". Since water demand in 2011 was 380 million imperial gallons (1,700,000 m3) per day, Singapore could actually already have been water self-sufficient in 2011 except in years of very low rainfall. The official figures downplay the share of reclaimed and desalinated water in water supply, and thus the ability of the country to be self-sufficient. However, the Chairman of PUB admitted in 2012 that water self-sufficiency could be achieved well before the target year of 2061. In Singapore, water management is closely integrated with land management. The latter is tightly controlled in order to prevent any pollution of water resources through sewage, sullage or other sources of pollution. The management of water supply, sanitation and stormwater drainage is managed by a single agency, the Public Utilities Board, in an integrated and coordinated manner. ### Water from catchment areas Two thirds of the country's surface area are classified as partly protected catchment areas with certain restrictions on land use, so that the rainwater can be collected and used as drinking water. As of 2012,[update] surface water was collected in 17 raw water reservoirs. Singapore's oldest reservoirs - MacRitchie, Lower Peirce, Upper Selatar as well as the more recently built Upper Peirce Reservoir - are all located in the [Central Catchment Nature Reserve](/wiki/Central_Catchment_Nature_Reserve), a protected area that has been reforested to protect the water resources and act as a \"green lung\" for the city. The larger reservoirs, however, have been built after independence and are located in river estuaries that have been closed off by barrages. Reservoir water is treated through chemical coagulation, [rapid gravity filtration](/wiki/Rapid_gravity_filter) and disinfection. ### Imported water Singapore's imported water comes through a pipeline that runs along a 1 km bridge, the [Johor–Singapore Causeway](/wiki/Johor%E2%80%93Singapore_Causeway), that also carries a road and a railway. Imported water has gradually reduced over the years; as of 2009,[update] imported water had been reduced from 50% previously to 40% of total consumption. After the expiry of a 1961 water agreement between Malaysia and Singapore in 2011, two agreements are in force now. One was signed in 1962 and another one in 1990. Both will expire in 2061. Under the first agreement the price of raw water was set at 3 Malaysian sen per 1,000 imperial gallons (4,500 L), corresponding to about 0,2 US cents per cubic meter. Under this agreement Singapore is entitled to receive up to 250 million imperial gallons (1,100,000 m3) per day, corresponding to 56% of its water use of 380 million imperial gallons (1,700,000 m3) in 2011. Furthermore, under the 1990 agreement, Singapore is entitled to buy an additional unspecified quantity of treated water from the Linggiu Dam at a price that is higher than under the previous agreement. ### Reclaimed water In Singapore, [reclaimed water](/wiki/Reclaimed_water) is branded as [NEWater](/wiki/NEWater) and is bottled directly from an advanced water purification facility for educational and celebratory purposes. Though most of the reused water is used for high-tech industry in Singapore, a small amount is returned to reservoirs for drinking water. NEWater is the [brand name](/wiki/Brand) given to ultra-pure water that is produced from [reclaimed water](/wiki/Reclaimed_water). [Wastewater](/wiki/Wastewater), which is called \"used water\" in Singapore, is treated in conventional advanced wastewater treatment plants that are called reclamation plants in Singapore. The effluent from the reclamation plants is either discharged into the sea or undergoes further microfiltration, reverse osmosis and ultraviolet treatment. Reclaimed water provides 40% of Singapore's water requirements. Using the NEWater technology, cleaned water is recycled to create ultra-clean, premium reclaimed water. Up to 55% of Singapore's water demand is anticipated to be satisfied by NEWater by 2060. The quality of NEWater is monitored by, among others, an international panel of experts and exceeds the [World Health Organization](/wiki/World_Health_Organization) (WHO) standards for drinking water, much higher than imported water. In 2012, there were four NEWater factories, located at the [Bedok](/wiki/Bedok), [Kranji](/wiki/Kranji), Ulu Pandan and [Changi](/wiki/Changi) next to five water reclamation plants. At the end of 2002, the programme had garnered a 98 percent acceptance rate among Singaporeans, with 82% of respondents indicating that they would drink the reused water directly, another 16% only when mixed with reservoir water. The produced NEWater after stabilization (addition of alkaline chemicals) is in compliance with the WHO requirements and can be piped off to its wide range of applications (e.g. reuse in industry, discharge to a drinking water reservoir). [NEWater](/wiki/NEWater) now makes up around 30% of Singapore's total use, by 2060 Singapore's National Water Agency plans to triple the current NEWater capacity as to meet 50% of Singapore's future water demand. Most of the NEWater is used by industries for non-potable uses such as [wafer fabrication](/wiki/Wafer_fabrication). The rest is fed into nearby reservoirs. As of 2019,[update] according to PUB, NEWater was able to meet 30% of Singapore's water requirements. The high purity of the water has actually allowed industries to reduce their costs. With the construction of the Deep Tunnel Sewerage System the decentralized water reclamation plants and NEWater factories are expected to be gradually closed and replaced by the single, much larger water reclamation plant and NEWater factory at Changi at the Eastern end of Singapore Island. The Bedok reclamation plant was the first one to be decommissioned in 2009, followed by the Seletar plant in 2011. The Bedok NEWater plant, however, continued to operate, while the Seletar NEWater plant was decommissioned along with the reclamation plant. The Kranji, Ulu Pandan and Bedok reclamation plants had been upgraded in 1999–2001, making them more compact so that they needed less land and covering them for odor control in order to make nearby land more valuable. ### Desalinated seawater On 13 September 2005, the country opened its first [desalination](/wiki/Desalination) plant, SingSpring Desalination Plant, in [Tuas](/wiki/Tuas) at the southwestern tip of Singapore Island. The S$200 million plant, built and operated by [Hyflux](/wiki/Hyflux), can produce 30 million imperial gallons (140,000 m3) of water each day and meets 10% of the country's water needs. In 2007, the Sungei Tampines was established as a test project for future large-scale desalination projects. This project would influence further desalination projects in the country, as the reliability of the dual-purpose desalination concept was tested on a smaller scale. That facility, which also draws freshwater and seawater from surrounding sources, is able to produce around one million gallons a day. The bid to build and operate Singapore's second and largest desalination plant, Tuaspring Desalination Plant (since renamed Tuas South Desalination Plant), with a capacity of 70 million imperial gallons (320,000 m3) per day, also located at Tuas, was launched in June 2010. Hyflux won the contract in April 2011, and the plant began operations two years later in 2013. In May 2019, following financial losses from the plant, PUB took over the Tuaspring Desalination Plant. In June 2018, a third desalination plant, the Tuas Desalination Plant (TDP), was opened. Functioning also as a test bed for energy saving technology, the plant can produce 30 million imperial gallons (140,000 m3) of water per day. Together, desalinated water from SingSpring, Tuaspring and the Tuas Desalination Plants can meet up to 30% of Singapore's current water needs as of 2019.[update] In 2019, government has identified five other coastal sites for future plants in the coming decades, with the objective of bringing the installed capacity to one million m³ per day, so that desalination will be able to meet up to 30% of Singapore's future water demand by 2060. In June 2020, Singapore began operating its fourth desalination plant, the Keppel Marina East Desalination Plant (KMEDP). In April 2022, a fifth desalination plant began operations, the [Jurong Island Desalination Plant](/wiki/Jurong_Island_desalination_plant) (JIDP). Plant nameDate of commissioningMaximum capacity (ML/day)OperatorSingSpring Desalination Plant2005137KeppelTuas South Desalination Plant2013320PUBTuas Desalination Plant2018137PUBKeppel Marina East Desalination Plant2020137Keppel[Jurong Island Desalination Plant](/wiki/Jurong_Island_desalination_plant)2022137Tuas Power–Singapore Technologies Marine (TP–STM) consortium ## Water research and technology ### Sanitation Until 2010, wastewater in Singapore was collected through a sewer system that included 139 pumping stations that pumped water to six wastewater treatment plants. These pumping stations and plants were gradually decommissioned while a newer system, the Deep Tunnel Sewerage System (DTSS) was made operational. The Changi Water Reclamation Plant, the heart of the first phase of the DTSS, was opened by Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) in June 2009. The first phase of the DTSS consists of a 48-km long deep tunnel sewer that runs 20 to 55 metres below ground, and channels used water to the Changi Water Reclamation Plant at the Eastern end of the island. The plant had an initial capacity of 176 million imperial gallons (800,000 m3) per day. Most of the treated used water is discharged into the sea through an outfall, while some of it is further purified into NEWater. The deep tunnel works entirely by gravity, eliminating the need for pumping stations, and thus the risks of used water overflows. At one-third the size of conventional plants, the Changi Water Reclamation Plant is designed to be compact. Centralisation of used water treatment at Changi also allows for economies of scale. In a second phase of the DTSS, the deep tunnel system is to be expanded to the entire island, with a second wastewater treatment plant at Tuas at the Western end of the island. ### Stormwater management The stormwater drainage system in Singapore is completely separated from the sewer system. It consists of 7,000 km of public roadside drains and about 1,000 km of major canals and waterways that are regularly cleaned of debris and maintained by private companies under performance-based contracts with PUB. This system has reduced the flood-prone area from 3,200 hectares in the 1970s to about 49 hectares today[*when?*] despite increased urbanization, which usually would have resulted in more floods. PUB plans to further reduce flood prone areas to 40 hectares by 2013. In the 1960s and 1970s widespread flooding was common in Singapore, especially in the city centre, which is built on relatively low-lying land. Nevertheless, flash floods caused by unusually heavy rains and blocked drains [caused damage in 2010 and 2011](/wiki/2010-2011_Singapore_floods). ### Water use, conservation and efficiency There have also been campaigns to urge people to conserve water, reducing consumption from 165 litres per person per day in 2003 to 155 litres in 2009. The target is to lower it to 140 litres by 2030. Public education was an important instrument to promote [water conservation](/wiki/Water_conservation). For example, a Water Efficiency Labeling Scheme for taps, showerheads, toilets and washing machines was introduced so that consumers could make informed choices when making purchases. The tariff structure was also modified. While tariffs historically included a cross-subsidy from industries that paid a higher price to residential users that paid a lower price for social reasons, this policy was ended and residential users were charged a tariff that covers the full costs of supply. The level of water losses - more precisely defined as [non-revenue water](/wiki/Non-revenue_water) - is one of the lowest in the world at only 5%. ### Responsibility for water supply and sanitation Within the government of Singapore, the [Ministry of Sustainability and the Environment](/wiki/Ministry_of_Sustainability_and_the_Environment) is in charge of policy setting for water and sanitation. The [Public Utilities Board](/wiki/Public_Utilities_Board), a [statutory board](/wiki/Statutory_boards_of_the_Singapore_Government) under the Ministry, is in charge of providing drinking water as well as of sanitation and stormwater drainage. It also monitors compliance of potential polluters on the basis of the Sewerage and Drainage Act. Thus, PUB is both a service provider and a regulator, but its regulatory role only encompasses other entities. The [National Environment Agency](/wiki/National_Environment_Agency) monitors PUB's compliance with environmental as well as drinking water quality standards on the basis of the Environmental and Public Health Act. Legislation is effectively implemented, with heavy fines, and the various agencies in charge of water work together in a coordinated manner under a common framework. ### Research and development In 2006, the Singapore government identified water as a new growth sector and committed to invest S$330 million over the following five years in order to make Singapore a global hub for water research and development. PUB has an active research and development program that includes upstream research, pilot projects and demonstration projects. An Environment and Water Industry Development Council (EWI) has been established to support, together with the National Research Foundation, a Strategic Research Programme on Clean Water. Leading Japanese companies such as [Toshiba](/wiki/Toshiba) and [Toray](/wiki/Toray) have established water research centers in Singapore. Singapore is home to over 70 local and international water companies and 23 research and development centers working on about 300 projects valued at $185 million. Furthermore, the [Lee Kuan Yew School of Public Policy](/wiki/Lee_Kuan_Yew_School_of_Public_Policy) at [National University of Singapore](/wiki/National_University_of_Singapore) established an Institute of Water Policy in 2008. Also since 2008, the country has hosted the [Singapore International Water Week](/wiki/Singapore_International_Water_Week), a key event for the global [water industry](/wiki/Water_industry). ### Financial aspects **Tariffs**. Water and sewer tariffs in Singapore are set at a level allowing cost recovery, including capital costs. Water and sewer tariffs were raised substantially in the late 1990s, so that the average monthly domestic bill including taxes increased from S$13 in 1996 to S$30 in 2000. The sewerage tariff (called \"waterborne fee\") is S$0.30/m3 for domestic users plus a fixed tariff of S$3 per \"chargeable fitting\" per month. The [water tariff](/wiki/Water_tariff) includes a conservation tax set at 30% that increases to 45% for domestic consumption above 40 m3 per month. A general service tax of 7% is added to the bill. As of 2012,[update] a household consuming 20 m3 per month and that has three \"chargeable fittings\" faces a water bill of S$32.5 per month and a sewer bill of S$15 per month, both including all taxes. The total of S$47.5 (USD 37.7) per month corresponds to S$2.38/m3 (US$1.88/m3). Industrial water tariffs are set lower at S$0.52/m3. Water and sewerage tariffs are lower than tariffs in some European countries such as in [Germany](/wiki/Water_supply_and_sanitation_in_Germany) where the average water and sewer tariff including taxes was Euro 3.95 per m3 in 2004. From 2017, the water tariff will increase by 30% in two phases. **Investment**. In the financial year 2010 PUB undertook investments of S$411 million (USD 290 million) in its own assets, mainly for water supply and NEWater, and S$451 million (USD 319 million) for assets belonging to the government, mainly for sanitation and stormwater drainage. This corresponds to annual investments of USD 117 per capita, which is higher than in the [United States](/wiki/Water_supply_and_sanitation_in_the_United_States) where the corresponding figure is USD 97. **Financing**. In 2005 PUB issued for the first time a bond, raising S$400 million, to finance part of its investment program. Since then, bonds have been issued regularly, including a S$300 million bond with a maturity of 20 years in 2007. During the financial year 2010, PUB Group received an operating grant of S$185 million to fund the operation and maintenance of the stormwater drainage network and operating costs of certain water infrastructure assets such as the Marina, Serangoon and Punggol Reservoir schemes. ## Notes Library resources about **Water supply and sanitation in Singapore** - Resources in your library - Resources in other libraries - Ministry of the Environment and Water Resources - Public Utilities Board of Singapore - National Environment Agency Portals: - Singapore - Water\n",
  "language": "en",
  "processed_at": "2026-01-12T12:13:34.074383",
  "title": "Water supply and sanitation in Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Water_supply_and_sanitation_in_Singapore"
}