{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:13:52.210320"
  },
  "content": "This article **relies largely or entirely on a single source**. Relevant discussion may be found on the talk page. Please help improve this article by introducing citations to additional sources. *Find sources:* \"West Mall\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(January 2018)*Shopping mall in Bukit Batok, Singapore **West Mall** ([Chinese](/wiki/Chinese_language): 威城; [pinyin](/wiki/Pinyin): *Wēi Chéng*) is a [shopping centre](/wiki/Shopping_centre) located in [Bukit Batok](/wiki/Bukit_Batok_New_Town), [Singapore](/wiki/Singapore), next to [Bukit Batok MRT station](/wiki/Bukit_Batok_MRT_station). ## Background It was opened in 1998. It consists of eight storeys, for a total gross floor area of 183,000 square feet (17,000 m2), and sitting on a land area of 106,000 square feet (9,800 m2). West Mall houses a mix of retailers, such as fashion and accessory vendors, jewellery retailers, gifts and specialty stores, telcos, cafes and restaurants, a food court, a six-screen [theatre](/wiki/Cathay_Cineplexes), post office, community library, music school, electrical and household store and a supermarket. The mall also has a carpark occupying three basement levels. ### Renovation West Mall has been undergoing renovation works since the first half of 2023, aimed at revitalising its offerings to create a more community-centric and vibrant retail destination. Scheduled for completion in 2025, key changes include a new sheltered plaza for events and gatherings, as well as additional food and beverage and lifestyle shops in Basement 1. The [Bukit Batok Public Library](/wiki/Bukit_Batok_Public_Library) will also be revamped and doubled in size. In February 2025, [Cathay Cineplexes](/wiki/Cathay_Cineplexes) closed its cinema citing expiry of lease with mutual consent with the landlord. - Official website This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:13:52.210015",
  "title": "West Mall",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/West_Mall"
}