{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:13:48.529936"
  },
  "content": "Subzone of Clementi Planning Area in Singapore **West Coast** is a subzone located in the town of [Clementi](/wiki/Clementi,_Singapore), the [western part](/wiki/West_Region,_Singapore) of [Singapore](/wiki/Singapore). The subzone currently lies in the [West Coast GRC](/wiki/West_Coast_Group_Representation_Constituency). Although the West Coast subzone has its boundaries demarcated by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA), adjacent subzones, namely Pandan, portions of Clementi Central, Clementi Woods and the [Port](/wiki/Queenstown,_Singapore), are commonly regarded as part of West Coast by the general public, due to their proximity to [West Coast Park](/wiki/West_Coast_Park), a defying landmark of the area. ## History West Coast was created out of reclaimed land in the 1970s. Despite both being created out of reclaimed land, the east became a recreational area but the west was filled with industries. The western part of West Coast is largely industrial but the eastern and central parts of the area are mostly filled with private housing along with a single HDB estate. ## Amenities ### Commercial Facilities Few amenities exist in the vicinity of private houses and condominiums along West Coast. However, a town centre exists in the heart of the HDB housing estate. It consists of two-storey shophouses on Jalan Mas Puteh, Ayer Rajah Food Centre, Ayer Rajah Market, West Coast Community Centre, and West Coast Market Square. [West Coast Plaza](/wiki/West_Coast_Plaza) (formerly known as Ginza Plaza) lies across the market. There are also Buddhist centres like Singapore Buddhist Meditation Centre and Jayamangala Buddhist Vihara in the town. ### Places of Worship There are three places of worship in West Coast. #### Temples - [Ang Chee Sia Ong Temple](/wiki/Ang_Chee_Sia_Ong_Temple) - Wu Tai Shan Temple (五台山佛公寺) #### Church - Clementi Bible Centre ### Recreation There is a wide variety of sports and recreational facilities around West Coast. Clementi Stadium, which opened in 1983, is set to be redeveloped by 2030 with new facilities including softball and baseball fields, a running track, and community sports courts. The redeveloped site will extend into the vacant land which housed the former West Coast Recreational Centre, which was demolished in 2020. [West Coast Park](/wiki/West_Coast_Park) and [Clementi Woods Park](/wiki/Clementi_Woods_Park) also hold facilities for cycling and a dog run for pups to play. There are also several fitness corners and children's playgrounds throughout West Coast. ## Transportation ### Roads West Coast is well connected with an array of road networks. There are two parallel primary roads which serve West Coast: West Coast Road and [West Coast Highway](/wiki/West_Coast_Highway,_Singapore). [Ayer Rajah Expressway](/wiki/Ayer_Rajah_Expressway) is located along the northern boundary of Clementi West. Jalan Buroh and Penjuru Road are located towards the western end of West Coast, where [Teban Gardens](/wiki/Teban_Gardens) is located. ### Public Transport #### Bus West Coast is also connected by a diverse network of public transportation. SBS Transit services 30, 51, 175, 196, 197, 198, SMRT services 176, 188 and Tower Transit services 78, 97, 143, 282, 285, 963 travels through or loops around West Coast and many of the mentioned bus services links West Coast to [Clementi MRT station](/wiki/Clementi_MRT_station) as well as [Clementi Bus Interchange](/wiki/Clementi_Bus_Interchange). #### Mass Rapid Transit - **CR18** [West Coast](/wiki/West_Coast_MRT_station) (future) Scheduled to be completed in 2032, the [West Coast MRT Station](/wiki/West_Coast_MRT_Station) on the upcoming [Cross Island Line](/wiki/Cross_Island_Line) will be the first MRT station serving residents in West Coast. The MRT station will be located on the former Tanglin Secondary School site. ## Education There are several schools in West Coast, including 1 primary school, 2 secondary schools, 1 international school and 2 Japanese schools. **Primary School** - Qifa Primary School **Secondary Schools** - Kent Ridge Secondary School - [Tanglin Secondary School](/wiki/Tanglin_Secondary_School) **International School** - International Community School **Japanese Schools** - [The Japanese Secondary School](/wiki/The_Japanese_School_Singapore) - [Waseda Shibuya Senior High School](/wiki/Waseda_Shibuya_Senior_High_School_in_Singapore) **Former Schools** - Jin Tai Primary School - Merged with Qifa Primary School in 2008. - Jin Tai Secondary School - Changed name to Clementi Woods Secondary School in 2006. - Jubilee Primary School - Closed down in 1997. - Yusof Ishak Secondary School (Formerly Jubilee Integrated Secondary School) - Moved to Bukit Batok in 1998. - Clementi Woods Secondary School - Merged with Tanglin Secondary School in 2016. - Tanglin Secondary School - Merged with [New Town Secondary School](/wiki/New_Town_Secondary_School) in 2023. ## Politics Currently, West Coast is a part of West Coast ward within the [West Coast GRC](/wiki/West_Coast_Group_Representation_Constituency), its current MP's are [Foo Mee Har](/wiki/Foo_Mee_Har), [Desmond Lee](/wiki/Desmond_Lee_(Singaporean_politician)), [Ang Wei Neng](/wiki/Ang_Wei_Neng) and [Rachel Ong](/wiki/Rachel_Ong). - Singapore portal\n",
  "language": "en",
  "processed_at": "2026-01-12T12:13:48.529633",
  "title": "West Coast, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/West_Coast,_Singapore"
}