{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:13:54.405211"
  },
  "content": "Planning Area in West, Singapore The **Western Islands** is a [planning area](/wiki/Planning_Areas_of_Singapore) located within the [West Region](/wiki/West_Region,_Singapore) of Singapore. It comprises a collection of islands located in the south-western waters of Singapore, namely [Jurong Island](/wiki/Jurong_Island), [Pulau Bukom](/wiki/Pulau_Bukom), [Pulau Semakau](/wiki/Pulau_Semakau), and [Pulau Sudong](/wiki/Pulau_Sudong), on which is the [Pulau Sudong Airport](/wiki/Pulau_Sudong_Airport). The Western Islands originally comprised 27 islands, once home to the native [Malay](/wiki/Malay_Singaporeans) islanders in the past. In the 1990s, the government decided to reclaim land to form one major island, called [Jurong Island](/wiki/Jurong_Island). It was subsequently formed from the amalgamation of several offshore [islands](/wiki/Island), chiefly the seven main islands of Pulau Ayer Chawan, Pulau Ayer Merbau, Pulau Merlimau, Pulau Pesek Besar, Pulau Pesek Kechil, Pulau Sakra, Pulau Soraya, [Pulau Hantu Besar](/wiki/Pulau_Hantu), and [Pulau Hantu Kechil](/wiki/Pulau_Hantu). The planning area is located on the [Singapore Straits](/wiki/Singapore_Straits), with [Tuas](/wiki/Tuas) situated to its west, as well as [Pioneer](/wiki/Pioneer,_Singapore), [Boon Lay](/wiki/Boon_Lay_Planning_Area), [Jurong East](/wiki/Jurong_East) and [Queenstown](/wiki/Queenstown,_Singapore) to its north. Western Islands planning area also shares a maritime boundary with the [Southern Islands](/wiki/Southern_Islands) to its east. It has three subzones, [Jurong Island](/wiki/Jurong_Island) and [Bukom](/wiki/Pulau_Bukom), [Semakau](/wiki/Pulau_Semakau) and [Sudong](/wiki/Pulau_Sudong). ## Location Although called 'Western Islands', the islands are not actually located on the west of the [main island](/wiki/Pulau_Ujong) of [Singapore](/wiki/Singapore). They are in fact located south-west of the main island. The islands are also relatively near to the [Southern Islands](/wiki/Southern_Islands). ## Jurong Island Jurong Island is the biggest and most important [island](/wiki/Island) among the Western Islands. It serves as the [petroleum](/wiki/Petroleum) and [petrochemical](/wiki/Petrochemical) hub of the city-state, and it houses the third largest refining centre in the world. Jurong Island is home to over 94 petroleum, petrochemical, specialty chemical and supporting companies with more than [S$](/wiki/S$)26 billion in fixed assets investment on Jurong Island. Multinational companies such as [ExxonMobil](/wiki/ExxonMobil) and [Shell](/wiki/Royal_Dutch_Shell) have established a strong presence on Jurong Island. Jurong Island is linked to [the main island](/wiki/Pulau_Ujong) by a 2.3 km causeway known as the Jurong Island Highway, opened in March 1999. Access to the island is restricted to persons who have a Jurong Island Security Pass. Other restrictions include that one must declare any photographic equipment that they are bringing to the island. This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:13:54.404897",
  "title": "Western Islands, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Western_Islands,_Singapore"
}