{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:13:58.015293"
  },
  "content": "Former factory in Singapore **Whampoa's Ice House** was a factory near [Coleman Bridge, Singapore](/wiki/Coleman_Bridge,_Singapore). It was owned by [Hoo Ah Kay](/wiki/Hoo_Ah_Kay), commonly known as Whampoa. A replica of the factory currently stands on the factory's former site. ## History The ice factory was completed in 1854, as part of a joint venture with nutmeg planter Gilbert Angus. The factory was built on land given to [Hoo Ah Kay](/wiki/Hoo_Ah_Kay) by the government in exchange for 60 acres of his [nutmeg](/wiki/Nutmeg) plantation, which was suffering from an island-wide disease. Ice was imported from the United States. It was initially assumed that the factory would be able to sell over a thousand pounds of ice a day. However, the factory only managed to sell four hundred to five hundred pounds of ice a day, causing the factory to close after two years in 1856. In 1861, an American firm took over ownership of the factory and reopened it. However, the attempt to revive the factory also failed. In 1904, the factory was occupied by Tai Thong Rubber Works Ltd., the rubber company of businessman [Tan Kah Kee](/wiki/Tan_Kah_Kee). In 1981, the factory was demolished to allow for the widening of [River Valley Road](/wiki/River_Valley_Road). A replica of the factory was later built on the former site of the factory. The factory possessed Victorian wrought-iron [balustrade](/wiki/Balustrades), which caused it to become a landmark. - BiblioAsia article 1°17′26″N 103°50′49″E﻿ / ﻿1.29046°N 103.84683°E﻿ / 1.29046; 103.84683 This article about a Singapore building or structure is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:13:58.014990",
  "title": "Whampoa's Ice House",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Whampoa%27s_Ice_House"
}