{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:14:09.568049"
  },
  "content": "Shopping mall in Pasir Ris, Singapore **White Sands Shopping Mall** ([Chinese](/wiki/Simplified_Chinese): 白沙购物中心), also known as **White Sands**, is a 5-storey [shopping mall](/wiki/Shopping_mall) with retail outlets at the basement and two additional floors of basement carparks. It is located near [Pasir Ris MRT station](/wiki/Pasir_Ris_MRT_station) and [Pasir Ris Bus Interchange](/wiki/Pasir_Ris_Bus_Interchange). The mall is a gathering spot for conscripted soldiers due to the mall's close proximity to Pasir Ris Bus Interchange, the location at which they are dropped off from the army camp on [Pulau Tekong](/wiki/Pulau_Tekong). ## History Developed by OCBC Properties Pte Ltd, a company owned by [OCBC Bank](/wiki/OCBC_Bank), White Sands was the first major mall to be opened in Pasir Ris, being built at a cost of $130 million. It was 85% leased by December 1995. Like a typical suburban mall at the time, it had an Eng Wah cinema, Singapore's first Timezone arcade (the largest arcade in Singapore as of that point), a food court, a John Little department store, a Courts store, a Popular bookstore, a post office, a NTUC FairPrice supermarket and more than 60 specialty stores. Due to declining patronage, the cinema and arcade were closed in October 1999 and were replaced by retail outlets and the Pasir Ris Public Library (which opened in October 2000) respectively. The mall was sold to ARMF Pte Ltd in 2004. The mall did not undergo any major renovations until 2007, and its facade was repainted blue. John Little was replaced by several smaller stores, and the food court was relocated to the 3rd floor, taking up the space initially occupied by Courts. Travelators were installed linking to Basement 2 and 3 carparks. The mall went through another round of renovations in 2014 and reopened in May 2016, with a new tenant mix, a new interior layout and an enhanced blue facade. The library was revamped, the local post office was relocated to level 5, and the bookstore relocated to level 4. Currently, its main tenants are [McDonald's](/wiki/McDonald%27s), [NTUC FairPrice](/wiki/NTUC_FairPrice), [Pasir Ris Public Library](/wiki/Pasir_Ris_Public_Library) and [Cookhouse by Koufu](/wiki/Koufu_(company)). - Official website This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:14:09.567782",
  "title": "White Sands Shopping Mall, Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/White_Sands_Shopping_Mall,_Singapore"
}