{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:14:11.222100"
  },
  "content": "The **[wildlife](/wiki/Wildlife) of [Singapore](/wiki/Singapore)** is surprisingly diverse despite its rapid [urbanisation](/wiki/Urbanisation). The majority of [fauna](/wiki/Fauna) that remain on the island exist in [nature reserves](/wiki/Nature_reserves) such as the [Bukit Timah Nature Reserve](/wiki/Bukit_Timah_Nature_Reserve) and the [Sungei Buloh Wetland Reserve](/wiki/Sungei_Buloh_Wetland_Reserve). In 1819, Singapore was mostly covered in [rainforests](/wiki/Rainforest). During that time, it still contained [flora](/wiki/Flora) shared with the [Malay Peninsula](/wiki/Malay_Peninsula), but even then, the [biodiversity](/wiki/Biodiversity) of fauna was relatively low. Following the establishment of the [British](/wiki/United_Kingdom) trading post, rapid [deforestation](/wiki/Deforestation) began due to crop cultivation, and was largely completed by the 20th century. By some estimates, there has been a loss of 95% of the [natural habitats](/wiki/Natural_habitat) of Singapore over the course of the past 183 years. Due to the deforestation, over 20 species of [freshwater fish](/wiki/Freshwater_fish), 100 species of [bird](/wiki/Bird), and a number of mammals became locally [extinct](/wiki/Extinct). A 2003 estimate put the proportion of extinct species as over 28%. In modern times, over half of the naturally occurring fauna and flora in Singapore is present only in nature reserves, which comprise only 0.25% of Singapore's land area. Estimates made in 2003 have said that the rapid [habitat destruction](/wiki/Habitat_destruction) will culminate in a loss of 13-42% of populations in all of [Southeast Asia](/wiki/Southeast_Asia). To combat these problems, the Singaporean government made the [Singapore Green Plan](/wiki/Singapore_Green_Plan_2012) in 1992 and the new Singapore Green Plan in 2012 to continue it. The plan aims to keep tabs on the unstable populations of fauna and flora, to place new nature parks, and to connect existing parks. In addition, there were plans to set up a National Biodiversity Reference Centre (now known as the [National Biodiversity Centre](/wiki/National_Biodiversity_Centre_(Singapore))). The last goal was reached in 2006 when the centre was founded (it also accomplished the establishment of two new nature reserves in 2002). Since its foundation it has been formulating various specific initiatives including attempts to conserve the [hornbill](/wiki/Hornbill) and the rare [dragonfly](/wiki/Dragonfly) *[Indothemis limbata](/wiki/Indothemis_limbata)*. ## Fauna ### Mammals Singapore has roughly 80 [species](/wiki/Species) of [mammals](/wiki/Mammal) (out of 11 different [orders](/wiki/Order_(biology))) including 45 species of [bats](/wiki/Bat) and three species of non-human [primates](/wiki/Primate). Currently, the only introduced non-domestic mammal species in Singapore is the [variable squirrel](/wiki/Callosciurus_finlaysonii). The abundance of bats however has been decreasing rapidly due to habitat loss of over 95%. ### Birds Singapore is the occasional home of 395 species of [birds](/wiki/Bird) (out of which roughly 180 species are resident). ### Reptiles Singapore contains a relatively large number of [reptiles](/wiki/Reptile), a total of about 110 species (4 of which are introduced). Most of the species, roughly 75 are [snakes](/wiki/Snake) (mainly [Colubrid snakes](/wiki/Colubrid)). ### Amphibians Singapore has 30 species of amphibians (out of which two species, the [painted bull frog](/wiki/Kaloula_pulchra) and the [American bullfrog](/wiki/Rana_catesbeiana), are [introduced](/wiki/Introduced_species)). ## Flora Singapore currently contains 1358 known species of native [vascular plants](/wiki/Vascular_plants), of which approximately 759 are [critically endangered](/wiki/Critically_endangered). ## Urban environment interactions Singapore's land area is dominated by urban development that is interspaced by [natural reserves](/wiki/Nature_reserves_in_Singapore), [waterways](/wiki/List_of_waterways_in_Singapore), [parks](/wiki/List_of_parks_in_Singapore) and a large interlinked network of over 300 km of [Park Connector Network](/wiki/Park_Connector_Network). As a result, there are many [urban-wildlife interactions in Singapore](/wiki/Urban-wildlife_interactions_in_Singapore): - Smooth coated otters (*[Lutrogale perspicllata](/wiki/Smooth-coated_otter)*) have expanded to 17 families \"fishing for tilapia in waterways and sleeping under bridges\". There were reports of people who had their prized [koi](/wiki/Koi) collection decimated by hungry otters. - Long tailed macaques (*[Macaca fascicularis](/wiki/Crab-eating_macaque)*) numbered more than 2,000 according to a 2015 census. There were reports of macaques scaling [Housing and Development Board](/wiki/Housing_and_Development_Board) buildings and invading homes. - Oriental pied hornbills (*[Anthracoceros albirostris](/wiki/Oriental_pied_hornbill)*) are native to Singapore, though the species declined to the point of local extinction during the 19th century. These birds made a comeback, having established a thriving population on [Pulau Ubin](/wiki/Pulau_Ubin) and on occasion, can be sighted throughout Singapore. - Wild boars (*[Sus scrofa](/wiki/Wild_boar)*) are native to Singapore with some weighing up to 100 kg. They have been sighted in urban areas close to forested areas. There are reports of wild boars attacking people who have strayed into their territory. Other wildlife sightings include the following: - Critically endangered Sunda pangolin (*[Manis javanica](/wiki/Sunda_pangolin)*) - Sambar deer (*[Rusa unicolor](/wiki/Sambar_deer)*) which re-colonised the [Central Catchment Reserve](/wiki/Central_Catchment_Nature_Reserve) after escaping from the zoo in the 1970s. In 2023, there was a report of road kill along the [Bukit Timah Expressway](/wiki/Bukit_Timah_Expressway). In February 2024, according to the journal *Conservation Science and Practice*, the mammal's population is believed to be increasing in several forested regions, including areas within the Central Catchment Nature Reserve near MacRitchie and Bukit Timah. - [Urban-wildlife interactions in Singapore](/wiki/Urban-wildlife_interactions_in_Singapore) - [Environmental issues in Singapore](/wiki/Environmental_issues_in_Singapore) - National Biodiversity Centre, Singapore - National Parks Board, Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T12:14:11.221871",
  "title": "Wildlife of Singapore",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Wildlife_of_Singapore"
}