{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:14:19.478445"
  },
  "content": "* *Willment Leong Sai-Onn** ([Chinese](/wiki/Simplified_Chinese_characters): 梁世安; [pinyin](/wiki/Pinyin): *Liáng shì'ān*; [Jyutping](/wiki/Jyutping): *loeng4 sai3 on1*; [Thai](/wiki/Thai_language): วิลเมนต์ ลีออง; born October 13, 1971) is a Singaporean chef residing and working in [Thailand](/wiki/Thailand). He serves as the Continental Director for Asia and an executive board member of Worldchefs for the term 2022–2026. He is the founder of the Thailand Culinary Academy and participates as a board member and host in several cooking competition shows. He is also a partner and owner of the restaurant COAL Bistro ## Early life Willment was born on October 13, 1971 in Singapore, into a poor family. His father sold fruit and his mother was a homemaker. He has four siblings. He only completed schooling up to Grade 9. At age 16, he left home and began working in restaurant kitchens, believing that working in cooking would always provide a way to survive. He also briefly studied culinary arts for nine months before dropping out. He later worked as a dishwasher at the [Raffles Hotel](/wiki/Raffles_Hotel), then was promoted to assistant chef, before leaving to start a bakery. Unfortunately, during [the Asian financial crisis in 1997](/wiki/1997_Asian_financial_crisis), his bakery business collapsed with debts of over ten million baht. Distressed, he once nearly attempted suicide by walking into the sea, but an older man intervened and stopped him. ## Career After his bakery venture failed, Willment returned to work at [Raffles Hotel](/wiki/Hotel_Le_Royal) (this time at a branch in [Cambodia](/wiki/Cambodia)). Later he moved to Thailand to work in the restaurant business there. In 2010, he founded the Thailand Culinary Academy to help develop professional Thai chefs and support them in global competitions. He is also currently a partner in the restaurant COAL Bistro. ## Filmography YearShowRoleSeason and Episode2013[Junior MasterChef Thailand](/wiki/Junior_MasterChef_Thailand_season_1)Guest JudgeS1 (Only one)2017[Top Chef Thailand](/wiki/Top_Chef_Thailand)Head JudgeS12018 - 2019S22019 - 2020S32023S42024[Hell's Kitchen Thailand Season 1](/wiki/Hell%27s_Kitchen_Thailand)JudgeS1[The Restaurant War Thailand Season 1](/wiki/The_Restaurant_War_Thailand)2025[MasterChef The Professionals Thailand](/wiki/MasterChef_The_Professionals_Thailand)Guest judgeS1 EP. 12[The Restaurant War Thailand Season 2](/wiki/The_Restaurant_War_Thailand)JudgeS2[Hell's Kitchen Thailand Season 2](/wiki/Hell%27s_Kitchen_Thailand)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:14:19.478136",
  "title": "Willment Leong",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Willment_Leong"
}