{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:14:13.426134"
  },
  "content": "Scottish explorer **William Cameron** (1833-1886) [FGS](/wiki/Geological_Society_of_London), [FRGS](/wiki/FRGS) was the explorer whose name is commemorated in the [Cameron Highlands](/wiki/Cameron_Highlands). Brother of John Cameron, of Singapore, William was born in [Glasgow](/wiki/Glasgow), educated at its High School, and first worked there as an accountant. He emigrated to Australia, where he studied geology and the goldfields before returning to Scotland where he reported on the gold discovered at Kildonan, Sutherland. From discussions with miners he wrote reports for the *[North British Daily Mail](/wiki/North_British_Daily_Mail)* which led to a Royal Commission on the [Truck Acts](/wiki/Truck_Acts). He then went to report as a war correspondent with the French army on the [Franco-German War](/wiki/Franco-German_War), but was arrested as a spy, condemned to death, and only freed after strenuous diplomatic representations. For a time, he then worked in finance in London. He then went to Singapore where his brother was proprietor of the *[Straits Times](/wiki/Straits_Times)*. Around 1880 he went surveying alone in [Pahang](/wiki/Pahang), and later in [Selangor](/wiki/Selangor) and [Perak](/wiki/Perak). His 'practical knowledge of mineralogy and geology' and 'love of exploring' ultimately led to his being given the honorary title of 'Government Explorer and Geologist' in the [Straits Settlements](/wiki/Straits_Settlements) in 1885. He was married, and had several children. He died at Parsee Lodge, Singapore on 20 November 1886. This Scottish biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e This Singaporean biographical article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:14:13.425832",
  "title": "William Cameron (explorer)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/William_Cameron_(explorer)"
}