{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:14:15.585411"
  },
  "content": "Singaporean Paralympian, physician, and motivational speaker **William Tan** (born 1957) is a [neuroscientist](/wiki/Neuroscientist), [medical doctor](/wiki/Medical_doctor), [paralympian](/wiki/Paralympic_Games) and [motivational speaker](/wiki/Motivational_speaker). He was the first person to complete a marathon in the [North Pole](/wiki/North_Pole) in a wheelchair. ## Early life and career Tan was born in [Singapore](/wiki/Singapore). He contracted [polio](/wiki/Polio) when he was 2 years old, which caused him to be paralysed from the waist down. He studied at Raffles Institution. In 1980, he graduated from [Nanyang University](/wiki/Nanyang_University) (predecessor of [NTU Singapore](/wiki/Nanyang_Technological_University)) with a Bachelor of Science. And in 1980 he applied to the [University of Singapore's](/wiki/National_University_of_Singapore) medical school, but was not accepted. Instead, Tan entered the university as a science undergraduate, majoring in biology and psychology. In 1989, he embarked on postgraduate studies, pursuing a master's degree in physiology at [Harvard University](/wiki/Harvard_University) where he graduated with first class honours as a [Fulbright scholar](/wiki/Fulbright_Program). While in the United States, he pursued a research fellowship in neurosurgery at the Mayo Clinic. In 2002, he pursued a second master's degree in social work and social policy from the [University of Oxford](/wiki/University_of_Oxford) under a [Chevening scholarship](/wiki/Chevening_Scholarship). He also holds a [Bachelor of Medicine, Bachelor of Surgery](/wiki/Bachelor_of_Medicine,_Bachelor_of_Surgery) (MBBS) from Newcastle University and a doctorate of philosophy in neuroscience from the [University of Auckland](/wiki/University_of_Auckland). In 2009, he was diagnosed with stage 4 leukemia, and doctors gave him 9 to 12 months to live. However, through aggressive treatment, his cancer went into remission. ## Sports career Tan competed in the [1988 Seoul Paralympics](/wiki/1988_Summer_Paralympics). He was disqualified from two events for lane violations, because his homemade wheelchair could not drive straight. He competed in the Asian-Pacific games, where he won three gold medals, the World Games and the Commonwealth Games. He holds multiple world records, including the fastest marathon in a wheelchair across the seven continents, and first person to complete a marathon in a wheelchair on the North Pole. He has taken part in over 100 marathons. Tan also plays badminton competitively. Tan uses marathons and other physical challenges as a means to raise money for charity. Events include hand-cycling from London to Paris and participating in [ultramarathons](/wiki/Ultramarathon). In total he has raised over 18 million dollars for charity. He received the Commonwealth Point of Light award for his fundraising. ## Awards and honors - 2005: The [National University of Singapore's](/wiki/National_University_of_Singapore) Distinguished Alumni Award - 2018: Commonwealth [Points of Light](/wiki/Points_of_Light) Award\n",
  "language": "en",
  "processed_at": "2026-01-12T12:14:15.585136",
  "title": "William Tan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/William_Tan"
}