{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:14:21.297608"
  },
  "content": "Singaporean food processing company **Wilmar International Limited** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 丰益国际; [traditional Chinese](/wiki/Traditional_Chinese_characters): 豐益國際; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Hong-ek Kok-chè*) is a [Singaporean](/wiki/Singapore) [food processing](/wiki/Food_processing) and [investment](/wiki/Investment) [holding company](/wiki/Holding_company) with more than 300 [subsidiary](/wiki/Subsidiary) companies.: 18 Founded in 1991, it is one of Asia's leading [agribusiness](/wiki/Agribusiness) groups alongside the [COFCO Group](/wiki/COFCO_Group). It ranks amongst the largest listed companies by market capitalisation on the [Singapore Exchange](/wiki/Singapore_Exchange) (SGX), being the second largest as of September 2010. It was ranked 211th in the [Fortune Global 500](/wiki/Fortune_Global_500) list in 2020. It was ranked 3rd in the World's Most Admired Company (Food Production) by *[Fortune](/wiki/Fortune_(magazine))* in 2019. Wilmar International business activities include [oil palm](/wiki/Oil_palm) cultivation, [edible oils](/wiki/Edible_oil) refining, oilseeds crushing, consumer pack edible oils processing and merchandising, specialty fats, [oleochemicals](/wiki/Oleochemicals), and [biodiesel](/wiki/Biodiesel) manufacturing, grains processing and merchandising, and sugar milling and refining. In 2021, Wilmar placed 2nd on FoodTalks' Global Top 30 Specialty Oil Companies list. It has over 500 manufacturing plants and an extensive distribution network covering [China](/wiki/China), [Indonesia](/wiki/Indonesia), [India](/wiki/India) and some 50 other countries. The group employs a multinational workforce of more than 100,000 people.: 28 Wilmar's merchandising and processing segment encompasses merchandising of palm oil and [laurics](/wiki/Laurics)-related products, operations of palm oil processing and [refinery](/wiki/Refining) plants and crushing, further processing and refining of a range of edible oils, [oilseeds](/wiki/Oilseed), [grains](/wiki/Grain) and [soybean](/wiki/Soybean). Its consumer products include edible oils, rice, flour and noodles in China, Indonesia, [Vietnam](/wiki/Vietnam) and India. Its plantation and palm oil mills segment engages in oil palm [cultivation](/wiki/Plant_cultivation) and [milling](/wiki/Mill_(grinding)). Wilmar has come under criticism for its exploitation of [child labour](/wiki/Child_labour) and [slave labour](/wiki/Forced_labour), as well as unsafe working conditions on its plantations amidst other worker mistreatment incidents. The company has also been exposed for its environmentally degrading practices, and [forced displacement](/wiki/Forced_displacement) of poor populations, amongst other unethical behaviours. ## History Wilmar was founded by [Kuok Khoon Hong](/wiki/Kuok_Khoon_Hong) and [Martua Sitorus](/wiki/Martua_Sitorus) on 1 April, 1991 and commenced operations as a palm oil trading company. Forbes named Kuok the twelfth richest person in Singapore in 2021 and Martua is the twelfth richest person in [Indonesia](/wiki/Indonesia). 1999 - Formed a joint venture with India's [Adani Group](/wiki/Adani_Group) called [Adani Wilmar](/wiki/Adani_Wilmar), to manufacture and distribute edible oils, flour, rice, pulses and sugar among others in India. 2003 - Established the first compound fertiliser manufacturing plant with a production capacity of 120,000 tonnes per year.[*citation needed*] 2004 - Opened the first [oleochemicals](/wiki/Oleochemical) plant in [Shanghai](/wiki/Shanghai).[*citation needed*] 2005 - Acquired a controlling interest in [Jakarta Stock Exchange](/wiki/Jakarta_Stock_Exchange) listed PT Cahaya Kalbar Tbk, a producer of specialty oils and fats for the chocolate, cocoa confectionery industry, bakery and cakes ingredient industry, and beverage and food industry.[*citation needed*] 2006 - Renamed Wilmar International Limited on 14 July, 2006 upon completion of the reverse takeover of Ezyhealth Asia Pacific Ltd. 2007 - Completed the merger with Kuok Group's palm plantation, edible oils, grains and related businesses in a deal worth US$2.7 billion, as well as a restructuring exercise to acquire the edible oils, oilseeds, grains and related businesses of Wilmar Holdings Pte Ltd (WHPL), including interests held by Archer Daniels Midland Asia Pacific (ADM) and its subsidiaries in these businesses, for US$1.6 billion;[*citation needed*] - Formed a joint venture (JV) with Olam International Ltd and SIFCA Group, one of Africa's largest agro-industrial groups with significant interests across palm oil, cotton seed oil, natural rubber and sugar sectors in Africa. The JV was aimed at developing a regional leadership position in palm oil, natural rubber, sugar and potentially in other agricultural plantation crops in Africa;[*citation needed*] - Entry into the Philippines with the setting-up of two coconut oil mills and refineries in [President Manuel A. Roxas, Zamboanga del Norte](/wiki/President_Manuel_A._Roxas,_Zamboanga_del_Norte) and [Gingoog, Misamis Oriental](/wiki/Gingoog,_Misamis_Oriental).[*citation needed*] 2008 - Formed a joint venture with Nizhny Novgorod Fats & Oils Group and Delta Exports Pte Ltd to spearhead expansion in Russia and the CIS countries.[*citation needed*] 2010 - Expanded into the sugar business through the acquisition of [Sucrogen](/wiki/Sucrogen) Limited, the largest raw [sugar producer](/wiki/Sugar_producer) and refiner in Australia, and PT Jawamanis Rafinasi, a leading sugar refinery in Indonesia.[*citation needed*] - Acquired Natural Oleochemicals, a leading oleochemicals producer with significant market share in Europe and Asia and a growing presence in the US.[*citation needed*] 2011 - Further expanded into the sugar business through the acquisition of PT Duta Sugar International in Indonesia and Proserpine Mill in Australia[*citation needed*] - Expanded its African footprint to Ghana through the acquisition of Benso Oil Palm Plantations Limited, a company listed on Ghana Stock Exchange[*citation needed*] 2012 - Acquired approximately 30,000 hectares of land in Nigeria for expansion of oil palm plantations; - Established a 50:50 joint venture company, [Yihai Kerry](/wiki/Yihai_Kerry) Kellogg Foods (Shanghai) Company Ltd, with Kellogg Company for the manufacture, sale and distribution of breakfast cereals and savoury snacks in China; - Formed a 50:50 Joint Venture with Clariant Ltd for production and sales of amines and selected amines derivatives; - Formed strategic partnership with Archer Daniels Midland Company (ADM) in tropical oils refining in Europe, global fertiliser purchasing and distribution, and global ocean freight operations. Launched Olenex CV. headquartered in Rolle, Switzerland to handle the sales and marketing of refined vegetable oils and fats to European Area and Switzerland - Completed four palm oil milling plants with an aggregate hourly capacity of 200 MT - In 2012, Wilmar was named the world's least environmentally friendly company by US news magazine *[Newsweek](/wiki/Newsweek)*. 2013 - Due to their poor environmental performance Wilmar was excluded in 2013 from [The Government Pension Fund of Norway](/wiki/The_Government_Pension_Fund_of_Norway), the largest stock owner in Europe. 2015 - Together with [First Pacific](/wiki/First_Pacific), acquired [Goodman Fielder](/wiki/Goodman_Fielder) of Australia and New Zealand for $1.3 billion Australian dollars. 2018 - Wilmar joined forces with Aidenvironment, a consultancy to develop a group mapping database that allows Wilmar's suppliers to be monitored in relation to its No Deforestation, No Peat & No Exploitation Policy (NDPE) policy. Wilmar planned to use satellites to monitor its suppliers making it impossible for them to get away with forest destruction. - Wilmar broke ties with GAMA (a palm oil company owned by a former Wilmar executive) because GAMA had razed forests in Indonesia twice the size of Paris, but then decided to resume purchasing GAMA palm oil in 2019. 2020 - Wilmar International was included in the Dow Jones Sustainability Indices (DJSI) under the Asia Pacific Index for the Food, Beverage and Tobacco industry - Wilmar International resigned 2 April from the steering group of the High Carbon Stock Approach (HCSA), a widely supported mechanism to distinguish forest areas that should be protected from degraded areas that can be developed. - Wilmar secured a $200 million sustainability-linked loan to Wilmar International Limited to help advance the agribusiness’ sustainability agenda. - A joint venture between Wilmar and PZ Cussons - PZ Wilmar - restated its commitment to building a sustainable future for palm oil. ## Business profile [Unilever](/wiki/Unilever) is one of the main customers of Wilmar. Unilever and Wilmar are members of the [Roundtable on Sustainable Palm Oil](/wiki/Roundtable_on_Sustainable_Palm_Oil) (RSPO) which brings together retailers, producers and [NGOs](/wiki/NGOs) like [Oxfam](/wiki/Oxfam) and [WWF](/wiki/World_Wide_Fund_for_Nature). ## Palm oil [Palm oil](/wiki/Palm_oil), extracted from [palm fruit](/wiki/Palm_fruit) pulp, is Wilmar's main product. Palm oil is the most widely used edible oil, and there are 42 million acres under cultivation worldwide. Commercial production has helped many communities in Africa and South-east Asia tackle local poverty. However, environmentalists have been concerned that such widespread cultivation has led to [deforestation](/wiki/Deforestation) and [air pollution](/wiki/Air_pollution), and is a threat to [endangered species](/wiki/Endangered_species). In 2013, Wilmar changed its approach and endorsed [sustainability](/wiki/Sustainability) principles. As a part of this it sold its subsidiary [PT Asiatic Persada](/wiki/PT_Asiatic_Persada) which for its involvement in land grabs. ## Ethical issues In 2004, [Friends of the Earth Netherlands](/wiki/Friends_of_the_Earth_Europe) performed a review of Wilmar's palm oil operations in [Sumatra](/wiki/Sumatra) Riau as undertaken by PT Jatim Jaya Perkasa. Wilmar had 20,800 hectares of land there and the operation was financed by the Dutch [Rabobank](/wiki/Rabobank) and the [International Finance Corporation](/wiki/International_Finance_Corporation). Satellite photos proved that in 2004, the plantations were on sea shore [peat](/wiki/Peat) [rain forests](/wiki/Rain_forests), the depth of the peat being four meters, whereas such land is actually protected under Indonesian law. Nevertheless, in 1997 Wilmar received permission to plant there despite it being peat land. According to locals, the plantation endangers the [Sumatran tiger](/wiki/Sumatran_tiger) population that inhabits the area, and this became a point of conflict with Wilmar in 2004. Soon after, Wilmar sold PT Jatim Jaya Perkasa and joined the [WWF](/wiki/World_Wide_Fund_for_Nature) Palm Oil Association.[*citation needed*] According to Friends of the Earth Netherlands, Wilmar International starts [forest fires](/wiki/Forest_fire) and violates the rights of local populations. In July 2007, [Friends of the Earth](/wiki/Friends_of_the_Earth) and two local environmental organizations criticized Wilmar's [illegal forest felling](/wiki/Illegal_logging) in [Kalimantan](/wiki/Kalimantan), in Indonesia. As a result of this campaign against Wilmar's projects in [Sambas](/wiki/Sambas_Regency), [West Kalimantan](/wiki/West_Kalimantan), the company agreed to implement a number of new measures and policies. In July 2013, a report published by the WWF which documented that Wilmar (as well as the Indonesian company [Asian Agri](/wiki/Royal_Golden_Eagle#Asian_Agri)) were purchasing palm oil fruit which was grown illegally in [Tesso Nilo National Park](/wiki/Tesso_Nilo_National_Park), Sumatra. According to the [Roundtable on Sustainable Palm Oil](/wiki/Roundtable_on_Sustainable_Palm_Oil), both Wilmar and Asian Agri took immediate action to stop this illegal sourcing. In October 2015, Wilmar and Sinarmas, reportedly involved with the case of forest fires in Indonesia that led to the island of Sumatra and Kalimantan burn and cause catastrophic [smog](/wiki/Southeast_Asian_haze). In 2018, a [Greenpeace International](/wiki/Greenpeace_International) [report](/wiki/Greenpeace#Wilmar_International_palm-oil_issue) asserted that Wilmar International is \"the biggest and dirtiest palm oil trader in the world\". In 2020, global campaign organisation Mighty Earth reported that Wilmar International was involved in cutting down of natural forests inside an oil palm concession in Indonesia's easternmost region of Papua, but Wilmar's investigation concluded that the deforestation is smaller than alleged and done by [smallholder](/wiki/Smallholding) farmers. ### Uganda According to [Friends of the Earth](/wiki/Friends_of_the_Earth), Wilmar and [Bidco Africa](/wiki/Bidco_Africa) through Bidco Uganda, have been involved in long running dispute over land with local communities. According to [The Guardian](/wiki/The_Guardian) in March 2015, the land grab issue has plagued the community of Kalangala for a number of years. In July 2011, residents awoke to \"find yellow machines churning up her land and razing the crops she had grown in a bid to make way for palm oil plantations.\" [Bidco Africa](/wiki/Bidco_Africa) and Wilmar have made no recorded statement on these matters. Again according to [Friends of the Earth International](/wiki/Friends_of_the_Earth_International), the projects implications include: Forced displacement, poor labour standards, deforestation, and insecurity amongst other. The community have now taken the conglomerate to court. In February 2016, the [United Nations Development Programme](/wiki/United_Nations_Development_Programme) (UNDP) received a petition from the Bugala Farmers Association in [Uganda](/wiki/Uganda) related to UNDP's association with Bidco Africa Ltd. A complaint was also received by the UNDP's Stakeholder Response Mechanism (SRM) and Social and Environmental Compliance Unit (SECU). In May 2016, [UNDP](/wiki/UNDP) visited Kalangala to further investigate the issues surrounding the matter. In November 2016, the UNDP faulted a decision inviting Bidco Ltd into partnership with the United Nations Development Programme's Business Call to Action in Uganda. ### Human right violations in 2016 On 30 November 2016, [Amnesty International](/wiki/Amnesty_International) published a report into working conditions on the Wilmar International plantations and refineries in Indonesia. It alleged human rights abuses, including \"forced labour, low pay, exposure to toxic chemicals and discrimination against women\". According to [Amnesty International](/wiki/Amnesty_International), Wilmar International profited from 8- to 14-year-old child labour and forced labour. Some workers were extorted, threatened or not paid for work. Some workers suffered severe injuries from exposure to [herbicides](/wiki/Herbicide) containing [paraquat](/wiki/Paraquat). Wilmar customers include [FAMSA](/wiki/FAMSA), [ADM](/wiki/Archer_Daniels_Midland), [Colgate-Palmolive](/wiki/Colgate-Palmolive), [Elevance](/wiki/Elevance), [Kellogg's](/wiki/Kellogg%27s), [Nestlé](/wiki/Nestl%C3%A9), [Procter & Gamble](/wiki/Procter_%26_Gamble), [Reckitt Benckiser](/wiki/Reckitt_Benckiser) and [Unilever](/wiki/Unilever). Wilmar palm oil may be used in popular products like [Magnum](/wiki/Magnum_(ice_cream)) ice-cream, [Colgate](/wiki/Colgate_(toothpaste)) toothpaste, [Dove (toiletries)](/wiki/Dove_(toiletries)), [Knorr](/wiki/Knorr_(brand)) soup, [KitKat](/wiki/KitKat), [Pantene](/wiki/Pantene) shampoo, [Ariel](/wiki/Ariel_(detergent)), and [Pot Noodle](/wiki/Pot_Noodle). ### NDPE Initiatives On 5 December 2013, Wilmar committed to a No Deforestation, No Peat & No Exploitation Policy (NDPE policy) for both its own operations and third party suppliers. It promised to stop buying from suppliers who cleared forest, drained peat land, or exploited locals. This was lauded as a transformational step towards responsible and sustainable palm oil development. Preliminary analysis estimated that Wilmar's commitment would eliminate more than 1.5Gt CO2 emissions in total between 2016 and 2020. ### Recognition / Awards In 2015, Wilmar won the Special Recognition Award at the Singapore Apex CSR Awards 2015 organised by the Global Compact Network Singapore, [Singapore Business Federation](/wiki/Singapore_Business_Federation) and [The Business Times](/wiki/The_Business_Times_(Singapore)). It was hailed for being the first major palm oil player to step up to ensure its supply chain is de-linked from any forest destruction and human rights abuse. - [official website]\n",
  "language": "en",
  "processed_at": "2026-01-12T12:14:21.297319",
  "title": "Wilmar International",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Wilmar_International"
}