{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:14:24.178355"
  },
  "content": "Demolished building in Orchard Road, Singapore **Wisma Indonesia** (also called the **Indonesia House)** was a building on [Orchard Road](/wiki/Orchard_Road) in the Orchard Planning Area of Singapore. Completed in 1964, it was constructed to house the [Embassy of Indonesia in Singapore](/wiki/Embassy_of_Indonesia,_Singapore), which was only able to move into the building in 1967 as a result of [Konfrontasi](/wiki/Konfrontasi). It was demolished in 1983 to make way for the [Wisma Atria](/wiki/Wisma_Atria) after the embassy moved to Chatsworth Road. ## History Wisma Indonesia was first announced in July 1961, with the [Indonesian Government](/wiki/Indonesian_Government) to spend [S$](/wiki/Singapore_dollar)4 million (1961) ([US$](/wiki/USD)1.31 million). The project was the result of \"growing confidence of the Indonesian government in its relationship with Singapore\". Negotiations with [Ngee Ann Kongsi](/wiki/Ngee_Ann_Kongsi) for the building's land concluded in September. In November 1961, it was announced that Wisma Indonesia would start construction by early 1962, expecting to take 13 months to build and costing [S$](/wiki/Singapore_dollar)4.5 million (1961) ([US$](/wiki/USD)1.47 million). The foundation stone was laid by then-[Indonesian Consul-General](/wiki/List_of_ambassadors_of_Indonesia_to_Singapore) Sugih Arto [id] on 17 August 1962, the anniversary of [Indonesia's independence](/wiki/Indonesia%27s_independence). Initially to be completed on Indonesia Independence Day in August, Wisma Indonesia's completion was postponed to [Indonesia Youth Pledge Day](/wiki/Youth_Pledge) in October as preparation works could not be carried out. It was due to be completed in November 1963, with it containing a 500-seat exhibition hall, a mosque, restaurants, office space, the hotel and a swimming pool, with the front being decorated with works by sculptors from [Bali](/wiki/Bali). The building was completed in January 1964. However, as a result of the [Konfrontasi](/wiki/Indonesia%E2%80%93Malaysia_confrontation), it did not house the embassy at its opening. Plans were announced to open it as a shopping centre and a hotel with a 300-seat restaurant instead, with the units within the building being leased to local businesses to meet maintenance costs. On 21 June 1965, the [Malaysian Government](/wiki/Government_of_Malaysia) took possession of Wisma Indonesia. By then, some of the external decorations had yet to be completed. The takeover officially occurred on 2 July, with the [Malaysian flag](/wiki/Malaysian_flag) being raised at the building, which was to house the Singaporean offices of the Ministry of Information and Broadcasting, the Ministry of External Affairs and the Ministry of Youth and Culture, as well as the Department of Fisheries and the Department of Co-operatives. The rest of the building was to remain vacant. In 1966, following the end of Konfrontasi, it was announced that the building would be returned to the Indonesian government. By September, Indonesian [flag carrier](/wiki/Flag_carrier) [Garuda Indonesia](/wiki/Garuda_Indonesia) had already occupied office space within the building. In June 1967, the building underwent a $60,000 renovation as the Indonesian liaison office, which was still based at the Singaporean branch office of the [Bank Negara Indonesia](/wiki/Bank_Negara_Indonesia) on Malacca Street at the time. It was officially opened by [Attorney-General of Indonesia](/wiki/Attorney_General_of_Indonesia) Soegih Arto, who flew to Singapore from [Jakarta](/wiki/Jakarta) 12 August, on 14 August. The opening ceremony, during which Arto's wife cut the ribbon, was attended by around 100 people, including Woon Wah Siang, the permanent secretary to the Ministry of Foreign Affairs. After Arto returned to Indonesia, chairmanship of the building was transferred to an Indonesian liaison officer stationed in Singapore. Beginning on the Indonesian [Independence Day](/wiki/Independence_Day_(Indonesia)) on 17 August, an arts exhibition featuring over 120 Indonesian paintings, which were worth $300,000 in total, works of other art forms, which were worth $250,000 in total, and books on various aspects of Indonesian society, was held at the building. It was held to \"strengthen the cultural bonds between the two countries\", with some of the items on display being sold to the public. By its original end date on 22 August, it had attracted over 25,000 visitors. Due to its popularity, it was extended to the end of the month. The embassy officially moved into the building on 8 September, with the Indonesian flag being risen at the building on that day. In November 1977, the embassy denied rumours that the building was to be demolished to make way for a skyscraper. In March 1981, the Indonesian embassy announced that it would sell the building as its location at Orchard Road was \"too noisy\". On 20 March, the embassy announced that it was negotiating a swap deal for the building. It was announced in April that the there were plans to redevelop Wisma Indonesia while the embassy was looking to move to a newer building located in the area around Nassim Road and Rochalie Drive. However, the embassy announced in June that the decision to shift had yet to be finalised, and that it still owned the building. On 19 June, it was announced that Indonesian President [Suharto](/wiki/Suharto) had approved the embassy's plans to move to a new location and that the Indonesian company Ustriando had been appointed to redevelop Wisma Indonesia. Despite criticism against plans to demolish the building, which were made due to its \"important historical significance\", it was announced that the building would be torn down to make way for a \"towering shopping-cum-office complex while the embassy moved to the area around [Napier Road](/wiki/Napier_Road,_Singapore) and Nassim Road, where the Singaporean embassies of several other nations were located. The Indonesian embassy moved to a temporary premises on Orange Grove Road on 23 April 1983. The Wisma Indonesia was demolished by the end of November. However, its bas-reliefs were removed before the demolition and placed at the new embassy, which was at the corner of Chatsworth Road and Bishopsgate. ## Details Wisma Atria was located at Orchard Road. It consisted of an exhibition hall, a shopping centre, a [mosque](/wiki/Mosque), and a hotel. The building was designed by local architectural firm James Cubitt, [Leonard Manasseh](/wiki/Leonard_Manasseh) & Partners who were assisted by an Indonesian professor. It was to \"feature typical Indonesian architectural styles and ornaments\", such as a crown-shaped roof modelled after houses in [Sumatra](/wiki/Sumatra), as well as the [Indonesian crest](/wiki/National_emblem_of_Indonesia). The offices of the Indonesian Consul-General would be placed on the first floor, while the ground floor would be occupied by the \"various offices of Indonesian State enterprises here\". During the construction of Wisma Indonesia, carvers from Bali were brought to Singapore to assist with the Indonesian architectural elements. Batu padas, a clay used in Indonesian temples, were used carve Wisma Indonesia's walls.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:14:24.178074",
  "title": "Wisma Indonesia",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Wisma_Indonesia"
}