{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:14:34.784386"
  },
  "content": "Multi-purpose stadium in Woodlands, SingaporeThis article **relies largely or entirely on a single source**. Relevant discussion may be found on the talk page. Please help improve this article by introducing citations to additional sources. *Find sources:* \"Woodlands Stadium\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(May 2021)* **Woodlands Stadium** is a [multi-purpose stadium](/wiki/Multi-purpose_stadium) located in [Woodlands](/wiki/Woodlands,_Singapore), [Singapore](/wiki/Singapore). It is the main home ground of [S.League](/wiki/S.League) side, [Woodlands Wellington](/wiki/Woodlands_Wellington_FC), and used mostly for [football](/wiki/Football_(soccer)) matches for both the [S.League](/wiki/S.League) and [Singapore National Football League](/wiki/Singapore_National_Football_League) competitions. Apart from being used for competitive matches, the pitch is also used by the club for their training sessions as well. Woodlands Stadium is the only stadium in Singapore which has a [MRT](/wiki/Mass_Rapid_Transit_(Singapore)) track overlooking the pitch. The stadium was officially opened in August 1989 as part of the eight hectare Woodlands Sports Complex, which also consists of the Woodlands Sports Hall and the Woodlands Swimming Complex. All three facilities are owned and operated by [Sport Singapore](/wiki/Sport_Singapore). Woodlands Stadium houses a grass football pitch, an 8-lane running track and partial athletic facilities. People can be seen running around the track daily as [Sport Singapore](/wiki/Sport_Singapore) allows joggers to use the track facilities between 4:30am to 8:30pm for free. Besides the sporting facilities mentioned above, the stadium also has a [Singapore Pools](/wiki/Singapore_Pools) outlet located near to the entrance of the away fans' stand, as well as the clubhouse of [Woodlands Wellington](/wiki/Woodlands_Wellington_FC). Before the [2015 SEA Games](/wiki/2015_SEA_Games) commenced, [Warriors FC](/wiki/Warriors_FC) had to vacate [Choa Chu Kang Stadium](/wiki/Choa_Chu_Kang_Stadium) and instead played their home matches temporary at the Woodlands Stadium for the [2015 season](/wiki/2015_S.League) instead. ## Seating Capacity Woodlands Stadium started off with a total seating capacity of 1,600 when it was first constructed. In view of the inauguration of the [S.League](/wiki/S.League) in (/wiki/S.League_1996), where the stadium was assigned as the home ground of [Woodlands Wellington FC](/wiki/Woodlands_Wellington_FC), the stadium capacity was upgraded to 4,300. This includes the 2,000 seater grandstand, the 1,000 seater semi-permanent stand opposite the grandstand and the 1,300 seater portable stands on each end of the pitch. Home fans are always seated on the right side of the grandstand (facing the pitch) while away fans are directed to the left side of the grandstand. [Woodlands Stadium (Lusaka)](/wiki/Woodlands_Stadium_(Lusaka)) 1°26′05″N 103°46′51″E﻿ / ﻿1.434591°N 103.780788°E﻿ / 1.434591; 103.780788 This article about a [Singaporean](/wiki/Singapore) sports venue is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:14:34.784071",
  "title": "Woodlands Stadium",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Woodlands_Stadium"
}