{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:14:40.454910"
  },
  "content": "The **Workforce Skills Qualifications** (**WSQ**) system is a national [continuing education](/wiki/Continuing_education) and training system designed for adult workers in Singapore, complementing the formal education system for students. WSQ training is accessible to all workers and does not require academic pre-requisites. The WSQ provides training for skills upgrading and also recognition and certification of workers' existing skills. There are seven qualification levels from basic Certificate to graduate Diploma and these spell out the upgrading and career advancement pathways for workers. Workers can also be certified with Statements of Attainment for individual modules to fill gaps in their skills. WSQ is based on industry agreed national skills standards, and courses only cover skills training which is determined by employers to be relevant to prevailing occupations in the industry. WSQ training is quality assured by then [Singapore Workforce Development Agency](/wiki/Singapore_Workforce_Development_Agency) (WDA; now [Workforce Singapore](/wiki/Workforce_Singapore)) and is delivered to suit adult workers - modular, flexible, not necessarily classroom based and recognises past skills and experience that workers already acquired. WSQ was launched by then [Minister of Manpower](/wiki/Ministry_of_Manpower_(Singapore)) [Ng Eng Hen](/wiki/Ng_Eng_Hen) on 27 October 2005. Through the WSQ system, we can enhance the professionalism of industries, improve their global competitiveness and create training avenues for workers to advance in their jobs and to enter new industries. As at 2010, there are in total 30 Singapore Workforce Skills Qualifications Framework, mainly categories in two aspects 1. Foundation Skills 2. Industry & Occupational Skills WSQ courses are delivered via various WDA Approved Training Organisations (ATO) or Continuing Education and Training (CET) centres. ## Types of WSQ CET Centre WSQ CET Centres are public training providers that usually provides a comprehensive array of WSQ courses, and they are required to provide additional services such as career facilitation as well as employment advisory. To ensure standard and quality of training delivery, CET need to undergo rigorous accreditation and Continuous Improvement Review process conducted by WDA on a regular basis. The National CET Institute (NCI) is the pinnacle status conferred by WDA to WSQ CET that demonstrate high quality delivery, and commitment to support workforce development programme in the WSQ sectors which it serve. The following CET has been conferred NCI status in March 2009: 1. At-Sunrice Global Chef Academy for Food & Beverage WSQ framework 2. Centre for Urban Greeny Ecology (CUGE) for Landscape WSQ framework 3. Tourism Management Institute of Singapore (TMIS) for Tourism WSQ framework 4. SEED Institute - http://www.seedinstitute.edu.sg/ for Early Childhood Care and Education Sector 5. NUS Institute of Systems ScienceAbout for the Information & Communications Technology - Singapore Workforce Skills Qualifications - List of CET Centres - National CET Institute - CET 2020 Masterplan\n",
  "language": "en",
  "processed_at": "2026-01-12T12:14:40.454621",
  "title": "Workforce Skills Qualifications",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Workforce_Skills_Qualifications"
}