{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:14:43.628151"
  },
  "content": "* *This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(August 2014)* *(Learn how and when to remove this message)*The topic of this article **may not meet Wikipedia's notability guidelines for companies and organizations**. Please help to demonstrate the notability of the topic by citing reliable secondary sources that are independent of the topic and provide significant coverage of it beyond a mere trivial mention. If notability cannot be shown, the article is likely to be merged, redirected, or deleted. *Find sources:* \"Workplace Safety and Health Council\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2014)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Workplace Safety and Health Council\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(October 2022)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* The **Workplace Safety and Health Council** **(WSHC)** is a Singapore-based [statutory body](/wiki/Statutory_body) that focuses on the education and engagement of the industry in the areas of [workplace health, safety and welfare](/wiki/Occupational_safety_and_health). The WSHC can be considered as a successor institution to the Workplace Safety and Health Advisory Committee (WSHAC), which was formed in September 2005. ## History On 29 April 2008, Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong) announced the creation of the Workplace Safety and Health Council to oversee safety standards and promote a workplace safety culture. The council is an upgrade from the former Workplace Safety Health advisory committee. The WSHC works closely with the [Ministry of Manpower](/wiki/Ministry_of_Manpower_(Singapore)) (MOM) and other government agencies, various industry sectors, unions, and professional associations in the development of strategies and programs to raise workplace safety and health standards in Singapore. ## Main functions and key programs ### Build capability of the industry to better manage workplace safety and health The WSHC collaborates with other government agencies, including the Workforce Development Agency (WDA). Utilizing the Workforce Skills Qualification (WSQ) framework developed by WDA, the WSH Professional WSQ framework was established for the competency training of workplace safety and health professionals. Complementing the training development aspects, the WSHC conducts regular reviews and audits of accredited training providers so as to ensure a pool of highly credible and competent workplace health and safety training providers. ### Promote workplace safety and health and recognize companies with good performance To build and promote workplace safety and health culture in the community, the WSHC actively organizes events and programs, engaging various stakeholders, to promote the importance of workplace safety and health and its benefits and provide the necessary guidance for its implementation. Some of these activities include the National WSH Campaign, the WSH Awards and various workplace safety and health seminars, conferences and workshops targeting different categories of workforce. Among the staple of WSHC publications are workplace safety and health statistical reports, case studies, guidelines, approved codes of practice, posters, flyers, and videos, and iWSH (newsletter specially designed for workers)). The WSHC also has an up-to-date website, and the *WSH Bulletin*, an electronic bulletin that highlights the latest in workplace safety and health issues. ### Setting acceptable WSH practices The WSHC aims to promote the adoption of good workplace safety and health practices with various stakeholders. The WSHC also aims to work in collaboration with the other standard-setting bodies to develop national standards, lead the development of industry guidelines, and establish approved codes of practices for the industry. ## WSHC programs ### bizSAFE bizSAFE is a capability-building program that is tailored to assist small and medium enterprises (SME) in building up their workplace safety and health capabilities.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:14:43.627862",
  "title": "Workplace Safety and Health Council",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Workplace_Safety_and_Health_Council"
}