{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:14:46.793527"
  },
  "content": "Global provider of cross-border payments **WorldFirst** is a global provider of cross-border payments and treasury services for [small and medium-sized enterprises](/wiki/Small_and_medium-sized_enterprises) (SMEs). It operates as a subsidiary of [Ant International](/wiki/Ant_International), using the group’s financial technology infrastructure. ## History WorldFirst was founded in 2004 in the [United Kingdom](/wiki/United_Kingdom) by Jonathan Quin and Nick Robinson with the aim of simplifying foreign-exchange processes for [SMEs](/wiki/Small_and_medium_enterprises). Between 2007 and 2008, the company launched its online platform and expanded through [e-commerce](/wiki/E-commerce) and corporate FX services. WorldFirst began international expansion in 2009 with the opening of an office in [Sydney](/wiki/Sydney), followed by additional offices in [Hong Kong](/wiki/Hong_Kong), [Singapore](/wiki/Singapore), the [Netherlands](/wiki/Netherlands), [Japan](/wiki/Japan), and [Korea](/wiki/Korea) between 2013 and 2016. In 2019, WorldFirst became a part of [Ant Group](/wiki/Ant_Group) (formerly Ant Financial) and expanded its services across [Asia](/wiki/Asia) and other emerging markets. In 2024, Ant Group announced a reorganization of its operations, with WorldFirst subsequently operating as a brand under one of its independently operated business units, [Ant International](/wiki/Ant_International). In 2025, it further extended its presence in [Southeast Asia](/wiki/Southeast_Asia) by launching services in [Thailand](/wiki/Thailand) and secured its license in [Malaysia](/wiki/Malaysia). ## Products and services WorldFirst provides international payments and financial services through one global account. It has served over one million SMEs, connecting them to more than 120 global marketplaces and supporting international payments in over 40 currencies. WorldFirst’s services are used by e-commerce sellers, goods and services trade businesses and freelancers. WorldFirst's global account, the World Account, combines international payments, collections, FX conversion, and treasury management in one unified account. WorldFirst's also has a virtual card solution, World Card, aimed at businesses operating internationally. It allows them to make payments in more than 150 currencies across 210 countries and regions without incurring foreign exchange fees when using 15 major currencies from their WorldFirst account balance. In 2025, WorldFirst launched an API-integrated and AI-driven solution tailored to global enterprises. ## International operations WorldFirst operates in more than 210 countries and regions worldwide. Its services are available in major markets including the [United Kingdom](/wiki/United_Kingdom), the [Netherlands](/wiki/Netherlands), the [Singapore](/wiki/Singapore), the [Thailand](/wiki/Thailand), the [Malaysia](/wiki/Malaysia), the [Australia](/wiki/Australia), the [China](/wiki/China), the [United Arab Emirates](/wiki/United_Arab_Emirates), the [Saudi Arabia](/wiki/Saudi_Arabia),and the [Mexico](/wiki/Mexico). The company holds over 60 regulatory licences globally and serves more than one million small and medium-sized enterprises (SMEs) as well as enterprise customers. ## Global Partnership Programme Through its Global Voyage programme, WorldFirst enables businesses in supported markets to establish e-commerce storefronts on international marketplaces within 24 hours. This expedited capability is supported by partnerships with 28 global e-commerce platforms, including [Amazon](/wiki/Amazon_(company)). The programme also provides participating merchants with access to a range of integrated end-to-end services, such as online advertising, logistics support, and website development and management, to facilitate international expansion and digital growth. - [Ant International](/wiki/Ant_International) - [Ant Group](/wiki/Ant_Group) - [Alipay](/wiki/Alipay) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:14:46.793211",
  "title": "WorldFirst",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/WorldFirst"
}