{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:14:52.318287"
  },
  "content": "Written form of the Hokkien languagePart of a series onWritten Hokkien - [Comparison of Hokkien writing systems](/wiki/Comparison_of_Hokkien_writing_systems) Chinese characters ([Hàn-jī](/wiki/H%C3%A0n-j%C4%AB)) - [Tale of the Lychee Mirror](/wiki/Tale_of_the_Lychee_Mirror) - [Koa-á books](/wiki/Koa-%C3%A1_books) - [Doctrina Christiana en letra y lengua china](/wiki/Doctrina_Christiana) - [Taiwanese Minnan Recommended Characters](/wiki/Taiwanese_Southern_Min_Recommended_Characters) Romanizations (Lô-má-jī) - [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB) - [Taiwanese Language Phonetic Alphabet](/wiki/Taiwanese_Language_Phonetic_Alphabet) - [Taiwanese Romanization System](/wiki/Taiwanese_Romanization_System) - [Bbánlám pìngyīm](/wiki/Bb%C3%A1nl%C3%A1m_p%C3%ACngy%C4%ABm) - [Daighi tongiong pingim](/wiki/Daighi_tongiong_pingim) - [Phofsit Daibuun](/wiki/Phofsit_Daibuun) - [Modern Literal Taiwanese](/wiki/Modern_Literal_Taiwanese) Mixed script ([Hàn-lô](/wiki/H%C3%A0n-l%C3%B4))Other transcriptions - [Taiwanese kana](/wiki/Taiwanese_kana) - [Taiwanese Phonetic Symbols](/wiki/Taiwanese_Phonetic_Symbols) - [Taiwanese hangul](/wiki/Taiwanese_hangul) - v - t - e [Hokkien](/wiki/Hokkien), a [variety of Chinese](/wiki/Variety_of_Chinese) that forms part of the [Southern Min](/wiki/Southern_Min) family and is spoken in Southeastern China, Taiwan and Southeast Asia, does not have a unitary standardized writing system, in comparison with the well-developed written forms of [Cantonese](/wiki/Written_Cantonese) and [Standard Chinese](/wiki/Written_vernacular_Chinese) (Mandarin). In Taiwan, a standard for **Written Hokkien** has been developed by the [Ministry of Education](/wiki/Ministry_of_Education_(Taiwan)) including its *[Dictionary of Frequently-Used Taiwan Minnan](/wiki/Dictionary_of_Frequently-Used_Taiwan_Minnan)*, but there are a wide variety of different methods of writing in Vernacular Hokkien. Nevertheless, vernacular works written in Hokkien are still commonly seen in literature, film, performing arts and music. ## History Prior to the modern era, the main written language of China was [Classical Chinese](/wiki/Classical_Chinese), which has grammar and vocabulary based on [Old Chinese](/wiki/Old_Chinese) used in ancient times. Whilst the written form of Chinese mostly remained static, the spoken varieties of Chinese diverged from Old Chinese. In the early 20th century, reformers in China saw the need for language reform and championed the development of a writing system that allowed Chinese people to write in a form more closely reflecting speech called [written vernacular Chinese](/wiki/Written_vernacular_Chinese). However, there are various differences between the spoken Chinese varieties, such as Hokkien, Mandarin, Cantonese, including in vocabulary, meaning that Vernacular Chinese is less suited for writing texts spoken in Hokkien. Various expressions in Hokkien, as with other Chinese varieties, do not have associated Chinese characters in Vernacular Chinese, meaning that some words originally could not be written. In the case of Cantonese, a vernacular system specifically for writing Cantonese was developed in Hong Kong, then a British colony. On the other hand, since Hokkien was never standardized, different people began to use various separate methods to solve the issue of Hokkien-specific words, where such words would eventually be written phonetically, using either a [Latin-based alphabet](/wiki/Latin-based_alphabet), [bopomofo](/wiki/Bopomofo), or through the use of Chinese characters as [loangraphs](/wiki/Loangraph) for their phonetically with no relation to the original word via meaning. Varieties of Hokkien are spoken in the [Southern Fujian](/wiki/Southern_Fujian) in [mainland China](/wiki/Mainland_China), Taiwan, Chinese communities [in Malaysia](/wiki/Chinese_in_Malaysia), [Singapore](/wiki/Chinese_in_Singapore), and other Chinese expatriate communities. Initially there was no effort by the [government of the Republic of China](/wiki/Government_of_the_Republic_of_China) on Taiwan, nor other governments, to create a standardized Hokkien vernacular. During the initial stages of [Kuomintang](/wiki/Kuomintang) rule in Taiwan, the official Kuomintang language policy was to promote the use of Mandarin Chinese in everyday speech, and to discourage the use of other Chinese varieties such as Hokkien and Hakka; this was done in an attempt to promote national linguistic unity, and to promulgate a Chinese identity over that of a Taiwanese one for political reasons. Following the [Taiwan localization movement](/wiki/Taiwan_localization_movement), education and everyday usage of spoken and written Hokkien by local Taiwanese became more widely used. A Chinese character online dictionary for Hokkien was released in 2008 by the ROC Ministry of Education. Nevertheless, within literature circles there is still ongoing debate over which writing system should be used to write Taiwanese Hokkien, and controversy exists between the various rival systems currently used to write Hokkien. Today usage of languages remains a politicized issue in Taiwan. In Singapore, in an effort to promote Mandarin as a [lingua franca](/wiki/Lingua_franca) amongst ethnic Chinese through the [Speak Mandarin Campaign](/wiki/Speak_Mandarin_Campaign), usage of other varieties such as Hokkien is discouraged. Today, whilst [Taiwanese Hokkien](/wiki/Taiwanese_Hokkien) speakers speak in their variety of Hokkien, they would officially write in Vernacular Chinese for formal documents, and only use vernacular Hokkien writings during informal occasions, if at all. In Taiwan, vernacular Chinese is used for academic writings, newspaper articles and television news report headlines, whilst Hokkien writings are used in novels, songs lyrics, film subtitles, theatrical and opera scripts, and in informal communication. ## Phonetic writing systems ### *Pe̍h-ōe-jī* *Pe̍h-ōe-jī* (白話字) is a Latin alphabet developed by Western missionaries working in Southeast Asia in the 19th century to write Hokkien. *Pe̍h-ōe-jī* allows Hokkien to be written phonetically in [Latin script](/wiki/Latin_script), meaning that phrases specific to Hokkien can be written without having to deal with the issue of non-existent Chinese characters. Current usage of *Pe̍h-ōe-jī* is restricted to some Taiwanese Christians, non-native learners of Hokkien, and native-speaker enthusiasts in Taiwan. POJ remains the Taiwanese script with \"the richest inventory of written work, including dictionaries, textbooks, literature [...] and other publications in many areas\". *Pe̍h-ōe-jī* can also be used along with Chinese characters in a mixed script called *Hàn-lô*, where words specific to Hokkien are written in *Pe̍h-ōe-jī*, and words with associated characters written in Han Characters. *Sample mixed orthography text:* > 翻 tńg 工，我 koh hap i tī Hotel ê 餐廳食西式 ê chái 起，我講 beh tò 去稅厝 ê 所在，i beh 送我去，我 kā 拒絕，mā 無 beh hō͘ i 知我 ê 地址、電話番，講若有緣就會 koh 再相會。I 講人海茫茫，我若無 tī hit 間跳舞、唱歌，i beh 去 toh 位 chhōe--我？「就是 án-ni m̄-chiah 講是緣」，我嘴是 án-ni 應，心肝內知影 kap i 自細漢到這時 ê 牽連、綿纏無 hiah 簡單就煞。 ### *Tâi-lô* The official romanization system for [Taiwanese Hokkien](/wiki/Taiwanese_Hokkien) (Taigi) in [Taiwan](/wiki/Taiwan) is known as **[Tâi-uân Tâi-gí Lô-má-jī Phing-im Hong-àn](/wiki/T%C3%A2i-u%C3%A2n_L%C3%B4-m%C3%A1-j%C4%AB_Phing-im_Hong-%C3%A0n)**, often shortened to **Tâi-lô**. It is derived from *[Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB)* and since 2006 has been one of the phonetic notation systems officially promoted by [Taiwan's Ministry of Education](/wiki/Ministry_of_Education,_Republic_of_China). The system is used in the MoE's *[Dictionary of Frequently-Used Taiwanese Taigi](/wiki/Dictionary_of_Frequently-Used_Taiwanese_Taigi)*. Its main differences with [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB) are that it uses *ts tsh* instead of *ch chh*, *u* instead of *o* in vowel combinations such as *oa* and *oe*, *i* instead of *e* in *eng* and *ek*, *oo* instead of *o͘*, and *nn* instead of *ⁿ*. (**[Full article...](/wiki/T%C3%A2i-u%C3%A2n_L%C3%B4-m%C3%A1-j%C4%AB_Phing-im_Hong-%C3%A0n)**) ### Bopomofo Bopomofo is another script used in Taiwanese Hokkien writings. It is commonly used in Taiwanese literature to represent Hokkien-specific [grammatical particles](/wiki/Grammatical_particle), along with Chinese characters, and can also be used to [gloss](/wiki/Ruby_character) Chinese characters with their Hokkien readings. *Sample text:* 我像離水ㄟ魚 ('I am like the fish that has left the water', with [ㄟ](/wiki/%E3%84%9F) [ei] being used as a replacement for [ㆤ](/wiki/%E3%86%A4) ê [[e](/wiki/Close-mid_front_unrounded_vowel)].) ### Taiwanese kana During the period of [Taiwan under Japanese rule](/wiki/Taiwan_under_Japanese_rule), a [kana](/wiki/Kana)-based system was introduced to gloss Hokkien writing in Chinese characters, as well writing as other languages of Taiwan. ## Chinese characters Writing Hokkien using Chinese characters (漢字 *Hàn-jī* or 唐人字 *Tn̂g-lâng-jī*, Taiwanese Hokkien pronunciation: [han˥˩d͡ʑi˧, tŋ̍˧˩laŋ˧˩d͡ʑi˧]) is a common method of writing in Taiwanese literature. However, there are various problems relating to the use of Chinese characters to write vernacular Hokkien, and in many cases Chinese characters are used alongside other scripts, such as bopomofo or POJ. The problem with using only Chinese characters to write Min Nan is that there are many morphemes, estimated to be around 15% of running text, which are not definitively associated with a particular character. Various strategies have been developed to deal with the issue, including researching and reviving the etymologically correct Chinese character from ancient Chinese texts and classical Chinese, creating new characters, allocating Chinese characters used in written Mandarin with similar meanings, but dissimilar etymology, to represent the missing characters, or using romanization for the missing 15%. In many cases, when writing Hokkien using Chinese characters phonetically, the use of characters is entirely unrelated to the original meaning of the phrase. While most Hokkien morphemes have standard designated characters, they are not always etymologically correct or phono-semantic. Similar-sounding, similar-meaning or rare characters are commonly borrowed or substituted to represent a particular morpheme. In addition, there may be many different ways to write a specific Hokkien phrase using Chinese characters. [Wanhua District](/wiki/Wanhua_District) in Taipei is commonly written as 萬華 ('ten thousand flowers'); however, the original meaning of the location name, pronounced *Báng-kah* in Taiwanese Hokkien (old character form 艋舺), is a rendering of a non-Chinese [indigenous](/wiki/Taiwanese_aborigines) name for 'boat'. Along with location names, common words also have orthography problems due to non-standardization; *chhit-thô* or *thit-thô* ('play (around)') is commonly written as 𨑨迌; however, neither characters have anything to do with the act of \"playing\" (the characters mean 'near' and 'cunning', 'deceitful'). Within Robert Cheng's publication of a Han character edition of the Taiwanese Hokkien novella **Khó-ài ê Sîu-jîn** ('Beloved Enemy') by Lai Jinsheng, the word **lô͘-môa**, meaning 'gangster' and cognate with Standard Chinese *liúmáng* (流氓)), is transcribed as 鱸鰻; these two phonetically used characters literally translate to 'perch' and 'eel'. Additional examples include the word for 'beautiful' (美; *bí* is the literary form), which has the vernacular morpheme *suí* represented by characters such as 媠 (an obsolete character), 婎 (a vernacular reading of this character) and even 水 (*suí*, typically meaning 'water'), and 'tall' (高; *ko* is the literary form), whose morpheme *kôan* is 懸. Common grammatical particles are not exempt; the negation particle *m̄* ('not') is variously represented by 毋, 呣 or 唔, among others. In other cases, characters are invented to represent a particular morpheme (a common example is the non-standard character 𪜶 *in*, which represents the personal pronoun 'they'). In addition, some characters have multiple and unrelated pronunciations, adapted to represent Hokkien words. For example, the Hokkien word *bah* ('meat') has been reduced to writing via 肉, which has etymologically unrelated colloquial and literary readings (*he̍k* and *jio̍k*, respectively). In other cases, a character is borrowed to represent a morpheme with the same meaning, but a different pronunciation; the morpheme *kē* ('low', as in *kē-thn̂g* 低糖 'low sugar') has been assigned the character 低, whose phonetic reading is *te*, by the Republic of China's Ministry of Education. Another case is the word 'to eat', *chia̍h*, which is often transcribed in Taiwanese newspapers and media as 呷 (a Mandarin transliteration, *xiā*, to approximate the Hokkien term), even though its recommended character in dictionaries is 食. [Victor H. Mair](/wiki/Victor_H._Mair) makes an estimate that if \"pure, unadulterated spoken vernacular Taiwanese\" were written exclusively in Chinese characters, with minimal use of Mandarin phrases, over 25% of morphemes would have no character, about 25% would have arbitrarily selected (yet more or less conventionally accepted) characters that are homophones or near-homophones, 10% would be written using characters exclusive to Hokkien, and 40% would be written with characters that have the correct sound and meaning. However, in more colloquial styles of Taiwanese Hokkien, the proportion of morphemes written with conventionally accepted characters would drop even lower than 40%. Likewise, [Carstairs Douglas](/wiki/Carstairs_Douglas), who has compiled a historical comprehensive 1873 Dictionary on Hokkien as well that later formed the basis of many other dictionaries for Hokkien in the subsequent decades, regarding Chinese characters would argue as well that: > *There are a very large number of the words for which we have not been able to find the corresponding character at all, perhaps a quarter or a third of the whole; [...] many of them rare, and many difficult to recognize from the great variations that take place between the written and spoken forms of the language.* — Chinese–English Dictionary of the Vernacular or Spoken Language of Amoy, Preface (p. viii) Moreover, unlike Cantonese, Hokkien does not have a universally accepted standardized character set. Thus, there is some variation in the characters used to express certain words and characters and they can be ambiguous in meaning. In 2007, Taiwan's [Ministry of Education](/wiki/Ministry_of_Education_(Taiwan)) formulated and released a standard character set known as the *[Taiwanese Southern Min Recommended Characters](/wiki/Taiwanese_Southern_Min_Recommended_Characters)* to overcome these difficulties. These standard Chinese characters for writing Taiwanese Hokkien are now taught in schools in Taiwan. When writing Hokkien in Chinese characters, some writers create 'new' characters when they consider it impossible to use existing ones; this corresponds to similar practices in character usage in Cantonese, Vietnamese [chữ Nôm](/wiki/Ch%E1%BB%AF_N%C3%B4m), Korean [hanja](/wiki/Hanja) and Japanese [kanji](/wiki/Kanji). These are usually not encoded in [Unicode](/wiki/Unicode). The earliest Hokkien vernacular literature written in hàn-jī is *[Tân Saⁿ and Gō͘-niû](/wiki/T%C3%A2n_Sa%E2%81%BF_and_G%C5%8D%CD%98-ni%C3%BB)* in the [Ming dynasty](/wiki/Ming_dynasty), and [koa-á-chheh](/wiki/Koa-%C3%A1-chheh) is also an important kind of hàn-jī vernacular literature in the history of the Hokkien language. ### Vocabulary The following table lists a few examples displaying differences in vocabulary between Vernacular Chinese based on Mandarin, and [Taiwanese Hokkien](/wiki/Taiwanese_Hokkien) written in Chinese characters: EnglishVernacular ChineseWritten HokkienHave you eaten enough yet?你吃飽了沒有你食飽未I will leave now.我會現在走了我這馬欲來行矣Where?哪裡佗位，叨位What?什麼啥物，啥咪(I) don't understand聽不懂聽無Thank you謝謝多謝 or 感謝different不一樣無仝款 In addition, Hokkien literature can consist of phrases that are vernacular to Hokkien, as well as literary terms originating from Classical Chinese. The following list of Taiwanese Hokkien words is adapted from a list by scholar [Ong Iok-tek](/wiki/Ong_Iok-tek), contrasting vernacular terms with relevant literary terms; the English translations have been added by Mair. EnglishVernacular phraseLiterary equivalentbeautifulsúi 媠美 bíwild, crazysiáu 痟狂 kôngstandkhiā 徛豎 sūgo againstkoāi乖 koaiwindowthang 窗窗 chhongmancha-po͘ 查埔男人 lâm-jîn ### Literary and colloquial character readings Hokkien separates reading pronunciations (讀音) from spoken pronunciations (語音) and explications (解說) of Chinese characters (see [Literary and colloquial readings of Chinese characters](/wiki/Literary_and_colloquial_readings_of_Chinese_characters)). The following examples in Pe̍h-oē-jī show differences in readings in Taiwanese Hokkien: Chinese characterReading pronunciationsSpoken pronunciations / †explicationsEnglish白pe̍kpe̍hwhite面biānbīnface書suchubook生sengseⁿ / siⁿstudent不putm̄†not返hóantńg†return學ha̍ko̍hto study人jîn / lînlâng†person少siàuchiófew轉chóantńgto turn - China portal - Taiwan portal - Singapore portal - Malaysia portal - Languages portal - [Taiwanese literature movement](/wiki/Taiwanese_literature_movement) - [Comparison of Hokkien writing systems](/wiki/Comparison_of_Hokkien_writing_systems) - [Amoy dialect](/wiki/Amoy_dialect) - [Singaporean Hokkien](/wiki/Singaporean_Hokkien) - [Penang Hokkien](/wiki/Penang_Hokkien)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:14:52.318056",
  "title": "Written Hokkien",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Written_Hokkien"
}