{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:14:54.284494"
  },
  "content": "Malayan physician (1879–1960) **Wu Lien-teh** ([Chinese](/wiki/Traditional_Chinese_characters): 伍連德; [pinyin](/wiki/Pinyin): *Wǔ Liándé*; [Jyutping](/wiki/Jyutping): *Ng5 Lin4 Dak1*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Gó͘ Liân-tek*; **Goh Lean Tuck** and **Ng Leen Tuck** in [Hokkien](/wiki/Southern_Min) and [Cantonese](/wiki/Cantonese) [transliteration](/wiki/Romanization_of_Chinese) respectively; 10 March 1879 – 21 January 1960) was a [Malayan](/wiki/British_Malaya) [physician](/wiki/Physician) renowned for his work in [public health](/wiki/Public_health), particularly the [Manchurian plague](/wiki/Manchurian_plague) of 1910–11. He is the inventor of the Wu mask, which is the forerunner of today's [N95 respirator](/wiki/N95_respirator). Wu was the first medical student of [Chinese descent](/wiki/Chinese_descent) to study at the [University of Cambridge](/wiki/University_of_Cambridge). He was also the first Malayan nominated for the [Nobel Prize](/wiki/Nobel_Prize) in [Physiology or Medicine](/wiki/Nobel_Prize_in_Physiology_or_Medicine), in 1935. ## Life and education Wu was born in [Penang](/wiki/Penang), one of the three towns of the [Straits Settlements](/wiki/Straits_Settlements) (the others being [Malacca](/wiki/Malacca) and [Singapore](/wiki/Singapore)), currently as one of the states of [Malaysia](/wiki/Malaysia). The Straits Settlements formed part of the colonies of the [United Kingdom](/wiki/United_Kingdom). His father was a recent immigrant of Ethnic Hoisanese background from [Taishan](/wiki/Taishan,_Guangdong), [China](/wiki/China), and worked as a [goldsmith](/wiki/Goldsmith). Wu's mother's was of ethnic [Hakka](/wiki/Hakka_people) heritage and was a second-generation [Peranakan](/wiki/Peranakan) born in Malaya. Wu had four brothers and six sisters. His early education was at the [Penang Free School](/wiki/Penang_Free_School), a [Church of England](/wiki/Church_of_England) school. Wu was admitted to [Emmanuel College, Cambridge](/wiki/Emmanuel_College,_Cambridge) in 1896, after winning the [Queen's Scholarship](/wiki/Queen%27s_Scholar_(British_Malaya_and_Singapore)). The women in his family made him a version of his college’s lion crest in [Perakanan beadwork](/wiki/Peranakan_cut_beads) as a leaving gift. He had a successful career at university, winning virtually all the available prizes and scholarships. His undergraduate clinical years were spent at [St Mary's Hospital, London](/wiki/St_Mary%27s_Hospital,_London) and he then continued his studies at the [Liverpool School of Tropical Medicine](/wiki/Liverpool_School_of_Tropical_Medicine) (under [Sir Ronald Ross](/wiki/Ronald_Ross)), the [Pasteur Institute](/wiki/Pasteur_Institute), [Halle University](/wiki/Martin_Luther_University_of_Halle-Wittenberg), and the Selangor Institute. Wu returned to the Straits Settlements in 1903. Some time after that, he married Ruth Shu-chiung Huang, whose sister was married to [Lim Boon Keng](/wiki/Lim_Boon_Keng), a Hokkien baba physician who promoted social and educational reforms in [Singapore](/wiki/Singapore). The sisters were daughters of [Wong Nai Siong](/wiki/Wong_Nai_Siong), a Fuzhou revolutionary leader and educator who had moved to the area from 1901 to 1906. Wu and his family moved to China in 1907. During his time in China, Wu's wife and two of their three sons died. While Ms Huang lived in Peking, Wu started a second family in Shanghai with Marie Lee Sukcheng, whom he had met in Manchuria. Wu had four children with Lee. During the [Japanese invasion of Manchuria](/wiki/Japanese_invasion_of_Manchuria), in November 1931, Wu was detained and interrogated by the Japanese authorities under suspicion of being a Chinese spy. In 1937, during the [Japanese occupation of much of China](/wiki/Second_Sino-Japanese_War) and the retreat of the Nationalists, Wu was forced to flee, returning to the Settlements to live in [Ipoh](/wiki/Ipoh). His home and all his ancient Chinese medical books were burnt. In 1943 Wu was captured by Malayan left-wing resistance fighters and held for ransom. Then he nearly was prosecuted by the Japanese for supporting the resistance movement by paying the ransom, but was protected by having treated a Japanese officer. ## Career In September 1903, Wu joined the Institute for Medical Research in Kuala Lumpur as the first research student. However, there was no specialist post for him because, at that time, a two-tier medical system in the British colonies provided that only British nationals could hold the highest positions of fully qualified medical officers or specialists. Wu spent his early medical career researching [beri-beri](/wiki/Thiamine_deficiency) and roundworms ([Ascarididae](/wiki/Ascarididae)) before entering private practice toward the end of 1904 in [Chulia Street, George Town](/wiki/Chulia_Street,_George_Town), Penang. ### Opium Wu was a vocal commentator on the social issues of the time. In the early 1900s, he became friends with Lim Boon Keng and [Song Ong Siang](/wiki/Song_Ong_Siang), a lawyer who was active in developing Singapore's civil society. He joined them in editing *The Straits Chinese Magazine*. With his friends, Wu founded the Anti-Opium Association in Penang. He organised a nationwide [anti-opium](/wiki/History_of_opium_in_China) conference in the spring of 1906 that was attended by approximately 3000 people. This attracted the attention of the powerful forces involved in the lucrative trade of [opium](/wiki/Opium) and, in 1907, this led to a search and subsequent discovery of one ounce of tincture of opium in Wu's dispensary, for which he was convicted and fined. In 1908, Dr Wu accepted the then Grand Councillor [Yuan Shikai](/wiki/Yuan_Shikai)'s offer to become the Vice Director of the Imperial Army Medical College, now known as the [Army Medical College](/wiki/National_Defense_Medical_Center), based in [Tianjin](/wiki/Tianjin), in 1908. This was established to train doctors for the Chinese Army. ### Pneumonic plague In the winter of 1910, Dr Wu Lien Teh was given instructions from the Foreign Office of the Imperial Qing court in Peking, to travel to [Harbin](/wiki/Harbin) to investigate an unknown disease that killed 99.9% of its victims. This was the beginning of the large [pneumonic plague](/wiki/Pneumonic_plague) epidemic of Manchuria and Mongolia, which ultimately claimed 60,000 lives. Wu was able to conduct a [postmortem](/wiki/Postmortem) (usually not accepted in China at the time) on a [Japanese](/wiki/Japanese_people_in_China) woman who had died of the plague. Having ascertained via the autopsy that the plague was [spreading by air](/wiki/Airborne_transmission), Wu developed [surgical masks](/wiki/Surgical_mask) into more substantial masks with layers of [gauze](/wiki/Gauze) and cotton to filter the air. Gérald Mesny, a prominent French doctor who had come to replace Wu, refused to wear a mask and died days later of the plague. The mask was widely produced, with Wu overseeing the production and distribution of 60,000 masks in a later epidemic, and it featured in many press images. Wu initiated a quarantine, arranged for buildings to be disinfected, and the old plague hospital to be burned down and replaced. The measure that Wu is best remembered for was in asking for imperial sanction to cremate plague victims. It was impossible to bury the dead because the ground was frozen, and the bodies could only be disposed of by soaking them in [paraffin](/wiki/Kerosene) and burning them on pyres. Cremation of these infected victims turned out to be the turning point of the epidemic; days after cremations began, plague began to decline and within months it had been eradicated. Wu chaired the International Plague Conference in Mukden ([Shenyang](/wiki/Shenyang)) in April 1911, a historic event attended by scientists from the United States of America, the United Kingdom of Great Britain and Ireland, France, Germany, Italy, Austria-Hungary, the Netherlands, Russia, Mexico, and China. The conference took place over three weeks and featured demonstrations and experiments. Wu later presented a plague research paper at the International Congress of Medicine, London in August 1911 which was published in *[The Lancet](/wiki/The_Lancet)* in the same month. At the plague conference, [epidemiologists](/wiki/Epidemiologists) [Danylo Zabolotny](/wiki/Danylo_Zabolotny) and Anna Tchourilina announced that they had traced the initial cause of the outbreak to [Tarbagan marmot](/wiki/Tarbagan_marmot) hunters who had contracted the disease from the animals. A tarabagan became the conference mascot. However, Wu raised the question of why traditional marmot hunters had not experienced deadly epidemics before. He later published a work arguing that the traditional [Mongol](/wiki/Mongols) and [Buryat](/wiki/Buryats) hunters had established practices that kept their communities safe and he blamed more recent [Shandong](/wiki/Shandong) immigrants to the area (*[Chuang Guandong](/wiki/Chuang_Guandong)*) for using hunting methods that captured more sick animals and increased risk of exposure. ### Later career This article **is missing information** about this seems to be missing information about his life post WWII, a pivotal time in history. Please expand the article to include this information. Further details may exist on the talk page. *(March 2021)* In 1912, Wu became the first director of the Manchurian Plague Service. He was a founder member and first president of the [Chinese Medical Association](/wiki/Medicine_in_China) (1916–1920). Wu led the efforts to combat the [1920-21 cholera pandemic](/wiki/1899%E2%80%931923_cholera_pandemic) in the north-east of China. In 1929, he was appointed a trustee of the 'Nanyang Club' in [Penang](/wiki/Penang) by [Cheah Cheang Lim](/wiki/Cheah_Cheang_Lim), along with Wu Lai Hsi, [Robert Lim Kho Seng](/wiki/Robert_Lim), and Lim Chong Eang. The 'Nanyang Club', an old house in [Beiping, China](/wiki/Beijing), provided convenient accommodation to [overseas Chinese](/wiki/Overseas_Chinese) friends. In the 1930s he became the first director of the National Quarantine Service. Around 1939, Wu moved back to Malaya and continued to work as a general practitioner in [Ipoh](/wiki/Ipoh). Wu collected donations to start the Perak Library (Now the Tun Razak Library) in Ipoh, a free-lending public library, and donated to Shanghai City Library and the [University of Hong Kong](/wiki/University_of_Hong_Kong). Wu was a [mandarin](/wiki/Mandarin_(bureaucrat)) of the second rank[*clarification needed*] and sat on advisory committees for the [League of Nations](/wiki/League_of_Nations). He was given awards by the Czar of Russia and the President of France, and was awarded honorary degrees by [Johns Hopkins University](/wiki/Johns_Hopkins_University), [Peking University](/wiki/Peking_University), [University of Hong Kong](/wiki/University_of_Hong_Kong), and [University of Tokyo](/wiki/University_of_Tokyo). ## Death and commemoration Wu practised medicine until his death at the age of 80. He had bought a new house in Penang for his retirement and had just completed his 667-page autobiography, *Plague Fighter, the Autobiography of a Modern Chinese Physician*. On 21 January 1960, he died of a stroke while in his home in Penang. A road named after Wu can be found in Ipoh Garden South, a middle-class residential area in Ipoh. In Penang, a residential area named Taman Wu Lien Teh is located near the [Penang Free School](/wiki/Penang_Free_School). In that school, his alma mater, a house has been named after him. There is a Dr. Wu Lien-teh Society, Penang. The Wu Lien-teh Collection, which comprises 20,000 books, was given by Wu to the [Nanyang University](/wiki/Nanyang_University), which later became part of the [National University of Singapore](/wiki/National_University_of_Singapore). The [Art Museum](/wiki/NUS_Museum) of the [University of Malaya](/wiki/University_of_Malaya) has a collection of Wu's paintings. In 1995, Wu's daughter, Dr. Yu-lin Wu, published a book about her father, *Memories of Dr. Wu Lien-teh, Plague Fighter.* In 2015, the Wu Lien-Teh Institute opened at [Harbin Medical University](/wiki/Harbin_Medical_University). In 2019, *The Lancet* launched an annual Wakley-Wu Lien Teh Prize in honour of Wu and the publication's founding editor, [Thomas Wakley](/wiki/Thomas_Wakley). Dr. Wu Lien-teh is regarded as the first person to modernise China's medical services and medical education. In [Harbin Medical University](/wiki/Harbin_Medical_University), bronze statues of him commemorate his contributions to public health, preventive medicine, and medical education. ### Places named after Wu Lien-Teh - Dr Wu Lien-Teh Centre for Research on Communicable Diseases, [Universiti Tunku Abdul Rahman](/wiki/Universiti_Tunku_Abdul_Rahman) - Wu Lien-Teh Institute, [Harbin Medical University](/wiki/Harbin_Medical_University) ### Commemoration during the COVID-19 pandemic Wu's work in the field of [epidemiology](/wiki/Epidemiology) had contemporary relevance during the [COVID-19 pandemic](/wiki/COVID-19_pandemic). In May 2020, Dr. Yvonne Ho united the 22 known \"medical and scientific descendants\" of Dr. Wu Lien-Teh for a video conference meeting spanning 14 cities around the world. In July 2020, some of these medical and scientific descendants collaborated to publish an article to memorialize Dr. Wu's lifetime work in public health. In August 2020, a second group of Wu's medical and scientific descendants collaborated on a similar piece. In March 2021, Wu was honoured with a [Google Doodle](/wiki/Google_Doodle), depicting Wu assembling surgical masks and distributing them to reduce the risk of disease transmission. - Wu Lien-Teh, 1959. *Plague Fighter: The Autobiography of a Modern Chinese Physician*. Cambridge. (Reprint: Areca Books. 2014 [ISBN](/wiki/ISBN_(identifier)) 978-967-5719-14-1) - Yang, S. 1988. \"Dr. Wu Lien-teh and the national maritime quarantine service of China in 1930s\". Zhonghua Yi Shi Za Zhi 18:29–32. - Wu Yu-Lin. 1995. *Memories of Dr. Wu Lien-Teh: Plague Fighter*. World Scientific Pub Co Inc.[ISBN](/wiki/ISBN_(identifier)) 981-02-2287-4 - Flohr, Carsten. 1996. \"The plague fighter: Wu Lien-teh and the beginning of the Chinese public health system\". *Annals of Science* 53:361–80 - Gamsa, Mark. 2006. \"The Epidemic of Pneumonic Plague in Manchuria 1910–1911\". *Past & Present* 190:147–183 - Lewis H. Mates, ‘Lien-Teh, Wu’, in Douglas Davies with Lewis H. Mates (eds), *Encyclopedia of Cremation* (Ashgate, 2005): 300–301. Lien-Teh, Wu - Penang Free School archive PFS Online - History of the Manchurian Plague\n",
  "language": "en",
  "processed_at": "2026-01-12T12:14:54.284198",
  "title": "Wu Lien-teh",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Wu_Lien-teh"
}