{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:14:58.511333"
  },
  "content": "Defunct radio station **XFM 96.3** was a multilingual radio station in Singapore. Owned by the state-owned broadcaster [Mediacorp](/wiki/Mediacorp), it primarily broadcast news and cultural programming serving expat communities, including blocks of [world music](/wiki/World_music), simulcasts of programmes from international radio services such as [Deutsche Welle](/wiki/Deutsche_Welle) and [Radio France Internationale](/wiki/Radio_France_Internationale), and locally produced cultural programmes in languages such as Japanese and Korean. The station was shut down on 30 September 2016; its frequency was later awarded to [SPH Media](/wiki/SPH_Media), who launched [96.3 Hao FM](/wiki/96.3_Hao_FM) in 2018. ## History ### The International Channel Plans for the station was announced by Minister for Information and the Arts [George Yeo](/wiki/George_Yeo) in March 1998, with the tentative name Inter FM, providing programmes in French, Japanese, and German. Ahead of the launch of the station, it was announced that FM 96.3 was going to feature locally made programming in Japanese, as part of the first phase of the service, set to begin on 14 September 1998. The initial target during the first four weeks of operation was to consist mainly of 25,000 Japanese immigrants residing in Singapore. From 12 October, French and German output were to be added, when the station's regular broadcasts were about to begin. The station started 24/7 broadcasts on 1 January 2008. ### XFM Both the [Media Development Authority](/wiki/Infocomm_Media_Development_Authority) (MDA) and [Mediacorp](/wiki/Mediacorp) mutually agreed to cease transmission of the station on 30 September 2016. [Mediacorp](/wiki/Mediacorp) stated \"new technologies and evolving radio listenership preferences\" were the reasons for their evaluation. In 2016, the vacated frequency was tendered and won by [SPH Media](/wiki/SPH_Media), which launched the new classic mandopop station [96.3 Hao FM](/wiki/96.3_Hao_FM) on 8 January 2018. ## Programming - **[French](/wiki/French_language) and [German](/wiki/German_language)**: from the outset of the service, the station carried live satellite feeds of [RFI](/wiki/Radio_France_Internationale) and [Deutsche Welle](/wiki/Deutsche_Welle) mostly in their respective languages. - **[Japanese](/wiki/Japanese_language)**: the Japanese programme was the oldest to be made for the station, as well as the first to be outsourced, as opposed to be a direct simulcast of a foreign service. Titled *Hello Singapore*, it was produced by Comm and featured news and music, in contrast to the current affairs and heavy cultural line-up offered by the European providers. News consisted of a daily relay of an [NHK](/wiki/NHK) news bulletin and reports from the [Asahi Shimbun](/wiki/Asahi_Shimbun) and [Jiji Press](/wiki/Jiji_Press). - **[Korean](/wiki/Korean_language)**: the slot started on 1 February 2008, shortly before the station was renamed. *Cool K Time* was produced by Briyo Media. - [List of radio stations in Singapore](/wiki/List_of_radio_stations_in_Singapore) - XFM 96.3 Official Website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:14:58.511017",
  "title": "XFM 96.3",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/XFM_96.3"
}