{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:15:08.546986"
  },
  "content": "Singaporean cafe chain 1°18′N 103°48′E﻿ / ﻿1.3°N 103.8°E﻿ / 1.3; 103.8 **Ya Kun Kaya Toast** (*YAH-koon*; [simplified Chinese](/wiki/Simplified_Chinese_characters): 亚坤加椰面包; [traditional Chinese](/wiki/Traditional_Chinese_characters): 亞坤加椰麵包; [pinyin](/wiki/Pinyin): *Yà Kūn Jiā Yē Miànbāo*), often colloquially known just as **Ya Kun** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 亚坤; [traditional Chinese](/wiki/Traditional_Chinese_characters): 亞坤; [pinyin](/wiki/Pinyin): *Yà Kūn*), is a Singaporean chain of mass-market, retro-ambience [cafés](/wiki/Caf%C3%A9) selling toast products (notably [kaya toast](/wiki/Kaya_toast)), soft-boiled eggs and coffee. Founded by Loi Ah Koon in 1944, Ya Kun remained a small family-run stall for decades, but has expanded rapidly since Loi's youngest son headed the business in 1999. The chain has over fifty outlets, mostly [franchised](/wiki/Franchising), across 14 countries, and is a [Singaporean cultural icon](/wiki/Culture_of_Singapore), known for its traditional brand identity and conservative, people-centric corporate culture. ## History In 1926, Loi Ah Koon (黎亚坤) emigrated from [Hainan](/wiki/Hainan) to [Singapore](/wiki/Singapore), where he worked as a coffee-stall assistant. He later went on to start his own business with two other immigrants. They sold coffee, crackers and toast at [Telok Ayer](/wiki/Telok_Ayer) Basin, however, his two partners later dropped out, leaving him to run the stall alone. He married while visiting relatives in Hainan, his wife later settled down with him in Singapore. She worked alongside him and later suggested cutting each slice of bread into half and combining the toast with her homemade [kaya](/wiki/Kaya_(jam)), this became their signature kaya toast. Registered in 1944 as Ya Kun Coffeestall (Ya Kun being Ah Koon in [Hanyu Pinyin](/wiki/Pinyin)), the stall gradually developed a reputation for delicious kaya toast and friendly service. The couple, their eight children and seven other families lived together in a three-storey shophouse across the road, where the [Hong Leong Building](/wiki/Hong_Leong_Building) now stands. As the children grew up, they began to help stir the [kaya](/wiki/Coconut_jam), run errands, charcoal-grill the bread and eventually, manage the stall. Ya Kun Coffeestall moved to [Lau Pa Sat](/wiki/Lau_Pa_Sat) in 1972, but high rents and renovation of Lau Pa Sat in 1984 sparked a return to the Telok Ayer Market; nevertheless, the stall continued to attract \"customers who came every day, some from as far as [Jurong](/wiki/Jurong) or [Woodlands](/wiki/Woodlands,_Singapore)\". In 1998, the market closed down, so the stall relocated to Far East Square and was renamed Ya Kun Kaya Toast. The following year, Ah Koon died and his youngest son, Loi Boon Sim Adrin (黎文深), took over the business, determined \"to keep his father's legacy going\". Realising that Ya Kun had a lot of [goodwill](/wiki/Goodwill_(accounting)) and potential, Adrin decided to expand the business, the family opened a second store at [Tanjong Pagar](/wiki/Tanjong_Pagar) and, in 2000, began franchising the brand. Ya Kun was [incorporated](/wiki/Incorporation_(business)) in 2001, and they launched their first overseas outlet (in Indonesia) in 2002 and have since expanded their menu (adding ice cream toast and the Toastwich). They have won the 2004 and 2005 [Superbrands](/wiki/Superbrands) Award, the 2005 to 2007 SIFST Product Award and the 2008 SPBA-CitiBusiness Regional Brands Award. In 2025, Ya Kun Kaya Toast collaborated with Japanese fast-fashion giant [Uniqlo](/wiki/Uniqlo) to create a line of apparel featuring the former's famous products. This marketing initiative was conducted to time with the nation's SG60 celebrations, marking the 60th anniversary of the Republic's founding. ## Products and stores Ya Kun Kaya Toast has over forty Singaporean outlets, about half of which are franchised, and over thirty overseas outlets, all franchised, across seven countries ([China](/wiki/China), [Indonesia](/wiki/Indonesia), [Japan](/wiki/Japan), [Myanmar](/wiki/Myanmar), [South Korea](/wiki/South_Korea), [Taiwan](/wiki/Taiwan), [Philippines](/wiki/Philippines) and [United Arab Emirates](/wiki/United_Arab_Emirates)); they plan to expand to [Brunei](/wiki/Brunei), [India](/wiki/India), [Malaysia](/wiki/Malaysia), the [Maldives](/wiki/Maldives), and [Thailand](/wiki/Thailand) in future. The stores have a retro ambiance, with wooden tables and stools, a [Chinese calligraphy](/wiki/Chinese_calligraphy) of the company name, posters about their history, and traditional methods of preparing food and customer service reflecting [Chinese family values](/wiki/Filial_piety). Unlike their main competitors, they have a limited menu that revolves around their core product, kaya toast, with cheese, peanut butter and ice cream as alternative spreads for their thin, brown, crispy bread. To appeal to a wider demographic, Ya Kun also sells [French toast](/wiki/French_toast) and Toastwiches (their Asian alternative to sandwiches). Prices at local Ya Kun stores are slightly higher than those at [kopitiams](/wiki/Kopitiam), but lower than prices of comparable products at Western [coffeehouse](/wiki/Coffeehouse) chains operating in Singapore, while food at overseas Ya Kun outlets is relatively expensive. All outlets obtain their ingredients from the same suppliers and some ingredients, notably the kaya and coffee powder, are made at the Ya Kun factory in [Bedok](/wiki/Bedok), using recipes that only a few of the Loi family know. The chain are \"widely regarded as an institution of good kaya toast\" and \"a Singaporean cultural icon\" that the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board) has promoted as a tourist attraction. A *[Ming Pao](/wiki/Ming_Pao)* review praised the \"crispy but not hard, fragrant but not burnt\" toast and fresh kaya, while a *[Straits Times](/wiki/Straits_Times)* review described the toast as \"evenly sliced\" and of \"the right texture\", the eggs as \"cooked to perfection\" and the teh tarik as \"not too milky and not overpoweringly sweet either\". ## Management Adrin has an 80 per cent share of Ya Kun Singapore and his younger brother, Algie, has a 20 per cent share, with other members of the Loi family actively involved in daily activities, while Ya Kun International is fully owned by Adrin Loi. Their corporate culture is conservative and people-centric, with emphasis on preserving their brand identity as their *chengnuo* (承诺, \"commitment\" or \"promise\") to their customers, [sustainable growth](/wiki/Sustainable_growth) over actively pursuing new opportunities, nurturing family-like relationships among staff (they do not fire or retrench workers) and avoiding aggressive conflict with competitors. Although Ya Kun do not publicly disclose their financial figures, a 2009 *[Lianhe Zaobao](/wiki/Lianhe_Zaobao)* article estimated that the company had an annual revenue of S$8 million, while a 2012 article in *[The Star](/wiki/The_Star_(Malaysia))* stated they had 300 employees. - [Vegetarian Society (Singapore)](/wiki/Vegetarian_Society_(Singapore)) ### Cited literature - Koh, William (2010). *The Top Toast: Ya Kun and the Singapore Breakfast Tradition*. Cengage Learning. [ISBN](/wiki/ISBN_(identifier)) 978-981-4281-65-2. Media related to Ya Kun Kaya Toast at Wikimedia Commons - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:15:08.546727",
  "title": "Ya Kun Kaya Toast",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Ya_Kun_Kaya_Toast"
}