{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:15:15.107268"
  },
  "content": "Liberal arts college in SingaporeThis article **relies excessively on references to primary sources**. Please improve this article by adding secondary or tertiary sources. *Find sources:* \"Yale–NUS College\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(March 2024)* *(Learn how and when to remove this message)*‹ The template *Infobox university* is being considered for merging. › The **Yale–NUS College of the National University of Singapore** was a [liberal arts college](/wiki/Liberal_arts_college) from April 2011 to June 2025 under the [National University of Singapore](/wiki/National_University_of_Singapore) (NUS) in [Singapore](/wiki/Singapore). It was established in 2011 by NUS in collaboration with [Yale University](/wiki/Yale_University). It stopped new class admissions since 2021 and was fully closed in 2025 as NUS established its own honors college, the NUS College. ## History ### Overview Yale–NUS was a four-year, fully residential undergraduate institution. The first class, the class of 2017, consisted of 157 students entering in 2013. At full capacity, the college had 250 students in each class. Students would select their majors at the end of their second year, after two years of the Yale–NUS Common Curriculum. Students graduated with a [Bachelor of Arts](/wiki/Bachelor_of_Arts) degree with Honours or a [Bachelor of Science](/wiki/Bachelor_of_Science) degree with Honours from the \"Yale–NUS College of the National University of Singapore\". In August 2021, it was announced that Yale–NUS College would be merged with the NUS University Scholars Programme to form a new interdisciplinary honours college, with the Class of 2025 being the last cohort of Yale–NUS students. According to [Pericles Lewis](/wiki/Pericles_Lewis), this decision was part of NUS' plan for a \"broader restructuring of Singapore’s educational offerings, one that had been conceived of in 2018\". The new college will not feature liberal arts subjects in its core curriculum. In January 2022, it was announced that the provisionally-named \"New College\" would be named the \"NUS College\". The Yale–NUS Class of 2025 was the final cohort of Yale–NUS students. The college was officially closed on 30 June 2025. ### Launch Under the presidency of [Richard Levin](/wiki/Rick_Levin), Yale began developing a \"internationalization\" strategy that included expanding financial resources for international students and study abroad programs, founding the [Yale World Fellows](/wiki/Yale_World_Fellows) and the [Center for the Study of Globalization](/wiki/Yale_Center_for_the_Study_of_Globalization), and joining the [International Alliance of Research Universities](/wiki/International_Alliance_of_Research_Universities). Administrators at Yale began considering international campus expansion in 2006, and initially approached the [United Arab Emirates](/wiki/United_Arab_Emirates) about establishing an arts institute on Abu Dhabi's [Saadiyat Island](/wiki/Saadiyat_Island), developed in collaboration with the university's arts professional schools. After Yale indicated that it was not willing to offer Yale degree programs at the proposed institute, the project was dropped. Levin and National University of Singapore President [Tan Chorh Chuan](/wiki/Tan_Chorh_Chuan) discussed the concept of a joint liberal arts college at the 2009 [World Economic Forum](/wiki/World_Economic_Forum) in Davos, Switzerland, and eighteen months later, Levin and Yale Provost [Peter Salovey](/wiki/Peter_Salovey) circulated to the Yale faculty a prospectus for a liberal arts college in Singapore. Among the given reasons for the initiative were \"develop[ing] a novel curriculum spanning Western and Asian cultures\" and better preparing students for \"an interconnected, interdependent global environment\". Yale–NUS College was officially launched in April 2011. In July 2012, the college held its ground-breaking ceremony; it enrolled its first class of students in 2013. Yale–NUS inaugurated its campus on 12 October 2015. The event was attended by Singaporean prime minister Lee Hsien Loong, acting education minister (higher education) Ong Ye Kung and the presidents of Yale and the National University of Singapore. The college held its inaugural graduation ceremony on 29 May 2017. The certificates were presented by [Tony Tan](/wiki/Tony_Tan), [President of Singapore](/wiki/President_of_Singapore), and Richard Levin, former president of Yale and chief executive of Coursera, was the guest speaker. In 2012, Yale–NUS published its policy on academic freedom and non-discrimination, which states that “the College upholds the principles of academic freedom and open inquiry, essential core values in higher education of the highest calibre. Faculty and students in the College will be free to conduct scholarship and research and publish the results, and to teach in the classroom and express themselves on campus, bearing in mind the need to act in accordance with accepted scholarly and professional standards and the regulations of the College.” The college is also “committed to basing judgments concerning the admission, education, and employment of individuals upon their qualifications and abilities.” ### Closure The closure of Yale–NUS College was initiated by NUS president Tan Eng Chye, who approached Yale president [Peter Salovey](/wiki/Peter_Salovey) in July 2021 with the decision, surprising Yale administrators who \"were confident that Yale–NUS was living up to its ambitions\". Despite previous assurances that Yale–NUS would not be affected by the launching of NUS's College of Humanities and Sciences, NUS later announced in August 2021 that the college would close, being merged with the University Scholars Programme to form an interdisciplinary college tentatively referred to as the 'New College'. The closure was made without any consultation with faculty, most senior administrators, and students due to sensitivities between both universities. According to [Yale Daily News](/wiki/Yale_Daily_News), the \"National University of Singapore’s one-sided decision to push Yale out of the universities’ joint college surprised Yale administrators, who were subsequently forced to accept the change\". Yale University also stated that either party can withdraw from the college from 2025. The decision was made by NUS without input from many senior figures at Yale University, NUS, and Yale–NUS. Yale–NUS president [Tan Tai Yong](/wiki/Tan_Tai_Yong) described the decision to shut down the college as a \"fait accompli\"*.* A petition titled \"#NoMoreTopDown\" was drafted and calls for the reversal of the decision. It received over 13,000 signatures. The Class of 2025, admitted in 2021, would be the last cohort to receive a Yale–NUS degree. In Peter Salovey's statement on the shutdown, he expressed a wish for Yale–NUS to continue, stating that Yale–NUS was \"a unique and remarkable living and learning experience in Singapore.\" By the end of its operations, the institution will have produced approximately 1,500 graduates and employed 90 faculty and staff members. #### 2025 book and DVD destruction incident On 20 May 2025, 60 to 70 bags of books from the former Yale–NUS library were discarded by NUS, leading to widespread condemnation among the Yale–NUS alumni community, citing concerns over the destruction of knowledge. The incident was described as an \"operational lapse\" by NUS officials, with university librarian Natalie Pang describing the 9,000 books earmarked for disposal comprised approximately 20% of the Yale–NUS Library. NUS provost Aaron Thean issued a recorded apology. Member of Parliament-elect of Singapore [Jamus Lim](/wiki/Jamus_Lim) criticised the destruction of the books, adding “You may say that books are just books; without reading them, they are just ink printed on dead trees. Yet there is something magical about a simple tome.” Students were also directed by NUS officials to destroy DVDs of classic films. ## Leadership and faculty ### Leadership **Presidents** - Yale–NUS College's founding president from 2012 to 2017 was [Pericles Lewis](/wiki/Pericles_Lewis), Douglas Tracy Smith Professor of Comparative Literature and Professor of English at Yale University. Pericles Lewis is the current dean of Yale College, Yale University. - [Tan Tai Yong](/wiki/Tan_Tai_Yong) served as the second president of Yale–NUS from 2017 to 2022. Prior to this, he was the executive vice president (academic affairs) from 2014 to 2017. Tan Tai Yong is the current president of the Singapore University of Social Sciences. - [Joanne Roberts](/wiki/Joanne_Roberts), professor of social sciences (economics) at Yale–NUS was appointed the third and current president of Yale–NUS in 2022. She was the Executive Vice President (Academic Affairs) from 2018 to 2022, and previously on the faculty of the University of Calgary. She also served as Vice President (Humanities and Social Sciences Research)-Designate at National University of Singapore from 1 January to 30 June 2025, during which time she continued to serve as President of Yale–NUS College. On 1 July 2025, she joined Bates College as its vice president for academic affairs and dean of the faculty. **Executive Vice Presidents and Vice Presidents** - Mrs Doris Sohmen-Pao, currently Chief Executive Officer of the Human Capital Leadership Institute, was Executive Vice President (Administration) from 2012 to 2015. She was Executive Vice President (Institutional Affairs) from 2015 to 2016. - Kristen Lynas, formerly the director of executive programmes at INSEAD, was the Executive Vice President (Administration) from 2015 to 2023. - National University of Singapore’s (NUS) Professor [Lai Choy Heng](/wiki/Lai_Choy_Heng) was executive vice president (academic affairs) from 2012 to 2014. - Steven Bernasek, professor of chemistry, emeritus at Princeton University, was Executive Vice President (Academic Affairs) from 2017 to 2018. - [David M. Post](/wiki/David_M._Post), Visiting Wong Ngit Liong Professor at Yale–NUS and professor of ecology and evolutionary biology at Yale University, was Vice President (Academic Affairs) from 2022 to 2024. - Dave Stanfield, currently the vice president and dean of students at Sarah Lawrence College, was Vice President (Student Affairs) from 2022 to 2023. - Trisha Craig, currently the executive director of the Princeton Institute for International and Regional Studies, was vice president (engagement) from 2019 to 2024. ### Faculty As of February 2024, Yale–NUS lists over 120 faculty members from leading colleges and universities around the world. ### Governing board The governing board was composed of trustees half-appointed by Yale, and half-appointed by NUS. The board was chaired by Mdm. Kay Kuok Oon Kwong. ## Admissions Admission to Yale–NUS was based on each student's prior achievement and promise for success at the college. Yale–NUS had a [need-blind](/wiki/Need-blind) financial aid programme for domestic students and, until 2020, for international students, which offered substantial support for students from a variety of backgrounds. Fees were cohort-based and individual circumstances will be considered in the financial aid application process. The admission timeline was similar to that of colleges and universities in the US. Yale–NUS targeted a class size of around 250 students; this threshold was met with the Class of 2022. Application deadlines were typically in January and March. At full capacity, the total expected student population will be 1,000 students. The college employed a holistic approach in evaluating applicants: while academic achievement as reflected in examinations grades was a primary consideration, interviews, recommendations, essays and extracurricular accomplishments were also given significant weight in the process. Dean of Yale College and Yale–NUS' first president, Pericles Lewis, reported that the college “exceeded expectations” in terms of attracting talented students and faculty. The Yale–NUS class of 2025 was the final round of admissions offered by the institution. ## Academics The founding instruction committee decided to implement a common curriculum, a set of interlinked courses for all students. Similar to the core curricula at [Columbia University](/wiki/Columbia_University) and [University of Chicago](/wiki/University_of_Chicago), students get to choose from a number of set courses in their first year of study. The common curriculum was reviewed every four years. Following its inaugural review, the common curriculum was reduced to 10 courses, with the removal of a science course. The Yale–NUS common curriculum was a set of interconnected courses designed to provide all students with a shared, intensive exploration of themes and topics ranging across all the academic disciplines, from science to the humanities. In his book, titled \"In Defense of a Liberal Education,\" Fareed Zakaria describes the Yale–NUS Curriculum Report as the 21st century version of the Yale Report of 1828, which set the agenda for the classical curriculum of the 19th century, and the Harvard Red Book of 1945, which set a similar agenda for the 20th. ### Majors Students choose their majors at the end of their second year. Currently, there are 14 major fields of study. 31% of the courses are part of the common curriculum, 34% are required by the major, and 35% are electives and prerequisites for the major. ### Minors Students could declare their minors after the end of their second year. Currently, there are 13 minor fields of study. The fields correspond to Yale–NUS's existing majors, with the exception of Philosophy, Politics and Economics and the Double Degree Programme with Law. The college also offers three independent minors: Global Antiquity, Chinese Studies, and Innovation and Design. ### Alumni The college's first graduating class (Class of 2017 – excluding those still completing their concurrent degree programmes, amongst others) comprises 119 students. 103 students graduated with a Bachelor of Arts with Honours and 16 with a Bachelor of Science with Honours. The largest five majors among the students were Arts and Humanities; Philosophy, Politics and Economics; Environmental Studies; Psychology; and Mathematical, Computational and Statistical Sciences. Across the College’s 2017 – 2023 cohorts, an average of 9 in 10 graduates find employment within six months of completing their final examinations. Yale–NUS graduates were employed in diverse industries, which include Financial and Insurance, Business and Management Consultancy, Information & Communication, Scientific Research & Development, and Education. ## Joint and associated programmes Yale–NUS and [Faculty of Law, NUS](/wiki/National_University_of_Singapore_Faculty_of_Law) offered a joint Double Degree programme in Law and Liberal Arts for those seeking a broad liberal arts education in addition to their professional training in the law. Yale–NUS and the [Duke-NUS Medical School](/wiki/Duke%E2%80%93NUS_Medical_School), Singapore's first US-style graduate-entry medical school, jointly offered the Liberal Arts and Medicine pathway, giving select Yale–NUS students a conditional admission offer from Duke-NUS to proceed to the MD programme directly after the Yale–NUS bachelors programme. Duke-NUS had also expressed interest in admitting Yale–NUS graduates for their PhD and MD/PhD degree programmes. Yale–NUS offered four Special and Concurrent Degree Programmes: - *Special Programme with [Yale School of the Environment](/wiki/Yale_School_of_Forestry_%26_Environmental_Studies)*: A six-year programme designed for students who want to pursue careers in an environmental field. - *Concurrent Degree Programme with [Lee Kuan Yew School of Public Policy](/wiki/Lee_Kuan_Yew_School_of_Public_Policy)*: A five-year programme designed for students who want a broad liberal arts education followed by careers in the field of public policy. - *Concurrent Degree Programme with [Yale School of Public Health](/wiki/Yale_School_of_Public_Health)*: A five-year programme designed for students who want a broad liberal arts education and a career in the field of public health. - *Concurrent Degree Programme with [NUS School of Computing](/wiki/NUS_School_of_Computing)*: A five-year programme designed for students who want to combine a broad liberal arts education with a strong theoretical and practical foundation in computing. ## Experiential learning The Yale–NUS Centre for International and Professional Experience integrates traditionally separate and often silo-ed components of experience based learning (such as study abroad, summer sessions, internships, career services, leadership and service programming, research attachments) under one roof. The Week 7 program takes place in the seventh week of the first semester of the first year – a time when all freshers are enrolled in the same common curriculum courses. During Week 7, all first-year students participate in a faculty-generated initiative that brings student learning out into the world and connects to both faculty interests and themes of the common curriculum. At Yale–NUS, a term-time study abroad experience was the norm. Some 75 to 80 per cent of students spend a semester elsewhere. ## Campus life ### Residential colleges Yale–NUS's student life was modelled on the [residential colleges of Yale](/wiki/Residential_colleges_of_Yale_University). There are three residential colleges named Saga, Elm and Cendana. Each has its own dining hall, courtyard, student suites, sky-gardens, faculty residences, study-spaces, intramural teams, and butteries, informal student-run eateries that are a Yale tradition. Students live in suites of six single rooms that share common space and a bathroom. These small-scale communities are arranged vertically in residential towers, which contain both student suites and faculty apartments. Floors are grouped into neighbourhoods, every alternate floor equipped with its own skygarden, a landscaped outdoor space for high-rise buildings that was pioneered in Singapore. The residential community includes a rector (equivalent to the position of a college master at Yale), a vice rector, faculty fellows, advisors, rector's aides, and distinguished visiting fellows. Students will expand their social and leadership skills while enjoying the support of \"nested academic communities.\" Kyle Farley, formerly dean of Jonathan Edwards College at Yale, served as the first dean of students of the college. Brian McAdoo, a geologist and expert in environment studies, formerly of [Vassar College](/wiki/Vassar_College), served as the inaugural rector and was rector of Elm college, while Eduardo Lage-Otero, formerly of Trinity College, was named inaugural vice-rector and later served as vice-rector of Saga College. Yale–NUS faculty members Derek Heng, a historian; Neil Clarke, a biochemist; Steven Bernasek, a chemist and former Executive Vice President (Academic Affairs); Khoo Hoon Eng, a toxicologist, Amber Carpenter, a philosophy professor; and Lynette Chua, a law professor, served as subsequent rectors of the residential colleges. As the first-years transitioned into the collegiate living experience, they were originally aided by Dean's Fellows, a group of recent college graduates picked from various higher educational backgrounds, including Amherst, Carleton, Princeton, Reed, Mt. Holyoke, Yale, and NUS. As of 2017, the Dean's Fellow role changed, with Residential College Advisors providing pastoral care and programmatic organising for smaller groups of first-years and Dean's Fellows providing this for the rest of the student body alongside other institutional work. In 2020, Residential Life Officers (RLOs) were appointed in place of Dean's Fellows. The RLOs work full-time on student care, community building and other responsibilities in their assigned Residential College. ### Student organisations Yale–NUS had over 50 student organisations for students to build on their interests or pursue new passions. The college had a number of student newspapers, magazines and journals. Publications include *The Octant*, Yale–NUS's most established publication, *The Mocktant*, its satirical counterpart, *Tònes*, a multilingual magazine, and the Yale–NUS Society for Academic Research, which published academic journals. ## Campus The Yale–NUS campus was adjacent to NUS University Town and the college moved to this permanent campus in July 2015. It consists of a central campus green flanked by academic and administrative buildings. The campus was designed by architectural firms Pelli Clarke Pelli and Forum Architects (a Singaporean architecture studio), who state that \"its architectural style blends the collegiate traditions of Yale with the Southeast Asian cultures through its modernist style ornamented by metalwork patterns inspired by southeast Asian textiles.\" Unlike the neighbouring University Town, Yale–NUS's campus was built on a grid system. The campus was designed to achieve the highest rating under the Building and Construction Authority's Green Mark, Singapore's benchmark for sustainable design. In addition to visible sustainable design strategies such as the biofiltration pond and the frequent use of natural ventilation, the campus integrates advanced building systems for energy efficiency. Yale–NUS's campus was awarded the Green Mark Platinum Award from the Building and Construction Authority (BCA) in 2013 (recertified in 2018 and 2021), the Landscape Excellence Assessment Framework certificate in 2014 (recertified in 2017 and 2020), the International Architecture Award in 2016., the ASEAN Energy Awards for Energy Efficient Building in 2019 and the Building Performance Awards for Facilities Management (CIBSE) in 2020. In 2022, the college was ISO 45001 (Safety) and ISO 14001 (Environment) certified, and garnered a recertification for ISO 41001 (Facilities management). The campus now houses NUS College, and in 2026 will be shared with [NUS Law](/wiki/NUS_Law). ## Alumni Upon graduation, Yale–NUS alumni will have access to alumni benefits provided by Yale–NUS College, Yale University, and the National University of Singapore. Graduates will receive alumni membership of National University of Singapore and will be international affiliates in the Association of Yale Alumni (AYA). As Yale affiliates, Yale–NUS alumni are not eligible for membership to the Yale Club of Singapore. However, they are eligible for membership at the [Yale Club of New York](/wiki/Yale_Club_of_New_York_City). Yale–NUS has its own Alumni Affairs Council and is working to establish a Yale–NUS Club of Singapore. Since graduating its first class in June 2017, Yale–NUS alumni have won several post-graduate awards, including three [Rhodes Scholars](/wiki/Rhodes_Scholarship), two [Fulbright Scholars](/wiki/Fulbright_Scholars), six [Schwarzman Scholars](/wiki/Schwarzman_Scholars), four [Yenching Scholars](/wiki/Yenching_Scholars), two [Knight-Henessy Scholars](/wiki/Knight-Hennessy_Scholars), one Quad Fellow, and an Ertegun Graduate Scholar in the Humanities. As of 2025, over 1,700 students from the college's nine cohorts have graduated, and are living and working across five continents in cities as diverse as Boston, Dublin, Lagos, London, Melbourne, New York, Seattle, and Seoul, in addition to Singapore. Based on the 2024 Joint Graduate Employment Survey, about 9 in 10 fresh graduates from Yale–NUS College's Class of 2024 in the labour force were employed within six months of completing their final examinations. The median gross monthly salary of Yale–NUS graduates was S$4,786. Across the college’s graduate cohorts from 2017 to 2024, approximately 11 per cent went on to pursue Master’s and PhD programmes in the world’s top institutions, such as Johns Hopkins University, London School of Economics, Massachusetts Institute of Technology, National University of Singapore (NUS), Stanford University, Tsinghua University, University of Cambridge, University of Oxford and Yale University. ## Mascot Yale–NUS launched the College Mascot in 2017. The Yale–NUS College Mascot – 'Halcyon' – emerged as a representation of the blue-eared kingfisher species found rarely in Singapore. The orange-and-blue mascot, colours of Yale–NUS, found ready acceptance as it also encapsulates the core identity of a young academic institution in quick and confident ascension, ready to take on the world. The mascot was ratified by the student body on 7 April 2016, after three rounds of voting. Since ratification, the Yale–NUS Student Government held focus group discussions to gather feedback on the mascot design and name. The name Halcyon emerged from one of these student focus group discussions. ## Reactions Observers in *[The New York Times](/wiki/The_New_York_Times)* and *[The Chronicle of Higher Education](/wiki/The_Chronicle_of_Higher_Education)* see Yale's move as part of a larger movement of the globalisation of higher education. Yale faced criticism for its involvement in Singapore because of the government's restrictions on freedom of assembly and ban on homosexual activity. [Fareed Zakaria](/wiki/Fareed_Zakaria), a CNN host and fellow of the [Yale Corporation](/wiki/Yale_Corporation) at the time, supported the venture, saying that \"Singapore has a great deal to learn from America, and NUS has a great deal to learn from Yale.\" [Tommy Koh](/wiki/Tommy_Koh), former Singaporean ambassador to the [United Nations](/wiki/United_Nations), called it a \"timely and visionary initiative.\" Faculty expressed themselves in the pages of [Yale Daily News](/wiki/Yale_Daily_News). [Seyla Benhabib](/wiki/Seyla_Benhabib), a [political philosopher](/wiki/Political_philosophy) at Yale, calling it a \"naïve missionary sentiment,\" asked, \"Do we need to go to Singapore to advance interdisciplinarity and a revival of the liberal arts?\" The chairs of the faculty search committee responded, \"the new college will require faculty to rethink their pedagogical assumptions and to consider such innovations as integrated and interactive approaches to science; writing across the curriculum; computation, computer simulations and interpretation of large data sets; and the honing of quantitative, communication and other skills.\" Howard Bloch, a [Sterling Professor of French](/wiki/Sterling_Professor), said that \"As a nexus between India, China and the West, Singapore’s location favors an important conceptual realignment of the humanities that will be a long time coming to the home campus in New Haven — that is, a synthesis of the ways that ideas and creative works of East and West intersect historically as well as conceptually with each other.\" A group of professors critical of the project characterise the endeavour of \"globalizing\" a \"specious one,\" saying that the graduates \"will have to be conformist, dissent-averse managers and executives who serve the global profit motive.\" Marvin Chun, the master of [Berkeley College](/wiki/Berkeley_College_(Yale_University)) and educated in South Korea, disagreed, asking \"Will Yale–NUS be denied to numerous students around the world like me who lack the hyper-talent or mega-resources needed to study abroad at a place like Yale?\" In response to concerns that Yale–NUS would dilute the Yale name, computer science professor [Michael Fischer](/wiki/Michael_J._Fischer) argued that since Yale–NUS will not be granting Yale degrees, the value of a degree from Yale will not be diminished, and that the joint governing board does not \"make Yale–NUS a part of Yale any more than does [Yale President Richard] Levin's service on the board of directors for American Express make American Express a part of Yale.\" [Haun Saussy](/wiki/Haun_Saussy) stated says that \"It’s in the spirit of the motto \"Lux et veritas\" — my light is not diminished when my neighbour lights his candle at mine, and a truth becomes more powerful, not less, when it is shared.\" In spring 2012, the Yale College faculty passed a resolution stating, \"We urge Yale–NUS to respect, protect and further principles of non-discrimination for all, including sexual minorities and migrant workers; and to uphold civil liberty and political freedom on campus and in the broader society\". In the summer, prompted by a *Wall Street Journal* report that students would not be allowed to stage protests or form political parties, [Human Rights Watch](/wiki/Human_Rights_Watch) stated that it disapproved such restrictions. [John Riady](/wiki/John_Riady), an associate professor of law at the Pelita Harapan University in Indonesia, defended the venture, stating that \"Singapore and Asia are in the middle of great transitions, and Yale has an opportunity to shape that process and put its stamp on a rising continent. In fact, Yale would be doing the cause of liberty a disservice by dropping the project.\" Since its founding Yale–NUS has hosted a number of controversial events on its campus, including screening banned documentaries and hosting conversations with activists. In 2015, Yale–NUS became the first higher education institution in Singapore to offer gender neutral housing to students. The move was in response to a push by the inaugural Yale–NUS Student Government. The project, executed by government representatives David Chappell, Jay Lusk, and Ami Firdaus Bin Mohamed Ali, used a mixture of survey data, student testimonies and statements from student organisations to advocate for the policy change. The move was greeted favourably by students interviewed by the press and in the pages of The Octant, one of the college's online student publications. The college received increased media scrutiny in response to student calls for the resignation of [Chan Heng Chee](/wiki/Chan_Heng_Chee), a Yale–NUS governing board member and Singapore's ambassador-at-Large. Chan defended Section 377A of the Singaporean Penal Code, a law forbidding sodomy, at the United Nations Human Rights Council's Universal Periodic Review in Geneva in January 2016. In February, The Octant published an op-ed by Nik Carverhill that called on Chan to either take a stand against Section 377A or relinquish her seat on the governing board. In response, Chan attended a closed door dialogue in March, hosted by the Yale–NUS Student Government and The G Spot, a gender and sexuality alliance on campus, to discuss Singapore's approach to human-rights. 87% of students surveyed by The Octant said that they did not think Chan should resign, although 62% of respondents supported the dialogue. Chan remains a member of the Yale–NUS governing board. Reports in the [Chronicle of Higher Education](/wiki/Chronicle_of_Higher_Education), [Times Higher Education](/wiki/Times_Higher_Education), [Barron's Magazine](/wiki/Barron%27s_(newspaper)) and [Harvard Magazine](/wiki/Harvard_Magazine) on the new college, which started classes in August 2013, noted that lively discussions take place on campus. Barron's Magazine's article “Yale goes to Asia” highlighted how education experts such as Ben Nelson, CEO of the Minerva Project, particularly likes Yale–NUS’ emphasis on seminars and its requirement that all students in their first two years take pretty much the same core curriculum, including philosophy and political thought, literature and humanities, and modern social thought. In an article for The Atlantic, Michael Roth, president of Wesleyan University and author of *Beyond the University: Why Liberal Education Matters* write about how he was impressed by Yale–NUS’ decision to decline to institutionalise faculty within departments representing the academic disciplines. This has led to a reconceptualisation of majors as complements to a core curriculum, and, in turn, to the welcoming of faculty with diverse skill sets over those tethered to divisive academic specialisations. The closure of Yale–NUS, announced in 2021, has generated discussions on the future of transnational higher education, with Kevin Kinser, head of education-policy studies at [Pennsylvania State University](/wiki/Pennsylvania_State_University), being among analysts who expressed surprise at the dissolution of the collaboration. - Yale–NUS College - Yale–NUS Blog\n",
  "language": "en",
  "processed_at": "2026-01-12T12:15:15.106984",
  "title": "Yale–NUS College",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Yale%E2%80%93NUS_College"
}