{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:15:06.259588"
  },
  "content": "* *YCP Holdings (Global) Limited** is a Singapore-based [consulting company](/wiki/Consulting_firm). Established in 2011, the group operates three businesses: management services, solutions services, and principal investments. On December 21, 2021, the company's Japanese Depository Receipt (JDR) listing went live on the Growth Market of the [Tokyo Stock Exchange](/wiki/Tokyo_Stock_Exchange). The securities listed consist of foreign stock trust beneficiary certificates (JDRs), with the company's common stock serving as the trust assets. ## History YCP Holdings, originally established in 2011 as \"Yamato Capital Partners,\" is a global investment holding company based in [Singapore](/wiki/Singapore). Initially operating from [Japan](/wiki/Japan), the company relocated to [Hong Kong](/wiki/Hong_Kong) in 2013 to reflect its expanding international focus. In 2021, YCP Holdings solidified its global presence by listing on the [Tokyo Stock Exchange](/wiki/Tokyo_Stock_Exchange) and establishing its holding company function in Singapore. With its strengths in cross-border transactions, [mergers and acquisitions](/wiki/Mergers_and_acquisitions) (M&A), and [digital transformation](/wiki/Digital_transformation) (DX), the company offers advisory services (various management support) and principal investments (personal care, pet care, and strategic investment domains) globally, with a focus on [Asia](/wiki/Asia). Today, YCP Holdings operates its management services business through two brands: YCP and YCP Auctus. - August 2011 — Yamato Capital Partners Inc. (now YCP Japan Inc.) is established in Minato-ku, Tokyo. - April 2013 — YCP Product Inc. is established (now SOLIA Inc.). - June 2013 — YCP Management Southeast Asia Pte. Ltd. (now YCP SG Pte. Ltd.) is established in Singapore. - August 2013 — Waryu (Shanghai) Investment & Consulting Co. is established. - November 2013 — YCP Holdings Limited is established in [Hong Kong](/wiki/Hong_Kong) and transitioned to a [holding company](/wiki/Holding_company) structure. YCP Hong Kong Limited is established in Hong Kong. - April 2014 — YCP Bangkok Co., Ltd. is established in [Thailand](/wiki/Thailand). - September 2014 — YCP Lifemate Inc. is established as a holding company in the pet care area for the purpose of managing [veterinary hospitals](/wiki/Veterinary_hospital), etc. - November 2016 — Acquired shares of Strategic Decision Initiative, Inc. and merged with YCP Japan, Inc. - January 2017 — YCP America Limited is established in [Delaware](/wiki/Delaware), USA. - October 2018 — YCP Acquired shares of Solidiance Asia Pacific Pte. Ltd. in Singapore. Solidiance later merged with YCP Management Southeast Asia Pte. Ltd. and became a [consolidated](/wiki/Consolidation_(business)) subsidiary with 11 subsidiaries of Solidiance Asia Pacific Pte. Ltd. in Hong Kong and Shanghai, China (2 companies, of which one was sold). Myanmar, Philippines, Germany, Malaysia, Indonesia, Australia, United Arab Emirates and India) as consolidated subsidiaries. Thereafter, the brand under which the management services business is operated was named \"YCP Solidiance.\" (now YCP) - January 2019 — YCP Hong Kong Limited opens a [branch](/wiki/Branch_(business)) in Taiwan. YCP Solidiance International [B.V.](/wiki/B.V.) is established in the Netherlands. - March 2021 — YCP Holdings (Global) Limited is established. - December 2021 — Listed on the Mothers market (now Growth Market) of the [Tokyo Stock Exchange](/wiki/Tokyo_Stock_Exchange). - May 2022 — YCP Group establishes Sustainability Solutions, Digital Transformation (DX), and Interactive Solutions divisions within YCP Group; signs a partnership agreement with RIMM Sustainability. - November 2022 — [Acquisition](/wiki/Business_acquisition) of shares of Auctus Advisors Private Limited into a [wholly owned subsidiary](/wiki/Wholly_owned_subsidiary). - August 2023 — Acquisition of shares in Consus Global, making it a wholly owned subsidiary and establishment of Supply Chain Solutions Division. - April 2024 — Integration of Shenkuo to be YCP, a transition to a wholly owned subsidiary under YCP Holdings. - December 2024 —The sale of shares in SOLIA was completed. ## Leadership YCP Holdings is founded by Yuki Ishida. Ishida started his professional career at [Goldman Sachs](/wiki/Goldman_Sachs) (Japan) under the Asian Special Situations Group, where he managed investments in various asset classes. In 2011, he founded YCP Holdings as the managing director of YCP Japan, Inc. (formerly Yamato Capital Partners, Inc.). He was appointed Director and Group CEO in 2014 after YCP Holdings Limited was established as a [Hong Kong](/wiki/Hong_Kong)-based holdings company. ### Board of Directors - Yuki Ishida, [Director](/wiki/Director_(business)) and [Group CEO](/wiki/Group_CEO) - Justin Leung, [Non-executive director](/wiki/Non-executive_director) ([Statutory Audit](/wiki/Statutory_audit) and [Supervisory](/wiki/Supervisory) Committee Member) - Teng Theng Dar, Independent Non-executive director (Statutory Audit and Supervisory Committee Member) - Satoko Kametaka, Independent Non-executive director (Statutory Audit and Supervisory Committee Member) ### Management Team - Yuki Ishida, Director and Group CEO - Pilar Dieter, [Group Officer](/wiki/Group_Officer), [Managing Partner](/wiki/Managing_Partner), CEO of Management Service Division, and North America & Europe Regional Manager - Naoki Arai, Group Officer, Managing Partner, and Greater China Regional Manager - Manish Chheda, Group Officer, Managing Partner, and India Regional Manager - Shingo Kasumoto, Group Officer, Managing Partner, and CEO of Interactive Solutions Division - Saurabh Mehta, Group Officer, Managing Partner, and CEO of Supply Chain Solutions Division - Victor Hui, Partner and Group [CFO](/wiki/Chief_financial_officer) - Yuki Tsutsumi, Partner and Group [COO](/wiki/Chief_operating_officer) - Puneet Kaushik, Group Officer, Managing Partner, and CEO of Digital Transformation Division - Masa Matsouka, Group Officer, Managing Partner, and Japan Regional Manager - Daisuke Katano, Group Officer, Managing Partner, Co-CEO of MSD & Head of MSD Japan ### Senior Advisors - Kiyoto Matsuda - [Yutaka Matsuo](/wiki/Yutaka_Matsuo) - Daisuke Otobe - Louisa Wong ## Locations The company has offices in 22 cities around the world, primarily in [Asia](/wiki/Asia), with offices strategically located in key regions. Those offices including YCP headquarters in [Collyer Quay](/wiki/Collyer_Quay), [Singapore](/wiki/Singapore); [Tokyo, Japan](/wiki/Tokyo,_Japan); [Shanghai, China](/wiki/Shanghai,_China); [Hong Kong](/wiki/Hong_Kong); [Taipei, Taiwan](/wiki/Taipei,_Taiwan); [Jakarta](/wiki/Jakarta) and [Surabaya, Indonesia](/wiki/Surabaya); [Kuala Lumpur, Malaysia](/wiki/Kuala_Lumpur); [Makati, Philippines](/wiki/Makati); [Bangkok, Thailand](/wiki/Bangkok); [Ho Chi Minh City, Vietnam](/wiki/Ho_Chi_Minh_City); [Bangalore](/wiki/Bangalore), [Gurgaon](/wiki/Gurgaon), [Mumbai](/wiki/Mumbai), [Hyderabad](/wiki/Hyderabad) and [New Delhi, India](/wiki/New_Delhi,_India); [Dubai, United Arab Emirates](/wiki/Dubai); [Halifax, Canada](/wiki/Halifax,_Canada); [San Diego, USA](/wiki/San_Diego,_USA); [Amsterdam, Netherlands](/wiki/Amsterdam), and [Paris, France](/wiki/Paris,_france). ## Recognitions - February 2021 – YCP Solidiance, YCP Holdings subsidiary ranked #11 in Vault's 2021 Top Consulting Firms in [Asia Pacific](/wiki/Asia%E2%80%93Pacific). - May 2023 – YCP Holdings wins the Management Consulting Award at the SBR National Business Awards 2023 organized by the Singapore Business Review (SBR). - March 2025 – YCP Ranked #9th on [Vault](/wiki/Infobase)'s list of Best Consulting Firms to Work For in the APAC region. - Official website - YCP Investment Relations - YCP Holdings - Bloomberg - YCP Holdings - Financial Times - YCP Holdings - Tokyo Stock Exchange - Lifemate Veterinary Hospital Group\n",
  "language": "en",
  "processed_at": "2026-01-12T12:15:06.259316",
  "title": "YCP Holdings",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/YCP_Holdings"
}