{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:15:20.954098"
  },
  "content": "Singapore initiative for reintegrating ex-convicts into society The **Yellow Ribbon Project** ([Chinese](/wiki/Simplified_Chinese_characters): 黄丝带计划; [Malay](/wiki/Malay_language): *Projek Riben Kuning*) started on 2 October 2004, is a community initiative organised by the Community Action for Rehabilitation of Ex-offenders (CARE) Network in Singapore. The Yellow Ribbon Project advocates a second chance for ex-offenders and their families through concerted efforts and for ex-offenders to reintegrate into society. It also engage the community to accept and engage in community action to accept and support ex-offenders and their families. ## Description Every year, more than 9,000 ex-offenders in Singapore complete their sentences and are released from the various prisons and drug rehabilitation centres (DRCs). The Yellow Ribbon Project's objective is to raise awareness of the need to give second chances to ex-offenders and their families and inspire community action to support rehabilitation and reintegration of ex-offenders back into society. The Yellow Ribbon Project is managed by the CARE Network. Members of the CARE Network include Singapore's Ministry of Home Affairs (MHA), Ministry of Social and Family Development (MSF), [Singapore Prison Service](/wiki/Singapore_Prison_Service) (SPS), [Singapore Corporation of Rehabilitative Enterprises](/wiki/Singapore_Corporation_of_Rehabilitative_Enterprises) (SCORE), [National Council of Social Service](/wiki/National_Council_of_Social_Service) (NCSS), Industrial & Services Co-operative Society Ltd (ISCOS), Singapore After-Care Association (SACA) and Singapore Anti-Narcotics Association (SANA). The inspiration behind the Yellow Ribbon Project was taken from the 70s song, \"[Tie a Yellow Ribbon Round the Ole Oak Tree](/wiki/Tie_a_Yellow_Ribbon_Round_the_Ole_Oak_Tree)\", sung by [Tony Orlando and Dawn](/wiki/Tony_Orlando_and_Dawn), which is in turn based on the true story published in a 1971 article in [The New York Post](/wiki/The_New_York_Post). Almost nine in 10 Singaporeans are able to identify the aims of the initiative according to a survey conducted by the Yellow Ribbon Project organisers. Beyond awareness, the Yellow Ribbon Project also actively encourages employers and volunteers to offer second chances to offenders who are willing to change for the better. ## YRP Themes Since its inception, YRP has set a different theme each year. 2004Creating AwarenessHelp unlock the second prison2005Engaging the CommunityGive ex-offenders a second lease of life2006Engaging the Ex-offendersWidening the reach, deepening the message2007Giving BackExtending the reach, inspiring action in inmates and ex-offenders2008Beyond Just WordsGoing beyond awareness to action by actively engaging the community2009Giving BackInmates and ex-offenders playing a role in society2010Coming Together, We CareEngaging the community for action to help ex-offenders reintegrate2011Little Gestures, Big DifferenceEncourage everyday gestures that signify acceptance of ex-offenders by the community2012WillInspire inmates and ex-offenders to take charge of their own rehabilitation and contribute to the society2013Celebrating 10 years of Second Chances – The Road to AcceptanceStronger community engagement to empower Singaporeans with the opportunity to be part of the movement ## History ### 2004–2008 The Yellow Ribbon Project was established in 2004 by the various CARE Network's member agencies. Former President of Singapore, Mr S.R. Nathan officially launched the community engagement campaign at the Yellow Ribbon Project Charity Concert. A special album featuring songs performed by inmates was produced in commemoration of the inaugural Yellow Ribbon Project in 2004. In 2005, the campaign introduced the Tie-A Yellow-Ribbon Walk which encouraged more Singaporeans to learn about the offenders' journey of reintegration. The Yellow Ribbon Concert, \"New Hope, New Dreams\", was held in 2006 to launch the third edition of the community campaign. The concert featured celebrities performing alongside inmates and was broadcast on local television. A series of events was held in 2007 to raise funds for the Yellow Ribbon Fund. The events included the Yellow Ribbon Culinary Competition, Yellow Ribbon Charity Gala Dinner, and the Yellow Ribbon Appreciation Dinner. In 2008, 467 foreign delegates, government officials, academics, aftercare professionals and community partners attended the Yellow Ribbon Conference on \"Aftercare: A Collaborative Approach\" ### 2009–2012 The inaugural Yellow Ribbon Prison Run was launched on 6 September 2009, and saw the participation of more than 6,000 runners. A contingent of 80 reformed ex-offenders also participated in the Run. The Yellow Ribbon Project was themed \"Little Gestures, Big Difference\" in 2011, and sought to engage more inmates and ex-offenders to step forward to share details of their reintegration journey and to give back to society. The 2012 edition aimed to inspire inmates and ex-offenders to take charge of their own rehabilitation and continue to give back to society. This marked the first year that grassroots divisions were engaged to recruit more volunteers to render assistance to the families of inmates. ### 2013: 10th Anniversary Since its inception in 2004, the Yellow Ribbon Project has attracted more than 380,000 members of the community to participate in its activities and 1,500 community partners to show their support to the cause through various initiatives. In a survey conducted by the organisers to measure community support, the Yellow Ribbon Project achieved 97% awareness. ## Yellow Ribbon Events ### Yellow Ribbon Prison Run (2009–present) One of the Yellow Ribbon Project's signature annual event is the Yellow Ribbon Prison Run. The inaugural Yellow Ribbon Prison Run was first held in September 2009, which attracted 6,500 participants. Funds raised through the event go towards the Yellow Ribbon Fund to rehabilitation and reintegration programmes for ex-offenders and support programmes for their family members. Local marathon icon, Madam Jenap, was involved in a personal 12-hour challenge to raise funds for ex-offenders in 2012. In 2013, a record 1,230 run participants came together to form a Giant Human Yellow Ribbon in celebration of 10 years of YRP. The formation was recorded in the Singapore Book of Records. ### Yellow Ribbon Community Art Exhibition (2007–2017) Yellow Ribbon Project's [Changi Prison](/wiki/Changi_Prison) Artist Mentor Programme is an annual collaboration between the Yellow Ribbon Project and [Singapore Art Museum](/wiki/Singapore_Art_Museum), with the aim to facilitate the rehabilitation of inmates through creative art making under the guidance of selected artist mentors. In 2017 the artist mentor of Changi Women's prison was British artist Nicola Anthony, whist local Singaporean artists Barry Yeow, and Kim Whye Kee were the mentors of Changi Men's Prison. The annual Programme cumulates in an exhibition of the inmates artworks. In 2017 it was held at the Singapore Art Museum taking over two gallery spaces and running alongside the solo exhibition of Nicola Anthony who made artworks inspired by the inmates she had been mentoring, as well as other disenfranchised communities she had worked with in Singapore. The 2017 exhibition was titled 'For Better Endings and New Beginnings', and revolved around the themes of love, hope, optimism, reflection, and tomorrow. In addition to the Art Exhibition, the artist mentors are often asked to create a collaborative work which symbolises their response and experience of working with inmates to teach art and build confidence. A commissioned sculpture installation titled 'Flow of Time' commemorates the 2017 exhibition, and is the collaborative artistic response of Nicola Anthony, Barry Yeow, and Kim Whye Kee. ### Yellow Ribbon Art Competition (2007–2011) The Yellow Ribbon Community Art Exhibition provides a platform for inmates and ex-offenders to express their hopes and aspirations through art, showcase their artistic talents, foster closer family relationships and communicate with the community. The Yellow Ribbon Community Art Exhibition was first held in 2007 at The Arts House. Out of the 73 pieces of artworks, ten were winning entries selected by Japanese artist Kon Saishu. The Yellow Ribbon Art Competition was also held from 2008 to 2011 and the artworks were also showcased at the Yellow Ribbon Community Art Exhibition. The exhibition was then held at the Singapore Botanic Gardens in 2008 and at the Singapore Art Museum from 2009 onwards. In 2012, the Yellow Ribbon Community Art Exhibition 2012 featured artwork by inmates from Changi Women's Prison for the first time. ### Celebrating Second Chances Awards Ceremony (2006, 2008, 2011 and 2013) The first Celebrating Second Chances Awards Ceremony was held in 2006. As an encouragement for the continued commitment of those who have stayed crime- and drug-free, ex-offenders receive tokens of commendation at the biennial event. In conjunction with the Yellow Ribbon Project's 10th anniversary, a new Celebrating Second Chances Award category was created to honour four organisations and two individuals. A commemorative book chronicling 10 years of YRP was also launched at the 2013 ceremony. ### Yellow Ribbon Charity Golf Tournament (2008, 2010 and 2012) The first Yellow Ribbon Charity Golf Tournament was held in November 2008. The second and third editions of the tournament were held in 2010 and 2012. The biennial event consisted of the golf tournament and an appreciation dinner for participants of the tournament, donors and sponsors of the Yellow Ribbon Fund. Proceeds raised through the event went towards the development and implementation of family support programmes to strengthen family ties of inmates and ex-offenders. ### Yellow Ribbon Song Writing Competition (2006, 2010) The Yellow Ribbon Song Writing Competition was organised as part of the Yellow Ribbon Project Creative Festival. The competition was conceptualised as part of the inmates' rehabilitation programmes and is used as a platform for inmates and ex-offenders to express their hopes for acceptance. The Yellow Ribbon Song Writing Competition started in 2008 with twelve inmates competing in the finals. 76% of inmates achieved distinction for the internationally recognized music theory exam by the Associated Board of the Royal Schools of Music (ABRSM), proving the strength of rehabilitation through music. • **2013 onwards** Launched in 2013, the annual competition is aimed at rehabilitating inmates and allowing them to express themselves while picking up new skills. Jointly organised by the Yellow Ribbon Project and Composers and Authors Society of Singapore (COMPASS), the volunteer-led initiative is a channel for inmates to express their hopes for acceptance and forgiveness from their family and friends. Another aim of the Yellow Ribbon Song Writing Competition is to aid in rehabilitation and provide them with skills that would improve their employability. ### Yellow Ribbon Concerts (2004, 2006 and 2008) The first Yellow Ribbon Concert was held in October 2004 to mark the launch of the community campaign. Besides featuring local and foreign artistes, reforming offenders and ex-offenders also shared their experience of rehabilitation and reintegration through drama, song and dance. Local celebrities who participated in the concerts included Dick Lee, Shiek Haikel, Azrina Ahmad, Koh Chieng Mun, [Mark Lee](/wiki/Mark_Lee_(Singaporean_actor)), Sharon Ismail, Jai, Nathan Hartono and [Project Superstar](/wiki/Project_Superstar) Season 1 winners, [Chen Wei Lian](/wiki/Chen_Wei_Lian) and [Kelly Poon](/wiki/Kelly_Poon). Regional artistes including Taiwanese singers, Wakin Chau, B.A.D, Tension and Chinese singer Anson Hu have also participated in the various Yellow Ribbon Concerts. ### Yellow Ribbon Culinary Programme (2007) The Yellow Ribbon Culinary Programme is organised by YRP to allow inmates an opportunity to improve their culinary skills through a certified training course to earn certificated qualification. The certifications seek to help increase inmates' employability after their release. Graduation ceremonies were held in 2010 and 2012 to present inmate-graduates with the Certificate in Basic Culinary Skills Course, conducted by SHATEC Institutes. Under the Yellow Ribbon Culinary Programme, the Yellow Ribbon Culinary Competition was first held in 2007 as part of the Yellow Ribbon Creative Festival which aims to give inmates the opportunity to acquire culinary skills. As part of the programme, teams comprising prison inmates learnt to create several dishes which was cooked and presented to their family members during the Tribute of Love event. ### Yellow Ribbon Poetry-Writing and Story Telling Competition (2007) The Yellow Ribbon Poetry-Writing and Story Telling Competition was held in 2006 and 2007. The poetry competition allows ex-offenders to express their thoughts and reflections through their self-penned poems. The 2006 competition saw the participation of 480 inmates and 20 of them were selected to recite their entry in front of their families. Organised by CARE Network and the [National Library Board](/wiki/National_Library_Board), the 2007 competition saw the participation of 24 inmates who were asked to write on the theme of giving and how they hoped to contribute to their families and society. ### Tie-A-Yellow-Ribbon Walk (2005 and 2007) The inaugural Tie-A-Yellow-Ribbon Walk was held on 3 September 2005 and drew a crowd of 14,000. The second Tie-A-Yellow-Ribbon Walk was held in 2007 which saw more than 10,000 participants walking from Pasir Ris Town Park to the new Prison Link Centre. The event was graced by Prime Minister [Lee Hsien Loong](/wiki/Lee_Hsien_Loong). ## Related Initiatives - **Yellow Ribbon Fund** Launched in 2004, the Yellow Ribbon Fund (YRF) is the first national charitable fund devoted entirely towards the development and implementation of rehabilitation and reintegration programmes for inmates and ex-offenders, as well as family support programmes to strengthen family ties of inmates and ex-offenders. Proceeds from the various fund-raising activities will go towards funding a variety of rehabilitation and reintegration programmes as well as family support programmes which are in line with the vision of the Community Action for the Rehabilitation of Ex-offenders (CARE) Network YRF provides financial support for: - - The provision of rehabilitative and aftercare services to inmates and ex-offenders during and after their discharge from custody and to assist the provision of such services by other partner organizations - Rehabilitation and reintegration support programmes for family members of ex-offenders after their discharge from custody - Public awareness programmes aimed at creating awareness of the need to give second chances to ex-offenders, generating acceptance of ex-offenders back into society and inspiring community action to support the rehabilitation and reintegration of ex-offenders The Yellow Ribbon Fund comprises Main Committee, Advancement Committee, Audit Committee, Family & Children's Welfare Committee, Fund Disbursement Committee and Bursary Selection Committee. Some of the members include Mrs Wong Ai Ai, Mr Manraj Singh Sekhon, Dr Lucas Chow Wing Keung, Mr Stanley Tang, Mr Woo Woh Kuan Christopher, Ms Shie Yong Lee, Mr Ajay Kanwal, Mr Leow Tze Wen, Mr Bernard Peh, Mr Asad Jumabhoy, Ms Michelle Eng, etc. ### Programmes and Services supported by the YRF Yellow Ribbon Fund STAR Bursary The YRF STAR (Skills Training Assistance to Restart) Bursary, initiated in 2010, aims to provide financial support to ex-offenders for vocational and skills training. Recipients of the bursary receive full financial assistance for their course fees. - **Yellow Ribbon Community Outreach Programme** Formerly known as the Yellow Ribbon Community Outreach Project, the Yellow Ribbon Community Project is a grassroots-led project that provides support and assistance to the families of offenders. Yellow Ribbon Community Project (YRCP) is a grassroots-led initiative that aims to provide proactive support and assistance to the families of offenders. Trained grassroots volunteers will visit the families of newly admitted offenders to render assistance, such as linking them to the relevant social support networks. This benefits and stabilises the families who are affected by the offenders' incarceration, and also allows the offender to focus on rehabilitation. Since September 2010, the YRCP has expanded from eight participating GRC divisions to a total of 63 (see Annex A for breakdown). As of March 2015, more than 700 grassroots volunteers have undergone basic training (e.g. understanding the ex-offenders and their families, conducting effective home visits, basic interviewing/case assessments) to better equip themselves with the knowledge and skills to effectively reach out to more than 2,800 families of offenders. ### Partners #### CARE Network The CARE Network was formed in 2000 to co-ordinate and improve the effectiveness of the efforts of the many agencies engaging in rehabilitative works for ex-offenders throughout Singapore. In a relatively short period of 10 years, a hitherto little known cause has grown and matured into a national movement that has also managed to become a social model to several countries internationally. ##### Singapore Anti-Narcotics Association (SANA) SANA is a Voluntary Welfare Organisation set up in 1972 to work with the community and grassroots organisations to rein in the spread of drug and inhalant abuse and to work towards the vision of keeping Singapore drug-free. SANA is an approved charity with IPC status and cash donations to SANA are tax-exempt. ##### Singapore After-Care Association (SACA) SACA was formed in 1956 and was registered as a charity in 1984. SACA is the key agency providing welfare and rehabilitation services for discharged offenders and their families. The association aims to assist ex-offenders and their families to cope with problems arising from the offending behaviour and the consequent incarceration. Such assistance would hopefully give these ex-offenders the chance to reintegrate into society successfully thereby reducing the chances of recidivism ##### [Singapore Corporation of Rehabilitative Enterprises](/wiki/Singapore_Corporation_of_Rehabilitative_Enterprises) (SCORE) Singapore Corporation of Rehabilitative Enterprises (SCORE) was established as a statutory board under the Ministry of Home Affairs on 1 April 1976. SCORE plays an important role in the Singapore correctional system by creating a safe and secure Singapore through the provision of rehabilitation and aftercare services to inmates and ex-offenders. SCORE seeks to enhance the employability of offenders and prepare them for their eventual reintegration into the national workforce by focusing on four main building blocks of training, work, employment assistance and community engagement ##### [Singapore Prison Service](/wiki/Singapore_Prison_Service) (SPS) SPS is an agency under the Ministry of Home Affairs. As a key member of the Home Team, SPS operates a secure prison system. SPS protects society through the safe custody and rehabilitation of offenders, cooperating with its partners in aftercare and prevention. The SPS is committed to realising its Captains of Lives vision. Its team of uniformed officers and civilian staff work together to realise its vision of steering offenders towards becoming responsible citizens with the help of their family and the community. ##### Industrial & Services Co-operative Society Ltd (ISCOS) ISCOS is a social organisation that helps ex-offenders and their families make positive changes to reintegrate successfully into society. Established in 1989, it has over 13,000 members who have benefited from various employment and training programmes. ##### National Council of Social Service (NCSS) Founded in 1958, the Singapore Council of Social Service leads and coordinates the social service sector in Singapore. The council was renamed National Council of Social Service in 1992. The NCSS works closely with voluntary welfare organisations to build organisational capabilities for better management and delivery of social service programmes. ##### Ministry of Home Affairs (MHA) The Ministry of Home Affairs was set up in 1959 when Singapore attained self-government. After Singapore gained independence, MHA was part of the Ministry of Interior and Defence. In 1970, it was separated into two ministries, MHA and the Ministry of Defence. MHA is responsible for public safety, civil defence and immigration. The ministry is headed by Deputy Prime Minister and Minister for Home Affairs, Mr K Shanmugam. MHA consists of seven departments: 1. [Central Narcotics Bureau](/wiki/Central_Narcotics_Bureau) (CNB) 2. Home Team Academy (HTA) 3. Immigration and Checkpoints Authority (ICA) 4. Internal Security Department (ISD) 5. Singapore Civil Defence Force (SCDF) 6. Singapore Police Force (SPF) 7. Singapore Prison Service (SPS) ##### Ministry of Social and Family Development (MSF) Previously known as the Ministry of Community Development, Youth and Sports, the Ministry was officially restructured on 1 November 2012 to become the Ministry of Social and Family Development (MSF). MSF aims to bring a sharper focus to the Singapore Government's work in the development of families, social services and social safety nets. #### Impact of YRP Recidivism rate According to statistics released by the Singapore Prison Service in 2015, the penal recidivism rate for the 2012 cohort was 27.5 per cent, compared to 27.0 per cent for the 2011 cohort and 23.3 per cent for that in 2010. The statistics also showed that fewer drug abusers released from Drug Rehabilitation Centres (DRC) in 2012 went back to their old habits. The recidivism rate for the 2012 release cohort was 28.3 per cent, down from 31.1 per cent in 2011. Overall, fewer people were admitted into prison and DRC in 2014. There were 11,595 convicted penal admissions in 2014, compared to 12,744 such admissions in 2013 and 12,530 in 2012. DRC admissions meanwhile dropped from 1,384 in 2012 and 1,364 in 2013 to 1,139 admissions in 2014. Employment for ex-offenders In 2014, there were 4,433 employers registered with the Singapore Corporation of Rehabilitative Enterprises (SCORE) to provide job opportunities for inmates, up from 3,876 employers in 2013 and 3,457 in 2012. A total of 4,245 inmates were also engaged in work programmes in prison last year, up from 4,200 in 2013 and 4,183 in 2012. ##### Overseas adoption of YRP [Fiji](/wiki/Fiji) The introduction of the Singapore-conceived Yellow Ribbon Project in Fiji in 2008 introduced programmes specifically aimed at shifting the general public's perception of inmates and ex-offenders. In October 2008, Fiji officially launched their Yellow Ribbon Campaign after attending the Yellow Ribbon Walk in 2007. The Fiji YRP campaign aimed to shift the general public's perception of inmate and ex-offenders. In 2012, the campaign reported a rise in corporate support. [Nigeria](/wiki/Nigeria) In 2008, Prison Fellowship Nigeria started a similar campaign called the Green Ribbon Campaign. The Nigeria Green Ribbon campaign aims to reduce crime through the provision of a constructive moral environment for returning ex-prisoners back to society and meaningful socio-economic reintegration. The campaign, similar to YRP, also reaches out to public and volunteers to raise awareness for the cause. [United States of America](/wiki/United_States_of_America) American Eric Schulzke began the Apollo 13 Project which develops necessary ground support to help prisoners return to society after their release. Schulze was inspired by YRP's vision of uniting custodians, ex-offenders, employers and society to change the public perception of ex-offenders. [Australia](/wiki/Australia) Inspired by the Yellow Ribbon Projects organised in Singapore and Fiji, Australia celebrates Second Chance Day: YRP Australia every 1 May. The initiative was launched in 2011 and aims to engage the community in accepting former female inmates and their families. [Philippines](/wiki/Philippines) A team from BuCor LOVE Foundation Inc. attended YRP activities in Singapore in 2008. The team partners the Bureau of Corrections in Manila to conduct similar YRP activities such as the first Philippine Prison Run. Yellow Ribbon packs were also given to participants at the event. - [Yellow Ribbon](/wiki/Yellow_Ribbon) - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:15:20.953791",
  "title": "Yellow Ribbon Project",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Yellow_Ribbon_Project"
}