{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:15:24.395728"
  },
  "content": "Singaporean beverage company **Yeo Hiap Seng Limited** ([simplified Chinese](/wiki/Simplified_Chinese_characters): 杨协成; [traditional Chinese](/wiki/Traditional_Chinese_characters): 楊協成; [pinyin](/wiki/Pinyin): *Yáng Xiéchéng*; [Pe̍h-ōe-jī](/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB): *Iûⁿ Hia̍p-sêng*, Commonly known as **Yeo's**) is a Singaporean [beverage company](/wiki/Beverage_company). It operates as an investment [holding company](/wiki/Holding_company) as well as a drink manufacturer in [Singapore](/wiki/Singapore), [Malaysia](/wiki/Malaysia) and China. It is a [multinational corporation](/wiki/Multinational_corporation) that has offices and market presence in the US, Europe, Australia, New Zealand, Maldives, Mauritius, Mongolia, Pacific Islands, Mainland China, Hong Kong, Cambodia, Myanmar, Laos and Vietnam. Some of its house brands (See Below) include H-Two-O, Yeo's Asian Beverages, Justea, and Pink Dolphin. YHS majority shareholder is [Ng Teng Fong](/wiki/Ng_Teng_Fong)'s [Far East Organization](/wiki/Far_East_Organization), which also develops houses and [condominiums](/wiki/Condominium_(living_space)). The company also has operations in over 60 countries which includes [Thailand](/wiki/Thailand), China, Singapore, Malaysia, United States and franchises in [Indonesia](/wiki/Indonesia) and [Mauritius](/wiki/Mauritius). ## History ### Establishment The company's history dates back to 1900. Founded by Yeo Keng Lian (Chinese: 杨景连), a native of [Fujian](/wiki/Fujian), China, who began his business career by making soy sauce in [Zhangzhou](/wiki/Zhangzhou) with the Yeo Hiap Seng Sauce Factory (Chinese: 杨协成) in 1901. Then he immigrated to Singapore in the 1930s, where he re-established the Yeo Hiap Seng Sauce Factory in 1938. Yeo died in Singapore in 1960. The name Yeo Hiap Seng is of Christian origin, with Hiap Seng meaning unity of Christ as Yeo was [Presbyterian](/wiki/Presbyterian). ### Corporate Although founded in 1938, the company was incorporated in Singapore on 20 December 1955 as **Yeo Hiap Seng Canning and Sauce Factory Private Limited** and was listed on 7 November 1968 and renamed to its present shorter name. The 1950s saw the company can [curry chicken](/wiki/Curry), pioneer the bottling of [soy milk](/wiki/Soy_milk), and package Asian drinks in [Tetra Brik](/wiki/Tetra_Brik) aseptic [containers](/wiki/Packaging_and_labelling) using the [Ultra-high temperature processing](/wiki/Ultra-high_temperature_processing) system. ### 1990s and beyond In June 1995, [Robert Ng](/wiki/Robert_Ng) took over as chairman of Yeo Hiap Seng (YHS). His chairmanship came at the same time as his family increased its stake in the company to 24.9%, just short of the 25% threshold above which they would be required by law to make an offer to buy out all other shareholders. This marked a step forward in his fight with Malaysian billionaire investor [Quek Leng Chan](/wiki/Quek_Leng_Chan) for control of YHS and its land holdings in Singapore's [Bukit Timah](/wiki/Bukit_Timah) district, which could be worth billions of dollars were they redeveloped into residential real estate. In the end, Ng and his father were able to successfully take advantage of squabbles within the Yeo family to buy up 86% of YHS' stock. Their battle to gain control of the company was later described as \"one of the most colourful take-over struggles in Singapore's history\" and led to YHS' transformation from a food company to a [luxury real estate](/wiki/Luxury_real_estate) developer. - Companies portal - Drink portal - Food portal - [List of food companies](/wiki/List_of_food_companies) - [Vitasoy](/wiki/Vitasoy) – Hong Kong–based soy beverage giant ## Bibliography - Backman, Michael (2001), *Asian eclipse: exposing the dark side of business in Asia*, J. Wiley, [ISBN](/wiki/ISBN_(identifier)) 978-0-471-47912-3 - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:15:24.395409",
  "title": "Yeo Hiap Seng",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Yeo_Hiap_Seng"
}