{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:15:28.552877"
  },
  "content": "* *Yep** is a [search engine](/wiki/Search_engine) website based in Singapore, which was launched in June 2022. It features an image search, a news section and AI summaries. Yep promised to share revenue with [content creators](/wiki/Content_creators). ## History In March 2019 Ukrainian Dmytro Gerasymenko, founder of [Search engine optimization](/wiki/Search_engine_optimization) company Ahrefs, announced their intention to develop a search engine to compete with established [search engines](/wiki/Search_engines) like Google. Yep was incorporated in Singapore and launched a [beta version](/wiki/Beta_version) of the search engine website in June 2022. An image search and a news section were later added. Before announcing Yep, Ahrefs was contacted by [Sridhar Ramaswamy](/wiki/Sridhar_Ramaswamy)'s startup to use its search data for the in-development [Neeva](/wiki/Neeva) search engine according to Gerasymenko. He said to have rejected the offer due to becoming competitors with Ahrefs working on its own search engine Yep. By August 2021, Ahrefs is said to have invested US$40 million in the project and by June 2022, [TechCrunch](/wiki/TechCrunch) reported Ahrefs had invested US$60 million in Yep. At launch, Yep promises to give 90 per cent of revenue to [content creators](/wiki/Content_creators). The search engine was first launched in English due to Ahrefs product experience on the English-speaking web. In April 2023, Yep launched a artificial intelligence (AI) based summarization tool YepTLDR. ## Reception Search Engine Journal reviewed Yep on its beta launch, it criticized search engine results, using [Worldwide Developers Conference](/wiki/Worldwide_Developers_Conference) as an example, as not fresh but \"perhaps [...] passable\" particularly with broad search terms. The journal concluded Yep needs more work before it could be a serious alternative or help to content creators. - Cordon, Miguel (23 June 2021). \"With almost $100m in ARR without taking VC money, Ahrefs is now challenging Google\". *[Tech In Asia](/wiki/Tech_In_Asia)*. Retrieved 2026-01-01. - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:15:28.552614",
  "title": "Yep (search engine)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Yep_(search_engine)"
}