{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T11:38:13.658957"
  },
  "content": "Town in North Region, SingaporeThis article may **require cleanup** to meet Wikipedia's quality standards. The specific problem is: **sections need to be reorganised and converted to prose.** Please help improve this article if you can. *(February 2018)* *(Learn how and when to remove this message)*Planning Area and Town in North Region, Singapore **Yishun** ([IPA](/wiki/International_Phonetic_Alphabet): /ˈiːʃuːn/ *EE-shoon*), formerly known as **Nee Soon**, is a [planning area](/wiki/Planning_Areas_of_Singapore) and [residential town](/wiki/New_towns_of_Singapore) located in the eastern corner of the [North Region](/wiki/North_Region,_Singapore) of [Singapore](/wiki/Singapore), bordering [Sembawang](/wiki/Sembawang) to the north, [Mandai](/wiki/Mandai) to the west, the [Central Water Catchment](/wiki/Central_Catchment_Nature_Reserve) to its southwest, [Ang Mo Kio](/wiki/Ang_Mo_Kio) to its south, as well as [Seletar](/wiki/Seletar) and [Sengkang](/wiki/Sengkang) to its east and southeast respectively. ## Etymology The name Yishun ([traditional Chinese](/wiki/Traditional_Chinese_characters): 義順; [simplified Chinese](/wiki/Simplified_Chinese_characters): 义顺) is the [Mandarin Chinese](/wiki/Mandarin_Chinese) equivalent of \"Nee Soon\", the given name of [Lim Nee Soon](/wiki/Lim_Nee_Soon) ([Chinese](/wiki/Chinese_language): 林義順), a prominent industrialist who made his fortune from the rubber and pineapple plantations he had in the area. Yishun planning area is divided into nine sub-zones namely Khatib, Lower Seletar, Nee Soon, Northland, Springleaf, Yishun Central, Yishun East, Yishun South and Yishun West. Springleaf and Nee Soon subzones are private housing estates in Yishun. ### Sub planning areas - [Khatib](/wiki/Khatib,_Singapore) - [Lower Seletar](/wiki/Lower_Seletar) - Northland - Nee Soon - Springleaf - Yishun Central - Yishun East - Yishun South - Yishun West ## Amenities ### Shopping malls - [Northpoint City](/wiki/Northpoint_City) - The largest shopping mall in the North, it is located beside [Yishun MRT station](/wiki/Yishun_MRT_station). Previously known as Northpoint Shopping Centre, it underwent its first expansion which was completed in 2009. It included a new building connected to the main shopping mall built on a plot of land next to it. The expansion increased the square footage of Northpoint Shopping Centre and had more shops as well. Additionally, Yishun Community Library moved to its new location, at the top floor of Northpoint Shopping Centre and was renamed Yishun Public Library. The shopping centre was opened in 1992 making it the first modern sub-urban mall in a major housing estate (new town). Currently, sub-urban malls are almost a standard feature in all housing estates. Northpoint Shopping Centre was then renamed Northpoint City. After undergoing a massive expansion in 2017, it became the first shopping mall in Singapore to have the Integrated Transport Hub (ITH), a condominium called North Park Residences, a public library, an underground walkway to Yishun MRT station and the Nee Soon Central Community Club. The latest expansion brings the number of shops and restaurants to 500. - Junction Nine - The first mixed development in Yishun. Situated at the junction of Yishun Ring Road and Yishun Avenue 9, Junction Nine is a seven-minute walk away from Yishun MRT station with Sheng Shiong Supermarket as one of its anchor tenants. - Wisteria Mall - Opened on 28 July 2018, Wisteria Mall is the only, and smallest, mall and heartland mall in the southern part of a mature Yishun estate. Wisteria Mall has Fairprice Finest supermarket and Koufu Food Court as its anchor tenants. ### Neighbourhood centres - [Chong Pang](/wiki/Chong_Pang) City - Chong Pang City is located in Neighbourhood 1. It has a collection of shophouses, a hawker centre and a market. There are small and family-run businesses as well as major retailers. Chong Pang City was the largest neighbourhood centre in Yishun until the opening of Northpoint City and Yishun 10. In September 2020, the Singapore government announced that the 40-year-old neighborhood would be rejuvenated with a new community club, upgraded hawker center and market, tentatively named Chill @ Chong Pang. The multistorey development will also feature swimming pools, a gym, fitness studios, and commercial spaces. Expected to be completed in 2027, it will include more than 300 parking spaces, serving residents of Nee Soon South and Nee Soon Central, all within walking distance. - Neighbourhood Centres - There are various neighbourhood centres such as Nee Soon East (Neighbourhood 2) and Khatib Central (Neighbourhood 8). A typical \"heartland\" neighbourhood centre would consist of stores such as provision stores, eateries (commonly called coffee shops), supermarket chains, mini-marts, clinics, local banks, and salons. In the last few decades, fast food outlets as well as pharmacies have opened in these areas. - Blossom Spring @ 461 - A small neighborhood hub that is manage and operate by Prime, located in Yishun Everspring, opened on 6 September 2019. - Yishun Park Hawker Centre - Operated by the Timbre Group, the Yishun Park Hawker Centre at Yishun Avenue 11 opened on 20th Sep 2017. The 800-seater hawker centre includes family-friendly features such as a play area, and a Radio Frequency Identification (RFID) tray return system. It also has top-up kiosks for cashless payments and is due to host arcade games and pinball machines, as well as weekend activities for community bonding. ### Leisure areas - ORTO - Formerly known as the Bottle Tree Park, ORTO was closed down mid-2023 to make way for future housing developments. It was Singapore's First 24 Hour Multi Recreational Leisure Park with activities such as prawning, freshwater sports fishing, *longkang* fishing, jump at Katapult Trampoline Park, drift karting at Maximum Drift Karting Arena, paintball games at Red Dynasty Paintball Park and kick the ball with Uber Sports Futsal. Additionally, ORTO catered for corporate events and weddings. - Ground-Up-Initiative (GUI) *Kampung Kampus* - Boast activities ranging from farming programmes, craft workshops and even camping! This is a family friendly place that is a must to visit. ### Learning spaces - [Yishun Public Library](/wiki/Yishun_Public_Library) - Previously named Yishun Community Library, it was previously located at Yishun Street 22 and was relocated to Northpoint City and was renamed Yishun Public Library in 2008 and now features a larger floor area to cater to the different needs of the Yishun population, with books for both children and adults. It underwent renovations in 2018 to better serve the Yishun residents. - Tzu Chi Humanistic Youth Centre - Houses areas for youth to flourish. Amenities include plant-based cafe and artisan bakery, Wellness Studio, Arts Studio, Makerspace, Sustainable Workshops, Bookstore cafe, Multi-purpose hall equipped with AV and lighting, Co-working space, Study Area, Classrooms, Youth Volunteer Room, Counselling Rooms and Office Space/Pantry/Conference Room. ### Places of worship #### Chinese temples - Chee Leng Lian He Miao (慈靈聯合廟) - Chee Hoon Sun Kong (慈云山宫) & Cheow Leng Beo (昭灵庙) - Chong Pang Combined Temple (忠邦联合宫) - Dou Mu Gong(汫水港斗母宫), Hong San See(汫水港凤山寺), Kwang Tee Miao(关帝庙) and Hwa Poh Siang Tng(华报善堂) & Fook Poon Tong(复本堂) - Chu Siang Wah Sua Temple (聚善华山宫) - Chu Siang Tong (聚善堂) & Wah Sua Keng (华山宫) - Hwee San Temple (橫山廟) - Phua Clan Temple, founded in 1907 - Hock Huat Keng Combined Temple (福发宫) - Hup Choon Kek Hock Huat Keng (合春格福发宫), Tian Hock Dian (天福殿) & Tiow Hoon Tien (朝云殿) - Nam Hong Siang Theon (南凤善堂), Seng Pang Tua Pek Kong Keng (成邦大伯公宫) & He Bi Shan Gong (何碧山宫) - Teong Siew Wei Ling Dong Shan Temple (长袖威灵东山联合庙) - Teong Siew Kuan (長秀馆), Wei Ling Keng (威靈宫) & Dong Shan Temple (東山廟) - Yishun United Temple (义顺镇联合庙) - Guan Loong Sheng Temple (元龍聖廟), Chern Nam Kong Siew Temple (镇南庙广寿堂) & Soon Say Keng Reservoir Tua Pek Kong (顺西宫水池林) #### Churches - Evangel Family Church - Church of Our Lady Star of The Sea - Sembawang Tamil Methodist Church - Spiritual Grace Presbyterian Church - Yishun Christian Church #### Hindu temples - Holy Tree Sri Balasubramaniar Temple - Sree Maha Mariamman Temple - Sri Veeramuthu Muneeswarar Temple #### Mosques - [Masjid Ahmad Ibrahim](/wiki/Masjid_Ahmad_Ibrahim) (Ahmad Ibrahim Mosque) - [Masjid Darul Makmur](/wiki/Masjid_Darul_Makmur) (Darul Makmur Mosque) #### Gurdwaras - Gurdwara Sahib Yishun ### Columbarium - Yishun Columbarium - Teochew Memorial Park ## Medical facilities - [Khoo Teck Puat Hospital (KTPH)](/wiki/Khoo_Teck_Puat_Hospital) Initially named Northern General Hospital, the new general hospital was named [Khoo Teck Puat Hospital](/wiki/Khoo_Teck_Puat_Hospital) after receiving a S$125 million donation from the late Mr Khoo's family. Spanning over 3.5 hectares in the Yishun Central Area, the 795-bed general and acute care hospital is managed by Alexandra Health System. Opened in June 2010, KTPH offers a comprehensive range of medical services and specialist care to the community in the north. It overlooks the scenic Yishun Pond. - Yishun Polyclinic Yishun Polyclinic was located at 30 Yishun Central beside Khoo Teck Puat Hospital and is managed by [National Healthcare Group Polyclinics (NHGP)](/wiki/National_Healthcare_Group). It moved to a new location opposite Nee Soon East Community Club in 2018. - Yishun Community Hospital The new Yishun Community Hospital (YCH) with about 428 beds provides sub-acute, rehabilitative, dementia and palliative care for patients. Opened on December 28, 2015, YCH receives post-surgical, post-stroke patients and patients who are recovering from medical illnesses/trauma from the neighbouring [Khoo Teck Puat Hospital](/wiki/Khoo_Teck_Puat_Hospital) (KTPH), other acute hospitals and nursing homes. - Khatib Polyclinic Opened in May 2024 and managed by [NHGP](/wiki/National_Healthcare_Group), Khatib Polyclinic is designed with elderly-friendly facilities, a Health Studio for lifestyle workshops, and programmes screening adolescents for psychosocial conditions. The polyclinic is also integrated with technology like telehealth consultations and self-help blood pressure stations. - Other Private Clinics and Dental Clinics Currently, the Yishun estate is well served by the Yishun and Khatib Polyclinics as well as many private medical clinics and dental clinics situated at void decks. ## Country Clubs - SAFRA Yishun Country Club - SAFRA Yishun Country Club is a country club owned by [SAFRA](/wiki/SAFRA_National_Service_Association), which aims to build morale and camaraderie amongst NSmen in Singapore. The club was opened in 2001. It also has a wide range of amenities like a Bowling centre, Gym, Tennis court, Adventure Sports Centre ([Rock Climbing](/wiki/Rock_climbing)), Western and Chinese restaurants, Swimming Pool and a Karaoke Centre. To create various choices among NSmen, SAFRA Yishun Country Club is destined as an Adventure Sports Hub within the group of [SAFRA](/wiki/SAFRA_National_Service_Association) clubhouses. It underwent upgrading works and completed in February 2020. - Orchid Country Club - Opened in 1993 located near the scenic Seletar Reservoir. The club aims to improve the social status of its members. Activities there include Paintball. There is also a Chinese restaurant, Bowling alley. Member facilities include a gym, swimming pool, golf driving range as well as tennis courts. They also offer accommodations as well for [staycations](/wiki/Staycation). - Seletar Country Club - Seletar Country Club was opened in 1930. It is strategically located on a hill overlooking the Lower Seletar Reservoir and the Orchid Country Club. Although the country club is named after Seletar, Seletar Country Club is in Yishun planning area according to URA Masterplan. - HomeTeamNS Khatib - The club opened in August 2020 and has a wide range of amenities like an Indoor Obstacle Course Hub, Gym, Swimming Pool, Indoor Playground, Karaoke Centre, Bowling. Various restaurants and shops can be found inside the clubhouse too, but referred to its official openings on 10 April 2021. And followed by another HomeTeamNS clubhouse in Bedok Reservoir that officially opened on 4 January 2023. ## Transport ### Bus interchange The old [Yishun Bus Interchange](/wiki/Yishun_Bus_Interchange) was built in 1987 and was closed on 14 March 2015 serving 28 years of service to Singapore residents so as to make way for Northpoint City. The Yishun Temporary Bus Interchange was later opened at a land parcel adjacent to Golden Village Yishun. This interchange operated throughout the construction of the Integrated Transport Hub where it was being built at the old site of the Yishun Bus Interchange. On 8 September 2019, the newly constructed air-conditioned Yishun Integrated Transport Hub (ITH) officially opened its doors facilitating the integration of Yishun Bus Interchange, Northpoint City, North Park Residences, Nee Soon Central Community Club and Yishun MRT station. ### Mass Rapid Transit stations There are three main MRT stations serving Yishun. The three stations are: - **NS13** [Yishun](/wiki/Yishun_MRT_Station) (at the north) - **NS14** [Khatib](/wiki/Khatib_MRT_Station) (at the south) - **TE4** [Springleaf](/wiki/Springleaf_MRT_Station) (at the south west) ## Parks, gardens and other recreational facilities Major parks: - [Yishun Park](/wiki/Yishun_Park) (managed by National Parks Board)– a 13 ha park in the centre of the housing estate. Used to be a rubber estate, it is thickly covered with natural vegetation. Part of the land was developed into the SAFRA Yishun Country Club. - [Lower Seletar Reservoir Park](/wiki/Lower_Seletar_Reservoir) (managed by NParks and PUB)– this small 3 ha park at the southern edge of the housing estate bordering the northern edge of the reservoir. Under the PUB's Active, Beautiful, Clean Water for all (ABC) programme, there are plans to open up the reservoir to more water sports. Currently there is a smaller water sports rental facility, and occasionally there are dragon boat competitions held there. Viewing benches, riverside deck and possibly a stage will be in the works if the project take off. - Khatib Bongsu Nature Park: Khatib Bongsu Nature Park was initially an old Kampong estate. It was the most recent kampong to be demolished, in 2007. It is situated near the mouth of Sungei Khatib. On 4 March 2020, it was announced by the government that Khatib Bongsu Nature Park will be the new nature park covering 40ha by 2030 as part of government efforts to revitalise Singapore's biodiversity. The area is rich with mangrove and mudflat habitat. Small parks: - Yishun Neighbourhood Park- Bounded by Yishun Ave 2, Ave 7 and St 22 and featuring an open lawn for picnics and facilities such as fitness corner and playgrounds. - Nee Soon East Park– Located opposite Block 407 Yishun Avenue 6. Facilities include a basketball court and fitness corner. - Yishun Pond Park- Located along Yishun Central, in front of [Khoo Teck Puat Hospital](/wiki/Khoo_Teck_Puat_Hospital). Features a spiral tower called The Spiral@Yishun where visitors can get a bird's eye view of the area. - Yishun Park Neighbourhood 8- Located at Blk 810 Yishun Ring Rd. Facilities include fitness corner, playground and a running track. It is undergoing renovation in 2020. - Yishun Nature Park- Located at 329 Yishun Ring Road has a basketball court, playground and exercise corner. - Rower's Bay Park- Located at Seletar Club Road - Yishun Green Link- Located at Yishun Street 61 - Rockridge Park- Located at Yishun Street 51 - Springside Park- Located at Springside Place - Springleaf Nature Park- Located at 1230 Upper Thomson Road - Oasis Waterpark @ Nee Soon East - Everspring Park - Located within Yishun Ever spring along Yishun Street 42 Yishun Park Connector: - The Yishun [Park Connector Network](/wiki/Park_Connector_Network) links the Khatib Bongsu Park Connector to the Canberra Park Connector, passing through the Simpang Kiri Park Connector and Canberra-Sembawang Park Connector, and running by Yishun Swimming Complex. ## Sports facilities - [Yishun Stadium](/wiki/Yishun_Stadium) and Sports Hall: Located at the Southern end of the town, the Yishun Stadium was opened on 2 January 1992. In 1993, it played host to the Karate event during the 1993 SEA Games in Singapore. In 1996, it was the home ground for the [Sembawang Rangers FC](/wiki/Sembawang_Rangers_FC) in the S-league. Eventually the team was dropped from the league in 2003. Later on, it hosted the [Young Lions](/wiki/Young_Lions_(Singapore_football_team)) in 2005 season, [Sporting Afrique FC](/wiki/Sporting_Afrique_FC) in 2006 season and currently it is the home for [Korean Super Reds FC](/wiki/Korean_Super_Reds_FC) for the 2007 season. Other than the main stadia with the soccer field and 8-lanes running track, it also houses a ClubFitt gym. The sport hall seats 800 people and it can be use for badminton, basketball or other indoor sports. In 2020, Yishun Sports Hall will be undergoing upgrading works. It will have two covered tennis and multi-sport courts, new cafeteria, air-conditioned table tennis area, a bigger dance studio and bigger gym. - Yishun Swimming Complex Opened in 1988, it has a competition pool (with 430 seating), a children pool and a training pool. Together with Yishun Sports Hall, it will be undergoing upgrading works in 2020. - Nee Soon Sports Centre The Nee Soon Sports Centre, managed by FutsalArena, operates from 9am to 1am daily. - Chill @ Chong Pang The new integrated development at Chong Pang City will feature three swimming pools, a gym and fitness studios, which is expected to be completed in 2027. ## Industrial park The Yishun Industrial Park is a small industrial park situated between Avenues 6 and 7 which comprises some well known companies such as [Murata](/wiki/Murata_Manufacturing), [Philips Lumileds](/wiki/Philips_Lumileds_Lighting_Company), [Agilent](/wiki/Agilent), [Avago Technologies](/wiki/Avago_Technologies), ATS, ASM-Frontend, [STATS, Inc.](/wiki/STATS,_Inc.) and many other smaller companies. Commercial buildings like A’Posh Bizhub, Win5, Northpoint Bizhub, North Spring Bizhub, YS- One and North View Bizhub can be found at the Yishun Industrial Park. It can be reached by Bus service 811 from the [Yishun Bus Interchange](/wiki/Yishun_Bus_Interchange). ## Educational institutions There are ten primary schools, nine secondary schools, a junior college and an international school. ### Primary schools - Ahmad Ibrahim Primary School - Chong Fu School - [Huamin Primary School](/wiki/Huamin_Primary_School) - [Jiemin Primary School](/wiki/Jiemin_Primary_School) - Naval Base Primary School - [Northland Primary School](/wiki/Northland_Primary_School) - [North View Primary School](/wiki/North_View_Primary_School) - [Peiying Primary School](/wiki/Peiying_Primary_School) - [Yishun Primary School](/wiki/Yishun_Primary_School) - [Xishan Primary School](/wiki/Xishan_Primary_School) ### Secondary schools - [Ahmad Ibrahim Secondary School](/wiki/Ahmad_Ibrahim_Secondary_School) - [Chung Cheng High School (Yishun)](/wiki/Chung_Cheng_High_School_(Yishun)) - [Naval Base Secondary School](/wiki/Naval_Base_Secondary_School) - [Northbrooks Secondary School](/wiki/Northbrooks_Secondary_School) - [Northland Secondary School](/wiki/Northland_Secondary_School) - [Orchid Park Secondary School](/wiki/Orchid_Park_Secondary_School) - [Yishun Secondary School](/wiki/Yishun_Secondary_School) - [Yishun Town Secondary School](/wiki/Yishun_Town_Secondary_School) ### Junior college - [Yishun Innova Junior College](/wiki/Yishun_Innova_Junior_College) ### International school - [GEMS World Academy (Singapore)](/wiki/GEMS_World_Academy_(Singapore)) ## Politics Yishun was a large, single-member constituency starting in [Seletar](/wiki/Seletar) but later hived into [Sembawang](/wiki/Sembawang) and along with a dedicated [namesake Nee Soon SMC](/wiki/Nee_Soon_Single_Member_Constituency) on later years. When the [GRC](/wiki/Group_Representation_Constituency) scheme was introduced in (/wiki/Singapore_general_election,_1988), its population size was enough to form into [Sembawang GRC](/wiki/Sembawang_GRC), as well as two smaller SMCs. By (/wiki/Singapore_general_election,_2011), Nee Soon had its [dedicated GRC](/wiki/Nee_Soon_GRC) spanning most of Yishun. The entire Yishun was helmed by the current ruling party, [People's Action Party](/wiki/People%27s_Action_Party) (PAP) on its lifetime except on years between 1963 and 1968 where it was helmed by [Barisan Sosialis](/wiki/Barisan_Sosialis), a party formed from a fraction of former PAP members, and from 1991 to 1997 with ex-[Singapore Democratic Party](/wiki/Singapore_Democratic_Party) member (now [National Solidarity Party](/wiki/National_Solidarity_Party_(Singapore))) [Cheo Chai Chen](/wiki/Cheo_Chai_Chen) helming albeit a small portion of Yishun, known as [Nee Soon Central SMC](/wiki/Nee_Soon_Central_Single_Member_Constituency). Notable members of parliament who are overseeing or have overseen parts of the Yishun area include current Home Affairs Minister and Coordinating Minister for National Security [K Shanmugam](/wiki/K_Shanmugam) (who oversees the subregion of [Chong Pang](/wiki/Chong_Pang)), former [Nominated Member of Parliament](/wiki/Nominated_Member_of_Parliament) [Syed Harun Alhabsyi](/wiki/Syed_Harun_Alhabsyi) (who have overseen Eastern Yishun now known as Nee Soon Link), and [Lee Hui Ying](/wiki/Lee_Hui_Ying) (who has overseen the southern subregion of Khatib and [Lower Seletar Reservoir](/wiki/Lower_Seletar_Reservoir)). Outside of politics, a member of parliament and the 8th [President of Singapore](/wiki/President_of_Singapore), [Halimah Yacob](/wiki/Halimah_Yacob), was a resident of Yishun. [Hui Shiu-hung](/wiki/Hui_Shiu-hung), a veteran Hong Kong actor, was also a resident. ## Sources - Victor R Savage, Brenda S A Yeoh (2003), *Toponymics – A Study of Singapore Street Names*, Eastern Universities Press, [ISBN](/wiki/ISBN_(identifier)) 981-210-205-1 - SAFRA Online. (2006). About SAFRA. Retrieved on 5 April 2007. Archived 30 April 2007 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T11:38:13.658589",
  "title": "Yishun",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Northland,_Singapore"
}