{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:15:52.024270"
  },
  "content": "Urban park located in Yishun, Singapore **Yishun Pond Park** (or **Yishun Pond**) is an [urban park](/wiki/Urban_park) located at [Yishun](/wiki/Yishun), Singapore. It is situated along Yishun Central in front of [Khoo Teck Puat Hospital](/wiki/Khoo_Teck_Puat_Hospital) and connects the residential areas to [Yishun MRT station](/wiki/Yishun_MRT_station) and [Northpoint Shopping Centre](/wiki/Northpoint_City,_Singapore). The park features a large pond that serves as a recreational spot for residents and doubles as a [water catchment area](/wiki/Water_Catchment). Water from the pond is used in the irrigation system of Khoo Teck Puat Hospital. The park was renovated in 2006 and is linked to [Yishun Park](/wiki/Yishun_Park) via an 84-meter elevated bridge. ## Attraction The 2.3 Hectares park features benches and a spiral tower that one can climb to the top for a bird eye view of the surrounding areas. The large pond serves as a recreational spot for residents and doubles as a water catchment area. Yishun Pond Park is linked to another park, Yishun Park, via an 84-meter elevated bridge. ## Flora and fauna The park houses several magnificent trees including Ashoka trees, handkerchief trees, star-fruit trees, mangosteen trees, and jackfruit trees, to name a few. The park's fauna comprises several exotic and local species including tawny coster butterflies, collared kingfishers, common flameback woodpeckers, the common little herons, and sun skink lizards, otters, among others. ## Accessibility Parking is available at the hospital or the public housing area opposite to the park. A bus stop is right outside the park. - [List of parks in Singapore](/wiki/List_of_parks_in_Singapore) - Yishun Pond Park This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:15:52.023958",
  "title": "Yishun Pond Park",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Yishun_Pond_Park"
}