{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:15:50.064340"
  },
  "content": "14-hectare park located in Yishun, Singapore **Yishun Park** is a 14-[hectare](/wiki/Hectare) [park](/wiki/Park) located in [Yishun](/wiki/Yishun), Singapore. It is within the vicinity of [Northland Primary School](/wiki/Northland_Primary_School), [SAFRA Yishun Country Club](/wiki/SAFRA_National_Service_Association#SAFRA_Yishun_Country_Club) and Yishun Park Hawker Centre. The park is connected to [Yishun Pond Park](/wiki/Yishun_Pond_Park) by an 84-meter elevated bridge. ## History Plans for the development of Yishun Park were first announced in November 1993, and the park was opened to the public in January 1995. Developed at a cost of S$2.7 million, the park occupied what was previously plantation and farm land, and retained most of the site's preexisting vegetation. Covering an area of 17 hectares (42 acres), the park featured a 12 metres (39 ft) tall hill with a stand of fruit trees, an area for the playing of board games that took after a [Chinese chess](/wiki/Xiangqi) board, a playground for children of different age groups, fitness stations, and a foot reflexology path. In October 1997, the [Minister of Defence](/wiki/Ministry_of_Defence_(Singapore)) released plans for the construction of a SAFRA clubhouse within the park. Occupying an area of 3 hectares (7.4 acres) and costing S$2.8 million to build, the clubhouse opened to the public in November 2000. In 2008, the Dipterocarp Arbotereum, a S$160,000 project comprising the planting of multiple [dipterocarp](/wiki/Dipterocarpaceae) trees and the installation of signs about the trees' heritage, was carried out in the park. ## Description Developed on an old rubber estate, Yishun Park has a variety of rare [Indo-Malayan](/wiki/Indomalayan_realm) trees (e.g. [Shorea](/wiki/Shorea), [Kapur](/wiki/Dryobalanops_aromatica), [Chengal](/wiki/Neobalanocarpus)), tropical fruit trees (e.g. [rambutan](/wiki/Rambutan), [durian](/wiki/Durian), [guava](/wiki/Guava), [starfruit](/wiki/Carambola)) and numerous bird species are attracted by the park such as [herons](/wiki/Heron), [egrets](/wiki/Egret), migratory birds. There are also many [rubber trees](/wiki/Rubber_tree) and fallen rubber seeds in the park. The park also features an [allotment gardening](/wiki/Allotment_(gardening)) scheme hosted by the [National Parks Board](/wiki/National_Parks_Board). - [List of parks in Singapore](/wiki/List_of_parks_in_Singapore) - Yishun Park at National Parks Board, Singapore This [Singapore](/wiki/Singapore) location article is a stub. You can help Wikipedia by expanding it. - v - t - e\n",
  "language": "en",
  "processed_at": "2026-01-12T12:15:50.064022",
  "title": "Yishun Park",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Yishun_Park"
}