{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:16:00.641997"
  },
  "content": "Singapore Supreme Court caseThis article **is written like a personal reflection, personal essay, or argumentative essay** that states a Wikipedia editor's personal feelings or presents an original argument about a topic. Please help improve it by rewriting it in an encyclopedic style. *(November 2022)* *(Learn how and when to remove this message)* ***Yong Vui Kong v. Public Prosecutor*** was a seminal case decided in 2010 by the [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) of [Singapore](/wiki/Singapore) which, in response to a challenge by [Yong Vui Kong](/wiki/Yong_Vui_Kong), a convicted drug smuggler, held that the mandatory [death penalty](/wiki/Capital_punishment_in_Singapore) imposed by the [Misuse of Drugs Act](/wiki/Misuse_of_Drugs_Act_(Singapore)) (Cap. 185, 2001 Rev. Ed.) (\"MDA\") for certain drug trafficking offences does not infringe [Articles 9(1)](/wiki/Article_9_of_the_Constitution_of_Singapore) and [12(1)](/wiki/Article_12_of_the_Constitution_of_Singapore) of the [Constitution of Singapore](/wiki/Constitution_of_Singapore). Article 9(1) states: \"No person shall be deprived of his life or personal liberty save in accordance with law.\" The Court of Appeal held that the term *law* does not exclude laws sanctioning inhuman punishment. This does not mean that all laws are justified whatever their nature. Laws which violate fundamental rules of [natural justice](/wiki/Natural_justice), or those that are absurd or arbitrary cannot be considered law. Nonetheless, the threshold of culpability in imposing the mandatory death penalty for drug-related offences is a matter of policy and is therefore a matter for legislation and not for the courts to decide. The Court [distinguished](/wiki/Distinguishing) a line of [Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council) cases finding the mandatory death penalty to be unconstitutional, because the constitutions of the jurisdictions from which the appeals originated contained an explicit prohibition against inhuman punishment, which Singapore's Constitution lacks. In addition, though the [Constitution of India](/wiki/Constitution_of_India) also does not expressly prohibit inhuman punishment, the Court declined to follow a decision of the [Supreme Court of India](/wiki/Supreme_Court_of_India) invalidating the mandatory death penalty for inconsistency with Article 21 of the [Indian Constitution](/wiki/Constitution_of_India), which is similar to Singapore's Article 9(1). Among other things, it took the view that the test for constitutional validity under Article 9(1) is different from the test applied to India's Article 21. Finally, the Court was of the opinion that rules of [customary international law](/wiki/Customary_international_law) cannot be incorporated into the meaning of the word *law* in Article 9(1) as this is not in accordance with the normal hierarchy of Singapore law, which envisages that customary international law may only be adopted into the [common law](/wiki/Common_law) if it is not inconsistent with existing [domestic laws](/wiki/Municipal_law). In any case, there is insufficient state practice to demonstrate that customary international law regards the mandatory death penalty as an inhuman punishment. The Court of Appeal also held that the mandatory death penalty does not violate Article 12(1) of the Constitution, which states: \"All persons are equal before the law and entitled to the equal protection of the law.\" In its opinion, the 15-gram (0.53 oz) differentia used in the MDA to determine whether the death penalty should be imposed for trafficking in diamorphine ([heroin](/wiki/Heroin)) cannot be said to be purely arbitrary, and bears a rational relation to the social object of the Act which is to prevent the growth of drug addiction in Singapore by stamping out the illicit drug trade. Following this case, the appellant Yong Vui Kong unsuccessfully challenged the process by which the [President](/wiki/President_of_Singapore) grants [clemency](/wiki/Pardon) to convicted persons on the advice of the [Cabinet](/wiki/Cabinet_of_Singapore). Later, in 2013, his sentence was commuted to [life imprisonment](/wiki/Life_imprisonment_in_Singapore) in a re-trial after changes to the death penalty laws allowed drug convicts to face a potential life sentence other than death provided they acted as couriers or suffer from mental illnesses. ## Trial and subsequent events The appellant, [Yong Vui Kong](/wiki/Yong_Vui_Kong), was a 19-year-old [Malaysian](/wiki/Malaysia) national who was arrested in [Singapore](/wiki/Singapore) on 13 June 2007 and charged with trafficking in 47.27 grams (1.667 oz) of diamorphine ([heroin](/wiki/Heroin)), a Class A controlled drug under the [Misuse of Drugs Act](/wiki/Misuse_of_Drugs_Act_(Singapore)) (\"MDA\"). Yong told investigators that he had not been aware of the contents of the packages which he was asked to handle, maintaining instead that he had been delivering packages for his boss, a man known as \"Ah Hiang\", for whom he was working as a debt-collector. Ah Hiang had instructed him not to open the packages, and Yong had acted according to these instructions even though he was suspicious of the contents. Following a trial in the [High Court](/wiki/High_Court_of_Singapore), Yong was found guilty of drug trafficking contrary to section 5(1)(a) of the MDA. Trafficking in more than 15 grams (0.53 oz) of diamorphine attracts a mandatory [death penalty](/wiki/Capital_punishment_in_Singapore). The Court was of the view that Yong must have known that he had been carrying drugs. Yong instructed his counsel to file an appeal, but later asked that the appeal be withdrawn. His case was eventually taken over by another lawyer, [M. Ravi](/wiki/M_Ravi), who had been instructed by Yong's brother. In the meantime, Yong had also petitioned the [President of Singapore](/wiki/President_of_Singapore) for [clemency](/wiki/Pardon). This was rejected on 20 November 2009 and Yong's execution was set for 4 December 2009. Ravi then filed an urgent [motion](/wiki/Motion_(legal)) to challenge the constitutionality of the mandatory death penalty prescribed by the MDA. The motion was heard by Justice [Woo Bih Li](/wiki/Woo_Bih_Li), who granted a [stay of execution](/wiki/Stay_of_execution) pending a decision by the [Court of Appeal of Singapore](/wiki/Court_of_Appeal_of_Singapore). In the hearing before the Court of Appeal, Yong was allowed to pursue his appeal. The Court was of the opinion that the initial withdrawal of the appeal was a nullity as Yong had failed to appreciate the fact that he could have proceeded with his appeal on [points of law](/wiki/Question_of_law), namely, challenging the compatibility of the mandatory death penalty with [Articles 9(1)](/wiki/Article_9_of_the_Constitution_of_Singapore) and [12(1)](/wiki/Article_12_of_the_Constitution_of_Singapore) of the [Constitution of Singapore](/wiki/Constitution_of_Singapore). ## Legal issues In the present case before the Court of Appeal, Yong challenged the constitutionality of the mandatory death penalty imposed by the MDA on the grounds that it violated Article 9(1) and/or Article 12(1) of the Constitution. ### Article 9(1) challenge Article 9(1) of the Constitution reads: \"No person shall be deprived of his life or personal liberty save in accordance with law.\" The word *law* is defined in Article 2(1), which states that \"'law' includes ... the [common law](/wiki/Common_law) in so far as it is in operation in Singapore\". The Court of Appeal noted that if the appellant's challenge on the basis of Article 9(1) was successful, it would mean that mandatory death penalty provisions in statutes other than the MDA would also be unconstitutional, such as the penalties of the following offences: - Murder, in section 302 of the [Penal Code](/wiki/Penal_Code_(Singapore)). - Using or attempting to use arms, in section 4 of the Arms Offences Act. - Using or attempting to use arms to commit or attempt to commit specified offences, in section 4A of the Arms Offences Act. - Having or carrying, without lawful excuse and without lawful authority, any firearm, ammunition or explosive in a security area, in section 58(1) of the [Internal Security Act](/wiki/Internal_Security_Act_(Singapore)). #### Mandatory death penalty constitutes inhuman punishment Yong's first argument was that the word *law* in Article 9(1) did not include laws that imposed inhuman punishments. Since the mandatory death penalty was inhuman, the provisions in the MDA that imposed a mandatory death sentence ran afoul of the Constitution. The argument hinged on the fact that the mandatory death penalty has long been held to be an inhuman punishment in a string of cases from Belize, Saint Christopher and Nevis, Saint Lucia, Barbados, Jamaica, Trinidad and Tobago, the Bahamas, Grenada, the United States, Uganda, Malawi, and India. The Court of Appeal indicated that many of the cases had been [distinguished](/wiki/Distinguishing) in its earlier decision *Nguyen Tuong Van v. Public Prosecutor* (2005), and that this was merely \"traversing old ground\". However, the Court did highlight three cases. The first was the [Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council) case *Reyes v. R.* (2002), an appeal from Belize. Reyes had shot and killed his neighbour and his neighbour's wife, and had been convicted of two counts of murder. Murder by shooting was a \"Class A\" murder offence which attracted the mandatory death penalty. The Privy Council held that the mandatory death penalty imposed in this case contravened section 7 of the [Constitution of Belize](/wiki/Constitution_of_Belize) as it was inhuman or degrading punishment. This was because even within the category of \"Class A\" murders, there were some offenders who were not as morally culpable as the others, since the offence could have occurred in the heat of the moment. To deny the offender a chance to show the court that it would be disproportionate and inappropriate to impose the death penalty on him would thus be to deny his basic humanity. The second case was the [United States Supreme Court](/wiki/Supreme_Court_of_the_United_States) decision *[Woodson v. North Carolina](/wiki/Woodson_v._North_Carolina)* (1976). The [Eighth Amendment to the United States Constitution](/wiki/Eighth_Amendment_to_the_United_States_Constitution) prohibits [cruel and unusual punishment](/wiki/Cruel_and_unusual_punishment), and the Court proceeded on this basis to strike down mandatory death penalty legislation on a 5:4 majority. The reasons given were that the mandatory death penalty imposed a process which did not take into account relevant differences between the offenders and the offence, and excluded from judicial consideration any mitigating factors. The penalty was inhuman as it treated persons convicted of a designated offence \"not as uniquely individual human beings, but as members of a faceless, undifferentiated mass to be subjected to the blind infliction of the penalty of death\". The third case was the [Indian Supreme Court](/wiki/Supreme_Court_of_India) judgment *Mithu v. State of Punjab* (1983). In that case, the appellant, who was under a sentence of [life imprisonment](/wiki/Life_imprisonment), committed murder which attracted the mandatory death penalty under section 303 of the [Indian Penal Code](/wiki/Indian_Penal_Code) 1860. Similar arguments to those in *Woodson* were canvassed, namely, that this provision of law deprived the Court of the chance to use its discretion and wisdom and ignored all factors pertaining to the gravity of the offence. In response to the first challenge to Article 9(1), the [Attorney-General](/wiki/Attorney-General_of_Singapore) [Walter Woon](/wiki/Walter_Woon) submitted that the courts should hold to the established principles in both *[Ong Ah Chuan v. Public Prosecutor](/wiki/Ong_Ah_Chuan_v._Public_Prosecutor)* (1980) as well as *Nguyen Tuong Van*. His contention was premised on the argument that the Privy Council's decisions in the cases following *Ong Ah Chuan* and *Nguyen Tuong Van* did not necessarily have to be followed as the Privy Council \"does not dictate human rights standards for the rest of humanity\". #### Mandatory death penalty contrary to customary international law Yong's second argument was that the word *law* in Article 9(1) should also be taken to include [customary international law](/wiki/Customary_international_law). He argued that since customary international law prohibited mandatory death penalty sentences as inhuman, the MDA provisions also violated Article 9(1). Yong's argument was based on the fact that there are a diminishing number of states which still retain the mandatory death penalty for drug-related offences. The Attorney-General submitted that there are two possible ways in which to interpret the word *law*. First, it could be taken to refer only to statutes and the common law applicable in Singapore. Secondly, it could be interpreted to include rules of customary international law. When queried by the Court of Appeal as to his preferred interpretation, he responded that, in principle, the word *law* should be taken to include customary international law, but only rules which had already been recognised and applied by the domestic courts of Singapore. Furthermore, the Attorney-General disagreed with the contention that the mandatory death penalty violates any customary international law prohibition against inhuman punishment. He submitted that the decisions after *Ong Ah Chuan* and *Nguyen Tuong Van* were reflective of the Privy Council's changing attitude toward the mandatory death penalty specifically, but did not reflect any international consensus that the mandatory death penalty is prohibited by the rules of customary international law. This was evident from the fact that there are still 31 states worldwide which continue to impose the mandatory death penalty for drug-related offences as well as other serious crimes. Thus, the international consensus needed to establish the principle contended for by the appellant was lacking. ### Article 12(1) challenge Article 12(1) of the Constitution reads: \"All persons are equal before the law and entitled to the equal protection of the law.\" In *Ong Ah Chuan*, the Privy Council interpreted Article 12(1) as prohibiting laws requiring differentiation in the punishment of individuals in the same class, but allowing differentiation in punitive treatment between different classes of individuals where there was a difference in the circumstances of the offences committed. This dissimilarity in circumstances would justify discriminatory punitive treatment as long as it was not purely arbitrary and bore a reasonable relation to the social object of the law. Yong argued that the MDA made the quantity of 15 grams of diamorphine the only determinant of whether the mandatory death penalty should be imposed, and that this was highly arbitrary as baseless distinctions had to be drawn between offenders who trafficked in different amounts of controlled drugs. Six points were raised to support this contention: 1. Even if there was a quantitative and incremental increase in guilt or mischief associated with trafficking in just over 15 grams of diamorphine as opposed to just under 15 grams, it would be inappropriate to respond to this with a qualitative and non-incremental increase in the prescribed penalty. 2. The 15-gram differentia meant the MDA might be harsher on a one-time offender trafficking in slightly more than 15 grams of diamorphine, as opposed to a repeat offender who trafficked in slightly less than 15 grams of diamorphine each time. 3. At the sentencing stage, the mandatory death penalty precluded the court from considering the circumstances in which the offence was committed. This denied the Prosecution and the public of information on the type of offenders likely to reoffend, and impeded the [legislature](/wiki/Parliament_of_Singapore) from determining if the mandatory death penalty was actually necessary. 4. Sentencing under the MDA was too rigid as it prevented the court from considering major factual differences between cases. 5. Despite sentencing under the MDA being based on general deterrence, the court was disallowed from considering if the offender had voluntarily assumed the risk of trafficking in controlled drugs. It was unlikely that an offender would know if the substance he was trafficking contained the amount of diamorphine sufficient to fulfil the 15-gram differentia. 6. The 15-gram differentia failed to differentiate between an offender trafficking in slightly more than 15 grams of diamorphine as opposed to one who trafficked in multiple times that quantity. In response, the Attorney-General cited the two-step \"reasonable classification\" test applicable to Article 12(1) that had been outlined in *Nguyen Tuong Van* – that a differentiating measure in a statute is valid if: - the classification is founded on an intelligible differentia; and - the differentia bears a rational relation to the object sought to be achieved by the law in question. The Attorney-General submitted that the 15-gram differentia was intelligible and bore a rational relation to the social purpose of the MDA: to have a deterrent effect on drug trafficking in or through Singapore by large-scale drug traffickers. ## Decision ### Article 9(1) challenge #### Inhuman punishment argument The Court of Appeal noted that the definition of the word *law* in Article 2(1) of the Constitution includes \"written law\", which means that the MDA is law within the meaning of Article 9(1). However, this does not mean that all laws are justified whatever their nature. Laws which violate fundamental rules of natural justice, or those that are absurd or arbitrary cannot be considered law. The Court also held that all the cases which the appellant relied on concerned the offence of murder instead of drug-related offences. This being the case, \"the rationale underlying those cases has no direct application to the present appeal\". It relied on the judgment of [Lord Diplock](/wiki/Kenneth_Diplock,_Baron_Diplock) in *Ong Ah Chuan* which stated that while it was possible for the offence of murder to be committed in the heat of the moment, it was \"more theoretical than real in the case of large scale trafficking in drugs, a crime [for] which the motive is cold calculated greed\". The Court was of the opinion that the threshold of culpability in imposing the mandatory death penalty for drug-related offences was a matter of policy and was therefore a matter for legislation and not for the courts to decide. Also, apart from *Mithu*, the cases cited such as *Reyes* and *Woodson* were decided in different textual contexts, as inhuman punishment was expressly prohibited by the constitutions of the respective jurisdictions from which the cases originated. Hence, those cases were strictly based on the issue of what kind of punishment would be considered inhuman and not directly related to the issue on appeal in *Yong Vui Kong*, which was the meaning of the word *law* in Article 9(1) of the Singapore Constitution. As for *Mithu* itself, the Court held that there were three reasons for not adopting the reasoning of the Indian Supreme Court. First, the test for constitutional validity under Article 9(1) is different from the test applied to Article 21 of the Indian Constitution, which states: \"No person shall be deprived of his life or personal liberty except according to procedure established by law.\" The phrase *procedure established by law* means a \"fair, just and reasonable procedure established by valid law\". In *Mithu*, section 303 of the Indian Penal Code was found to infringe Article 21 as it did not satisfy this test. However, Singapore's Article 9(1) is worded differently, and does not specifically require that any law passed be \"fair, just and reasonable\" for it to be considered *law*. The Court felt that the \"fair, just and reasonable\" test for constitutionality was too vague, as whether a law restricted the right to life or personal liberty according to such criteria would hinge on a court's view of the reasonableness of the law. In effect, the court would be intruding into the legislature's domain. Secondly, according to this interpretation of Article 21 of the Indian Constitution any law which removed judicial discretion would be unconstitutional. The result would be that all mandatory sentences would contravene Article 21. The Court of Appeal held that this was not the law applicable in Singapore. The Court was also of the opinion that in India Article 21 was given relative pride of place in its constitutional framework due to the \"economic, social and political conditions prevailing in India and the pro-active approach of the Indian Supreme Court in matters relating to the social and economic conditions of the people of India\". The situation in Singapore was different. Finally, the Court gave two reasons for declining to imply a provision against inhuman punishment into Article 9(1). Singapore's constitutional history was markedly different from that of other Commonwealth countries, and its Constitution does not contain express prohibitions against cruel and inhuman punishments as it is not modelled upon the [European Convention on Human Rights](/wiki/European_Convention_on_Human_Rights). In addition, in 1966 the [Wee Chong Jin](/wiki/Wee_Chong_Jin) Constitutional Commission specifically considered whether to include a constitutional provision against inhuman punishment. However, the proposal was not taken up by the Government. #### Customary international law argument The Court of Appeal was of the opinion that customary international law cannot be incorporated into the meaning of the word *law* in Article 9(1) of the Constitution. Customary international law rules do not have any status in [domestic law](/wiki/Municipal_law) until they are first accepted and adopted as part of domestic law. This can occur when a rule is incorporated into a statute (in which case it is no longer a customary international law rule but is regarded as domestic law), or when it is judicially declared to be part of the common law of Singapore. However, customary international law can only be incorporated into the common law when it is not inconsistent with existing domestic laws. Given the existence of the mandatory death penalty in several Singapore statutes, the Court was of the opinion that it could not treat the alleged customary international law rule prohibiting inhuman punishment as part of Singapore common law. Also, even if a rule has been incorporated in this manner, it may be overridden by subsequent inconsistent statutory provisions. Moreover, the Court did not accept the contention that customary international law should be conferred constitutional status by being read into the meaning of *law* in Article 9(1) as this is clearly not in accordance with the normal hierarchy of Singapore law. At any rate, whether there is in fact a customary international law rule that prohibits the mandatory death penalty is also far from certain. The Court held that there is a lack of extensive and uniform state practice that supports the contention that customary international law prohibits the mandatory death penalty as an inhuman punishment. ### Article 12(1) challenge Agreeing with the Attorney General's submission, the Court of Appeal held that the mandatory death penalty satisfied the reasonable classification test used to assess the constitutionality of legislation with respect to Article 12(1) of the Constitution. Reiterating the Privy Council's holding in *Ong Ah Chuan*, the Court found that the 15-gram differentia used in the MDA to determine whether the death penalty should be imposed could not be said to be purely arbitrary, and bore a rational relation to the social object of the MDA which was to prevent the growth of drug addiction in Singapore by stamping out the illicit drug trade. There was nothing unreasonable in the legislature concluding that a wholesale dealer operating higher up in the distributive pyramid required a stronger deterrent than smaller scale dealers. It was up to the legislature to determine where the appropriate quantitative boundary was to lie between the two classes of dealers. The Court also held that the quantity of addictive drugs trafficked was broadly proportionate to both the quantity of addictive drugs brought on to the market, as well as the likely harm suffered by society as a result of the offender's crime. On the other hand, the court acknowledged that using a 15-gram differentia might not be the best method of furthering the social object of the MDA. However, the matter of what would constitute a better differentia was one which reasonable people may not necessarily agree on, and so this was a question of social policy best left to the legislature, not the judiciary. Addressing Yong's contention that in reality the mandatory death penalty only had a limited deterrent effect on drug traffickers, the Court said that it was not within its purview to determine the mandatory death penalty's efficacy as a deterrent to drug trafficking. Such an issue was a question of policy and should be left to the legislature to decide. If any changes to the mandatory death penalty or the death penalty in general were to be effected, these had to be done by the legislature and not by the Judiciary under the pretence of constitutional interpretation. In addition, while the court acknowledged it could be argued that there was insufficient evidence of the mandatory death penalty's deterrent effect on serious offences like murder, it could also be said there was insufficient evidence that the mandatory death penalty did not have a deterrent effect. The Court disagreed with Yong's fifth argument that an offender who did not know the amount of pure diamorphine in the substance he was trafficking had not voluntarily assumed the risk of trafficking. A drug trafficker would know his act was illegal and that he would be punished if caught, regardless of his knowledge of the precise amount of pure diamorphine he was trafficking. Yong's sixth argument was also dismissed, the Court explaining that the reason why the trafficking of a quantity of diamorphine greatly exceeding the 15-gram threshold did not incur a more severe sentence was because it would be impossible to impose a punishment more severe than the death penalty. ## Further developments ### Judicial review of the granting of clemency Following the delivery of the Court of Appeal's judgment on 14 May 2010, Yong's lawyer M. Ravi filed an application in the High Court for leave to challenge the clemency process by way of [judicial review](/wiki/Judicial_review). He sought, among other things, a [declaration](/wiki/Declaration_(law)) that it is the President and not the [Cabinet](/wiki/Cabinet_of_Singapore) that has discretion as to whether Yong's petition for clemency should be granted, and an order to grant Yong an indefinite stay of execution. Legal observers opined that the move was unprecedented, as petitions for judicial review are usually reserved for executive actions and not processes entrenched in the Constitution. The argument was based on comments by [K. Shanmugam](/wiki/K._Shanmugam), the [Minister for Law](/wiki/Ministry_of_Law_(Singapore)), at a dialogue session on 9 May 2010. When asked whether Yong's case would affect Singapore's laws on the mandatory death penalty, the Minister had replied: \"Yong Vui Kong is young. But if we say, 'We let you go', what's the signal we're sending? ... We are sending a signal to all drug barons out there: Just make sure you choose a victim who's young or a mother of a young child and use them as the people to carry drugs into Singapore.\" Commenting to the media, Ravi said that if the clemency decision was indeed taken by the Cabinet and not the President, then since Shanmugam was a member of the Cabinet and these statements were made while Yong's case was *[sub judice](/wiki/Sub_judice)*, his remarks implied a prejudgment of Yong's appeal for clemency. The Ministry of Law rejected as \"incorrect\" Ravi's remarks that the clemency process was flawed. It stated that as the [Government](/wiki/Government_of_Singapore)'s policy on the death penalty for drug offences was a \"matter of public importance\", the Government was entitled to comment on it. The Law Ministry also clarified that Shanmugam's comments were merely concerned with the Government's legislative policy and whether it would change, and that the Minister had not commented on any specific issue which was before the Court of Appeal at the time, or on what the outcome of the judgment should be. In a judgment delivered on 13 August 2010, Justice [Steven Chong](/wiki/Steven_Chong) dismissed the application, ruling that the power to grant a pardon lies with the Cabinet and not the President. This is because Article 21(1) of the Singapore Constitution provides that the President, by default, is to act in accordance with the advice of the Cabinet or a Minister acting under the general authority of the Cabinet, while Article 21(2) lays down an exhaustive range of exceptions from this rule. In situations where the President is empowered to act in his own discretion, the relevant constitutional provisions expressly use the phrase *acting in his discretion* in reference to the President. However, Article 22P states that the President may grant pardons \"on the advice of the Cabinet\", which indicates a contrary intention. The High Court also rejected Yong's request for an indefinite stay of execution. It held that the test of [apparent bias](/wiki/Doctrine_of_bias_in_Singapore_law) that applies to the judiciary does not govern the executive, as the executive is accountable to the electorate through the [election process](/wiki/Elections_in_Singapore). Furthermore, a court of law is restricted to considering only the law and facts in making its judgment, but the executive is entitled to \"formulate and act in accordance with policy, which is wide-ranging by its very nature and difficult to evaluate in accordance with objective legal criteria\". On 4 April 2011, the Court of Appeal dismissed an appeal filed by Yong against the judgment. It affirmed the High Court's view that the President did not possess any personal discretion when exercising the clemency power, and was required to act in accordance with Cabinet's advice on the matter. This conclusion was evident from the wording of Article 22P(1) of the Constitution, the legislative history of the clemency power in Singapore, relevant case law, and the nature of the President's power in the Constitution. The Court also noted that both Yong and the Attorney-General agreed that the power of clemency was vested exclusively in the executive and was not justiciable on the merits, because of the doctrine of [separation of powers](/wiki/Separation_of_powers_in_Singapore) and established [administrative law principles](/wiki/Administrative_law_in_Singapore). Nonetheless, the use of the power could be judicially reviewed if it was exercised in bad faith for an extraneous purpose, or in a way that contravened constitutional protections and rights. In addition, the Court was of the opinion that the clemency process could not be regarded as having been tainted by a reasonable suspicion of bias due to the Law Minister's remarks. The Minister had merely been setting out the Government's policy of taking a tough approach towards serious drug trafficking offences by imposing a mandatory death penalty as a deterrent. In any case, the rule against bias should not be applied to ministers making public statements on government policy in the same way as it applies to judicial or quasi-judicial officers, otherwise no minister would be able to speak on any policy in public or in [Parliament](/wiki/Parliament_of_Singapore) without the statement being regarded as a predetermination of any decision relating to the policy that might have to be made subsequently. Even if the Law Minister's statements indicated that he intended not to grant clemency to Yong, this predetermination could not be attributed to other Cabinet ministers. The alternative view was untenable, as it would mean that once any minister spoke about the Government's policy on the death penalty in a way that showed predetermination of the issue, the entire Cabinet would be disentitled from advising the President on how he should exercise the clemency power. ### Actions taken by Malaysian Government and civil society groups Yong's lawyer urged the [Government of Malaysia](/wiki/Government_of_Malaysia) to take Yong's case to the [International Court of Justice](/wiki/International_Court_of_Justice) to determine whether Singapore's conduct has violated local and [international law](/wiki/Public_international_law). [Malaysian Foreign Minister](/wiki/Ministry_of_Foreign_Affairs_(Malaysia)) [Anifah Aman](/wiki/Anifah_Aman) subsequently sent an appeal for clemency on Yong's behalf to the Singapore Government in July 2010. Yong's case has aroused interest among Singaporean and Malaysian human rights activists. A Save Vui Kong campaign was formed jointly by the Civil Rights Committee of the Kuala Lumpur and Selangor Chinese Assembly Hall and human rights group [SUARAM](/wiki/SUARAM). On 24 August 2010, a petition calling on President [S.R. Nathan](/wiki/Sellapan_Ramanathan) to spare Yong's life – bearing 109,346 signatures gathered from petitioners in Sabah, other parts of Malaysia, Singapore, and online – was delivered to the [Istana](/wiki/Istana_(Singapore)), the President's official residence. ### Commutation of Yong's death sentence In January 2013, the Singapore government changed its laws to remove the mandatory death penalty for drug traffickers who merely acted as couriers, or had mental illnesses at the time of their offences. Yong was qualified for re-sentencing since he was a courier in his case, and after his case was sent back to the original trial judge Choo Han Teck for review, Yong's death sentence was commuted to life imprisonment and 15 strokes of the cane in November 2013. ## Notes ### Cases - *[Woodson v. North Carolina](/wiki/Woodson_v._North_Carolina)* (/wiki/List_of_United_States_Supreme_Court_cases,_volume_428) [U.S.](/wiki/United_States_Reports) 280 (1976), [Supreme Court](/wiki/Supreme_Court_of_the_United_States) (United States). - *[Ong Ah Chuan v. Public Prosecutor](/wiki/Ong_Ah_Chuan_v._Public_Prosecutor)* UKPC 32, A.C. 648, [1979–1980] S.L.R.(R.) 710, [Privy Council](/wiki/Judicial_Committee_of_the_Privy_Council) (on appeal from Singapore). - *Mithu v. State of Punjab* A.I.R. 1983 S.C. 473, [Supreme Court](/wiki/Supreme_Court_of_India) (India). - *Public Prosecutor v. Yong Vui Kong* SGHC 4, [High Court](/wiki/High_Court_of_Singapore) (Singapore) (\"*Yong Vui Kong* (2009, H.C.)\"). - *Yong Vui Kong v. Public Prosecutor* 2 S.L.R. [*Singapore Law Reports*] 192, [Court of Appeal](/wiki/Court_of_Appeal_of_Singapore) (Singapore) (\"*Yong Vui Kong* (2010, C.A.)\"). - *Yong Vui Kong v. Public Prosecutor* SGCA 20, 3 S.L.R. 489 at 497, para. 7, C.A. (Singapore) (\"*Yong Vui Kong* (substantive appeal)\"). - *[Yong Vui Kong v. Attorney-General](/wiki/Yong_Vui_Kong_v._Attorney-General)* SGHC 235, 1 S.L.R. 1, H.C. (Singapore) (\"*Yong Vui Kong v. AG* (H.C.)\"). - *[Yong Vui Kong v. Attorney-General](/wiki/Yong_Vui_Kong_v._Attorney-General)* SGCA 9, 2 S.L.R. 1189, C.A. (Singapore) (\"*Yong Vui Kong v. AG* (C.A.)\"). ### Legislation - [Constitution of the Republic of Singapore](/wiki/Constitution_of_Singapore) (1999 Reprint). - [Misuse of Drugs Act](/wiki/Misuse_of_Drugs_Act_(Singapore)) (Cap. 185, 2001 Rev. Ed.) (\"MDA\"). ### Articles - Ganesh, Aravind (2010), \"Insulating the Constitution: *Yong Vui Kong v Public Prosecutor* SGCA 20\" (PDF), *[Oxford University Commonwealth Law Journal](/wiki/Oxford_University_Commonwealth_Law_Journal)*, **10** (2): 273–292, [doi](/wiki/Doi_(identifier)):10.5235/147293410794895304, [hdl](/wiki/Hdl_(identifier)):11858/00-001M-0000-0029-6F3F-E, [S2CID](/wiki/S2CID_(identifier)) 218770331. - Hor, Michael (2004), \"The Death Penalty in Singapore and International Law\" (PDF), *Singapore Year Book of International Law*, **8**: 105–117. - Lee, Jack Tsen-Ta (2011), \"The Mandatory Death Penalty and a Sparsely Worded Constitution\", *Law Quarterly Review*, **127**: 192–195, archived from the original on 27 September 2012, retrieved 9 September 2011. - Lim, C.L. (2005), \"The Constitution and the Reception of Customary International Law: *Nguyen Tuong Van v Public Prosecutor*\", *Singapore Journal of Legal Studies*, **1**: 218–233, [SSRN](/wiki/SSRN_(identifier)) 952611. - McDermott, Yvonne (2010), \"*Yong Vui Kong v. Public Prosecutor* and the Mandatory Death Penalty for Drug Offences in Singapore: A Dead End for Constitutional Challenge?\", *International Journal on Human Rights and Drug Policy*, **1**: 35–52, [SSRN](/wiki/SSRN_(identifier)) 1837822. - Tey, Tsun Hang (2010), \"Death Penalty Singapore-Style: Clinical and Carefree\", *Common Law World Review*, **39** (4): 315–357, [doi](/wiki/Doi_(identifier)):10.1350/clwr.2010.39.4.0208, [S2CID](/wiki/S2CID_(identifier)) 147148491. - [Thio, Li-ann](/wiki/Thio_Li-ann) (2010), \"'It is a Little Known Legal Fact': Originalism, Customary Human Rights Law and Constitutional Interpretation: *Yong Vui Kong v. Public Prosecutor*\", *Singapore Journal of Legal Studies*: 558–570, [SSRN](/wiki/SSRN_(identifier)) 1802666. ### Books - Tan, Kevin Y[ew] L[ee] (2011), \"Fundamental Liberties I: Protection of Life & Liberty\", *An Introduction to Singapore's Constitution* (rev. ed.), Singapore: Talisman Publishing, pp. 146–165, [ISBN](/wiki/ISBN_(identifier)) 978-981-08-6456-9. - Tan, Kevin Y[ew] L[ee] (2011), \"Fundamental Liberties II: Slavery & Forced Labour • Equality • Protection against Retrospective Criminal Laws • Double Jeopardy\", *An Introduction to Singapore's Constitution* (rev. ed.), Singapore: Talisman Publishing, pp. 166–185 at 178–185, [ISBN](/wiki/ISBN_(identifier)) 978-981-08-6456-9. - Tan, Kevin Y[ew] L[ee]; [Thio, Li-ann](/wiki/Thio_Li-ann) (2010), \"Fundamental Liberties and Human Rights: An Introduction\", *Constitutional Law in Malaysia and Singapore* (3rd ed.), Singapore: [LexisNexis](/wiki/LexisNexis), pp. 690–734, [ISBN](/wiki/ISBN_(identifier)) 978-981-236-795-2. - Tan, Kevin Y[ew] L[ee]; Thio, Li-ann (2010), \"Protection of Life & Liberty\", *Constitutional Law in Malaysia and Singapore* (3rd ed.), Singapore: [LexisNexis](/wiki/LexisNexis), pp. 735–794, [ISBN](/wiki/ISBN_(identifier)) 978-981-236-795-2. - Tan, Kevin Y[ew] L[ee]; Thio, Li-ann (2010), \"The Right to Equality & Equal Protection\", *Constitutional Law in Malaysia and Singapore* (3rd ed.), Singapore: [LexisNexis](/wiki/LexisNexis), pp. 871–970, [ISBN](/wiki/ISBN_(identifier)) 978-981-236-795-2.\n",
  "language": "en",
  "processed_at": "2026-01-12T12:16:00.641693",
  "title": "Yong Vui Kong v Public Prosecutor",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Yong_Vui_Kong_v_Public_Prosecutor"
}