{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:16:08.734723"
  },
  "content": "LGBT organization in Singapore**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **may contain excessive or inappropriate references to self-published sources**. Please help improve it by removing references to unreliable sources where they are used inappropriately. *(August 2011)* *(Learn how and when to remove this message)*This article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"Young Out Here\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(August 2011)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Young Out Here** (**YOH**) is a [gay](/wiki/Gay), [lesbian](/wiki/Lesbian), [bisexual](/wiki/Bisexuality) and [queer](/wiki/Queer) youth community group based in [Singapore](/wiki/Singapore). The community group is the first and longest running [non-profit](/wiki/Nonprofit_organization) [volunteer](/wiki/Volunteering) group of its kind in Singapore. ## History Young Out Here was established in 2006 by four teenagers, and started out as a support group for lesbian, gay, bisexual and queer youths between the ages of 16 and 21. The group provides a safe, [secular](/wiki/Secularity) place for these people to gather together and to discuss LGBT issues that they may face in life. The group begun due to the lack of focus on youths in the community during those days. The group's inaugural run of their [support group](/wiki/Support_group) begun in January 2007, with other runs following thereafter. - *Young Out Here's first run (YOH1)* commenced in January 2007 and concluded in July 2007. - *Young Out Here's second run (YOH2)* commenced in December 2007 and concluded in June 2008. - *Young Out Here's third run (YOH3)* commenced in November 2008 and concluded in April 2009. - *Young Out Here's fourth run (YOH4)* commenced in May 2010 and concluded in September 2010. - *Young Out Here's fifth run (YOH5)* commenced in March 2011 and concluded in August 2011. - *Young Out Here's sixth run (YOH6)* commenced in August 2012 and concluded in February 2013. - *Young Out Here's seventh run (YOH7) and eighth run (YOH8)* commenced simultaneously in June 2013 and concluded in December 2013. - *Young Out Here's ninth run (YOH9)* commenced in May 2014 and concluded on 8 November 2014. - *Young Out Here's tenth run (YOH10)* will commence in July 2015. Young Out Here used *yOUTh* as their organizational acronym until 2009, when it was simplified to *YOH*. During this period, the group also began its venture into event organization, starting with \"Labels and Love\", and also begun publishing the group's blog. Due to this expansion of focus, the group now refers to itself as a \"queer youth community group\" instead of the previous \"queer youth support group\". In May 2014, the group officially launched its official website. As of 2019, the group is inactive and they have ceased their activities. Their website is now no longer accessible. ## Support Groups ### YOH Young Out Here's core program remains to be the closed support group for gay, lesbian, bisexual and queer youths who are 16 to 21 years old. The objective of the support group program is to provide gay, lesbian, bisexual and queer youths in Singapore a safe, secular, and inclusive environment for them to meet like-minded individuals, where they can build healthy relationships, build healthy self identities, and learn about the community at large. Each YOH run consists of 13 sessions, each covering various issues related to gay, lesbian, bisexual and queer youths. Each session is limited to 10 to 15 participants with balanced number of males and females to provide a gender neutral environment. ## Events ### Labels and Love *Labels and Love* was a forum and workshop organized by Young Out Here in March 2009, with the help of [Oogachaga](/wiki/Oogachaga). The workshop involved a personal sharing of the experiences of a mother and her gay son. An approximate number of 40 participants attended the event. ### Outrace *Outrace*, jointly organized by Young Out Here, Oogachaga and dirrtyremixes, was held in August 2009 to coincide with the annual [IndigNation](/wiki/IndigNation). In this event, teams were set to compete against each other, racing to various LGBT related locations in Singapore, a la [The Amazing Race](/wiki/The_Amazing_Race). They had to overcome challenges and obstacles at each pit-stop. These were designed with educating the teams about Singapore's LGBT history in mind. The first team to arrive at the final pit-stop won a prize. ### Ties that Bind *Ties that Bind* was a workshop organized by Young Out Here in March 2011, with the help of Oogachaga. The theme of this workshop was Coming Out; as a lesbian, gay, bisexual and/or queer youth to family members. The objective was to create a platform for queer youths to discuss and share ideas pertaining to the theme, rather than the advocation of coming out, as participants each have different situations and comfort levels to work with. ### \"I AM\" Project On [Pink Dot](/wiki/Pink_Dot_SG) 2011, Young Out Here set up a booth at Hong Lim Park in a project where people are invited to pen down their thoughts, identity, or a statement beginning with \"I am\". They may then choose to take a photo of themselves with their statement, which may be uploaded to the group's social media page in the user's discretion. ### \"Light Up Your Dream\" Project Young Out Here was invited as one of the 19 community groups to set up a booth at Hong Lim Park for Pink Dot 2012. This marks the second year that Young Out Here organized an event on Pink Dot. For this project, the event-goers are invited to write down their hopes and dreams down, and use a flexible fluorescent tube to tie their hopes and dreams on Young Out Here's makeshift glowing tree. ### Climb Every Mountain On 29 March 2013, Young Out Here invited [Cason Crane](/wiki/Cason_Crane), a youth mountaineer climbing the [Seven Summits](/wiki/Seven_Summits) in an effort to raise funds for [The Trevor Project](/wiki/The_Trevor_Project), to share his story with youths in [Singapore](/wiki/Singapore). ### Project \"We Are Not Afraid\" In June 2013, YOH upped the ante by building and painting a 9.6m x 2.4m large wall mural. The mural was covered in ‘bricks’ that symbolised the fears of today's LGBTQ youths. By removing these individual bricks, the mural was slowly revealed to showcase the hopes and dreams penned down by event-goers from the previous “Light Up Your Dreams” Campaign in Pink Dot 2012. One may think of it as a Berlin Wall of sorts for the LGBTQ youth of Singapore. ### Project \"Connecting Voices\" For PinkDot 2014, YOH gave PinkDot participants a chance to post LGBT-related questions on a specially designed ‘FAQ’ board and get responses in return from other participants at the event. Being inspired by the Japanese prayer structure, the project this year signifies a collective hope and support to each other. A lucky draw was also provided for two free tickets to *[The Laramie Project](/wiki/The_Laramie_Project)* play at the Singapore Repertory Theatre. ### YOH 10th Anniversary Exhibition Pinkdot 2015 was held on 13 June 2015 at Hong Lim Park. It marks the fifth year of PinkDot celebrations in Singapore. Coincidentally it was also the 10 year anniversary of YOH since their inception. To commemorate this anniversary and at the same time, educate others about what YOH does, an exhibition of YOH history was put up. Suggestions were also canvassed from the public on how YOH can improve going forward. For this, goodie bags of neon-pink Sticky candy were given away in exchange for the ideas. - LGBTQ portal - [LGBT rights in Singapore](/wiki/LGBT_rights_in_Singapore) - [List of LGBT organizations in Singapore](/wiki/List_of_LGBT_organizations_in_Singapore) - [List of LGBT rights organisations](/wiki/List_of_LGBT_rights_organisations) - Young Out Here Official Website Archived 4 February 2016 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:16:08.734424",
  "title": "Young Out Here",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Young_Out_Here"
}