{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:16:11.660670"
  },
  "content": "Department store located in Chinatown, Singapore **Yue Hwa Building** ([Chinese](/wiki/Simplified_Chinese_characters): 裕华大厦; [pinyin](/wiki/Pinyin): *Yùhuá dàshà*) is a historic building located at the junction of [Eu Tong Sen Street](/wiki/Eu_Tong_Sen_Street) and [Upper Cross Street](/wiki/Upper_Cross_Street) in [Chinatown](/wiki/Chinatown), [Singapore](/wiki/Singapore), next to [Chinatown MRT station](/wiki/Chinatown_MRT_station). Built by [Swan and Maclaren](/wiki/Swan_and_Maclaren) in 1927, it was then the tallest building in Chinatown and was known as **Nam Tin Building** (南天大厦), owned by Lum Chang Holdings. The building housed the six-storey Great Southern Hotel (the first Chinese hotel with a lift), along with a few shops and [cabarets](/wiki/Cabaret) that were popular among Chinese travellers. In 1993, Lum Chang Holdings sold the building to Hong Kong businessman Yu Kwok Chun, who converted it to the first Yue Hwa Chinese Products department store in Singapore in 1994. The renovation process, which conserved the exterior while adding features such as an atrium and waterfall to the interior, won the building the Architectural Heritage Award by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) in 1997. ## History ### Great Southern Hotel Also known as Nam Tin Hotel, the Great Southern Hotel in Singapore's Chinatown was built by [Swan and Maclaren](/wiki/Swan_and_Maclaren) in 1927. Started as a [boutique hotel](/wiki/Boutique_hotel), it was the tallest building in Chinatown when it was completed. It was also the first Chinese hotel in Singapore with a [lift](/wiki/Elevator). Its height also gave it an unfortunate reputation as the focal point of many suicide attempts in its early days, until the tall [Singapore Improvement Trust](/wiki/Singapore_Improvement_Trust) flats at Upper Pickering Street were built. Owned by Lum Chang Holdings, the building housing Great Southern Hotel was called \"Nam Tin\" in [Cantonese](/wiki/Cantonese), meaning \"southern sky\". This choice of name is curious because the Chinese's discovery of the sky around the southern celestial was relatively recent, when [Xu Guangqi](/wiki/Xu_Guangqi) interpreted European star charts. It is thus possible that this building in Singapore, a colonial port, has a name in homage of this turn of events. Besides the hotel, Lum Chang Holdings also leased out the building to several [tenants](/wiki/Leasehold_estate) who operated shops and other businesses. The L-shaped ground floor was partitioned for 8 of these shops. People commonly referred to the entire Nam Tin building as the Great Southern Hotel when the hotel subsequently became very popular. The Nam Tin Building became a major shopping hub for customers who found it fashionable to patronise the building's shops, outlets and [cabarets](/wiki/Cabaret). [Chinese operas](/wiki/Chinese_opera) used to be staged at the building as an occasional attraction. The Southern Cabaret, based in the Diamond Dragon Dance Palace on the fifth floor, was of particular extravagance, as this article in [The Straits Times](/wiki/The_Straits_Times) describes it: > *\"Dragon pillars studded with cut glass… constructed under the supervision of Miss Leong Sai Chan, former Shanghai movie star, the cabaret is an imitation of China's famed Peking palace. Beautifully coloured carvings of birds and animals of Chinese mythology decorate the walls of cabaret.\"* Operated by the [Cantonese](/wiki/Cantonese_people), the Great Southern Hotel catered more to Chinese travellers, including [celebrities](/wiki/Celebrity) from [Hong Kong](/wiki/Hong_Kong) and [China](/wiki/China). This was unlike the upmarket hotels like [Raffles Hotel](/wiki/Raffles_Hotel), [Goodwood Park Hotel](/wiki/Goodwood_Park_Hotel) and Adelphi Hotel which then accommodated mainly [Europeans](/wiki/Europe) and English-speaking visitors. As a boutique hotel with shops and entertainment outlets for rich Chinese [immigrants](/wiki/Immigrant), the Great Southern Hotel was considered as the \"Raffles Hotel of Chinatown\". Each room had its own ensuite shower and toilet, and was given a roomy feeling by the 4m high ceiling and cast iron casement windows. The latter let in far more light than the wooden windows commonly found on [shophouses](/wiki/Shophouse) in the-now Kreta Ayer [Conservation Area](/wiki/Conserved_areas_of_Singapore), which were largely in the Transitional and [Art Deco](/wiki/Art_Deco) styles. Celebrities, artists, and merchants enjoyed fine food, [opium](/wiki/Opium), and liquor at the Great Southern Hotel, which had novel Western pleasures, such as a disco ball specially imported from the USA. The allure of Western goods and traditions even extended to weddings held at the hotel. A prolific Chinese writer, Wu Sijing, held her 17-table wedding banquet there in 1952, and was photographed in a white [bridal dress](/wiki/Wedding_dress), with her husband in a white suit and [bowtie](/wiki/Bow_tie). This choice of dress would have been most unusual amongst mainland Chinese due to the nationalistic influence of [Mao-era](/wiki/Maoism) China, highlighting Singapore's confluence between Eastern and Western cultures, of which the hotel was at the forefront. Both in decor, and activities. The building and its tenants were such an anchoring presence in the area that Eu Tong Sen street was colloquially known as 南天前, or, \"In front of Nam Tin\". The pre-eminence of the Great Southern Hotel as an entertainment destination did not last. In 1956, the [Cathay Organization](/wiki/Cathay_Organisation) bought the adjacent [Majestic Theatre](/wiki/The_Majestic,_Singapore) and transformed it into an attraction that drew film stars from Hong Kong. Changing entertainment preferences, a depressed economy, and socio-political unrest also contributed to the decline of Chinese opera and dances at the hotel. The popularity of Chinese opera declined throughout the 1950s and 1960s, and by 1959, even famous wayang theatres just one block down the street, such as Heng Seng Peng and Heng Wai Sun were closed ([People's Park Complex](/wiki/People%27s_Park_Complex) was built over that spot). \"Taxi dancers\", so-named because these dancers-for-hire would hang around cabarets like waiting taxis, were also falling out of fashion with the introduction of [rock ’n’ roll](/wiki/Rock_and_roll) at dance clubs, a genre of music that was then becoming increasingly popular with youths. By the 1960s, these dances were the most popular form of entertainment for Singaporean youth, and the hotel's cabaret took a backseat. Nam Tin’s façade reflected this decline. Through the 1960s to 1980s, the large red \"Southern Cabaret\" signage that adorned the Eu Tong Sen Street-facing side of the building were removed, and branding of the building became more nondescript. The red hotel signage on the corner arch of the ground floor also faded; with the lack of maintenance, they were barely visible by 1988. The shops at the ground floor also changed with the clientele. While shopping there was once seen as fashionable, stalls selling common electrical appliances now took up most of the ground floor frontage. The rooftop balcony and loggia visibly fell into disuse, with half-collapsed banners that advertised events that had passed by a year ago. ### Yue Hwa Chinese Products In 1993, Lum Chang Holdings sold the building at a price of [S$](/wiki/S$)25 million to Yu Kwok Chun, who was the head of a Hong Kong-based [multinational corporation](/wiki/Multinational_corporation) with its [flagship](/wiki/Flagship) department store, [Yue Hwa Chinese Products Emporium](/wiki/Yue_Hwa_Chinese_Products_Emporium). The company, set up by Yu's father in 1959, is a global corporation of 35 companies involved in [investments](/wiki/Investment), [travel](/wiki/Travel) and general [trading](/wiki/Trade). Yue Hwa's three department stores in Hong Kong are popular with both Hong Kongers and [tourists](/wiki/Tourism_in_Hong_Kong). Besides [agricultural](/wiki/Agricultural) produce from various [provinces of China](/wiki/Provinces_of_China), the stores also sell [jade](/wiki/Jade) carvings, [handicrafts](/wiki/Handicraft), [antiques](/wiki/Antique) and medical products such as [ginseng](/wiki/Ginseng), [antlers](/wiki/Antler) and [cordyceps](/wiki/Cordyceps). In February 1994, the Great Southern Hotel ended its operations from the building as the hotel faced increasing competition in the [hospitality](/wiki/Hospitality) industry. At the time of its closure, the hotel was operating only 40 rooms that were equipped with a double-bed and a ceiling fan, catering mainly to budget travellers from [Malaysia](/wiki/Malaysia) and [Indonesia](/wiki/Indonesia). The other seven existing tenants of the building vacated their businesses after the building was sold, and were each paid a [compensation](/wiki/Damages) sum. As the 999-year [leasehold](/wiki/Leasehold) building has been [gazetted](/wiki/Gazette) by the [Urban Redevelopment Authority](/wiki/Urban_Redevelopment_Authority) (URA) for [architectural conservation](/wiki/Architectural_conservation), the new owner was asked to preserve the building's [façade](/wiki/Fa%C3%A7ade). There were, however, no similar restrictions on its interiors. [Renovation](/wiki/Renovation) works were carried out on the building from 1994 to 1995. The Nam Tin building was then converted into the Yue Hwa Chinese Products department store, and was renamed Yue Hwa Building. The department store was opened on 9 October 1996, and sells a range of traditional Chinese products including [herbs](/wiki/Herb), [medicines](/wiki/Medicine), [porcelain](/wiki/Porcelain), [furniture](/wiki/Furniture), [arts and crafts](/wiki/Handicraft), [garments](/wiki/Garment) and [textiles](/wiki/Textile). ## Architecture ### Original design Being one of the tallest buildings in Singapore in the early 20th century, the Great Southern Hotel was an important [landmark](/wiki/Landmark) of Chinatown. Designed by Swan and Maclaren, the [architectural style](/wiki/Architectural_style) of the Nam Tin Building was that of the [Modern Movement](/wiki/Modern_architecture). The building was designed to be strictly [functional](/wiki/Functionalism_(architecture)). The grey-coloured façade of the Great Southern Hotel seemed to consist only of the bare essentials, with ordinary designs like strong horizontal lines with angular [arches](/wiki/Arch) and simple [cornices](/wiki/Cornice). The building was fitted with steel frame windows, with metal railings and grills, which were considered fashionable in the 1930s. The [loggia](/wiki/Loggia) on the uppermost floor was a little lighter in colour with the use of [cast iron](/wiki/Cast_iron) [balustrades](/wiki/Baluster) and [brackets](/wiki/Bracket_(architecture)), and there was extensive use of green glass. The building was one of the first in Singapore to be built as an integral structure of [reinforced concrete](/wiki/Reinforced_concrete) slab and beam with [infill](/wiki/Infill_wall) brick wall. At six storeys, the Great Southern Hotel was the first Chinese hotel to have a lift. The original design accommodated offices on the first storey, the hotel on the second and third storeys, a restaurant on the fifth storey, and a [tea house](/wiki/Tea_house) on the [roof terrace](/wiki/Roof_terrace) as well as a cabaret. The restaurant on the fourth floor was later converted into the owner's office. The whole of the fifth floor was occupied by a then-well-known cabaret, the Southern Cabaret. Shops and entertainment outlets, including a [Hainanese](/wiki/Hainan) [kopitiam](/wiki/Kopitiam), were situated on the ground floor. ### Restoration The [architectural firm](/wiki/Architectural_firm) engaged for the S$25 million [restoration](/wiki/Building_restoration) project was O.D. Architects of [Bukit Pasoh Road](/wiki/Bukit_Pasoh_Road). In accordance with URA's conservation guidelines for Nam Tin Building, the architects [preserved](/wiki/Architectural_preservation) the building's [roof-top garden](/wiki/Roof_garden) and [balconies](/wiki/Balcony) facing Eu Tong Sen Street. The interior of the building were revamped to accommodate an open layout suitable for a department store. Non-structural interior walls were torn down. A new [atrium](/wiki/Atrium_(architecture)) was created by constructing a wall on the second storey, and could be used as an [exhibition hall](/wiki/Exhibition_hall). A four-storey high [waterfall](/wiki/Waterfall) was built at the back of the building, which has a new three-storey extension. A [stained glass](/wiki/Stained_glass) [skylight](/wiki/Window#Skylight) was used as an interface to join the old and new parts of the building. New [escalators](/wiki/Escalator) and lifts were added to serve all six floors of the building. As a result, total floor space was increased from 3,700 to 4,600 square metres (39,800 to 49,500 square feet), with 4,650 square metres (50,000 square feet) of [retail](/wiki/Retail) space created for use by the store. Together with the acquisition of the Nam Tin Building in 1993, Yue Hwa Chinese Products invested a total of S$100 million to set up its first store selling Chinese products in Singapore. For its conservation and restoration work, the Yue Hwa Building won URA's Architectural Heritage Award in 1997. - [The Majestic, Singapore](/wiki/The_Majestic,_Singapore) - Naidu Ratnala Thulaja (11 October 1999). \"Great Southern Hotel\". Singapore Infopedia, [National Library Board](/wiki/National_Library_Board). Archived from the original on 4 July 2007. Retrieved 18 September 2007. - Norman Edwards, Peter Keys (1996). *Singapore - A Guide to Buildings, Streets, Places*. Singapore: Times Books International. [ISBN](/wiki/ISBN_(identifier)) 9971-65-231-5. - Dhoraisingam S Samuel (1991). *Singapore's Heritage Through Places of Historical Interest*. Singapore: Elixir Consultancy Service. [ISBN](/wiki/ISBN_(identifier)) 981-00-3185-8. - Robert Powell (2004). *Singapore Architecture*. Singapore: Periplus Editions. [ISBN](/wiki/ISBN_(identifier)) 0-7946-0232-0. - Yue Hwa Chinese Products Archived 27 November 2006 at the [Wayback Machine](/wiki/Wayback_Machine)\n",
  "language": "en",
  "processed_at": "2026-01-12T12:16:11.660404",
  "title": "Yue Hwa Building",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Yue_Hwa_Building"
}