{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:16:13.399767"
  },
  "content": "Temple in Raffles Place, Singapore **Yueh Hai Ching Temple** (Traditional Chinese 粵海清廟, Simplified Chinese 粤海清庙), also known as the **Wak Hai Cheng Bio** from its [Teochew](/wiki/Teochew_dialect) pronunciation, is a Chinese temple in [Singapore](/wiki/Singapore) located in [Raffles Place](/wiki/Raffles_Place), Singapore's [central business district](/wiki/Downtown_Core). The temple, whose name literally means \"Temple of the Calm Sea\", was the first stop for Chinese immigrants to Singapore in the early 19th century. The temple was gazetted as a [national monument of Singapore](/wiki/National_monuments_of_Singapore) in 1996. It had also won various awards for its heritage and conservation efforts. ## History Multiple narratives provide conflicting accounts on the date the temple was first constructed. Some traced the history of the temple to as far back as to 1738. The general consensus is that the temple was first put up in 1820 as a simple wood and [attap](/wiki/Attap) temple. A research study to verify details given in oral traditions published by Phua Chye Long (潘醒农) in *Teo-chews in Malaya* (马来亚潮侨通鉴) in 1950 found that the writings of Stamford Raffles and William Farquhar indicate that the British found Temenggong Abdul Rahman with 400 to 500 residents in Singapore in January 1819. Another member of the 1819 expedition party, Captain John Crawford, recalled in his diary an encounter with “upwards of 100” of Chinese. British colonial documentations revealed that Temenggong Abdul Rahman had provided these Chinese who were Teochews the cost and expenses of opening gambier plantations at Mount Stamford (now Pearl’s Hill) prior to British arrival. He had also “in some instances” advanced money to the Teochew cultivators on the understanding he would be repaid in the form of gambier or other produce. Farquhar had the impressions that the Temenggong’s interests in these plantations were represented by a brother-in-law of his named Baba Ketchil and the first Captain China of Singapore, a Teochew merchant named Tan Heng Kim (陈亨钦), was “one of the principal persons concerned”. The first Teochews in Singapore were led by Tan Heng Kim, who was from Siam, and a second merchant named Heng Hong Sung (王丰顺) from Ampou town in Chaozhou, China. Together, they founded the [Yueh Hai Ching Temple](/wiki/Wak_Hai_Cheng_Bio) on the south bank of the Singapore River. In 1826, pioneer of Man Say Soon Company, Lim Poon erected a shrine on the same site on Philip Street with a 999-year lease. It was managed by a board of trustees consisting of 14 members. The shrine was constructed so that sailors sailing between Singapore and China during the 19th century could offer their prayers and gratitude for their safe journey. This is reflected in the temple's name, which translates as “Temple of the Calm Sea”. Philip Street was once near the sea, so that sailors could head to the temple immediately after docking. Due to land reclamation, the temple was effectively distanced from the shore. When the [Ngee Ann Kongsi](/wiki/Ngee_Ann_Kongsi) was formed in 1845, it took over the management of the temple from Ban See Soon Kongsi. Between 1852 and 1855, the present temple was constructed. In 1895, the Ngee Ann Kongsi submitted a building plan which called for substantial rebuilding of the temple. By the late 19th century, the Teochews were the second largest and most influential of the Chinese dialect groups after the Hokkiens. Besides being a place of worship, Yueh Hai Ching Temple also acted as a community centre and a meeting place. In 1907, the temple was honoured with a *bian e [zh]*, an imperial plaque, from [Emperor Guangxu](/wiki/Guangxu_Emperor) of the [Qing Dynasty](/wiki/Qing_dynasty). According to historian Pan Xing Nong, the president of Ngee Ann Association had called for prayers at the temple for the impending [World War I](/wiki/World_War_I), reflecting the temple's important role in the everyday life of the Teochew community. It was where people socialized and exchanged news. It served as a place of congregation for immigrants from the same province to provide mutual support for each other. Further restoration was carried out between 1995 and 1997 (URA, 1997). On 28 June 1996, the temple as gazetted as a national monument of Singapore. The latest round of restoration was officially carried out from 2011 to 2014. However, study of the temple structure for restoration purposes commenced a few years before 2011 (Personal interview with Dr. Yeo Kang Shua). This restoration is highly acclaimed. The restoration and conservation earned the temple various awards, the Award of Merit at the 2014 [UNESCO Asia Pacific Heritage Awards](/wiki/UNESCO_Asia_Pacific_Heritage_Awards), 2014 Urban Redevelopment Authority's Architectural Heritage Awards and 2013 National Architecture Institute of China's Vernacular Architecture Award ## Architectural features Covering a total floor area of 1440 square meters, the Yueh Hai Ching Temple was divided into two temples, each with its own entrance. The right temple is dedicated to Xuan Tian Shang Di, otherwise known as Duo Lau Yah. The left temple is dedicated to Tian Hou Sheng Mu, otherwise known as Ma Zu. The Xuan Tian Shang Di is a god worshipped by the Taoist. It is very much respected and worshipped by the secret societies in 19th Century. Mazu is worshipped as she guides ships to safety in times of peril. The Yueh Hai Ching Temple is an expression of a Taoist temple of Chinese architecture. ### Orientation An important feature of classical [Chinese architecture](/wiki/Chinese_architecture) is its attention to the concept of orientation, which is developed into a special branch of art called [Feng Shui](/wiki/Feng_Shui). Buildings invariably face south or a little to the east. Yueh Hai Ching Temple is orientated to the southeast (Figure 6), which allows it to take advantage of the southeasterly winds and sunshine to provide the people living in the halls and courtyards with a pleasant micro-climate. ### Organisation of space #### Symmetrical layout One of the characteristics of classical Chinese architecture is the symmetrical structuring of the plan and elevation. Yue Hai Ching Temple has asymmetrical layout. #### Enclosed courtyard Courtyards and [gardens](/wiki/Chinese_garden) as visual components of Chinese architecture. Upon passing through the front entrance gate, the large forecourt gives visitors a panoramic view of the entire temple. The courtyard of Yueh Hai Ching Temple are enclosed by the walls and buildings around it, takes on a special introverted quality. The seclusion of the courtyard, separated from the outside world, forms a world by itself. The stone-paved courtyard provides abundant supplies of air and light for interior space. ### Elaborated roofscape The roof of the temple of Xuan Tian Shang Di has ridge ornaments over the nave in the form of two dragons flanking a blazing pearl, which is lifted on a metal rod. To the ancient Chinese, the dragon is the emblem of guardianship and vigilance and the symbol of strength, authority and justice. The roof of the temple of Mazu has a ridge design composed of dragons guarding the city against evil influences and were emblematic of geomantic power to revert evil forces into beneficial energy. Both roofs have the most unusual ornaments of complicated layouts of one- and two-storey mini-structures and human figurines. They are laid in such a way as to depict clusters of buildings within a Chinese town. In this temple, not only is the ridge extremely crowded with dragons and miniature models of dwellings, the copings, gable ends and hips are also adorned with all kinds of structures of pagodas, sheds, dwellings and niches. Human figurines area displayed everywhere, depicting scenes from Chinese operas which illustrate the courageous and meritorious deeds of the gods and ancient heroes of Chinese legend. These figures were created using a traditional technique known as cut-and paste porcelain shard work (嵌瓷 or 剪瓷雕). Wires and rods are used to form armatures around which a cement-like lime base is formed of either limestone powder or seashell powder. The limp is mixed with sand and help wool to form the substance onto which porcelain shards are set, providing a glazed sheen which gives a smooth and vibrant aesthetics. ### Exposure of structural element The support system of the massive roof timbering is visible in Yueh Hai Ching Temple. The exposed wooden structural truss are of highly decorated elements. The carvings on the beams are engraved in many different layers, with the most dramatic being the pierced-relief carvings. This style of carving is more three-dimensional. Not only the wood carvings are exceptionally detailed, they are also decorated in gold foil and paint. ### Colour Yellow is the symbol of earth, the property of the Emperor. As such, it is often regarded as a symbol of grandeur, power and state. In the temple, gold (instead of yellow) is used on roof trusses, brackets, eaveboards, Door Gods and he Chinese characteristics of plaques. Blue, the colour of sky, is also an Imperial colour which signifies the colour of the east. In the temple, blue is used for decorative painted patterns on beams and background colours of plaques. Red is associated with prosperity and good fortune. It is also associated with the ‘yang’ principle of the sun. happiness and the south. In the temple, red is used on roof purlins, trusses and doors. Green, which signifies the officials of lower rank, is associated with the water element. In the temple, green is used on roof rafters, roof tiles of the boundary walls and background colour of the plaques. ## Cultural artifacts Yueh Hai Ching Temple contains 19 temple plaques, 11 sets of couplets, 2 stone inscriptions, 1 bronze inscriptions, 2 bronze bells, 5 inscribed beams, 2 ceremonial placards and 1 “cloud coard” wooden chime. Four censers and one plaque are in the collection of Ngee Ann Kongsi. One of the stone censor may date to 1819. The temple was presented with an imperial plaque from Emperor Guangxu in 1899. Yueh Hai Ching Temple is one of the only two temples in Singapore being given this honour, the other being [Thian Hock Keng](/wiki/Thian_Hock_Keng). The signboard which reads “Auspicious Clouds above the Sea at Dawn” (曙海祥雲; Shǔ hǎi xiáng yún), is now hung at the Mazu temple. ### Citations ### Bibliography - National Heritage Board (2002), *Singapore's 100 Historic Places*, Archipelago Press, [ISBN](/wiki/ISBN_(identifier)) 981-4068-23-3. - Lee Geok Boi (2002), *The Religious Monuments of Singapore*, Landmark Books, [ISBN](/wiki/ISBN_(identifier)) 981-3065-62-1. - Preservation of Monuments Board, *Know Our Monuments*. - Yeo, Kang Shua (2021). *Divine custody a history of Singapore's oldest Teochew temple*. Singapore. [ISBN](/wiki/ISBN_(identifier)) 978-981-325-201-1. [OCLC](/wiki/OCLC_(identifier)) 1309128078.`{{cite book}}`: CS1 maint: location missing publisher (link) - Yueh Hai Ching Temple - Singapore eCitizen website - National Heritage Board website 1°17′04.2″N 103°50′57.6″E﻿ / ﻿1.284500°N 103.849333°E﻿ / 1.284500; 103.849333\n",
  "language": "en",
  "processed_at": "2026-01-12T12:16:13.399540",
  "title": "Yueh Hai Ching Temple",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Yueh_Hai_Ching_Temple"
}