{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:15:04.483525"
  },
  "content": "Japanese photographer **Yōsuke Yamahata** (山端 庸介, *Yamahata Yōsuke*; August 6, 1917 – April 18, 1966) was a Japanese photographer best known for extensively photographing [Nagasaki](/wiki/Nagasaki,_Nagasaki) the day after [it was bombed](/wiki/Atomic_bombings_of_Hiroshima_and_Nagasaki). ## Biography Yamahata was born in [Singapore](/wiki/Singapore) on 6 August 1917; his father, Shōgyoku Yamahata (山端祥玉, later to become known as a photographer) had a job there related to photography.[notes 1] He went to Tokyo in 1925 and eventually started at [Hosei University](/wiki/Hosei_University) (Tokyo) but dropped out in 1936 to work in G. T. Sun (ジーチーサン商会, *Jīchīsan Shōkai,* aka Graphic Times Sun), a photographic company run by his father. (He would become its president in 1947.) From 1940, Yamahata worked as a military photographer in China, [Taiwan](/wiki/Taiwan), [French Indochina](/wiki/French_Indochina) and [Singapore](/wiki/Singapore) and elsewhere in Asia outside Japan; he returned to Japan in 1942. ## Photography of immediate after-effects the Nagasaki atomic bombing In July 1945 Yamahata was requisitioned for a military journalist and dispatched to a department in [Hakata](/wiki/Hakata) on 1 August. He took up his new post of the department on 6 August, the day of Hiroshima bombing. On 9 August, 1945 it was reported in Japan that US bombers dropped an atomic bomb on Nagasaki and after it 5 military journalists in the department including Yamahata were commanded to go to Nagasaki to photograph its devastating scenes. On a day after the [Nagasaki bombing](/wiki/Atomic_bombings_of_Hiroshima_and_Nagasaki#Nagasaki), Yamahata reached the outskirt of Nagasaki to begin to photograph the devastation. Over a period of about twelve hours he took around a hundred exposures; by late afternoon, he had taken his final photographs near a [first aid](/wiki/First_aid) station north of the city. In a single day, he had completed the only extensive photographic record of the immediate aftermath of the [atomic bombing](/wiki/Nuclear_weapon) of either [Hiroshima](/wiki/Hiroshima) or Nagasaki. ## Publication Yamahata's photographs appeared swiftly in Japan, for example in the August 21 issue of *[Mainichi Shinbun](/wiki/Mainichi_Shimbun).* After the [GHQ](/wiki/Supreme_Commander_of_the_Allied_Powers)'s restrictions on coverage of the effects of the atomic bomb were lifted earlier in 1952, his photographs of Nagasaki appeared in the September 29 issue of *[Life](/wiki/Life_(magazine)).* The same year, they appeared in the book *Kiroku-shashin: Genbaku no Nagasaki.* One which was used in *Life,* also appeared in the 1955 exhibition and book \"[The Family of Man](/wiki/The_Family_of_Man)\" an exhibition created for [The Museum of Modern Art](/wiki/Museum_of_Modern_Art) by [Edward Steichen](/wiki/Edward_Steichen), which was seen by 9 million visitors worldwide. One of the less graphic, but more affecting images, it depicted a bewildered little boy, clutching a rice ball, with shrapnel cuts to the face. The head-and-torso enlargement was cropped tightly from a negative that had also showed his mother, also with facial wounds, standing behind, against a background of railway tracks. ## Illness and death Yamahata became violently ill in 1965, on his forty-eighth birthday and the twentieth anniversary of the [bombing of Hiroshima](/wiki/Atomic_bombings_of_Hiroshima_and_Nagasaki). He was diagnosed with terminal cancer of the [duodenum](/wiki/Duodenum). He died of the cancer on 18 April 1966 and was buried at Tama Cemetery, Tokyo. ## Preservation and ongoing circulation of Yamahata's Nagasaki images Restoration work was done on Yamahata's negatives after his death. An exhibition of prints, \"Nagasaki Journey\", traveled to San Francisco, New York, and Nagasaki in commemoration of the 50th anniversary of the bombing. Yamahata's photographs of Nagasaki remain the most complete record of the atomic bombing as seen immediately after the bombing. *[The New York Times](/wiki/The_New_York_Times)* has called his photographs \"some of the most powerful images ever made\". ## Gallery ## Books of Yamahata's works - *Kiroku-shashin: Genbaku no Nagasaki* (記録の写真：原爆の長崎). Daiichi Shuppansha, 1952. - *Genbaku no Nagasaki* (原爆の長崎). Tokyo: Gakufū Shoin, 1959. - *Nagasaki Journey: The Photographs of Yosuke Yamahata August 10, 1945.* San Francisco: Pomegranate, 1995. [ISBN](/wiki/ISBN_(identifier)) 0-87654-360-3. - *Nagasaki yomigaeru genbaku shashin* (長崎よみがえる原爆写真). Tokyo: NHK, 1995. [ISBN](/wiki/ISBN_(identifier)) 4-14-080231-6. - (in Japanese) *Yamahata Yōsuke* (山端庸介). Nihon no shashinka 23. Tokyo: Iwanami, 1998. [ISBN](/wiki/ISBN_(identifier)) 4-00-008363-5. - [Yoshito Matsushige](/wiki/Yoshito_Matsushige) – Hiroshima photographer ## Notes ## Sources - (in Japanese) Hirakata (平方正昭). \"Yamahata Yōsuke\". *Nihon shashinka jiten* (日本写真家事典) / *328 Outstanding Japanese Photographers.* Kyoto: Tankōsha, 2000. [ISBN](/wiki/ISBN_(identifier)) 4-473-01750-8. Despite the English-language alternative title, all in Japanese. - *Kaku: Hangenki* (核：半減期) / *The Half Life of Awareness: Photographs of Hiroshima and Nagasaki.* Tokyo: Tokyo Metropolitan Museum of Photography, 1995. Exhibition catalogue; captions and text in both Japanese and English. Fifteen pages of Yamahata's photographs of Nagasaki; also works by [Ken Domon](/wiki/Ken_Domon), [Toshio Fukada](/wiki/Toshio_Fukada), [Kikujirō Fukushima](/wiki/Kikujir%C5%8D_Fukushima), [Shigeo Hayashi](/wiki/Shigeo_Hayashi), [Kenji Ishiguro](/wiki/Kenji_Ishiguro), [Shunkichi Kikuchi](/wiki/Shunkichi_Kikuchi), [Mitsugi Kishida](/wiki/Mitsugi_Kishida), [Eiichi Matsumoto](/wiki/Eiichi_Matsumoto), [Yoshito Matsushige](/wiki/Yoshito_Matsushige), [Shōmei Tōmatsu](/wiki/Sh%C5%8Dmei_T%C5%8Dmatsu), and [Hiromi Tsuchida](/wiki/Hiromi_Tsuchida). Text and captions in both Japanese and English. - (in Japanese) *Nihon no shashinka* (日本の写真家) / *Biographic Dictionary of Japanese Photography.* Tokyo: Nichigai Associates, 2005. [ISBN](/wiki/ISBN_(identifier)) 4-8169-1948-1. Despite the English-language alternative title, all in Japanese. - Photographs of Hiroshima and Nagasaki Archived 2007-10-29 at the [Wayback Machine](/wiki/Wayback_Machine) - Nagasaki Journey, The Photographs of Yosuke Yamahata, presented by the San Francisco Exploratorium\n",
  "language": "en",
  "processed_at": "2026-01-12T12:15:04.483191",
  "title": "Yōsuke Yamahata",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Y%C5%8Dsuke_Yamahata"
}