{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:16:23.547656"
  },
  "content": "Singaporean businessman (1953–2019) **Zeng Guoyuan** ([Chinese](/wiki/Simplified_Chinese_characters): 曾国原; [pinyin](/wiki/Pinyin): *Zēng Guóyuán*; [tsə́ŋ kwǒ ɥɛ̌n]; 1953 – 16 November 2019), also known as **Zeng Guoyan**, **Thomas Chan Hock Seng** and, erroneously, **Zeng Guoyung**, was a Singaporean businessman, philanthropist, author, [acupuncturist](/wiki/Acupuncturist) and [perennial candidate](/wiki/Perennial_candidate). Zeng entered politics in 1991, when he became a [Workers' Party](/wiki/Workers%27_Party_of_Singapore) member; thereafter he renounced his affiliation to the group and became a [perennial](/wiki/Perennial) candidate in Singaporean elections, albeit always dropping out of contention at the last minute. Zeng was also an active acupuncturist who arranged for global meetings and operated an acupuncture centre in Singapore, later changing his focus to selling healthcare products after a string of molestation lawsuits initiated by his patients. Zeng was diagnosed with terminal cancer in 2014; this necessitated the excision of his entire nose, which led to significant facial disfigurement, and he became a tissue paper peddler, abandoning his previous jobs. Zeng was found dead in [Geylang Bahru](/wiki/Geylang_Bahru), Singapore on 16 November 2019. ## Early life Zeng was born Chan Hock Seng[a] in 1953, the eldest son of a clerk and a homemaker. Zeng became estranged with his siblings following a dispute regarding their father's will. According to a March 1987 *[Straits Times](/wiki/The_Straits_Times)* report, Zeng's highest level of education was [secondary school](/wiki/Secondary_school), but Zeng himself claimed to have \"a Doctor in Science degree, a Doctor in Medicine degree and a PhD in Complementary Medicine\". Between 1977 and 1978, he was President of Dale Carnegie Alumni Association's Lion Chapter of Singapore, an oratorical society. ## Career ### Early career Zeng was once a safety officer at a [Shell](/wiki/Shell_Oil_Company) production platform at [Pulau Bukom](/wiki/Pulau_Bukom). He officially became a member of the Singapore-based political party Workers' Party (WP) on 18 August 1991 because \"the [PAP](/wiki/People%27s_Action_Party) government obviously wants an opposition in Parliament\", and was fielded as a candidate for the [Bukit Timah Single Member Constituency](/wiki/Bukit_Timah_Single_Member_Constituency) in the [1991 Singaporean general election](/wiki/1991_Singaporean_general_election). He netted a quarter of the 22,000 votes cast, losing out to the PAP's Wang Kai Yuen. Zeng decided to leave the party that year because, in his words, \"in politics, all the crows are black\". In a 1996 lawsuit he was involved in, Zeng stated that he contested the 1991 general election only to gain publicity for his acupuncture business. ### Perennial candidacy After leaving the Workers' Party, Zeng became a [perennial candidate](/wiki/Perennial_candidate) for election in Singapore. He ran for the Mountbatten Single Member Constituency during the [2006 Singaporean general election](/wiki/2006_Singaporean_general_election), but was unsuccessful. Believing himself to be ineligible for candidacy, Zeng decided not to take part in the [2011 Singaporean general election](/wiki/2011_Singaporean_general_election). He had been present at a nomination centre, with the relevant documents in hand, but upon being reminded of an offence he committed in 2009 he ripped them into pieces and stormed out of the venue while repeatedly underscoring that \"they have fixed me up\" and \"you (the reporters present) know what it is all about\" without any elaboration. A news anchor at scene observed that Zeng's nomination papers had been left blank all along. In May 2012, Zeng announced his intention to contest the [2012 Singaporean by-election](/wiki/2012_Singaporean_by-election), but did not complete the nomination process. Zeng alleged that he was informed that he could not contest because of an offence he had incurred four years ago – scolding two police officers with vulgarities, to which he argued it was his bird that committed the deed. It was later clarified in an official statement by the Singapore Elections Department that Zeng \"did not file his nomination papers\". During the [2013 Singaporean by-election](/wiki/2013_Singaporean_by-election), Zeng decided not to contest as he suspected a conspiracy against him, claiming that he first needed \"the President's pardon\". He also explained that he wanted to give in to candidates of higher caliber than him, adding that \"[fools rush in where angels fear to tread](/wiki/Fools_Rush_In_Where_Angels_Fear_to_Tread)\". In August 2015, he declared that he would be [contesting](/wiki/2015_Singaporean_general_election) the [Potong Pasir Single Member Constituency](/wiki/Potong_Pasir_Single_Member_Constituency), pledging to \"fight until the end\", but after less than a week he changed his mind, citing his being the only independent running, his good ties with [Chiam See Tong](/wiki/Chiam_See_Tong), and not wanting his participation to cause a [three-cornered-contest](/wiki/Three-cornered-contest) as reasons for his withdrawal. Furthermore, he revealed he could not have secured the [election deposit](/wiki/Deposit_(politics)#Singapore) alone and was relying on his \"fifteen compassionate backers\". ### Other ventures Having studied the subject in Hong Kong and Taiwan, Zeng was an acupuncturist, and organised acupuncture meet-ups[b] as the president of the World Acupuncture Voluntary Organisation (WAVO).[c] After Zeng published controversial and self-admittedly \"misleading\" advertisements of it in 1991, the 28th World Congress of Acupuncture and Complementary Medicine, which was supposed to have taken place in Singapore, changed its host country to the [Republic of China](/wiki/Republic_of_China). Zeng, in defence, cited \"miscommunication\" with the Medicina Alternativa Institute in Sri Lanka. He also blamed the local press for this happening and promptly left the Singapore Acupuncture Association. As a philanthropist, Zeng funded the construction of a [mosque](/wiki/Mosque) in an unspecified Bangladeshi village. Zeng was the founder of the Prof Zeng's Medical Centre, which used to be an [Upper Serangoon Road](/wiki/Upper_Serangoon_Road)-based acupuncture centre. It moved to [Toa Payoh](/wiki/Toa_Payoh) and its sole basis of operations became selling healthcare products, including slimming oil and a \"hair regrowth shampoo\" made of vegetable and chocolate. He also owned a [MacPherson](/wiki/MacPherson,_Singapore)-based store. He drew attention when he used photographs of President of Singapore [S. R. Nathan](/wiki/S._R._Nathan) to endorse his healthcare products in 2007. The act was deemed as \"outrageous\" by one Singaporean lawyer, who added that it may constitute [defamation](/wiki/Defamation). Zeng's Medical Centre folded after he was diagnosed with cancer. In 2002, Zeng self-published a book on the [September 11 attacks](/wiki/September_11_attacks), titled *Why The World Trade Centre Collapse So So Fast?* [*[sic](/wiki/Sic)*]. The work, which contains numerous references to the 1976 monster thriller *[King Kong](/wiki/King_Kong_(1976_film))*, was banned by the government upon its release. ### Media and public image Zeng's eccentric personality and mannerisms earned him considerable coverage in local media, and is frequently referred to as **Parrot Man**, a moniker that came about after Zeng blamed his pet parrot for committing a crime he was charged for. Benson Ang stressed the controversy surrounding Zeng, describing him as \"Toa Payoh's nutty professor\". Tessa Wong of *[The Straits Times](/wiki/The_Straits_Times)* acknowledged that his appearance during elections \"does add colour to what is otherwise a serious day\". Others facetiously dub him as an \"election veteran\" in Singapore while noting his tendency of not filing his nomination papers and his public antics; Ilsa Chan, writing for Toggle SG, billed Zeng as \"the candidate who never gives up\" but found his backing out of the 2015 general election bizarre. Singaporean comedian and blogger Lee Kin Mun, better known as [mrbrown](/wiki/Mrbrown), portrayed Zeng in a satirical video on the 2013 Punggol East by-election. Zeng is notable for his unorthodox, Arab-style clothing, often appearing in his \"signature\" *[thawb](/wiki/Thawb)*, accompanied by either a red-and-white *[keffiyeh](/wiki/Keffiyeh)* or a golden scarf. He was also seen in a *[baju kurung](/wiki/Baju_kurung)* and *[songkok](/wiki/Songkok)* during the 2011 Singaporean general election. ## Personal life Zeng was married to Lili Han Yizi ([Chinese](/wiki/Simplified_Chinese_characters): 韩仪子; [pinyin](/wiki/Pinyin): *Hán Yǐzi*; born 1956),[d] and they had two sons King Yee and King Yew.[e] A 26 March 1987 *[The Straits Times](/wiki/The_Straits_Times)* report on Zeng stated that his English name was Thomas. In a 1996 lawsuit he was involved in, Zeng claimed to have a net worth of ten million dollars. He reportedly took \"more than 10 minutes\" to recite a list of his qualifications, which included \"Senior Professor of the [Colombo South Government Hospital](/wiki/List_of_hospitals_in_Colombo_District)\" (a claim debunked by the hospital itself) and \"Professor at the Medicinal Alternative Open University in the USSR and [Open University of Sri Lanka](/wiki/Open_University_of_Sri_Lanka)\". In a series of promotional advertisements the same year, Zeng proclaimed himself to be a \"Senior Professor Doctor Sir\". Zeng attracted criticism for his unconventional behaviour. Certain acts of his in public \"annoyed\" some individuals; this included the playing of high-volume videos and Zeng's loud singing. Others opined that his acts provided some form of entertainment. Zeng reportedly was an avid boxer and a [taekwando](/wiki/Taekwando) instructor. He was also interested in water sports; he owned a speed boat, in addition to *Scat*, a [hovercraft](/wiki/Hovercraft) made in America. In December 1991, Zeng was involved in an accident while on his leisure craft *Yeeyew*, which he had purchased for $80,000 as a [tin jubilee](/wiki/Wedding_anniversary) gift for his wife. Items on the boat valued at tens of thousands of [dollars](/wiki/Singapore_dollar) were lost to the sea. Zeng was hospitalised for a short period following the incident. In February 2013, Zeng sustained a rib fracture and internal bleeding after a traffic collision. Zeng sued the owner of the van involved, OJJ Foods, and the matter was settled out of court in December 2014. In 2014, Zeng underwent surgery to remove his nose, due to terminal [nasopharynx cancer](/wiki/Nasopharynx_cancer); in spite of that, the cancer [metastasised](/wiki/Metastasised), and Zeng had a portion of his large intestine removed shortly afterwards. His [thyroid](/wiki/Thyroid) and [salivary](/wiki/Salivary) glands were also removed for unspecified reasons. Heavy in debt, he mortgaged his house in May 2015. He peddled [tissue paper](/wiki/Tissue_paper) outside [a Chinese temple](/wiki/Kwan_Im_Thong_Hood_Cho_Temple) at [Queen Street](/wiki/Queen_Street,_Singapore) until late 2016. Travelling about on a [three-wheeler](/wiki/Three-wheeler) he bought in 1995, Zeng began frequenting [Geylang Serai](/wiki/Geylang_Serai) and [Ngee Ann City](/wiki/Ngee_Ann_City) in 2017. He resided with his wife at a \"jumbo flat\" (comprising two units) in [Geylang Bahru](/wiki/Geylang_Bahru) until it was destroyed by a fire in September 2017. ### Religious beliefs While on the 1991 campaign trail, Zeng stated his religion as [Roman Catholicism](/wiki/Roman_Catholicism). In April 2011, Zeng announced that he was a [Muslim](/wiki/Muslim) and had adopted an Islamic name, Muhammad Ali. Whilst the trial of [Kong Hee](/wiki/Kong_Hee) was underway, Zeng endorsed him as a \"good preacher\" capable of \"bring(ing) people to the Lord\", adding that he was a Christian who had donated large amounts of money to [City Harvest](/wiki/City_Harvest_Church) and attended many church sessions. In addition, Zeng claimed to still be partly [Buddhist](/wiki/Buddhist) and that he visited Buddhist temples on a regular basis. When asked for clarification on his religion, Zeng said: > You can say I'm a member (of City Harvest Church), you can say (unintelligible), but I am everything. I go to the [mosque](/wiki/Mosque) – I go Monday – (and) I go to the [temple](/wiki/Buddhist_temple); I'm still a Buddhist, if you'd say. Yes, I have a temple in [Lorong 15](/wiki/Geylang_Road). In a 2017 interview, Zeng identified himself as both a Muslim and a [Jehovah's Witness](/wiki/Jehovah%27s_Witnesses), and described the unfortunate happenings in his life as divine salvation. ## Legal troubles In 1981, Zeng was fined $400 for an advertisement of his which was against the law. In March 1987, Zeng was found guilty of publishing a newspaper advertisement which advertised his piles and pain treatment services – a breach of the Singapore Medical Act. He was fined $1,500. In March 1988, a clerk filed a lawsuit against Zeng, attesting that he had \"kissed her and touched her breast in his clinic\" during a hair-loss and weight-gain treatment session in November 1986. Zeng countered that the accuser was merely making use of him to get her \"jealous\" boyfriend's attention, labelling the case as an \"extortion bid\". He was found guilty and fined $2,000, but the conviction was rescinded in March 1990, following an appeal by Zeng. In December 1991, the owner of a white [Mercedes-Benz](/wiki/Mercedes-Benz) limousine lodged a complaint against Zeng for not having paid for his vehicle, which he rented in November of that year, during the General Election. Initially refusing to pay, he later complied and no charges were filed. In June 1994, Zeng was charged with assaulting and threatening two male individuals, a claim which he initially refuted. The victims were his neighbours, and one of them was businessman Ho Peng Keong. Zeng was ordered to pay a fine of $4,000. In April 1996, another female patient of his claimed that Zeng had outraged her modesty at a treatment session at his acupuncture centre. During the trial, Zeng refused to settle in court, repeatedly stating that he was a \"knight of Saint John\"; the claim was found to be untrue.[f] His antics were likened by a police officer at scene to that of a \"Shakespearean\" actor. Maintaining his innocence to the end, Zeng was nonetheless found guilty and sentenced to four [strokes of the cane](/wiki/Caning_in_Singapore) and some eighteen months of jail time, which was increased to ten strokes of the cane and twenty-seven months of imprisonment following a failed appeal. Zeng had claimed in his defence that the \"nasty\" victim was spitefully making up lies after he rejected her. Efforts on his part to postpone the sentencing, on the grounds that he was mentally disabled, were unsuccessful. It was noted that Zeng's antics in court were \"aggravating factor[s] that the Court could take into account in sentencing\". During that period in jail, Zeng alleged that he was stripped of some of his basic rights; he claimed that as a result of being denied access to clean bathing water, he had developed painful rashes near his [rectum](/wiki/Rectum). He added that the police in charge of him called him crazy and wanted to \"put him in a psychiatric cell\", and also accused them of forcing him to confess through physical means. In 2008, Zeng was charged with using abusive language on two police officers. He was found guilty of violating section 13(D) of the Miscellaneous Offences (Public Order and Nuisance) Act and fined $2,500; it was reinforced in *Public Prosecutor v Zeng Guoyuan* that \"the tariff for using abusive/threatening language or behaviour is a fine of $3,000\". In around October 2009, a lawsuit was filed against Zeng for placing at his two stores banners of escaped terrorist [Mas Selamat bin Kastari](/wiki/Mas_Selamat_bin_Kastari) – which he argued were merely sunshades – without official permit. The banners were accompanied by large one-word notes all reading \"Death\". The trial concluded with Zeng deciding to spend three weeks in jail, instead of paying $3,000 in fines. The management of Ngee Ann City \"called the police more than 30 times\" in early 2017, alleging that Zeng was \"masquerading as a cripple to sell tissue-paper packs\"; Zeng countered that they were simply \"not happy\" and \"jealous\" and dismissed their allegations as \"nonsense\". Additionally, a notice urging passers-by not to donate to Zeng was put up by the mall. Zeng was charged with begging, using abusive language on a police officer, and assaulting a Ngee Ann City security officer. In August 2018, Zeng was arrested for disorderly behaviour in Orchard Road. Two months later, he was arrested in [Geylang Serai](/wiki/Geylang_Serai) for assaulting two police officers. In October 2018, former police officer Seah Chin Peng was charged in a district court for deliberately damaging Zeng's walking stick two years ago and attempting to suppress the truth behind its destruction. ## Death Zeng was found dead at the [void deck](/wiki/Void_deck) of 68 Geylang Bahru on 16 November 2019 at 21:45 (GMT+8). The cause of death was not immediately known. Zeng's neighbour recounted being awoken by a loud thud and finding Zeng lying motionless in a pool of blood. ## Bibliography - *Why The World Trade Centre Collapse So So Fast?* (2002) (self-published; [ISBN unspecified]) - Singapore portal - Biography portal - [Ooi Boon Ewe](/wiki/Ooi_Boon_Ewe), another Singaporean perennial candidate ### Notes ### Citations\n",
  "language": "en",
  "processed_at": "2026-01-12T12:16:23.547370",
  "title": "Zeng Guoyuan",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Zeng_Guoyuan"
}