{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:16:25.774274"
  },
  "content": "Chinese interpreter and educator (1826–1895) **Zeng Laishun** (13 September 1826 – 2 June 1895) was a Chinese [interpreter](/wiki/Language_interpretation), businessman, and educator. He was among the first [Chinese people](/wiki/Chinese_people) to study at a foreign college. Born in [Singapore](/wiki/Singapore_in_the_Straits_Settlements) to a [Teochew](/wiki/Teochew_people) father and a [Malay](/wiki/Malays_(ethnic_group)) mother, he was orphaned as a young child. He was educated by the [American Board of Commissioners for Foreign Missions](/wiki/American_Board_of_Commissioners_for_Foreign_Missions), a Christian missionary organization, where he converted to Christianity. He was sent to the US in 1843, and in 1846 was admitted to [Hamilton College](/wiki/Hamilton_College), but he did not graduate due to a lack of funds. Zeng subsequently traveled to China. After several years working as a missionary assistant in [Guangzhou](/wiki/Guangzhou), he left with his family to pursue a trading career in [Shanghai](/wiki/Shanghai). In 1866, Zeng was hired by the local Fuzhou government as an [English language](/wiki/English_language) instructor at the newly established [Fuzhou Navy Yard School](/wiki/Foochow_Arsenal). Seeking to gain experience with Western practices and institutions, the imperial government began the [Chinese Educational Mission](/wiki/Chinese_Educational_Mission) in 1871, amassing a group of 120 Chinese boys to study in the US. He worked as an interpreter and English tutor for the mission under bureaucrat [Chen Lanbin](/wiki/Chen_Lanbin) and Zeng's colleague [Yung Wing](/wiki/Yung_Wing). He returned to the US in 1872, where he was frequently and erroneously hailed as the \"Chinese Commissioner of Education\". Zeng settled with his family in [Springfield, Massachusetts](/wiki/Springfield,_Massachusetts). He delivered public lectures on Chinese society and participated in local civic life. He was briefly dispatched to [Cuba](/wiki/Cuba) near the end of 1873 to investigate the poor working conditions of Chinese [indentured servants](/wiki/Indentured_servitude) brought to the island as part of the [coolie](/wiki/Coolie) trade. He was abruptly recalled to China in late 1874, likely for diplomatic purposes; during his return journey, he traveled through Europe to assess universities for future educational missions. He became the Chief Private English Secretary of [Li Hongzhang](/wiki/Li_Hongzhang) and served as an interpreter in diplomatic negotiations with the Western powers over the following two decades. ## Early life, family and education Zeng Laishun was born on 13 September 1826 in [Singapore](/wiki/Singapore_in_the_Straits_Settlements). His father was a [Teochew](/wiki/Teochew_people) migrant from eastern [Guangdong](/wiki/Guangdong) (a province of [southern China](/wiki/Northern_and_southern_China)), and his mother was [Malay](/wiki/Malays_(ethnic_group)). Zeng was brought up mainly speaking [Malay](/wiki/Malay_language). Both of his parents worked as vegetable farmers, and they died when he was a young child. He worked serving tables at the [American Consulate](/wiki/Embassy_of_the_United_States,_Singapore). In 1836, he was noticed by [American Board of Commissioners for Foreign Missions](/wiki/American_Board_of_Commissioners_for_Foreign_Missions) missionary Joseph Travelli, who enrolled him in a Chinese day school which had been established by his colleague [Ira Tracy](/wiki/Ira_Tracy) the previous year. The school's missionaries referred to Zeng as Chan Laisun. In February 1837, Zeng entered the American Board's Chinese School, a bilingual (English and Chinese) [boarding school](/wiki/Boarding_school) along with around 40 other students, mostly of Chinese-Malay ancestry. They were forbidden from speaking Malay and taught science as well as arts such as singing, which became a lifelong interest for Zeng. While studying at the American School, Zeng converted to Christianity. The school closed in late 1842, when the missionaries left Singapore to preach in China following the [Qing Empire](/wiki/Qing_dynasty)'s defeat in the [First Opium War](/wiki/First_Opium_War). Zeng was baptized instead by Thomas L. McBryde, a minister of the [Presbyterian Mission Agency](/wiki/Presbyterian_Mission_Agency). ### Education in the United States Around April 1843, Zeng was sent to the US to continue his education. He was accompanied by the Presbyterian missionary John Hunter Morrison, who was returning to America after work in northern India. They went west via the [Indian](/wiki/Indian_Ocean) and [Atlantic](/wiki/Atlantic_Ocean) oceans, sailing around the [Cape of Good Hope](/wiki/Cape_of_Good_Hope) to dock on the east coast of the country. Morrison raised funds from among his friends and enrolled Zeng in the Bloomfield Academy, a boarding school in [Bloomfield, New Jersey](/wiki/Bloomfield,_New_Jersey). Morrison returned to [India](/wiki/India) in 1846, and Zeng was put into the care of an American Board missionary previously stationed in [Guangzhou](/wiki/Guangzhou), [Samuel Wells Williams](/wiki/Samuel_Wells_Williams). In late 1846, Zeng transferred from Bloomfield Academy to [Hamilton College](/wiki/Hamilton_College), a Presbyterian institution in [Clinton, New York](/wiki/Clinton,_Oneida_County,_New_York). Williams arranged for the First Presbyterian Church in [Utica, New York](/wiki/Utica,_New_York), to support Zeng's study for two years, the \"faculty offering to teach him gratuitously, and the ladies in [Brooklyn](/wiki/Brooklyn) to clothe him.\" According to historian Edward J. M. Rhoads, Zeng was the first Chinese person to attend college in the United States,[a] and possibly the first at any foreign college. At Hamilton, Zeng studied the [New Testament](/wiki/New_Testament) in [Koine Greek](/wiki/Koine_Greek) (likely under classicist [Edward North](/wiki/Edward_North_(classicist))) and taught [Sunday school](/wiki/Sunday_school) at a local church. He was active in the college's [glee club](/wiki/Glee_club). In early 1848, his funding ran out, and he was forced to withdraw from the college. Williams attempted to arrange for the American Board to take Zeng to China to work as a teacher at their mission in [Xiamen](/wiki/Xiamen), but the American Board refused, stating that it was the Presbyterian Church's responsibility to transport him, and that foreign-educated Chinese Christians were unsuitable for mission work. Instead, he traveled to China with Williams and his wife, departing from New York City in late May 1848. ## Career Zeng arrived in Hong Kong, and attempted to secure a position teaching at the Morrison Educational Society. The society lacked the funds to hire him, and he was instead hired as an assistant at the American Board mission in Guangzhou in November 1848, working closely with missionary and educator [Dyer Ball](/wiki/Dyer_Ball). Being initially from a Malay and Teochew household, Zeng did not speak the local [Cantonese](/wiki/Cantonese) dialect, and was illiterate in [written Chinese](/wiki/Written_Chinese). He was enrolled in Chinese study for two years. Zeng married in 1850 and returned with his wife Ruth to [Guangzhou](/wiki/Guangzhou), where the couple had two daughters within the following two years. By 1851, Zeng was helping to teach classes at Ball's boarding school. The following year, he began preaching at the mission's daily midday service, and supervised the distribution of [religious tracts](/wiki/Tract_(literature)). He grew unhappy with low pay; although his salary was doubled after his marriage, it was half that of unmarried foreign missionaries. Zeng attempted to negotiate for a raise for over a year, which was formally denied in April 1853. He left Guangzhou with his family and moved to Shanghai. Shanghai was emerging as a center of Western trade. Zeng found employment as a [comprador](/wiki/Comprador) with two Western firms; first with Bower, Hanbury and Co., where he became a close friend of owner [Thomas Hanbury](/wiki/Thomas_Hanbury), and later set up his own business in partnership with Clapp and Company. Zeng fared well in business, with an American Episcopal missionary who visited him in 1856 writing that \"some profitable employment in the foreign community, and every token of prosperity surrounds him\", although his separate venture with Clapp was unsuccessful. Williams, meanwhile, regretted Zeng's turn away from preaching, writing that his \"Christian character suffers a severe trial\" in Shanghai. In August 1856, Zeng was introduced to fellow convert [Yung Wing](/wiki/Yung_Wing), who had also attended college in the United States. Zeng briefly left China for [Bangkok](/wiki/Bangkok) in 1857 for business purposes. During the 1850s, the Pantays, [Taiping Heavenly Kingdom](/wiki/Taiping_Heavenly_Kingdom), [Red Turban Cantonese rebels](/wiki/Red_Turban_Rebellion_(1854%E2%80%931856)) and [Nian rebels](/wiki/Nian_Rebellion) spread across much of southern China, the rebels espousing their [own local form of Christianity](/wiki/God_Worshipping_Society). In late 1860, Yung and Zeng boated up the [Yangtze](/wiki/Yangtze) to visit the Taiping capital. They met with one of the King to attempt to ascertain the beliefs of the Taiping kingdom and their likelihood of success. After a two month journey, they left unimpressed with the Taiping movement and returned to Shanghai. Following the defeat in the [Second Opium War](/wiki/Second_Opium_War), the Qing regime began the [Self-Strengthening Movement](/wiki/Self-Strengthening_Movement), seeking to modernize and gain equal footing with the Western powers. Zeng was hired by the imperial general [Zuo Zongtang](/wiki/Zuo_Zongtang) in 1866 as an English teacher at the newly established [Fuzhou Navy Yard School](/wiki/Foochow_Arsenal). He taught in the school's English division, which primarily taught [navigation](/wiki/Navigation), and worked as an assistant and interpreter for James Carroll, the division head. Following the graduation of the first class of students in 1871, Zeng was granted the [courtesy name](/wiki/Courtesy_name) Hengzhong for his service at the school. Zeng achieved the official status of [fifth-rank supervisor](/wiki/Royal_and_noble_ranks_of_the_Qing_dynasty). ## Chinese Educational Mission In August 1871, Chinese political and military leaders submitted a memorial to the Qing court calling for a group of 120 Chinese boys to be sent to study in the United States for a period of fifteen years, to familiarize them with [Western practices](/wiki/Culture_of_Europe) and institutions. This was based on an earlier proposal by Yung Wing, but Zeng occasionally claimed that he and Yung had come up with the idea for the program together. The memorial was soon approved by the chief foreign policy office and then the imperial court itself the following month. The bureaucrat [Chen Lanbin](/wiki/Chen_Lanbin) and [Yung Wing](/wiki/Yung_Wing) were tasked to head the mission, with Zeng Laishun serving as the third-in-command as well as the mission's translator. In addition to his knowledge of English, Zeng had become familiar with a range of different [varieties of spoken Chinese](/wiki/Sinitic_languages) across the coast of south China. He could translate for students with [mutually unintelligible](/wiki/Mutual_intelligibility) forms of Chinese; the students were recruited mainly from [Cantonese](/wiki/Cantonese)-speaking families, with a smaller contingent of Ningpo city and [Shanghainese](/wiki/Shanghainese) speakers. A preparatory school for the mission's students was established in Shanghai, with Zeng as the English teacher and his teenage sons Elijah and Spencer as assistants. They were extremely strict towards their students, inflicting [corporal punishments](/wiki/Corporal_punishment) over mispronunciations; they were described by alumnus Yung Kwai as \"this Satan with his infernal offspring\". When Zeng left to travel with the first group of students, Kuang Qizhao, a [lexicographer](/wiki/Lexicography), took over English instruction. ### Return to the United States In August 1872, Zeng departed from Shanghai aboard the [Pacific Mail](/wiki/Pacific_Mail_Steamship_Company) steamer *Costa Rica* along with his family, Chen, and the first party of 30 students – including Spencer. As Yung Wing had arrived in the United States before the rest of the mission, Zeng was the sole English-speaking official. Following brief stops in [Nagasaki](/wiki/Nagasaki) and [Kobe](/wiki/Kobe), they arrived in [Yokohama](/wiki/Yokohama), and transferred to the larger [SS *Great Republic*](/wiki/SS_Great_Republic_(1866)). They arrived in San Francisco in late September and met with dignitaries, including Mayor [William Alvord](/wiki/William_Alvord). After five days in the city, lodging at the [Occidental Hotel](/wiki/Occidental_Hotel), they departed east on the [transcontinental railroad](/wiki/First_transcontinental_railroad). They reached [Springfield, Massachusetts](/wiki/Springfield,_Massachusetts), eight days later and reunited with Yung. The group split up, the boys joining host families in [Connecticut](/wiki/Connecticut) and western [Massachusetts](/wiki/Massachusetts). While Chen and Yung relocated to [Hartford, Connecticut](/wiki/Hartford,_Connecticut), after the students departed, Zeng decided to stay in Springfield for unclear reasons. The mission may have wanted Zeng to stay to greet later student cohorts. He purchased a house for him and his family, who became active in the local community. Spencer and Elijah stayed with Zeng as they attended school; although Elijah was not officially a member of the mission, his schooling was nevertheless funded by it. Despite widespread [xenophobic attitudes towards Chinese people](/wiki/Anti-Chinese_sentiment_in_the_United_States) in the United States, Zeng reported little racist harassment against him and his family. He was well-received among upper-class circles in Springfield, where he was frequently referred to as \"our fellow citizen\" in the [*Springfield Daily Republican*](/wiki/The_Republican_(Springfield,_Massachusetts)). Zeng himself reconnected with his former teachers, writing to Ira Tracy, Joseph Travelli, and Edward North. He took his son Willie to visit Hamilton College, where Zeng was awarded an honorary [Master of Arts](/wiki/Master_of_Arts) degree. Writing that he sensed American curiosity for the \"very novelty of a Chinaman\" touring the country, he began giving lectures—both free and for payment—across the northeastern states. He lectured on a variety of topics, including Chinese social customs, writing, education, art, and tea culture. One of his most frequent subjects was the [opium trade](/wiki/History_of_opium_in_China), where he rallied against British support of the trade and encouraged American audiences to help \"deliver a nation from the poison that sweeps them by millions to destruction\". Zeng also gave sermons to church audiences and Sunday schools, predicting that Christianity would be increasingly persecuted in China before eventually rising to power. Zeng continued in employment as the mission's interpreter but, as he did not live near Chen and Yung, he rarely performed this duty. Although ostensibly subordinate to the other two ministers, he was referred to by local press and dignitaries as the \"Chinese Commissioner of Education\". He managed the succeeding groups of students and filled in for Yung during his temporary return to China in 1873. Zeng occasionally traveled across Connecticut and Massachusetts to check in with the students. He frequently visited [North Adams, Massachusetts](/wiki/North_Adams,_Massachusetts), with his sons, where he may have met with the community of Chinese workers at the [Sampson Shoe Factory](/wiki/North_Adams_strike). Alongside his family in March 1873, Zeng attended the [second inauguration of Ulysses S. Grant](/wiki/Second_inauguration_of_Ulysses_S._Grant) in Washington, D.C., wearing his official uniform. He was introduced to Grant at a [White House](/wiki/White_House) reception, where Zeng gave him well-wishes on behalf of the Chinese government and hoped for future [Sino–American relations](/wiki/China%E2%80%93United_States_relations) to be \"as pacific as the ocean which rolls between them.\" It is unknown why Zeng attended the inauguration in lieu of his superiors Chen and Yung. ### Chinese Commission to Cuba Following the 1842 [Treaty of Nanking](/wiki/Treaty_of_Nanking) at the close of the [First Opium War](/wiki/First_Opium_War), European firms began transporting large numbers of Chinese laborers, lured onto ships under false pretenses, to European colonies for use as [indentured servants](/wiki/Indentured_servitude). Although British involvement in this [coolie trade](/wiki/Coolie) declined after legislation in 1855, Spanish firms imported record numbers of laborers in the 1860s and 1870s, mainly to the sugar plantations of [Spanish Cuba](/wiki/Captaincy_General_of_Cuba) and the [guano](/wiki/Guano) mines of [Peru](/wiki/Peru). Approximately 142,000 Chinese workers were shipped to Cuba, and 90,000 to Peru. They faced extremely poor conditions that grew increasingly dire by the 1870s, forced to continue work even after the expiration of their contract. Less than 2% managed to return home. Western observers such as the minister and physician [Peter Parker](/wiki/Peter_Parker_(physician)) had publicly denounced the practice as inhumane. British and American diplomats grew concerned that it could damage the image of Westerners in China, but the Qing government itself was hesitant to act. Prince Gong, concerned by reports from missionary Samuel Wells Williams, petitioned the [Tongzhi Emperor](/wiki/Tongzhi_Emperor) to send a commission to Cuba to investigate. Gong appointed Chen Lanbin as the head of the commission, alongside Zeng and six other Chinese and Western dignitaries. The commission was tasked to investigate the abuse of Chinese workers and assemble a report with the evidence collected. Zeng was dispatched slightly before the rest of the commission to prepare for its arrival. He traveled to [Havana](/wiki/Havana) in late 1873 or early 1874 to discuss the laborers' working conditions with American and British diplomats, staying around ten days before returning to the United States. Although disrupted by both plantation owners and the [Cuban colonial government](/wiki/Government_of_Spanish_Cuba), the commission was able to gather almost 3,000 interviews. The mission's reports led to increased international pressure against Spain, leading to an 1877 Sino-Spanish treaty ending the practice and returning workers to China. ### Return to China In December 1874, after welcoming the third group of students for the mission, Zeng was abruptly recalled to China on official business, most likely relating to negotiations on ending the coolie trade with Spain and Peru. On 30 December, he departed from New York City to the United Kingdom aboard the [SS *Java*](/wiki/SS_Java_(1865)). He was tasked with inspecting several European schools on his return trip to find suitable institutions for graduates of the Fuzhou Navy Yard School. After his return to China in 1875, a group of twelve students was dispatched to schools in England, France, and Germany. The *Springfield Daily Republican* reported that Zeng had been dismissed from the mission due to court intrigue, but had managed to regain political standing after meeting with [Li Hongzhang](/wiki/Li_Hongzhang). It is unknown if Zeng had actually been dismissed due to some charge against him, or was simply reassigned elsewhere. His wife and children sold their house in Springfield and set off back to China in September 1875, while Spencer and Elijah stayed behind to continue their studies at [Yale University](/wiki/Yale_University). Kuang Qizhao officially succeeded Zeng as interpreter for the mission in November 1875. ## Later life After returning to China, Zeng served as an interpreter in several diplomatic contexts, including China's establishment of [diplomatic relations with Peru](/wiki/China%E2%80%93Peru_relations), investigations during the [Margary Affair](/wiki/Margary_Affair) (a diplomatic crisis involving the murder of a British official), and the resulting 1876 [Chefoo Convention](/wiki/Chefoo_Convention) with the United Kingdom. He became a permanent member of Li Hongzhang's secretariat in [Tianjin](/wiki/Tianjin), serving as his Chief Private English Secretary. In his dual role as [Viceroy of Zhili](/wiki/Viceroy_of_Zhili) and Superintendent of Trade for the Northern Ports, Li managed most foreign relations between China and the foreign powers, and was erroneously referred to in Western sources as China's \"[prime minister](/wiki/Prime_minister)\". Zeng served as interpreter during the Hawaiian king [Kalākaua](/wiki/Kal%C4%81kaua)'s 1881 visit to Tianjin. In 1895, Zeng was scheduled to accompany Li as an interpreter for the signing of the [Treaty of Shimonoseki](/wiki/Treaty_of_Shimonoseki) following China's defeat in the [Sino-Japanese War](/wiki/First_Sino-Japanese_War). Zeng was dismissed by Li, who stated \"You are old and so am I; but I have to go because there is no help for it.\" Zeng died soon afterwards in Tianjin on 2 June 1895. ## Personal life On 8 April 1873, in Springfield, Massachusetts, Zeng was initiated into the Hampden Lodge of [Freemasons](/wiki/Freemasonry), becoming a member in late September of that year. In January 1881, he helped establish a masonic lodge in Shanghai, and was dubbed by a Masonic publication the \"first master mason of the Chinese race known to have lived in China\". ### Family In August 1850, Zeng married Ruth Ati, a [Java](/wiki/Java)-born Christian teacher who had been previously educated in missionary schools. She was described by an 1850 report as of \"Indo-Chinese\" heritage. Their marriage was officiated by author and missionary [W. A. P. Martin](/wiki/William_Alexander_Parsons_Martin) at [Ningbo](/wiki/Ningbo) in eastern China. Zeng and Ruth joined the Union Church, a newly established independent church in Shanghai. They donated $175 to missionary [E. C. Bridgman](/wiki/Elijah_Coleman_Bridgman)'s mission in Shanghai to establish a schoolhouse, where Ruth taught a girls' [mission school](/wiki/Mission_school). During the late 1860s, Zeng's eldest children, Annie and Lena, were able to spend a year studying in England. This was thanks to a grant from Thomas Hanbury, Zeng's former employer. Annie later married the Danish naval officer Niels Peter Andersen. During the 1890s, she was an activist in the [anti-footbinding movement](/wiki/Anti-footbinding_movement) and a co-founder of the [Shanghai International Red Cross Committee](/wiki/Shanghai_International_Red_Cross_Committee). Elijah graduated from Yale in 1877, and spent a year and a half in [Freiberg, Saxony](/wiki/Freiberg). Becoming an engineer, he was commissioned to open copper mines in Eastern Mongolia, and declined an offered position as the chief engineer of the [Chinese railroad system](/wiki/Rail_transport_in_China) before dying unexpectedly in 1890. Willie served as an interpreter for the [United States consular court in Shanghai](/wiki/United_States_Court_for_China). Spencer became a journalist and official; he wrote for the *[North China Daily News](/wiki/North_China_Daily_News)* until 1906, before moving to Nanjing to serve as an [intendant](/wiki/Intendant) and foreign affairs deputy on the staff of Governor-General [Duanfang](/wiki/Duanfang). ## Notes ### Works cited\n",
  "language": "en",
  "processed_at": "2026-01-12T12:16:25.773927",
  "title": "Zeng Laishun",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Zeng_Laishun"
}