{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:16:27.829778"
  },
  "content": "China-born Singaporean news anchor **Zhang Haijie** ([Chinese](/wiki/Chinese_language): 张海洁; born 28 August 1971) is a Singaporean news anchor contracted under [Mediacorp](/wiki/Mediacorp). ## Education Zhang studied at the [Beijing Broadcasting Institute](/wiki/Beijing_Broadcasting_Institute) when she was 18. In 2003, Zhang took a one-year part-time master's degree in international management from the [Australian National University](/wiki/Australian_National_University). In July 2005, Zhang went back to studies and became a full-time PhD candidate at [Nanyang Technological University](/wiki/Nanyang_Technological_University)'s Chinese division with her thesis on the political role of the [Singapore Chinese Chamber of Commerce and Industry](/wiki/Singapore_Chinese_Chamber_of_Commerce_and_Industry) before Singapore's independence. She converted to be a part-time [PhD](/wiki/Doctor_of_Philosophy) candidate in 2008 as she had gone back to work at Mediacorp. She completed her PhD in April 2012. ## Career ### Early career After graduation, Zhang taught at her alma mater for four years before moving on to journalism. Zhang then worked in the Shanghai Cable TV Station for one-and-a-half years as a financial-news presenter and producer. She then decided to relocate to Singapore to work abroad. Initially hired as a trainer at the [Television Corporation of Singapore](/wiki/Television_Corporation_of_Singapore), where she trained then amateur presenters such as [Tung Soo Hua](/wiki/Tung_Soo_Hua), Zhang was asked to anchor the 1 pm news bulletin after just one week into the job. ### SPH MediaWorks In 2001, she resigned from MediaCorp News and crossed-over to rival TV station [SPH MediaWorks Channel U](/wiki/Channel_U_(Singaporean_TV_channel)). It was rumoured that she left MediaCorp because she was unhappy she did not win the Best News Presenter Prize in the Star Awards 2001 despite leading by a [landslide victory](/wiki/Landslide_victory) of 70% of the audience vote according to several reports by the local media.[*citation needed*] The award went to colleague Ng Siew Leng. Zhang resigned four days after the award ceremony was held. Then SPH MediaWorks head Man Shu Sum dismissed the rumours and added that negotiations with Zhang were going on for months before the award ceremony. In the same year, Zhang denied widespread rumours of rivalry between herself and Ng, declaring \"she and I have no conflict.\"[*citation needed*] When interviewed in Year 2003 by [Lianhe Zaobao](/wiki/Lianhe_Zaobao), Zhang admitted that she was extremely disappointed she did not win the coveted award in 2001. Zhang also revealed she cried in the taxi while on her way home because the taxi driver had thought she won the award. She disclosed that she was not on good terms with her colleagues in [MediaCorp TV](/wiki/Mediacorp#Television) and hinted that one's work performance there was judged solely based on the amount of work hours put in.[*citation needed*] In 2003, with [SPH MediaWorks Channel U](/wiki/Channel_U_(Singaporean_TV_channel)), Zhang hosted the current-affairs programme, *Inside Out*, which explores various social issues in Singapore and the region. The programme was very well received, which set the record with sky-high viewership ratings. *(Inside Out, last episode)* Till now, no other [Chinese-language](/wiki/Chinese-language) current-affairs programme has managed to break the viewership record *Inside Out* had set. Zhang also co-hosted radio talkshows on UFM 1003.[*citation needed*] On 1 January 2005, following the merger with [MediaCorp TV](/wiki/Mediacorp#Television) and [SPH MediaWorks](/wiki/SPH_MediaWorks), SPH MediaWorks closed down. Zhang was the only news anchor from SPH MediaWorks to be invited back to MediaCorp's News department. However, she rejected the move. ### Mediacorp After three years off the air, Zhang announced on 7 January 2008, that she would return to broadcasting on [MediaCorp TV Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)), and would assume duties as a news anchor on 15 February 2008, reporting on the *2008 Singapore Government Financial Budget*. Since 1 May 2008, she has been anchoring *News Tonight* (previously known as *News 8 at Ten*) every weeknight on [Mediacorp Channel 8](/wiki/Channel_8_(Singaporean_TV_channel)), one of two [Mandarin Chinese](/wiki/Mandarin_Chinese) free-to-air television channels in [Singapore](/wiki/Singapore). In an interview in 2009, Zhang was quoted as telling reporters that she no longer held any expectation of winning an award. Zhang said her perception of life changed greatly after a close friend of hers had a brain tumour in 2007, which made her treasure life more and do what she loves most - newsreading. She added that the audience support garnered for her would be the best form of recognition. In January 2011, an online Facebook page was set up in a bid to garner audience support for Zhang to win her long overdue *Best News Presenter* prize. Many netizens have also expressed support for Zhang in various online forums. However, Zhang did not win the award once again in 2011. Her poor [public relations](/wiki/Public_relations) skill was thought to be a contributing factor as to why she has never won despite being widely acknowledged as one of the finer news presenters in the industry with vast experience. Zhang was once quoted as saying to reporters: \"I once told my superior this – The TV station employed me all the way from China to come here to work, not to make friends.\"[*citation needed*] Zhang finally won the award in 2012 for her broadcasts and live analysis with [political analysts](/wiki/Political_analyst) for the [2011 Singaporean general election](/wiki/2011_Singaporean_general_election) and [2011 Singaporean presidential election](/wiki/2011_Singaporean_presidential_election).[*citation needed*] ## Personal life Zhang was born on 28 August 1971 in [Xi'an](/wiki/Xi%27an), China. She is the youngest child of a school-principal father and an architect mother. She has two older sisters and an older brother. She is single and has said she does not mind going for match-making sessions to find a partner. Zhang became a Singaporean citizen in 2003. ## Awards and nominations YearOrganisationAwardNominated work TitleResultRef2000[Star Awards](/wiki/Star_Awards)Best News / Current Affairs PresenterNews 8 at TenNominated2001[Star Awards](/wiki/Star_Awards)Best News / Current Affairs PresenterNews 8 at TenNominated2003[Asian Television Awards](/wiki/Asian_Television_Awards)Best Current Affairs PresenterInside OutNominated2004[Lianhe Zaobao](/wiki/Lianhe_Zaobao)Top 50 Most Popular Asian IdolN/AWon2008The Anniversary Gala 2008Most Memorable News Presenter (2000s Era)N/AWon2009[Star Awards](/wiki/Star_Awards)Best News / Current Affairs PresenterNews 8 at TenNominated2010[Star Awards](/wiki/Star_Awards)Best News PresenterNews 8 at TenNominated2011[Star Awards](/wiki/Star_Awards)Best News StoryKallang SlashNominated2011[Star Awards](/wiki/Star_Awards)Best News PresenterNews TonightNominated2012[Star Awards](/wiki/Star_Awards)Best News PresenterNews TonightWon2013[Star Awards](/wiki/Star_Awards)Best News PresenterNews TonightNominated - Zhang's blog, \"Woman in the News\"\n",
  "language": "en",
  "processed_at": "2026-01-12T12:16:27.829503",
  "title": "Zhang Haijie",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Zhang_Haijie"
}