{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:16:29.774239"
  },
  "content": "Electronics companyThis article **needs additional citations for verification**. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. *Find sources:* \"ZiiLABS\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(November 2025)* *(Learn how and when to remove this message)* **ZiiLABS Pte Ltd.** is a global electronics company, producing a line of media-oriented application processors, reference platforms and enabling software, in a series of platforms named ZMS. Its products are found in low-power consumer electronics and embedded devices, including [Android](/wiki/Android_(operating_system))-based phones and tablets. ## History ZiiLABS was founded in 1994 as [3Dlabs](/wiki/3Dlabs), which became a wholly owned subsidiary of Creative Technology Ltd in 2002. In January 2009, the company re-branded as ZiiLABS. This re-branding reflected 3Dlabs' focus on supplying low-power, media-rich application processors, hardware platforms and middleware, rather than just 3D GPUs as had previously been the case. The company announced its first applications/media processor, the *DMS-02* in 2005 and this has been followed by the ZMS-05, ZMS-08 and most recently the ZMS-20 and ZMS-40. The ZMS processors combine ZiiLABS’ core asset, the \"Stemcell Computing Array\" with ARM cores and integrated peripheral functions to create a [system on a chip](/wiki/System_on_a_chip) (SoC). As 3Dlabs the company developed the GLINT and Permedia GPUs used in both personal and workstation graphics cards. In 2002, the company acquired the Intense3D group to become a vertically integrated graphics board vendor supplying workstation graphics card under the RealiZm brand. 3Dlabs stopped developing graphics GPUs and cards in 2006 to focus on its media processor business. In November 2012, [Creative Technology Limited](/wiki/Creative_Technology_Limited) announced it has entered into an agreement with [Intel Corporation](/wiki/Intel_Corporation) for Intel to license certain technology and patents from ZiiLABS Inc. Ltd and acquire certain engineering resources and assets related to its UK branch as a part of a $50 million deal. ZiiLABS (still wholly owned by Creative) continues to retain all ownership of its StemCell media processor technologies and patents, and will continue to supply and support its ZMS series of chips to its customers. ## Products The company's products include a range of ARM-based *ZMS* processors that feature its so-called *StemCell* media processing architecture, plus a portfolio of tablet reference platforms based on its in-house [Android](/wiki/Android_(operating_system)) [board support package](/wiki/Board_support_package) and application software. The most recent platform, the JAGUAR Android reference tablet, was announced in May 2011. ### StemCell cores The core asset of the ZiiLABS ZMS chips seem to be an array of processing units called *StemCells* that are programmed to perform media processing. These are described as 32-bit [floating-point](/wiki/Floating-point) processing units and are likely some form of [digital signal processor](/wiki/Digital_signal_processor) cores used to accelerate various operations. All [video codec](/wiki/Video_codec) and 3D graphics handling in the ZMS processors is handled by programming this array of [coprocessors](/wiki/Coprocessor) to do the job.[*citation needed*] ### Processors - ZMS-40 (quad Cortex-A9 with 96 StemCell cores) - ZMS-20 (dual Cortex A9 with 48 StemCell cores) - ZMS-08 (single Cortex-A8 with 64 StemCell cores) - ZMS-05 (dual ARM9 with 24 StemCell cores) ### Reference platforms - [Zii EGG](/wiki/Zii_EGG) (this product is now[*when?*] end-of-life) - JAGUAR (Android 3.2 Reference Tablet) - JAGUAR3 (Slim Android 3.2 Reference Tablet) Over the years a number of other development platforms have been made introduced including the Zii Development kits (traditional large form factor systems). - Official website\n",
  "language": "en",
  "processed_at": "2026-01-12T12:16:29.773969",
  "title": "ZiiLABS",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/ZiiLABS"
}