{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:16:35.749995"
  },
  "content": "Singaporean nightclub**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)* **A major contributor to this article appears to have a close connection with its subject.** It may require cleanup to comply with Wikipedia's content policies, particularly neutral point of view. Please discuss further on the talk page. *(December 2018)* *(Learn how and when to remove this message)*This article **contains promotional content**. Please help improve it by removing promotional language and inappropriate external links, and by adding encyclopedic text written from a neutral point of view. *(August 2022)* *(Learn how and when to remove this message)* *(Learn how and when to remove this message)* **Zouk** is a [Singaporean](/wiki/Singapore) [nightclub](/wiki/Nightclub) located in the [Clarke Quay](/wiki/Clarke_Quay) district. Opened in 1991, the brand has since expanded to various cities around [Asia](/wiki/Asia) and [North America](/wiki/North_America). One of the country's most prominent nightclubs, it has won the [Singapore Tourism Board](/wiki/Singapore_Tourism_Board)'s \"Best Nightspot Experience\" award 6 times, between 1996 and 2007. Zouk was ranked number 10 on DJ Magazine's list of Top 100 clubs in the world in 2006, 2007 and 2010. In 2017, Zouk Singapore earned its highest ranking yet at number 3, the top entry for clubs across Asia. In 2021, Zouk Singapore was ranked number 11 while Zouk KL was ranked 33 on the [DJ Mag](/wiki/DJ_Mag) Top 100 Clubs list in the world. In September 2015, one of its founders, Lincoln Cheng, sold the rights of the Zouk brand to [Genting Hong Kong](/wiki/Genting_Hong_Kong), an affiliate of [Genting Singapore](/wiki/Genting_Singapore). The brand and its business was valued at S$40 million by the financial audit firm [Ernst & Young](/wiki/Ernst_%26_Young) in 2013. On 1 September 2020, Genting Hong Kong sold Zouk for S$14 million to Tulipa, a firm owned by Lim Keong Hui, the former deputy CEO of Genting Hong Kong and the son of Genting Hong Kong CEO and chairman of [Genting Group](/wiki/Genting_Group) [Lim Kok Thay](/wiki/Lim_Kok_Thay). ## Etymology The club is named after the [Antillean Creole](/wiki/Antillean_Creole) word for 'party'. ## History Zouk was designed based on Cheng's travels around [Ibiza](/wiki/Ibiza) and other Mediterranean coastal countries. The club, located at Jiak Kim Street, was housed in three restored warehouses, which were built in 1919, when Cheng acquired it. Three interconnected clubs were housed within the warehouses. - Zouk (1991), with a large dance floor, sound and lighting, catering to a variety of artists. - Velvet Underground (1994), a quieter, more relaxed lounge that plays [house](/wiki/House_music) and [soul](/wiki/Soul_music).[*citation needed*] - Phuture (1996), a more [avant-garde](/wiki/Avant-garde) bar specializing in [broken beats](/wiki/Breakbeat) and hip hop/R&B. In December 2016, Zouk moved to its new premises at [Clarke Quay](/wiki/Clarke_Quay). Housed in a revamped warehouse, the new space retained its multi-room concept with three club outlets and two bars: - Zouk, the largest club in the complex with a capacity of over 3,500, has a main room that regularly hosts international guest DJs, ‘live’ performances, and other events. - Phuture, an underground-esque club outlet for [hip-hop](/wiki/Hip_hop_music) and [R&B](/wiki/Contemporary_R%26B) lovers. - Capital, a dual lounge and club space aimed at older audiences with open format music nights. - RedTail Bar. - Queens, a hip-hop inspired cocktail bar inspired by the [New York borough](/wiki/Boroughs_of_New_York_City). *(No longer operational after COVID-19; used as a storage/staff area currently.)* In 2021 (month unknown), amidst the COVID-19 pandemic, Zouk further expanded its premises by taking over its neighboring bar, Get Juiced, in the same Clarke Quay entertainment complex. This additional space housed a restaurant and another bar. - Here Kitty Kitty SG, which borrows its concept from its sister outlet in Zouk Las Vegas, positions itself as a \"vice den\" inspired by Shinjuku in the 1950s. Featuring Japanese-fusion bites and speakeasy cocktails, it is generally a more luxurious but more expensive place than the other sister bars by Zouk in the area. - Sushi Ichizuke, a high-end omakase restaurant with only 16 seats, featuring \"instagram-worthy dishes\" at a high price tag of S$450++ per person. ## Other locations ### Malaysia #### Zouk Kuala Lumpur In 2004, Cheng opened the second outlet of Zouk in Kuala Lumpur (KL), Malaysia, together with [Cher Ng](/wiki/Cher_Ng), a former Zouk Singapore resident DJ. Zouk KL underwent a major revamp in 2008, and ultimately moved to newer and bigger premises in 2015 in the TREC entertainment and lifestyle precinct located in Jalan Tun Razak, Kuala Lumpur, Malaysia. Ng is also one of the partners of TREC. Since November 2022, it has been rebranded as Spark Club KL. #### Zouk Genting After Cheng sold Zouk to Genting Hong Kong in 2015, the new owners opened a third outlet of Zouk in [Genting Highlands, Malaysia](/wiki/Genting_Highlands) in 2019. This entertainment complex, housed within the Genting Casino and Integrated Resort, featured Zouk Group's first proper restaurant, FUHU Genting, a new club concept named Empire and RedTail Genting, a spin-off of the RedTail concept in Singapore. It also opened AYU Awana (date unknown), a restaurant within [Resorts World Awana](/wiki/Awana_Skyway), a smaller, sister resort of Resorts World Genting just one cable car ride away. ### United States #### Zouk Las Vegas In 2022, Zouk opened a fourth outlet in [Las Vegas](/wiki/Las_Vegas), [Nevada, USA](/wiki/Nevada,_USA) at [Resorts World LV](/wiki/Resorts_World_Las_Vegas). The concepts present in this new outlet mirror the concepts in other existing outlets. - Zouk Nightclub, the main venue for many famous DJs. As of January 2025, [Tiesto](/wiki/Ti%C3%ABsto), [Zedd](/wiki/Zedd), [DJ Snake](/wiki/DJ_Snake), [Kaskade](/wiki/Kaskade), [G-Eazy](/wiki/G-Eazy), and [Nelly](/wiki/Nelly) have all been named as resident DJs of this club. These nightclubs ran and operate by Jared Garcia, who was named director of artist relations for Zouk Group. Ronn Nicolli, CMO, Resorts World and vice president of nightlife marketing, Zouk Group Andrew Pacheco, executive director of customer development, Zouk Group Michael Waltman, executive director of operations, Zouk Group - Ayu Dayclub and Nightclub, borrowing its concept from its sister outlet in Genting. - RedTail Bar, similar to its sister outlets in Singapore and Genting. - FUHU Vibe Dining, similar to its sister outlet in Genting. - Here Kitty Kitty LV, similar to its sister outlet in Singapore, although the Las Vegas outlet opened first. In addition, it has a relatively large food hall named Famous Foods Street Eats, featuring 16 different dining concepts, in particular Singaporean and Japanese concepts. #### Zouk Los Angeles The group will be opening its sixth outlet along the [La Cinega Boulevard](/wiki/La_Cienega_Boulevard) in [Los Angeles](/wiki/Los_Angeles). The 16,500 sq ft venue will be jointly operated with SBE Entertainment Group and will then occupy the Nightingale nightclub. Zouk Los Angeles is slated to open in 2024. ### Japan #### Zouk Tokyo In 2023, Zouk has announced its expansion to open its fifth outlet at the newly built Granbell Square in [Ginza](/wiki/Ginza), [Tokyo](/wiki/Tokyo). The club is built through a partnership with Japan's Belluna, the company behind Granbell Hotel Group. It is located at the basement level of the hotel and was opened on 6 October 2023. ## ZoukOut In 2000, Zouk started an all-night dance music festival, ZoukOut. The dance festival was held at Siloso Beach at [Sentosa](/wiki/Sentosa), Singapore. ZoukOut was held annually with the exception of 2019 to 2021, due to the festival taking a break and [COVID-19 pandemic in Singapore](/wiki/COVID-19_pandemic_in_Singapore). The festival resumed in 2022. - Singapore portal - [List of electronic dance music venues](/wiki/List_of_electronic_dance_music_venues) - [Zouk](/wiki/Zouk_(musical_movement)) (style of music) - Boey, Dylan. Mambo Rocks in Sunday Times 8 August 2004. Singapore: SPH. - DJ Adam Low. (1998) Mambo Jambo Wednesday Night Live. Singapore: Avex Trax. - Media related to Zouk (club) at Wikimedia Commons - Official website - Zouk Tokyo - Zouk Las Vegas - Zouk Singapore\n",
  "language": "en",
  "processed_at": "2026-01-12T12:16:35.749711",
  "title": "Zouk (club)",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Zouk_(club)"
}