{
  "_metadata": {
    "crawler_version": "1.0.0",
    "file_format_version": "1.0",
    "saved_at": "2026-01-12T12:16:40.450529"
  },
  "content": "Malaysian politician (born 1958)**This article has multiple issues.** Please help **improve it** or discuss these issues on the **talk page**. *(Learn how and when to remove these messages)*This article **may need to be rewritten** to comply with Wikipedia's quality standards. Relevant discussion may be found on the talk page. You can help. The talk page may contain suggestions. *(June 2022)*This biography of a living person **needs additional citations for verification**. Please help by adding reliable sources. Contentious material about living persons that is unsourced or poorly sourced **must be removed immediately** from the article and its talk page, especially if potentially libelous. *Find sources:* \"Zuraida Kamaruddin\" – news **·** newspapers **·** books **·** scholar **·** JSTOR *(June 2022)* *(Learn how and when to remove this message)*This \"criticism\" or \"controversy\" section **may compromise the article's neutrality**. Please help integrate negative information into other sections or remove undue focus on minor aspects through discussion on the talk page. *(June 2022)*This article **appears to be slanted towards recent events.** Please try to keep recent events in historical perspective and add more content related to non-recent events. *(June 2022)* *(Learn how and when to remove this message)* **Zuraida binti Kamaruddin** ([Jawi](/wiki/Jawi_alphabet): زريدة بنت قمرالدين; born 14 March 1958) is a [Singaporean](/wiki/Singaporean)-born [Malaysian](/wiki/Malaysian_people) [politician](/wiki/Politician) who formerly served as [Minister of Plantation Industries and Commodities](/wiki/Minister_of_Plantation_Industries_and_Commodities_(Malaysia)) in the [Barisan Nasional](/wiki/Barisan_Nasional) (BN) administration under Prime Minister [Ismail Sabri Yaakob](/wiki/Ismail_Sabri_Yaakob), [Minister of Housing and Local Government](/wiki/Minister_of_Housing_and_Local_Government_(Malaysia)) twice in the [Perikatan Nasional](/wiki/Perikatan_Nasional) (PN) administration under former Prime Minister [Muhyiddin Yassin](/wiki/Muhyiddin_Yassin) and [Pakatan Harapan](/wiki/Pakatan_Harapan) (PH) administration under former Prime Minister [Mahathir Mohamad](/wiki/Mahathir_Mohamad). She was [Member of Parliament](/wiki/Dewan_Rakyat) (MP) for [Ampang](/wiki/Ampang_(federal_constituency)) from March 2008 to November 2022. Zuraida was formerly a member of the [People's Justice Party](/wiki/People%27s_Justice_Party_(Malaysia)) (PKR) from May 2007 to February 2020. She was the Women Chief of PKR from May 2007 to November 2018 and then the vice-president from November 2018 till February 2020 when she resigned from the party in February 2020 to join [Malaysian United Indigenous Party](/wiki/Malaysian_United_Indigenous_Party) (BERSATU) with her key political ally, Deputy President of [PKR](/wiki/People%27s_Justice_Party_(Malaysia)) and [Minister of Economic Affairs](/wiki/Minister_of_Economic_Affairs_(Malaysia)) [Azmin Ali](/wiki/Azmin_Ali) and several [MPs](/wiki/Member_of_Parliament) aligned with Azmin. Zuraida was with BERSATU and was a member of the Supreme Council of BERSATU from February 2020 to May 2022 before her resignation to join [Parti Bangsa Malaysia](/wiki/Parti_Bangsa_Malaysia) (PBM). She was a member of PBM from June to December 2022 where she failed to get re-elected under their banner in the [November 2022 Malaysian general elections](/wiki/2022_Malaysian_general_election), polling only 4.4 percent of the electorate in the Ampang parliamentary seat which she had held since 2008 as a PKR candidate. ## Non-political career Zuraida started working in the private sector in 1980 at Frank Small & Associates, [Australia](/wiki/Australia). She held the position of Qualitative Study Manager before progressing to Chuo Senko Advertising ([Japan](/wiki/Japan)) as Marketing Research and Account Planning Manager. In addition, she has worked with [American International Assurance](/wiki/American_International_Assurance) (AIA), [Saatchi & Saatchi](/wiki/Saatchi_%26_Saatchi) Advertising, AVON (M) Berhad and Flaireborne (M) Sdn Bhd. In 1998, she became a training and motivational consultant to advise [Petronas](/wiki/Petronas), [Oriflame](/wiki/Oriflame), Nutrimetics, and Shinetsu in [Texas](/wiki/Texas). Other posts include being a member of the Board of Directors of Maahad Tahfiz Az-Zahra, Adviser of ALQAS Education & Charity Home, GEMMA Humanitarian Relief Advisor and Malaysian Student Association in [Yemen](/wiki/Yemen). She is also a founder and chairwoman of WIRDA, a Community Service Center that provides counseling and protection to needy groups including single mothers, travelers, converts and teens. ## Political career ### PKR and 2008 general election win Zuraida won her Ampang seat in the 2008 general election representing PKR, defeating her predecessor Rozaidah Talib with a majority of 3,676 votes. She successfully defended the seat in both the 2013 and 2018 general elections with increased majorities. She also served as the Women's Chief for PKR before being succeeded by Haniza Talha. She was elected to become vice-president of PKR and concurrently served as Women's Chief for Pakatan Harapan until 24 February 2020. She is also an advisor to the Selangor Women Empowerment Institute ([Malay](/wiki/Malay_language): Institut Wanita Berdaya Selangor, IWB), a [Selangor State Government](/wiki/Selangor_State_Government) [think tank](/wiki/Think_tank). ### Expulsion and departure from PKR On 24 February 2020, PKR general-secretary [Saifuddin Nasution Ismail](/wiki/Saifuddin_Nasution_Ismail) announced in a press conference that the [Minister of Economic Affairs](/wiki/Minister_of_Economic_Affairs_(Malaysia)), [Azmin Ali](/wiki/Azmin_Ali) who was also the Deputy President, and Zuraida had been expelled from the party for their actions on 23 October 2019 which went against the party's stance regarding the position of the Prime Minister. In reaction to Azmin and Zuraida's expulsion, eight MPs from PKR[note 2] aligned towards Azmin subsequently left the party to form an \"independent bloc\". On 28 February 2020, Zuraida along with the rest of the \"independent bloc\" joined [Parti Pribumi Bersatu Malaysia](/wiki/Parti_Pribumi_Bersatu_Malaysia) (BERSATU), a component party of Pakatan Harapan until pulling out of the coalition on 24 February. In October 2020, Saifuddin, on behalf of PKR, sued Zuraida for [RM](/wiki/Malaysian_ringgit)10 million for violating a bond which binds herself to the party. Part of the bond terms include that Zuraida agrees to pay the party a sum of RM10 million not later than seven days upon winning the election on the PKR ticket and then resigning from the party or joining any other political party or becoming an independent elected representative. Zuraida attempted to strike out the lawsuit but was dismissed by the [High Court](/wiki/High_court_(Malaysia)) and the [Court of Appeal](/wiki/Court_of_Appeal_of_Malaysia). During the trial, Zuraida alleged that she was forced to sign the bond against her will and she did not know the bond's content. Saifuddin countered that Zuraida did not object to the signing of the bond. On 23 June 2023, the High Court found that the bond signed was a valid and binding contract and ordered Zuraida to pay PKR RM10 million for breaking the bond. The court also ordered her to pay RM50,000 in costs. Zuraida filed an appeal at the Court of Appeal against the decision, who partially allowed the appeal and reduced the sum of damages to RM100,000. The court also ordered PKR to pay RM40,000 in costs to Zuraida. PKR has since submitted an appeal at the Federal Court to reinstate the original sum of RM10 million. ### BERSATU On 25 January 2022, BERSATU's Supreme Council met to discuss the issue on the possibility to expel Zuraida from the party due to her alleged involvements in another party, [Parti Bangsa Malaysia](/wiki/Parti_Bangsa_Malaysia) (PBM), but no actions was taken after the meeting. On 2 February 2022, the Secretary General of PBM Nor Hizwan Ahmad clarified that Zuraida was not a member of PBM. On 22 March, BERSATU Supreme Council member Muhammad Faiz Na’aman criticised Zuraida on her absence in helping to campaign for BERSATU in the [2022 Johor state election](/wiki/2022_Johor_state_election) and suggested that this was a subtle betrayal to BERSATU and urged the party to take serious disciplinary actions against Zuraida. On 26 May, Zuraida announced that she had decided to leave BERSATU for PBM and her pending resignation as Minister of Plantation Industries and Commodities. Following this, she also noted that discussions with the [Prime Minister](/wiki/Prime_Minister_of_Malaysia) [Ismail Sabri Yaakob](/wiki/Ismail_Sabri_Yaakob) would be held as soon as possible on the issue of her pending resignation. On 28 May, Ismail Sabri clarified that Zuraida was still a minister and has yet to officially tender her resignation to him and could still attend Cabinet meetings. Both Ismail Sabri and Zuraida were overseas for duties and Ismail Sabri noted that they would only discuss the issue after returning to Malaysia. On 29 May, it was reported that Zuraida denied that she was a \"problematic\" member of BERSATU in her replies to a show-cause letter from BERSATU. She wrote that she spoke with Muhyiddin the idea of forming a new multiracial party to provide added value and be a subsidiary to BERSATU as it would increase support for BERSATU with the background of PBM which commands the support of the grassroots who numbered 400,000 people would definitely benefit BERSATU. Zuraida received the letter on 11 May for repeatedly participating in PBM activities that violated the discipline of the party, and she replied to the letter on 23 May. On Zuraida's resignation, UMNO secretary-general [Ahmad Maslan](/wiki/Ahmad_Maslan) said her resignation proved that there was a need for the anti-hopping law, \"if the law had been enforced, Zuraida would not have left BERSATU” at the open house of former [Menteri Besar of Johor](/wiki/Menteri_Besar_of_Johor) [Hasni Mohammad](/wiki/Hasni_Mohammad). PN chairman and BERSATU president [Muhyiddin Yassin](/wiki/Muhyiddin_Yassin) thanked Zuraida for her contributions to BERSATU and informed that her BERSATU membership was automatically nullified after she joined PBM. ### Parti Bangsa Malaysia After Zuraida's resignation from BERSATU, [PBM](/wiki/Parti_Bangsa_Malaysia) secretary-general Nor Hizwan Ahmad clarified that her PBM membership application was still being processed and would still have to go through relevant and proper channels. On 7 June 2022, Zuraida updated that Ismail Sabri had planned for a meeting with her and that it is the Prime Minister's prerogative on the status of her position as Minister of Plantation Industries and Commodities. She clarified her membership to PBM is still pending and should retain her Ampang federal seat. On 9 June, PBM president Larry Sng announced that Zuraida became an official member and was appointed as the party's president-designate after the agreements of PBM grassroots, political bureau and supreme council to \"drive the development and progress of PBM in the future\". Sng also expressed his hope for Zuraida to be retained in the Cabinet as the Minister of Plantation Industries and Commodities. In response and contradiction with her intention to resign, Zuraida also added that she was open and keen to finish her term in the position as she \"want to serve the nation and people\". Sng clarified that the leadership transition from him to Zuraida would \"take time\" and Zuraida would take the lead in his absence. PBM had given the mandate to Zuraida to lead a delegation if needed to meet leaders of other political parties and coalitions \"in terms of admission to any particular political coalition\". On 8 October, PBM announced the appointment of Zuraida as the new party president after a supreme council meeting held on 7 October. However, on 26 October, Sng released a statement saying he is still the legitimate party president according to the Registrar of Societies (RoS) records (later confirmed by the RoS director-general on 30 October) and subsequently suspended party secretary-general Nor Hizwan Ahmad and information chief Zakaria Abdul Hamid (who are reportedly Zuraida's allies) for holding the supreme council meeting to appoint Zuraida as party president without his knowledge and consent. Nor Hizwan dismissed the suspension, claiming that only Zuraida, as the current party president, can suspend him and Zakaria from the party. On 29 October, Sng announced the suspension of Zuraida's party membership and 12 supreme council members, which was also dismissed by deputy president and supreme council member Haniza Talha the following day. On 2 November, after a meeting between Sng and Zuraida at the RoS' office, PBM released a statement that Sng is recognised as the rightful party president and will sign the party's candidate appointment letters to contest in the [15th general election (GE15)](/wiki/2022_Malaysian_general_election) with Zuraida reverting to her previous designation of president-designate. Although Zuraida had announced her pending resignation as Minister of Plantation Industries and Commodities in May 2022, the issue was left undecided and not updated after June 2022. Therefore, her pending resignation did not materialise and she remained holding the position as a PBM member. In GE15, Zuraida sought re-election as Ampang MP by contesting for the [Ampang](/wiki/Ampang_(federal_constituency)) seat for the fourth time. She squared off against a total of eight opponents in the election; five candidates from [BN](/wiki/Barisan_Nasional), [PH](/wiki/Pakatan_Harapan), [PN](/wiki/Perikatan_Nasional), [Gerakan Tanah Air](/wiki/Gerakan_Tanah_Air) (GTA), [Heritage Party](/wiki/Heritage_Party_(Malaysia)) (WARISAN) and three independents. Zuraida lost the election to PH's [Rodziah Ismail](/wiki/Rodziah_Ismail), garnering 4th place with only 4.39% of the votes cast. On 24 December, Sng was reported to have sent show-cause letters to Zuraida and the 12 suspended party members after they have failed to attend a supreme council meeting. After failing to respond to the 26 December deadline, the party's disciplinary committee sacked Zuraida and 10 of the 13 suspended members from the party. On 11 April 2023, Zuraida was reported to have filed a judicial review leave application at the Kuala Lumpur [High Court](/wiki/High_court_(Malaysia)) in a bid to be officially recognised as PBM president. On 6 June, the High Court rejected Zuraida's leave application with Justice Amarjeet saying that Section 18C of the [Societies Act 1966](/wiki/Societies_Act_1966) prevents the court to intervene, or hear any issues or disputes on internal party matters. ### Muafakat Nasional On 14 December 2022, Tan Sri [Annuar Musa](/wiki/Annuar_Musa) announced that Zuraida has joined [Muafakat Nasional](/wiki/Muafakat_Nasional), a former political party turned non-governmental organisation. In January 2023, Zuraida, [Redzuan Yusof](/wiki/Mohd_Redzuan_Md_Yusof), Ridhuan Tee Abdullah and [Edmund Santhara Kumar](/wiki/Edmund_Santhara_Kumar_Ramanaidu) were appointed Muafakat Nasional's deputy presidents. ## Controversies On 5 January 2022, Zuraida's spirited defence of [palm oil in Malaysia](/wiki/Palm_oil_production_in_Malaysia), including her assertion that they were not harming the [orangutan](/wiki/Orangutan) population and the primates were more likely to kill humans than the other way round, has gained social media attention. Zuraida's office has clarified that her controversial comments about human-harming orangutans had been uttered in “jest”. ## Election results [Parliament of Malaysia](/wiki/Dewan_Rakyat) YearConstituencyCandidateVotesPctOpponent(s)VotesPctBallots castMajorityTurnout(/wiki/2008_Malaysian_general_election)**P099 [Ampang](/wiki/Ampang_(federal_constituency))****Zuraida Kamaruddin** ([**PKR**](/wiki/Keadilan))**26,995****53.50%**Azman Wahid ([UMNO](/wiki/United_Malays_National_Organisation))23,31946.21%51,0973,67673.91%(/wiki/2013_Malaysian_general_election)**Zuraida Kamaruddin** ([**PKR**](/wiki/Keadilan))**41,969****59.25%**Rozaidah Talib ([UMNO](/wiki/United_Malays_National_Organisation))28,69140.50%71,57513,27886.09%(/wiki/2018_Malaysian_general_election)**Zuraida Kamaruddin** ([**PKR**](/wiki/Keadilan))**54,307****70.94%**Leong Kim Soon ([MCA](/wiki/Malaysian_Chinese_Association))12,35116.13%77,53941,95684.50%Nurul Islam Yusoff ([PAS](/wiki/Malaysian_Islamic_Party))9,59812.54%Tan Hua Meng ([PRM](/wiki/Parti_Rakyat_Malaysia))2940.38%(/wiki/2022_Malaysian_general_election)Zuraida Kamaruddin ([PBM](/wiki/Parti_Bangsa_Malaysia))4,5894.39%**[Rodziah Ismail](/wiki/Rodziah_Ismail)** ([**PKR**](/wiki/People%27s_Justice_Party_(Malaysia)))**56,754****54.35%**133,49129,68178.23%Sasha Lyna Abdul Latif ([BERSATU](/wiki/Malaysian_United_Indigenous_Party))27,07325.92%Ivone Low Yi Wen ([MCA](/wiki/Malaysian_Chinese_Association))11,50911.02%Nurul Ashikin Mabahwi ([PEJUANG](/wiki/Homeland_Fighter%27s_Party))2,6532.54%[Lai Wai Chong](/wiki/Lai_Wai_Chong) ([WARISAN](/wiki/Heritage_Party_(Malaysia)))1,4231.36%Muhammad Syafiq Izwan Mohd Yunos ([IND](/wiki/Independent_politician))1880.18%Raveendran Marnokaran ([IND](/wiki/Independent_politician))1480.14%Tan Hua Meng ([IND](/wiki/Independent_politician))930.09% ## Honour - [Federal Territory (Malaysia)](/wiki/Federal_Territories_of_Malaysia) - Commander of the [Order of the Territorial Crown](/wiki/Orders,_decorations,_and_medals_of_the_Malaysian_states_and_federal_territories#Federal_Territories) (PMW) – **Datuk** (2021) - [Ampang (federal constituency)](/wiki/Ampang_(federal_constituency)) ## Notes\n",
  "language": "en",
  "processed_at": "2026-01-12T12:16:40.450259",
  "title": "Zuraida Kamaruddin",
  "type": "article",
  "url": "https://en.wikipedia.org/wiki/Zuraida_Kamaruddin"
}